*$MODULE       PHASE6                                                   00010021
IKF601 CSECT                                                            00020021
PH6BEG EQU    *                                                         00030021
         ENTRY PHASE6                                                   00040021
       ENTRY PH6                                                        00050021
       DC    C'IKFCLB60'          PHASE NAME                            00060021
       DC    C'B'             BUILD                                     00070021
       DC    X'1F'                 BUILD NUMBER                         00080021
*=3                                                                     00090021
*                                                                       00100021
*                                                                       00110021
*                                                                       00120021
*TITLE:                                                                 00130021
*                                                                       00140021
*   'IKFCBL60'                                                          00150021
*                                                                       00160021
*STATUS:                                                                00170021
*                                                                       00180021
*   CHANGE LEVEL 000                                                    00190021
*                                                                       00200021
*ENTRY POINTS:                                                          00210021
*                                                                       00220021
*        PHASE6                                                         00230021
*                                                                       00240021
*INPUT:                                                                 00250021
*                                                                       00260021
*        SYSUT1  PROCEDURE A-TEXT FROM PHASE 5                          00270021
*        SYSUT3  OPTIMIZATION A-TEXT FROM PHASE 5                       00280021
*        SYSUT4  LISTING A-TEXT FROM PHASE 1                            00290021
*                DATA A-TEXT FROM PHASE 2                               00300021
*                XREF DEF-TEXT FROM PHASES 2 + 3                        00310021
*                E-TEXT FROM ALL PHASES                                 00320021
*                                                                       00330021
*OUTPUT:                                                                00340021
*                                                                       00350021
*        SYSPRINT - PROCEDURE LIST                                      00360021
*        SYSLIN - OBJECT MODULE FOR LIKAGE EDITOR                       00370021
*        SYSPUNCH - OUTPUT DECK                                         00380021
*        SYSUT3  XREF REF-TEXT, ETEXT                                   00390021
*        SYSUT1  XREF DEF-TEXT                                          00400021
*                                                                       00410021
*FUNCTION/OPERATION:                                                    00420021
*                                                                       00430021
*   PHASE 6 COMBINES ALL THE INFORMATION IN THE PROCEDURE A TEXT, D     00440021
*   A-TEXT, AND OPTIMAZATION A-TEXT TO PRODUCE OBJECT MODULE SUITAB     00450021
*   FOR INPUT TO LINKAGE EDITOR, AND PRODUCES PUNCHED OBJECT DECK       00460021
*   AND AN OBJECT MODULE LISTING IF THEY ARE REQUESTED BY THE USER.     00470021
*                                                                       00480021
*EXTERNAL ROUTINES:                                                     00490021
*                                                                       00500021
*        PHASE 00 - LINK TO I-O AND INTERPHASE REGION                   00510021
*        TAMEIN - TAMER INITIALIZATION                                  00520021
*        PRIME  - ALLOCATE SPACE IN TABLE REGION                        00530021
*        INSERT - OBTAIN ROOM FOR AN ENTRY TO BE MADE IN A TABLE        00540021
*        STATIC - NOTES NO NEW ENTRY TO BE MADE. RELEASE UNUSED TAB     00550021
*        TABREL - FREE TABLE AREA IF A TABLE IS NO LONGER NEEDED        00560021
*                                                                       00570021
*EXITS NORMAL:                                                          00580021
*                                                                       00590021
*   RETURN TO PHASE 00, OR GO TO NEXT PHASE.  CALLING SEQUENCE:         00600021
*                                                                       00610021
*   CALL NEXT PHASE:                                                    00620021
*   LA   1,COSADR    L   2,PH7LOD     BALR   0,2     DC   X'A0'         00630021
*                                                                       00640021
*   RETURN TO PHASE 00:                                                 00650021
*   LA    1,COSADR      BALR    0,RB2      DC    X'B0'                  00660021
*                                                                       00670021
*EXITS-ERRORS:                                                          00680021
*                                                                       00690021
*   SAME AS NORMAL EXITS.                                               00700021
*                                                                       00710021
*TABLES/WORK AREAS:                                                     00720021
*                                                                       00730021
*   PNUTBL, RLDTBL, QTBL, CKPTBL, LTLTBL, CVIRTB, LVIRTB, PNTBL, GN     00740021
*   ERRTBL, CONTBL, C6TBL, ETC.                                         00750021
*   WORK AREAS STARTS AT PH6SAV.  ALL TABLES ARE DESCRIBED IN DETAI     00760021
*   IN PLM AND LISTING.                                                 00770021
*                                                                       00780021
*ATTRIBUTES:                                                            00790021
*                                                                       00800021
*   NOT REUSABLE,  NOT REENTRANT                                        00810021
*                                                                       00820021
*NOTES:  GENERAL ORGANIZATION -                                         00830021
*                                                                       00840021
*   1.   STANDARD EQU'S                                                 00850021
*   2.   SYSTEM BASED MASKS AND REGISTERS EQUATES                       00860021
*   3.   LENGTHS OF A-TEXT ELEMENTS                                     00870021
*   4.   HEX REPRESENTATIONS OF A-TEXT ELEMENTS                         00880021
*   5.   REGISTERS ASSIGNMENT STATUS CODES                              00890021
*  6.   COBOL COMMON DSECT AND TAMER EQUATES                            00900021
*   7.   MEMORY MAP                                                     00910021
*   8.   PHASE 6 INITIALIZATION                                         00920021
*   9.   TGT, SGT, PGT INITIALIZATION                                   00930021
*   10.  PROCEDURE NAME, VERB, USAGE TABLE, AND A-TEXT LIST PROCESS     00940021
*   11.  OPTIMIZATION A-TEXT PROCESSING                                 00950021
*   12.  PROCEDURE A-TEXT AND DATA A-TEXT PROCESSING                    00960021
*   13.  GENERATE CHECK-POINT                                           00970021
*   14.  GENERATE INIT2, INIT3, AND INIT1 CODING                        00980021
*   15.  CONSTANTS                                                      00990021
*   16.  WORK AREAS AND SWITCHES                                        01000021
*  17.  OUTPUT AREA                                                     01010021
*  18.  EXECUTE TABLES                                                  01020021
*   19.  MNEMONIC TABLE                                                 01030021
*   20.  SUBROUTINES                                                    01040021
*   21.  SYMBOLIC OPERAND TABLE                                         01050021
*  22.  DESCRIPTION OF PHASE 6 TABLES                                   01060021
*  23.  INPUT AREA                                                      01070021
         SPACE 3                                                        01080021
PH60   TITLE 'IKFCBL60'                                                 01090021
*   GENERAL CONSIDERATION:                                              01100021
*                                                                       01110021
*   PHASE 6'S TABLES, A-TEXT, OBJECT MODULE, ASSIGNMENT OF              01120021
*   PERMANENT REGISTERS TO BASE LOCATORS AND OBJECT TIME REGISTER       01130021
*   ASSIGNMENT ARE DESCRIBED IN DETAIL IN PLM AND LISTING.              01140021
*                                                                       01150021
         EJECT                                                          01160021
*                                                                       01170021
*                                                                       01180021
*   STANDARD EQUATES FOR BC INSTRUCTIONS                                01190021
*                                                                       01200021
UNCOND EQU   15                                                         01210021
HI     EQU   2                                                          01220021
LO     EQU   4                                                          01230021
LOW    EQU   4                                                          01240021
EQ     EQU   8                                                          01250021
NOTHI  EQU   13                                                         01260021
NOTLO  EQU   11                                                         01270021
NOTEQ  EQU   7                                                          01280021
OV     EQU   1                                                          01290021
POS    EQU   2                                                          01300021
NEG    EQU   4                                                          01310021
ZERO   EQU   8                                                          01320021
NOTOV  EQU   14                                                         01330021
NOTPOS EQU   13                                                         01340021
NOTNEG EQU   11                                                         01350021
NOTZER EQU   7                                                          01360021
ONES   EQU   1                                                          01370021
MIXED  EQU   4                                                          01380021
NOTONE EQU   14                                                         01390021
NOTMXD EQU   11                                                         01400021
NOP    EQU   0                                                          01410021
EOF    EQU   8                                                          01420021
*                                                                       01430021
*      SYSTEM BASED MASKS                                               01440021
NOLIST EQU   X'40'       LIST/NOLIST MASK                               01450021
NODECK EQU   X'20'       DECK/NODECK MASK                               01460021
NOLODU EQU   X'10'                                                      01470021
SEQTST EQU   X'08'                                                      01480021
FLGWRN EQU   X'04'       ON=FLAG WARNINGS  OFF=FLAG ERRORS ONLY         01490021
NO6OP    EQU   X'70'               NO PHASE 6 O/P MASK                  01500021
NO6OP3   EQU   X'60'      CLIST OR DMAP                             M O 01510021
XANDM    EQU   X'82'               XREF  AND  SUPMAP                    01520021
F4ANDPH7 EQU   X'03'               CALL PH7 TO READ F4                  01530021
NO6OPR   EQU   X'8F'               NO PH6 O/P FOR NI INST.              01540021
CLISTR   EQU   X'BF'               NO CLIST   FOR NI INST.              01550021
XREFR    EQU   X'7F'               NO XREF    FOR NI INST.              01560021
P6ERR  EQU   X'FF'                                                      01570021
*    REGISTER EQUATES                                                   01580021
NO6OP2   EQU   X'C0'              NEITHER CLIST NOR XREF                01590021
R0     EQU   0                                                          01600021
R1     EQU   1                                                          01610021
R2     EQU   2                                                          01620021
R3     EQU   3                                                          01630021
RW1    EQU   6                          PHASE 6 WORKING REGISTER        01640021
RW2    EQU   7                          PHASE 6 WORKING REGISTER        01650021
*-----NOTE RW1,RW2 MUST BE AN EVEN-ODD PAIR                             01660021
RW3    EQU   5                          PHASE 6 WORKING REGISTER        01670021
RB1    EQU   8                                                          01680021
RB2    EQU   9                                                          01690021
RB3    EQU   10                                                         01700021
RB4    EQU   12                                                         01710021
R13    EQU   13                                                         01720021
RS1    EQU   14                         SUBROUTINE LINK REGISTER        01730021
R15    EQU   15                                                         01740021
INPUTR EQU   4                                                          01750021
F2REG  EQU   INPUTR                                                     01760021
F4REG  EQU   11                                                         01770021
*                                                                       01780021
*                                                                       01790021
* LENGTHS OF A-TEXT ELEMENTS                                            01800021
*                                                                       01810021
LPNDEF EQU   3                                                          01820021
LGNDEF EQU   3                                                          01830021
LVNDEF EQU   3                                                          01840021
LRPDEF EQU   3                                                          01850021
LMACRO EQU   2                                                          01860021
LOP    EQU   3                                                          01870021
LPNREF EQU   3                                                          01880021
LGNREF EQU   3                                                          01890021
LVNREF EQU   3                                                          01900021
LVIRRF EQU   3                                                          01910021
LBLREF EQU   3                                                          01920021
LGTRF1 EQU   3                                                          01930021
LGTRF2 EQU   4                                                          01940021
LRELAD EQU   5                                                          01950021
LDC    EQU   2                PLUS CONTENTS BYTE 2                      01960021
LLTLRF EQU   1                                                          01970021
LBDISP EQU   3                                                          01980021
LRPREF EQU   3                                                          01990021
LADR   EQU   7                                                          02000021
LBCD   EQU   2      PLUS CONTENTS BYTE 2                                02010021
LPLUS  EQU   4                                                          02020021
LVIRDF EQU   12                                                         02030021
LLTLDF EQU   3      PLUS CONTENTS BYTE 3                                02040021
LDCB   EQU   5                                                          02050021
LDECB  EQU   9                                                          02060021
LBLK   EQU   9                                                          02070021
LSA    EQU   9                                                          02080021
LWS    EQU   8                                                          02090021
LCON   EQU   7      PLUS CONTENTS BYTES 6-7                             02100021
LACON  EQU   8                                                          02110021
LIACON EQU   8                                                          02120021
LSBL   EQU   4                                                          02130021
LMSGDF EQU   7                                                          02140021
LMSGPM EQU   2      PLUS CONTENTS BYTE 2                                02150021
LCRDNO EQU   3                                                          02160021
*                                                                       02170021
*      HEX REPRESENTATIONS OF  A-TEXT ELEMENTS                          02180021
*                                                                       02190021
*      OP DESCRIPTIVES                                                  02200021
ADRPLU EQU   X'20'            ADR FOLLOWED BY PLUS                      02210021
UPLUS  EQU   X'1C'                                                      02220021
ULNG   EQU   X'18'                                                      02230021
YINIT2 EQU   X'24'                                                      02240021
PNREF  EQU   X'28'                                                      02250021
GNREF  EQU   X'2C'                                                      02260021
VNREF  EQU   X'30'                                                      02270021
VIRREF EQU   X'34'                                                      02280021
BLREF  EQU   X'38'                                                      02290021
GTREF1 EQU   X'3C'                                                      02300021
GTREF2 EQU   X'40'                                                      02310021
LTLREF EQU   X'44'                                                      02320021
BDISP  EQU   X'48'                                                      02330021
ADR    EQU   X'4C'                                                      02340021
PLUS   EQU   X'50'                                                      02350021
ZINIT2 EQU   X'54'                                                      02360021
XINIT2 EQU   X'58'                                                      02370021
YHOLDA EQU   X'5C'                                                      02380021
*      OP                                                               02390021
OP     EQU   X'60'                                                      02400021
*      NON-OP ASSOCIATED ELTS                                           02410021
PNDEF  EQU   X'64'                                                      02420021
GNDEF  EQU   X'68'                                                      02430021
VNDEF  EQU   X'6C'                                                      02440021
PNBCD  EQU   X'70'                                                      02450021
*      EQU   X'74'  NOT ASSIGNED                                        02460021
RPDBCD EQU   X'78'                                                      02470021
RPDDEF EQU   X'7C'                                                      02480021
MACRO  EQU   X'80'                                                      02490021
CRDNO  EQU   X'84'                                                      02500021
IDBCD  EQU   X'88'                                                      02510021
*      SUBSEQUENT ELTS                                                  02520021
REGNO  EQU   X'EC'                                                      02530021
RPDREF EQU   X'F0'                                                      02540021
BCDREF EQU   X'F4'                                                      02550021
RELADR EQU   X'F8'                                                      02560021
DCDEF  EQU   X'FC'                                                      02570021
CSELT  EQU   X'E8'                                                      02580021
CSDPTR EQU   X'E4'                                                      02590021
*       CALLING SEQUENCE DISP/CODE FOR OBJECT MODULE FIELD              02600021
CSLIT  EQU   X'2C'                                                      02610021
CSBLI  EQU   X'0C'                                                      02620021
CSBLL  EQU   X'28'                                                      02630021
CSTS   EQU   X'64'                                                      02640021
CSVLCI EQU   X'1C'                                                      02650021
CSVLCO EQU   X'20'                                                      02660021
CSSUB  EQU   X'60'                                                      02670021
*        OPTIMIZATION A-TEXT ELEMENTS                                   02680021
DISPLTDF EQU   X'10'                                                    02690021
GNDF     EQU   X'08'                                                    02700021
VNDF     EQU   X'14'                                                    02710021
VIRDF    EQU   X'18'                                                    02720021
PNDF     EQU   X'0C'                                              42071 02730021
*      OTHER A-TEXT ELTS                                                02740021
VIRDEF EQU   X'00'                                                      02750021
LTLDEF EQU   X'04'                                                      02760021
DCBDF  EQU   X'04'                                                      02770021
DECBDF EQU   X'08'                                                      02780021
BLKDF  EQU   X'0C'                                                      02790021
SADF   EQU   X'20'                                                      02800021
WSDF   EQU   X'24'                                                      02810021
CONDF  EQU   X'28'                                                      02820021
ACONDF EQU   X'2C'                                                      02830021
ICONDF EQU   X'30'                                                      02840021
SBLDF  EQU   X'34'                                                      02850021
CKPTDF EQU   X'4C'                 HIGHEST DATA A-TXT ID BYTE           02860021
MSGDF  EQU   X'00'                                                      02870021
*      GTREF2 EQUS                                                      02880021
DCB    EQU   X'00'                                                      02890021
PFMCT  EQU   X'0C'                                                      02900021
PSVCT  EQU   X'10'                                                      02910021
DECB   EQU   X'14'                                                      02920021
PARAM  EQU   X'1C'                                                      02930021
XSA    EQU   X'18'                                                      02940021
WC     EQU   X'20'                                                      02950021
TS     EQU   X'24'                                                      02960021
XSASW  EQU   X'28'                                                      02970021
VLC    EQU   X'04'                                                      02980021
ONCTL  EQU   X'08'                                                      02990021
SUBS   EQU     X'2C'                                                    03000021
TS2    EQU   X'30'                                                      03010021
RPI    EQU   X'34'                                                      03020021
VLCO   EQU   X'38'                                                      03030021
SA2    EQU   X'3C'                                                      03040021
SA3    EQU   X'40'                                                      03050021
DECIO  EQU   X'4C'                                                      03060021
CKP      EQU   X'50'                                                    03070021
*      MACRO CODES                                                      03080021
EQUATE EQU   X'00'          MACRO CODES                                 03090021
ENTRY  EQU   X'04'          MACRO CODES                                 03100021
BLCHNG EQU   X'08'          MACRO CODES                                 03110021
ENDOPT EQU   X'0C'          MACRO CODES                                 03120021
PROCSS EQU   X'10'          MACRO CODES                                 03130021
HOLDD  EQU   X'14'          MACRO CODES                                 03140021
ADCON  EQU   X'18'       MACRO CODES                                    03150021
IDENFY EQU   X'1C'       MACRO CODES                                    03160021
STARTT EQU   X'20'       MACRO CODES                                    03170021
DEECEE EQU   X'24'                                                      03180021
RSRVE  EQU   X'28'                                                      03190021
FREE   EQU   X'2C'                                                      03200021
DESTRY EQU   X'30'                                                      03210021
INIT   EQU   X'34'                                                      03220021
*                                                                       03230021
*      REGISTER ASSIGNMENT STATUS CODES                                 03240021
*                                                                       03250021
IBLSLT EQU   X'02'                                                      03260021
IBLELT EQU   X'00'                                                      03270021
LAVAIL EQU   X'80'                                                      03280021
AVAIL5 EQU   X'01'                                                      03290021
AVAIL6 EQU   X'02'                                                      03300021
AVL56  EQU   AVAIL5+AVAIL6                                              03310021
YAVAL5 EQU   X'FE'                                                      03320021
YAVAL6 EQU   X'FD'                                                      03330021
LASIGN EQU   X'20'                                                      03340021
PGTOVF EQU   X'10'                                                      03350021
PGTOFF EQU   X'EF'            TURN OFF PGTOVF                           03360021
         EJECT                                                          03370021
       IHBCOB                                                           03380021
SBSCTR EQU   SUBCTR                                                     03390021
* EQUATES FOR TAMER                                                     03400021
CONTBL EQU   TIB9-COS                                                   03410021
CONDIS EQU   TIB14-COS                                                  03420021
LTLTBL   EQU   TIB4-COS                                                 03430021
LVIRTB EQU   TIB11-COS                                                  03440021
CVIRTB EQU   TIB12-COS                                                  03450021
VIRPTR EQU   TIB13-COS                                                  03460021
ERRTBL EQU   TIB10-COS                                                  03470021
QTBL   EQU   TIB3-COS                                                   03480021
PNUTBL EQU   TIB6-COS                                                   03490021
PNTBL  EQU   TIB7-COS                                                   03500021
GNTBL  EQU   TIB8-COS                                                   03510021
FILTBL EQU   TIB2-COS                                                   03520021
VNPTY  EQU   TIB17-COS                                                  03530021
SEGTBL EQU   TIB15-COS                                                  03540021
* OTHER EQUATES                                                         03550021
R6       EQU   6                                                        03560021
VIRNBR   EQU   2                                                        03570021
PGTR   EQU   X'80'                                                      03580021
TSGTR  EQU   X'40'                                                      03590021
GTOVFLON EQU   X'FF'               TGT OR PGT HAS OVERFLOW CELLS        03600021
*                                                                       03610021
LTLTYP EQU   1                                                          03620021
LTLBND EQU   1                POSITIONS                                 03630021
LTLLNG EQU   2                IN LTLDEF                                 03640021
LTLCON EQU   3                RECORDS                                   03650021
VIRTYP EQU   1                DISP OF TYPE                              03660021
VIRBCD EQU   4                DISP OF BCD                               03670021
TARG   EQU   1                                                          03680021
TARG0    EQU   0                                                        03690021
RELC   EQU   5                    DISPL OF REL ADDR IN RLDTBL           03700021
RELC4    EQU   4                                                        03710021
RLNG   EQU   8                    LENGTH OF RLDTBL ENTRY                03720021
*     TGT DISPLACEMENTS                                                 03730021
APGTVN EQU   408                   VNI TBL ADDR IN THE TGT              03740021
ATGTVN EQU   412                   VN-I TBL ADDRESS                     03750021
TGTVCON  EQU   416                                                 STAN 03760021
VNTBLN EQU   420                   LENGTH OF VNI TBL                    03770021
PGMIDTGT EQU   424                 PROGRAM ID                           03780021
TGTINIT1 EQU   432                                                 STAN 03790021
VARTGT1  EQU   444                                                      03800021
VARTGT2  EQU   448                                                      03810021
*                                                                       03820021
*        BOUNDARY ALIGNMENT                                             03830021
ONEBYTE  EQU   1                                                        03840021
TWOBYTE  EQU   2                                                        03850021
THREE    EQU   3                                                        03860021
FOURBYTE EQU   4                                                        03870021
SIXBYTES EQU   6                                                        03880021
DW8BYTES EQU   8                                                        03890021
FOUR8ORC EQU   X'C0'               BOUNDARY                             03900021
HALFWRD  EQU   X'80'                                                    03910021
*                                                                       03920021
* EQUATE MASKS                                                          03930021
*                                                                       03940021
HION     EQU   X'80'                                                    03950021
ALLON    EQU   X'FF'                                                    03960021
MC6M4A EQU   X'F000'                                                    03970021
MC6M4B EQU   X'B000'                                                    03980021
M7F    EQU   X'7F'                                                      03990021
M1FF   EQU   X'1FF'                                                     04000021
M1FFF  EQU   X'1FFF'                                                    04010021
MF0    EQU   X'F0'                                                      04020021
MC664  EQU   X'64'                                                      04030021
MF9    EQU   X'F9'                                                      04040021
PRMFLG   EQU   X'04'                                              56154 04050021
*                                                                       04060021
ATYP   EQU   X'C0'  TEXT - RLD - NO MATCH - VARIABLE LENGTH             04070021
DTYP   EQU   X'84'  TEXT - NO RLD - NO MATCH - LENGTH 4                 04080021
ITYP   EQU   X'E0'  TEXT - RLD - MATCH AGAINST N - VARIABLE LENGTH      04090021
NTYP   EQU   X'94'  TEXT - NO RLD - MATCHED BY I+V - LENGTH 4           04100021
VTYP   EQU   X'A4'  TEXT - NO RLD - MATCH AGAINST N - LENGTH 4          04110021
*        ESD TYPES                                                      04120021
ESDTYP0  EQU   0                   SD TYPE ESD                          04130021
ESDTYP1  EQU   1                   LD TYPE ESD                          04140021
ESDTYP2  EQU   2                   ER TYPE ESD                          04150021
ESDTYP4  EQU   4                   PC TYPE ESD                          04160021
*                                                                       04170021
CBRST  EQU   X'01B0'                                                    04180021
LVLST  EQU   X'01C0'                                                    04190021
VRBST  EQU   X'0100'                                                    04200021
RELST  EQU   X'0180'                                                    04210021
PARST  EQU   X'0190'                                                    04220021
ARIST  EQU   X'01A0'                                                    04230021
FCOST  EQU   X'01D0'                                                    04240021
SDNST  EQU   X'01F0'                                                    04250021
INITNO6A  EQU  X'BF'                                                    04260021
S6INIT00 EQU   X'00'               INITIALIZE SWITCH TO ZERO            04270021
S6WON  EQU   1                                                          04280021
S6WOFF EQU   254                                                        04290021
RW3M1  EQU   RW3-1                                                      04300021
RW3P1  EQU   RW3+1                                                      04310021
RW1M1  EQU   RW1-1                                                      04320021
*                                                                       04330021
ELEVEL   EQU   X'0C'               E-LEVEL DIAGNOSTIC                   04340021
DLEVEL   EQU   X'10'               D-LEVEL DIAGNOSTIC= PH6 LOGIC        04350021
CLEVEL   EQU   X'08'               C-LEVEL DIAGNOSTIC                   04360021
WLEVEL   EQU   X'04'               W-LEVEL DIAGNOSTIC                   04370021
ERF4ON   EQU   X'FF'               PH7 TO PRINT ERRMSG                  04380021
ERF4SEQ  EQU   X'00'               PH7 PRINT ONLY SEQUENCE ERRORS       04390021
NOTSEGTD EQU   X'FF'               SOURCE PROGRAM NOT SEGMENTED         04400021
INITOFF  EQU   X'00'               INITIALIZE SWITCHES TO ZERO          04410021
SEVEN    EQU   7                                                        04420021
SIXSUFFX EQU   6                                                        04430021
NEWBLOCK EQU   X'FF'                                                    04440021
INDEPSEG EQU   50                                                       04450021
NOPOPCD  EQU   X'00'               NOP OPERATION CODE                   04460021
REG14    EQU   14                  USE  R14                             04470021
REG15    EQU   15                  USE  R15                             04480021
EIGHTY   EQU   80                  80 COLUMNS PER CARD                  04490021
BLANK    EQU   X'40'                                                    04500021
*              LETTERS                                                  04510021
EE       EQU   C'E'                                                     04520021
GEE      EQU   C'G'                                                     04530021
EL       EQU   C'L'                                                     04540021
PEE      EQU   C'P'                                                     04550021
ESS      EQU   C'S'                                                     04560021
VEE      EQU   C'V'                                                     04570021
ECKS     EQU   C'X'                                                     04580021
COMMA    EQU   C','                                                     04590021
LFTPAREN EQU   C'('                                                     04600021
RTPAREN  EQU   C')'                                                     04610021
ASTER    EQU   C'*'                                                     04620021
PLUSSIGN EQU   C'+'                                                     04630021
MINUSIGN EQU   C'-'                                                     04640021
QUOTES1  EQU   C''''                                                    04650021
*                                                                       04660021
* LENGTH(LX), DISPLACEMENT(DX), AND PLUS BYTES(NX) FOR STANDARDS        04670021
DX0      EQU   0                                                        04680021
LX0      EQU   0                                                        04690021
DX1      EQU   1                                                        04700021
NX1      EQU   1                                                        04710021
LX1      EQU   1                                                        04720021
DX2      EQU   2                                                        04730021
NX2      EQU   2                                                        04740021
LX2      EQU   2                                                        04750021
DX3      EQU   3                                                        04760021
NX3      EQU   3                                                        04770021
LX3      EQU   3                                                        04780021
DX4      EQU   4                                                        04790021
NX4      EQU   4                                                        04800021
LX4      EQU   4                                                        04810021
DX5      EQU   5                                                        04820021
NX5      EQU   5                                                        04830021
LX5      EQU   5                                                        04840021
DX6      EQU   6                                                        04850021
NX6      EQU   6                                                        04860021
LX6      EQU   6                                                        04870021
DX7      EQU   7                                                        04880021
NX7      EQU   7                                                        04890021
LX7      EQU   7                                                        04900021
DX8      EQU   8                                                        04910021
NX8      EQU   8                                                        04920021
LX8      EQU   8                                                        04930021
DX9      EQU   9                                                        04940021
NX9      EQU   9                                                        04950021
LX9      EQU   9                                                        04960021
DX10     EQU   10                                                       04970021
NX10     EQU   10                                                       04980021
LX10     EQU     10                                                     04990021
DX11     EQU   11                                                       05000021
NX11     EQU   11                                                       05010021
DX12     EQU   12                                                       05020021
NX12     EQU   12                                                       05030021
DX13     EQU   13                                                       05040021
NX13     EQU   13                                                       05050021
DX14     EQU   14                                                       05060021
DX15     EQU   15                                                       05070021
NX15     EQU   15                                                       05080021
DX16     EQU   16                                                       05090021
LX16     EQU   16                                                       05100021
LX17     EQU   17                                                       05110021
DX18     EQU   18                                                       05120021
PTY10    EQU   10                                                  2963 05130021
NX18     EQU   18                                                       05140021
LX18     EQU   18                                                       05150021
NX19     EQU   19                                                       05160021
LX19     EQU   19                                                       05170021
DX20     EQU   20                                                       05180021
LX20     EQU   20                                                       05190021
LX22     EQU   22                                                       05200021
DX24     EQU   24                                                       05210021
LX24     EQU   24                                                       05220021
NX25     EQU   25                                                       05230021
LX27     EQU   27                                                       05240021
DX28     EQU   28                                                       05250021
LX28     EQU   28                                                       05260021
LX29     EQU   29                                                       05270021
NX40     EQU   40                                                       05280021
LX42     EQU   42                                                       05290021
NX44     EQU   44                                                       05300021
LX45   EQU   45                                                         05310021
NX47     EQU   47                                                       05320021
NX50     EQU   50                                                       05330021
DX55     EQU   55                                                       05340021
DX56     EQU   56                                                       05350021
NX56     EQU   56                                                       05360021
DX60     EQU   60                                                       05370021
DX64     EQU   64                                                       05380021
LX64     EQU   64                                                       05390021
DX72     EQU   72                                                       05400021
NX72     EQU   72                                                       05410021
LX75     EQU   75                                                       05420021
DX76     EQU   76                                                       05430021
NX76     EQU   76                                                       05440021
NX79     EQU   79                                                       05450021
LX79   EQU   79                                                         05460021
DX80     EQU   80                                                       05470021
DX84     EQU   84                                                       05480021
DX88     EQU   88                                                       05490021
NX91     EQU   91                                                       05500021
LX91     EQU   91                                                       05510021
DX92     EQU   92                                                       05520021
NX92     EQU   92                                                       05530021
DX94     EQU   94                                                       05540021
LX95     EQU   95                                                       05550021
DX96     EQU   96                                                       05560021
LX109    EQU   109                                                      05570021
LX110    EQU   110                                                47939 05580021
LX119    EQU   119                                                      05590021
DX120    EQU   120                                                      05600021
DX256    EQU   256                                                      05610021
DX324    EQU   324                                                      05620021
DX400    EQU   400                                                      05630021
DX404    EQU   404                                                      05640021
DX416    EQU   416                                                      05650021
DX422    EQU   422                                                      05660021
DX423    EQU   423                                                      05670021
DX436    EQU   436                                                      05680021
XX0C     EQU   X'0C'                                                    05690021
XX04     EQU   X'04'                                                    05700021
XX00     EQU   X'00'                                                    05710021
XX10     EQU   X'10'                                                    05720021
XX40     EQU   X'40'                                                    05730021
XX20     EQU   X'20'                                                    05740021
XX01     EQU   X'01'                                                    05750021
XXC0     EQU   X'C0'                                                    05760021
XX80     EQU   X'80'                                                    05770021
XX0F     EQU   X'0F'                                                    05780021
XX02     EQU   X'02'                                                    05790021
XX03     EQU   X'03'                                                    05800021
XX0B     EQU   X'0B'                                                    05810021
XX0A     EQU   X'0A'                                                    05820021
XX58     EQU   X'58'                                                    05830021
XX41     EQU   X'41'                                                    05840021
XXEC     EQU   X'EC'                                                    05850021
XX68     EQU   X'68'                                                    05860021
XX2C     EQU   X'2C'                                                    05870021
XX7C     EQU   X'7C'                                                    05880021
XX0D     EQU   X'0D'                                                    05890021
XXDF     EQU   X'DF'                                                    05900021
XX77     EQU   X'77'                                                    05910021
XX7F     EQU   X'7F'                                               0657 05920021
XX86     EQU   X'86'                                                    05930021
XX91     EQU   X'91'                                                    05940021
XX98     EQU   X'98'                                                    05950021
XX88     EQU   X'88'                                                    05960021
XX90     EQU   X'90'                                                    05970021
XX84     EQU   X'84'                                                    05980021
XX97     EQU   X'97'                                                    05990021
XX93     EQU   X'93'                                                    06000021
XXCF     EQU   X'CF'                                                    06010021
XXEF     EQU   X'EF'                                                    06020021
XX05     EQU   X'05'                                                    06030021
XX34     EQU   X'34'                                                    06040021
XX30     EQU   X'30'                                                    06050021
XX06     EQU   X'06'                                                    06060021
XX50     EQU   X'50'                                               2962 06070021
XC1      EQU   C'1'                                                     06080021
XC2      EQU   C'2'                                                     06090021
XC3      EQU   C'3'                                                     06100021
XC4      EQU   C'4'                                                     06110021
       EJECT                                                            06120021
*=1                     MEMORY MAP                                      06130021
*      PHASE 6 INITIALIZATION                                           06140021
       USING PHASE6,R1                                                  06150021
       SPACE 2                                                          06160021
*      TGT-SGT INITIALIZATION (COMMON AND COMTBL)                       06170021
       USING TGTINT,R1                                                  06180021
       SPACE 2                                                          06190021
*      PGT INITIALIZATION                                               06200021
       USING PGTINT,R1                                                  06210021
       USING ENO090,R1                                                  06220021
       USING ENO100,R1                                                  06230021
       SPACE 2                                                          06240021
*      PROCESS PROCEDURE NAME USAGE TABLE                               06250021
       USING PNUPRO,R1                                                  06260021
       SPACE 2                                                          06270021
*      OPTIMIZATION A-TEXT PROCESSING                                   06280021
       USING PRFTWO,R1                                                  06290021
*                   LITERALS                                            06300021
       USING LTLRTN,R1                                                  06310021
*                   VIRTUALS                                            06320021
       USING VIRRTN,R1                                                  06330021
*                   GN EQUATE STRINGS                                   06340021
       USING GNEQUR,R1                                                  06350021
*                   PN EQUATE STRINGS                                   06360021
       USING PNEQUR,R1                                                  06370021
*                   RESOLVE EQUATED BRANCH POINTS                       06380021
       USING ENOPAT,R1                                                  06390021
       SPACE 2                                                          06400021
*      PROCEDURE A-TEXT PROCESSING                                      06410021
       USING SE6000,R1                                                  06420021
*                   OPS AND ASSOCIATED ELEMENTS                         06430021
       USING R6010,R1                                                   06440021
*                   PROCEDURE NAME DEFS                                 06450021
       USING PNDEFR,R1                                                  06460021
*                   GENERATED NAME DEFS                                 06470021
       USING GNDEFR,R1                                                  06480021
*                   ALTERED NAME DEFS                                   06490021
       USING VNDEFR,R1                                                  06500021
*                   MACRO ELEMENTS                                      06510021
       USING MACPRO,R1                                                  06520021
*                                  ENTRY                                06530021
       USING MAC010,R1                                                  06540021
*                                  START                                06550021
       USING MAC080,R1                                                  06560021
*                                  IDENTIFY                             06570021
       USING MAC070,R1                                                  06580021
*                                  BLCHNG                               06590021
       USING MAC020,R1                                                  06600021
*                                  DC                                   06610021
       USING MAC090,R1                                                  06620021
*                                  ADCON                                06630021
       USING MAC060,R1                                                  06640021
*                                  RESERVE                              06650021
       USING MAC100,R1                                                  06660021
*                                  DESTROY                              06670021
       USING MAC120,R1                                                  06680021
*                                  FREE                                 06690021
       USING MAC110,R1                                                  06700021
*                                  INITIALIZE                           06710021
       USING MAC130,R1                                                  06720021
*                   PNBCD                                               06730021
       USING PNBPRO,R1                                                  06740021
*                   SPECIAL A-TEXT ELTS INTERNAL TO PHASE 6             06750021
       USING GENIMM,R1                                                  06760021
       USING GENBD,R1                                                   06770021
       USING GIDENL,R1                                                  06780021
       SPACE 2                                                          06790021
*      PROCESS DATA A-TEXT                                              06800021
       USING PDATEX,R1                                                  06810021
*                   CONDEF                                              06820021
       USING D6CON,R1                                                   06830021
*                   DCBADEF                                             06840021
       USING D6DCB,R1                                                   06850021
*                   BLKADEF                                             06860021
       USING D6BLK,R1                                                   06870021
*                   WSADEF                                              06880021
       USING D6WSA,R1                                                   06890021
*                   DECBADEF                                            06900021
       USING D6DECB,R1                                                  06910021
*                   SBLDEF                                              06920021
       USING D6SBL,R1                                                   06930021
*                   ACONDEF                                             06940021
       USING D6ACON,R1                                                  06950021
       SPACE 2                                                          06960021
*      FILE 4 EOD                                                       06970021
       USING PDT030,R1                                                  06980021
       SPACE 2                                                          06990021
*      PROCESS RLD ITEMS                                                07000021
       USING D6RLT,R1                                                   07010021
       SPACE 2                                                          07020021
*      GENERATE CHECKPOINT ROUTINE                                      07030021
       USING PCKPT,R1                                                   07040021
       SPACE 2                                                          07050021
*      GENERATE INIT2 CODING                                            07060021
       USING GINIT2,R1                                                  07070021
       SPACE 2                                                          07080021
*      GENERATE INIT3 CODING                                            07090021
       USING GINIT3,R1                                                  07100021
       SPACE 2                                                          07110021
*      GENERATE INIT1                                                   07120021
       USING GINIT1,R1                                                  07130021
       SPACE 2                                                          07140021
*      COMPLETE DECK                                                    07150021
       USING FTER,R1                                                    07160021
       SPACE 2                                                          07170021
       SPACE 2                                                          07180021
*      ERROR ROUTINES                                                   07190021
       USING ERR010,R1                                                  07200021
       SPACE 2                                                          07210021
*         CONSTANTS                                                     07220021
       USING C6M1,R1                                                    07230021
       USING C6CNST,R1                                                  07240021
       USING S6BNO,R1                                                   07250021
       SPACE 2                                                          07260021
*         WORK AREAS AND SWITCHES                                       07270021
*         PHASE 6 VALUES                                                07280021
       USING LOCPGT,R1                                                  07290021
       SPACE 2                                                          07300021
*         OUTPUT AREA                                                   07310021
       USING OU6REC,R1                                                  07320021
       SPACE 2                                                          07330021
*              MNEMONIC TABLE                                           07340021
       USING C6TBL,R1                                                   07350021
       SPACE 2                                                          07360021
       SPACE 2                                                          07370021
*         SUBROUTINES                                                   07380021
*                   CONVERT TO PRINTED HEX                              07390021
       USING S6010,R1                                                   07400021
*                   CONVERT TO PRINTED DECIMAL                          07410021
       USING S6200,R1                                                   07420021
*                   FORMAT AND PRINT LISTING LINE                       07430021
       USING S6800,R1                                                   07440021
       SPACE 2                                                          07450021
*            GETS AND PUTS                                              07460021
*                            GET F1 (PROCEDURE A-TEXT)                  07470021
       USING GET,R1                                                     07480021
       USING SAVGET,R1                                                  07490021
       USING RESGET,R1                                                  07500021
*                   GET RELATIVE PN OR GN NUMBER                        07510021
       USING GETPN,R1                                                   07520021
       USING GETGN,R1                                                   07530021
*                   GET F4  (LISTING TEXT, DATA A-TEXT, E-TEXT)         07540021
       USING GETF4,R1                                                   07550021
*                   PUT ROUTINE                                         07560021
       USING PUT,R1                                                     07570021
       USING PUTM,R1                                                    07580021
*                   PUNCH TEXT                                          07590021
       USING TXPNCH,R1                                                  07600021
*                   PUNCH ESD                                           07610021
       USING ESDCRD,R1                                                  07620021
*                   PUNCH RLD                                           07630021
       USING RLDCRD,R1                                                  07640021
*                   FORMAT AND PRINT PGT/TGT MAP                        07650021
       USING MAPLOC,R1                                                  07660021
       SPACE 2                                                          07670021
*            REGISTER ASSIGNMENT ROUTINES                               07680021
*                   GENERATE A LOAD OF A BASE LOCATOR                   07690021
       USING GENLD,R1                                                   07700021
*                   SEARCH FOR AN ASSIGNED OR AVAILABLE REGISTER        07710021
       USING SRCHR,R1                                                   07720021
       USING SRCHG,R1                                                   07730021
*                   GENERATE LOADS OF PERMANENTLY ASSIGNED REGISTER     07740021
       USING INITR,R1                                                   07750021
*                   SET UP PERMANENT REGISTER ASSIGNMENTS               07760021
       USING USING,R1                                                   07770021
       USING ASSIGN,R1                                                  07780021
       SPACE 2                                                          07790021
*              STATISTICS ROUTINE                                       07800021
       USING PRSTAT,R1                                                  07810021
       SPACE 2                                                          07820021
*      SYMBOLIC OPERAND TABLE                                           07830021
       USING XSYMC,R1                                                   07840021
       SPACE 2                                                          07850021
*      A-TEXT FOR INIT1                                                 07860021
       USING INIT1,R1                                                   07870021
       SPACE 2                                                          07880021
       SPACE 2                                                          07890021
*      A-TEXT FOR INIT2                                                 07900021
       USING INIT2,R1                                                   07910021
       SPACE 2                                                          07920021
*      ADCON LISTING ELEMENTS                                           07930021
       USING RLTBL,R1                                                   07940021
       SPACE 2                                                          07950021
*      CNOP  TABLE                                                      07960021
       USING CNOPT,R1                                                   07970021
       SPACE 2                                                          07980021
*         COMPILER COMMON DEFINITION                                    07990021
       USING COS,R1                                                     08000021
       SPACE 2                                                          08010021
*         INPUT AREA                                                    08020021
       USING A6TEXT,R1                                                  08030021
       DROP  R1                                                         08040021
       EJECT                                                            08050021
*=1    PHASE 6 INITIALIZATION                                           08060021
*=                                                                      08070021
PHASIX EQU *                                                            08080021
*                                                                       08090021
*                                                                       08100021
*                                                                       08110021
*                                                                       08120021
       DS    0H                                                         08130021
IKF601   CSECT                                                          08140021
       CNOP  0,4                                                        08150021
PH6    EQU   *                                                          08160021
PHASE6   EQU   *                                                        08170021
IKFCBL60 EQU   PH6                                                      08180021
         STM   RS1,RB4,DX12(R13)  SAVE REGISTERS IN PH0 SAVE AREA       08190021
       LR    R2,R13             SAVE ADDR OF PH0 SAVE AREA IN R2        08200021
       BALR  R15,R0                BRANCH TO PH0                        08210021
         BC    UNCOND,DX8(R15)     SKIP AROUND DC                       08220021
       DC    A(PH6SAV)                                                  08230021
         L     R13,DX4(R15)      SET R13 TO ADDR OF PHASE  SAVE AREA    08240021
         ST    RS1,DX12(R13)     SAVE SYSTEM RETURN ADR IN PHASE SV     08250021
         ST    R2,DX4(R13)       PUT PTR TO PH0 SV AREA IN PHASE SV     08260021
         ST    R13,DX8(R2)       PUT PTR TO PHASE SV AREA IN PH0 SV     08270021
         BALR  RB1,R0              BRANCH TO PH0                        08280021
       USING *,RB1                                                      08290021
       USING PGTINT,RB3                                                 08300021
       USING ERR010,RB4       EVENTUALLY ONLY CONST AND DATA AREA       08310021
         USING  PH6SAV,R13            CONSTANTS ONLY                    08320021
         USING A6TEXT,INPUTR  REGISTER FOR INPUT                        08330021
       USING COS,RB2                                                    08340021
FIRST  EQU   *                                                          08350021
       L     RB3,ADSCT1                                                 08360021
       L     RB4,ADCNST                                                 08370021
         L     R2,DX0(R1)     PICK UP COSADR                            08380021
       ST    R2,COSADR                                                  08390021
       L     R1,ABGPH6                                                  08400021
       BALR  R0,R2                 BR TO PH0                            08410021
       DC    X'06'                 READ SYSLST FILE                     08420021
       L     RW1,APNUTB        RELOCATE PNUTBL ADCON                    08430021
       ALR   RW1,R2                                                     08440021
       ST    RW1,APNUTB                                                 08450021
       L     RB2,COSADR                                                 08460021
       BALR  R0,RB2                BR TO PH0                            08470021
         DC    X'D6'               PAGE EJECT                           08480021
         NI    SWITCH,INITNO6A           INITIALIZE NO6A                08490021
       SPACE 5                                                          08500021
*      COS IS HANDLING COMTBL                                           08510021
* SEE IF ERROR MESSAGE LIST RUN                                         08520021
         CLC   PROGID(LX8),EMESLS                                       08530021
         BC    EQ,BYPASS6          YES, PROGID IS ERROR MESSAGE         08540021
         CLI   ERRSEV,ELEVEL       HAS AN E-LEVEL DIAGNOSTIC OCCU       08550021
         BC    LO,TSTNOOP          NO                                   08560021
         TM    PHZSW1,MAPSP        YES - IS MAP SUPPRESS ON             08570021
         BC    ONES,MSGMS          YES - PRINT MSG & TURN OFF OPTIO     08580021
TSTNOOP  DS    0H                                                       08590021
         TM    PHZSW,NO6OP         NO  - SEE IF ANY O/P NEEDED          08600021
         BC    NOTZER,NORMAL       O/P WANTED - PROCESS NORMALLY        08610021
         TM    PHZSW1,NO6OP2                  OR                        08620021
         BC    NOTZER,NORMAL       O/P WANTED - PROCESS NORMALLY        08630021
*  JUST PRINT STATISTICS - BYPASS REST OF PHASE 6                       08640021
         L     R15,APRSTAT                                              08650021
         BALR  RS1,R15             GO PRINT STATISTICS                  08660021
NOOPTST  DS    0H                                                       08670021
         OI    ERF4SW,ERF4ON       PH7 TO PRINT ERROR MSG               08680021
         CLI   ERRSEV,WLEVEL       DO WE WANT PH7                       08690021
         BC    HI,BYPASS6          YES - C LEVEL ERROR                  08700021
         BC    EQ,TESTFL           W LEVEL - GO TEST FLAG E OR W        08710021
         NI    ERF4SW,ERF4SEQ      PH7 ONLY PRINT SEQUENCE ERRORS       08720021
         SR    RW2,RW2             NO ERRORS - CHECK SEQ                08730021
         CH    RW2,SEQERR                                               08740021
         BC    EQ,NOPH7            NO SEQ ERRORS THUS NO PHASE 7        08750021
TESTFL   DS    0H                                                       08760021
         TM    PHZSW,FLGWRN                                             08770021
         BC    ZERO,NOPH7          FLAGE - DON'T WANT PHASE 7           08780021
BYPASS6  DS    0H                                                       08790021
         OI    SWITCH+NX1,F4ANDPH7  TO INDICATE TO PH6A TO CALL PH7     08800021
PASS6BY  DS    0H                                                       08810021
         TM    P6ESW,P6ERR         AND READ F4                          08820021
         BC    ZERO,PASSBY6        NO INTERNAL ERROR IN PH6             08830021
         MVI   ERRSEV,DLEVEL       DO IF PH6 LOGIC ERROR                08840021
PASSBY6  DS    0H                                                       08850021
       LA    R1,COSADR                                                  08860021
       BALR  R0,RB2                BR TO PH0 TO ISSUE MACRO TO          08870021
       DC    X'A0'                 TERMINATE PHASE                      08880021
NOPH7    DS    0H                  PHASE 7 WILL NOT BE CALLED           08890021
         TM    P6ESW,P6ERR                                              08900021
         BC    ZERO,NOPH75         NO PHASE6 ERROR                      08910021
         MVI   ERRSEV,DLEVEL       DO IF PH6 LOGIC ERROR                08920021
NOPH75   DS    0H                                                       08930021
         BALR  R0,RB2              BR TO PHASE0                         08940021
         DC    X'B0'               RETURN TO SYSTEM                     08950021
*  ROUTINE TO HANDLE MAP SUPPRESSION                                    08960021
MSGMS    DS    0H                                                       08970021
         NI    PHZSW,NO6OPR        TURN OFF OPTIONS FOR STATISTICS      08980021
         NI    PHZSW1,CLISTR                                            08990021
          TM    SWITCH,NO6A         HAS PH6 SET ERROR SW                09000021
         BC    ONES,MSGM1         YES, DON'T DO PH6 AGAIN FOR XREF      09010021
         TM    PHZSW1,XREF         PROCESS PH6 FOR XREF (WITH NO O/     09020021
         BC    ONES,NORMAL         BUT RETURN HERE LATER                09030021
MSGM1    EQU   *                  NO6A SO PRETEND NO XREF               09040021
         OI    SWITCH+NX1,RDERRFIL                                      09050021
MSGMS1   DS    0H                                                       09060021
         L     R15,APRSTAT                                              09070021
         BALR  RS1,R15             GO PRINT STATISTICS                  09080021
         OI    SWITCH+NX1,DOPH7                                         09090021
*  PRINT MESSAGE FOR SUPPRESSING MAP                                    09100021
         MVC   OU6CDN(LX110),MSMSG                                47939 09110021
         L     RS1,APUTM                                                09120021
         L     R15,APUT                                                 09130021
         BALR  RS1,RS1             PRINT MESSAGE                        09140021
         TM    P6ESW,P6ERR                                              09150021
         BC    ONES,NOOPTST        PH6 INTERNAL ERROR                   09160021
         OI    ERF4SW,ERF4ON       PH7 TO PRINT ERROR MSG               09170021
         BC    UNCOND,PASS6BY      TO TERMINATE PH6                     09180021
NORMAL DS    0H                                                         09190021
*      INITIALIZE RLDCRD SWITCHES                                       09200021
         NI    RLDIF,RLDNO         RLD NOT YET CREATED                  09210021
         NI    RLDONE,RLDFST       FIRST TIME                           09220021
         NI    RLDFSW,RLDNOFRC     NOT FORCE                            09230021
*    INITIALIZE GETF4 SWITCH                                            09240021
         MVI   F4SW,F4BLKLST       NEWBLOCK,F4REG, LISTING TEXT         09250021
*                                                                       09260021
*      INITIALIZE LINK EDIT PUNCH CARD SERIAL NUMBER                    09270021
*                                                                       09280021
         ZAP   CRDNUM(LX3),C6P0                                         09290021
         CLI   PROGID,BLANK        IS PROGRAM NAME BLANK                09300021
       BC    NOTEQ,PROGOK          NO,BR                                09310021
         OI    SEGSW,SEGNMBLK      YES, SET ASSWITCH                    09320021
         MVC   PROGID(LX8),NOID    GENERATE A NAME                      09330021
PROGOK   CLI   SEGLMT,NOTSEGTD     IS SOURCE PROGRAM SEGMENTED          09340021
         BC    EQ,NORMA1           NO, BR                               09350021
       L     RW1,ASGTBL            RELOCATE SEGTBL ADCON                09360021
       ALR   RW1,RB2                                                    09370021
       ST    RW1,ASGTBL                                                 09380021
*  SORT SEGTBL BY PRIORITY NUMBER                                       09390021
       L     R1,ASGTBL                                                  09400021
       L     R15,ATABLE                                                 09410021
       BALR  RS1,R15               GET STARTING ADDR(R1),AND SIZE(R     09420021
       LR    RW1,R1                                                     09430021
         LA    RW3,DX0(R1,R2)       END OF SEGTBL+1                     09440021
SEG00    LA    RW2,DX5(RW1)         COMPARE ADDR                        09450021
       CR    RW1,RW3               ALL DONE                             09460021
       BC    NOTLO,SEG20           YES,BR                               09470021
SEG02  CR    RW2,RW3               IS CURRENT PASS FINISHED             09480021
       BC    LO,SEG06              NO,BR                                09490021
         LA    RW1,DX5(RW1)         YES,START A NEW PASS                09500021
         B     SEG00               START A NEW PASS                     09510021
SEG06    CLC   DX0(LX1,RW1),DX0(RW2) ARE ENTRIES ALREADY ORDERED        09520021
       BC    NOTHI,SEG10           YES,BR                               09530021
         MVC   HOLD(LX5),DX0(RW1)    SWAP                               09540021
         MVC   DX0(LX5,RW1),DX0(RW2)                                    09550021
         MVC   DX0(LX5,RW2),HOLD                                        09560021
SEG10    LA    RW2,DX5(RW2)                                             09570021
       B     SEG02                 CHECK CURRENT PASS                   09580021
SEG20  DS    0H                                                         09590021
       LR    RW1,R1                                                     09600021
         LA    RW3,DX0(R1,R2)       END OF SEGTBL+1                     09610021
       SR    RW2,RW2               INITIALIZE CTR OF NON-RES SEGS       09620021
SEG22  CR    RW1,RW3               ALL DONE                             09630021
       BC    NOTLO,SEG26           YES,BR                               09640021
         CLI   DX0(RW1),XX00        IGNORE SEGMENTS OF PTY 0            09650021
         BC    NOTEQ,SEG24         IGNORE SEGMENT OF PTY ZERO           09660021
SEG23    LA    RW1,DX5(RW1)         POINT TO NEXT ENTRY                 09670021
       B     SEG22                 CHECK IF ALL DONE                    09680021
SEG24    CLC   CURPTY(LX1),DX0(RW1)  ARE PTY NMBRS EQUAL                09690021
         BC    EQ,SEG23            YES, BR                              09700021
         LA    RW2,DX1(RW2)         UPDATE CTR                          09710021
         MVC   CURPTY(LX1),DX0(RW1)                                     09720021
       B     SEG23                 GO POINT TO NEXT ENTRY               09730021
SEG26  STH   RW2,SEGCTR            SAVE                                 09740021
         NI    SEGSW,SEGNMOK       RESET SW, SEG NAME NOT BLANK         09750021
       L     R15,AESD              GET ADDR. OF PUNCH RTN               09760021
       LA    RS1,SE5091            SPECIFY RETURN ADDR                  09770021
         OI    SEGSW,SEGNSRT       SET SW TO PUNCH INSERT CARD          09780021
       BR    R15                   BR TO PUNCH                          09790021
NORMA1 EQU   *                     NORMAL PROCESSING-NO SEGMENTATIO     09800021
       EJECT                                                            09810021
*                                                                       09820021
*=1    PUNCH ESD CARD FOR CSECT                                         09830021
*                                                                       09840021
         LA    R0,ESDTYP0          CSECT, TYPE 0 ESD                    09850021
       SR    R0,R0                 SPECIFY TYPE=0                       09860021
         TM    SEGSW,SEGNMBLK      WAS PROGRAM NAME INITLY BLANK        09870021
       BC    ZERO,SE5090           NO,BR                                09880021
         LA    R0,ESDTYP4          TYPE 4 ESD                           09890021
SE5090 LA    R1,PROGID         NAME OF PROGRAM                          09900021
       L     R15,AESD                                                   09910021
       BALR  RS1,R15               PUNCH ESD CARD                       09920021
       SPACE 2                                                          09930021
* INITIALIZE PROGID DC FOR INIT1.                                       09940021
SE5091 EQU   *                                                          09950021
         MVC   DCPRID(LX8),PROGID                                       09960021
       SPACE 2                                                          09970021
SE5110 DS    0H                                                         09980021
       SPACE 2                                                          09990021
*     INITIALIZE E-TEXT SWITCH                                          10000021
         NI    ERF4SW,ERF4SEQ      NO ERRORS YET                        10010021
       SPACE 2                                                          10020021
*      INITIALIZE SWITCHES AND COUNTS                                   10030021
*                                                                       10040021
       SR    RW1,RW1                                                    10050021
       STH   RW1,GETLEN                                                 10060021
       STH   RW1,PNUCTR                                                 10070021
       STH   RW1,RPNCTR                                                 10080021
       STH   RW1,RGNCTR                                                 10090021
       STH   RW1,NUMBLW                                                 10100021
       STH   RW1,FRSBLW                                                 10110021
       STH   RW1,ERRCUR                                                 10120021
         NI    FGET,FGETNEW        GET NEW BLOCK                        10130021
         NI    S6BNO,S6INIT00      INIT TO DO B1                        10140021
         NI    S6PLNO,S6INIT00     INIT TO DO D1                        10150021
         NI    VIRTSW,INITOFF      VIRTUAL TABLE KILLED SW(OK NOW       10160021
         NI    QRTNSW,INITOFF      NOT IN QRTNS                         10170021
         NI    RGNSW,INITOFF       NOT DOING INIT CODING                10180021
         NI    DCBSW,INITOFF       NOT PROCESSING FILTBL                10190021
         NI    LOADSW,INITOFF      DON'T GEN LOAD INSTR                 10200021
         NI    NOLOAD,INITOFF      NOT JUST SEARCH                      10210021
       NI  PLUSFT,S6INIT00         NOT ADDR WITH PLUS ELT               10220021
*      INITIALIZE ERROR SWITCHES                                        10230021
       SPACE 2                                                          10240021
*      INITIALIZE OTHER AREAS NECESSARY                                 10250021
*                                                                       10260021
         XC    C6OP(LX9),C6OP  INITIALIZE INSTR CREATION AREA           10270021
       ST    RW1,C6WRK0                                                 10280021
         MVI   C6WRK1,MF0                                               10290021
         MVC   C6WRK2(LX8),C6WRK1                                       10300021
*                                                                       10310021
         LA    R1,DX96                                                  10320021
       STH   R1,WCMAX         *****                                     10330021
******                                                                  10340021
       LH    RW1,RPTSAV                                                 10350021
       LTR   RW1,RW1                                                    10360021
       BC    ZERO,TAM033           BR IF REPORT SAVE AREA CELL 0        10370021
         LA    RW1,SEVEN                                                10380021
       STH   RW1,RPTSAV                                                 10390021
TAM033 DS    0H                                                         10400021
         BC    UNCOND,HEADER       BR TO PRINT HEADER RTN               10410021
ABGPH6 DC    A(PH6BEG)                                                  10420021
ADSCT1 DC    A(PGTINT)                                                  10430021
ADCNST DC    A(ERR010)                                                  10440021
       EJECT                                                            10450021
*      PRINT PAGE HEADING AFTER SKIP                                    10460021
*                                                                       10470021
*=L    CODING FROM HERE TO NEXT *=L NOT EXECUTED IF NOLIST MODE         10480021
HEADER DS    0H                                                         10490021
*      CLEAR OUTPUT AREA                                                10500021
         MVI   OU6REC,BLANK                                             10510021
         MVC   OU6CDN(LX119),OU6REC                                     10520021
         MVC   SB1D1C(LX24),SBDINI INITIALIZE SYMBOLIC OPERAND AREA     10530021
         USING PUT,R15                                                  10540021
         L     R15,APUT                                                 10550021
         BAL   RS1,PUTM            PRINT BLANK LINE                     10560021
       BALR  RS1,R15            PRINT BLANK LINE                        10570021
*                                                                       10580021
*      PRINT MEMORY MAP                                                 10590021
*                                                                       10600021
         TM    PHZSW1,CLIST                                             10610021
         BC    ONES,CLHDG          PRINT CLIST HEADING                  10620021
*                                                                       10630021
         MVC   OU6REC+NX25(LX10),CMEMAP                                 10640021
CLHDG1   DS    0H                                                       10650021
       L     R15,APUT                                                   10660021
       BALR  RS1,R15            PRINT HEADER                            10670021
       BALR  RS1,R15            BLANK LINE                              10680021
         BC    UNCOND,TGTINT       CONTINUE WITH PH6                    10690021
*=L                                                                     10700021
CLHDG    DS    0H                                                       10710021
         MVC   OU6REC+NX50(LX17),CCLIST                                 10720021
         USING PUT,R15                                                  10730021
         L     R15,APUT                                                 10740021
         BAL   RS1,PUTM               PRINT LINE                        10750021
         BAL   RS1,PUTM              PRINT LINE                         10760021
       EJECT                                                            10770021
*=1    INITIALIZE COMMON AND COMTBL POINTERS FOR                        10780021
*=       THE TASK GLOBAL TABLE AND ANY SUBTASK                          10790021
*=       GLOBAL TABLES NEEDED.                                          10800021
*                                                                       10810021
*      THE COMTBL ENTRY FOR RPD=0 IS CURRENTLY IN COMMON.               10820021
*                                                                       10830021
* THE SUBROUTINE 'DSPLAC' IS USED TO CALCULATE DISPLACEMENTS.           10840021
*                                                                       10850021
TGTINT DS    0H                                                         10860021
*      CALCULATE NUMBER OF BL'S ASSIGNED TO WORKING STORAGE             10870021
*      AND BL= OF THE FIRST ONE                                         10880021
         MVC   C6WRK0+NX1(LX3),WSSIZE                                   10890021
         NI    C6WRK0,INITOFF                                           10900021
       L     RW1,C6WRK0       LENGTH W-S/4096 + 1 IF REMAINDER NOT      10910021
       LTR   RW1,RW1                                                    10920021
       BC    ZERO,TGT01            BR IF W-S CELL 0                     10930021
       BCTR  RW1,R0                SUBTRACT 1                           10940021
         SRA   RW1,DX10                                                 10950021
         LA    RW1,DX1(RW1)                                             10960021
       STH   RW1,NUMBLW                                                 10970021
       SR    RW1,RW1                                                    10980021
       IC    RW1,WSBL                                                   10990021
       STH   RW1,FRSBLW                                                 11000021
TGT01  DS    0H                                                         11010021
       L     RW1,LOCCTR       LOCCTR HAS BEEN SET                       11020021
         LA    RW1,DX7(RW1)                                             11030021
         SRL   RW1,DX3         TO THE END OF DATA                       11040021
         SLL   RW1,DX3         BY PHASE 2.                              11050021
*      RELLOC=LOCCTR ADJUSTED TO DOUBLE-WORD BOUNDARY                   11060021
TGT02  DS    0H                                                         11070021
       ST    RW1,TGTLOC                                                 11080021
       ST    RW1,GTLOC                                                  11090021
* CALCULATE LENGTH OF TGT + SGT'S                                       11100021
       LA    R15,M4ADD     ROUTINE TO MULT RW2*4 AND ADD TO RW1         11110021
         LA    RW1,VARTGT2                                              11120021
         LH    RW2,BLCTR                                                11130021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11140021
         LH    RW2,DECBCT                                               11150021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11160021
         BAL   RS1,ROUND8          BR TO ROUND TO DW BOUNDARY           11170021
         LH    RW2,TSMAX                                                11180021
         SLL   RW2,DX3                                                  11190021
         AR    RW1,RW2                                                  11200021
         AH    RW1,TS2MAX                                               11210021
         BAL   RS1,ROUND8          BR TO ROUND TO DW BOUNDARY           11220021
         AH    RW1,TS3MAX                                               11230021
         BAL   RS1,ROUND8          BR TO ROUND TO DW BOUNDARY           11240021
         AH    RW1,TS4MAX                                               11250021
         BAL   RS1,ROUND4          BR TO ROUND TO FW BOUNDARY           11260021
         LH    RW2,BLLCTR                                               11270021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11280021
         AH    RW1,VLCCTR                                               11290021
         AH    RW1,VLCCTR                                               11300021
         BAL   RS1,ROUND4          BR TO ROUND TO FW BOUNDARY           11310021
         LH    RW2,SBLCTR                                               11320021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11330021
         LH    RW2,INDEX1                                               11340021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11350021
       LH    RW2,SBSCTR                                                 11360021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11370021
       LH    RW2,ONCTR                                                  11380021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11390021
       LH    RW2,PFMCTR                                                 11400021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11410021
       LH    RW2,PSVCTR                                                 11420021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11430021
       LH    RW2,VNCTR                                                  11440021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11450021
       LH    RW2,SA2CTR                                                 11460021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11470021
       LH    RW2,SA3CTR                                                 11480021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11490021
       AH    RW1,XSWCTR                                                 11500021
       BAL   RS1,ROUND4            BR TO ROUND TO FW BOUNDARY           11510021
       AH    RW1,XSACTR                                                 11520021
       BCTR  RW1,R0          XSACTR IS 1 TOO HIGH                       11530021
       BAL   RS1,ROUND4            BR TO ROUND TO FW BOUNDARY           11540021
       LH    RW2,PARMAX                                                 11550021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11560021
TGT04  LH    RW2,RPTSAV                                                 11570021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          11580021
         LH    RW2,CKPCTR                                               11590021
         BALR  RS1,R15             BR TO MULTIPLY BY 4 AND ADD          11600021
       STH   RW1,VCONAD            SAVE DISPL OF VCONTBL                11610021
       LH    RW2,SEGCTR            GET NMBR OF NON-RESIDENT SEGMENT     11620021
         SLL   RW2,DX3              DEVELOP SIZE OF VCON TBL            11630021
       AR    RW1,RW2               UPDATE SIZE OF TGT                   11640021
       STH   RW1,GTLNG        LENGTH WITHOUT OVERFLOW CELLS             11650021
       SR    RW2,RW2                                                    11660021
       STH   RW2,MAXOV        INITIAL VALUE                             11670021
* CALCULATE MAXIMUM NUMBER OF OVERFLOW CELLS NEEDED                     11680021
TGT05  C     RW1,C6M6         F'4095'                                   11690021
       BC    NOTHI,TGT06           NOT OVERFLOW                         11700021
         LA    RW2,DX1(RW2)                                             11710021
       SH    RW1,CH4092                                                 11720021
         BC    UNCOND,TGT05        LOOP TO COMPARE AGAIN                11730021
TGT06  CH    RW2,MAXOV                                                  11740021
         BC    NOTHI,TGT09         NO NEW MAX                           11750021
       STH   RW2,MAXOV        NEW MAXIMUM                               11760021
         STH   RW2,TGTOVFL         SAVE OVFL COUNT FOR SEG        0339  11770021
*  ALSO, PUNCH OVERFLOW INFORMATION INTO THE TGT +(SGT'S)               11780021
TGT09    DS    0H                                                       11790021
         LH    RW2,GTLNG                                                11800021
         LA    RW1,VARTGT1                                              11810021
         LH    R2,MAXOV                                                 11820021
         AH    R2,BLCTR                                                 11830021
         AH    R2,DECBCT                                                11840021
         STC   R2,CALBND                                                11850021
         TM    CALBND,SOMEDISP     IS THERE SOME COUNT,ADD IF NOT       11860021
         BC    NOTZER,TGT10        YES, BRANCH                          11870021
         LA    RW1,DX4(RW1)                                             11880021
         LA    RW2,DX4(RW2)                                             11890021
TGT10    DS    0H                                                       11900021
         L     RW3,TGTLOC          GET TGT START                        11910021
         ST    RW3,RELLOC          STORE IT                             11920021
         ST    RW3,NXADDR          FOR PUNCHING OVFLO CELLS             11930021
         AR    RW1,RW3             GET ADDRESS OF OVFLO CELLS           11940021
         ST    RW1,LOCCTR          (START OF TGT + ADJUSTED             11950021
*                                   RELATIVE LOC OF OVFLO CELLS)        11960021
         ST    RW1,OVFLLOC         ALSO SAVE FOR SEG              0339  11970021
         LR    RW1,RW2             ADJUSTED LENGTH OF TGT               11980021
       LH    RW2,MAXOV                                                  11990021
       BAL   RS1,M4ADD             BR TO MULTIPLY BY 4 AND ADD          12000021
       BAL   RS1,ROUND8            BR TO ROUND TO DW BOUNDARY           12010021
       STH   RW1,GTLNG        FINAL VALUE                               12020021
       AR    RW3,RW1          RELLOC OF NEXT GT                         12030021
         ST    RW3,LOCPGT                                               12040021
         LA    INPUTR,SETTGT           FOR SEG BRANCH             0339  12050021
         CLI   SEGLMT,NOTSEGTD       IS PGM SEGMTD                0339  12060021
         BC    NOTEQ,SETTGT        YES, OVFL WILL BE PUNCHED IN RT0339  12070021
TGTOVCL    DS    0H                ENTERED FROM ROOT TO PUNCH OVFL0339  12080021
         LH    RW3,TGTOVFL         NUMBER OF OVERFLOW CELLS       0339  12090021
         BC    UNCOND,TMOROV       BR TO CHECK IF MORE CELLS            12100021
TPUNOV L     RW1,NXADDR                                                 12110021
       AH    RW1,H4096                                                  12120021
       ST    RW1,NXADDR       NEXT OVERFLOW CELL CONTENTS               12130021
         LA    R0,ESDTYP4                                               12140021
       LA    R1,NXADDR                                                  12150021
       L     R15,ATXPNH                                                 12160021
       BALR  RS1,R15            PUNCH TEXT                              12170021
       BCTR  RW3,R0                SUBTRACT 1                           12180021
TMOROV LTR   RW3,RW3          MORE OVERFLOW CELLS                       12190021
       BC    NOTZER,TPUNOV    YES                                       12200021
         BR    INPUTR              RET SEG OR NEXT INSTR          0339  12210021
SETTGT   DS    0H                                                 0339  12220021
* SET UP TGT HEADER IN MEMORY MAP                                       12230021
         MVC   OU6LC(LX3),CCTGT                                         12240021
       L     RW1,TGTLOC                                                 12250021
       ST    RW1,C6WRK0                                                 12260021
       L     R15,AS6010        CONVERT FOR LIST                         12270021
       BALR  RS1,R15               BR TO CONVERT RTN                    12280021
         MVC   OU6REC+NX44(LX5),C6WRK4                                  12290021
       L     R15,APUT                                                   12300021
       BALR  RS1,R15            PRINT                                   12310021
       BALR  RS1,R15            BLANK LINE                              12320021
       LA    RW3,CCSAVE                                                 12330021
       ST    RW3,MAPTXT                                                 12340021
       SR    RW1,RW1                                                    12350021
       L     R15,AMAPLC        SAVE AREA                                12360021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12370021
         LA    RW1,DX72        SWITCH CELL                              12380021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12390021
         LA    RW1,DX76        TALLY CELL                               12400021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12410021
         LA    RW1,DX80             SORT SAVE                           12420021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12430021
         LA    RW1,DX84            ENTRY/SAVE                           12440021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12450021
         LA    RW1,DX88            SORT CORE SIZE                       12460021
       BALR    RS1,R15             BR TO PRINT MEMORY MAP LINE          12470021
         LA    RW1,DX92             RET CODE                            12480021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12490021
         LA    RW1,DX94             SORT RET                            12500021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12510021
         LA    RW1,DX96             WORKING CELLS                       12520021
       BALR  RS1,R15              PRINT A LINE                          12530021
         LA    RW1,DX400            SORT FILE SIZE                      12540021
       BALR  RS1,R15              PRINT A LINE                          12550021
         LA    RW1,DX404            SORT MODE SIZE                      12560021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12570021
       LA    RW1,APGTVN            VNI TBL ADDRESS                      12580021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12590021
       LA    RW1,ATGTVN            VN-I TBL ADDRESS                     12600021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12610021
       LA    RW1,TGTVCON           PTR TO A VCON TBL               STAN 12620021
       BALR   RS1,R15              BR TO PRINT MEMORY MAP LINE          12630021
       LA    RW1,VNTBLN            LENGTH OF VNI TBL                    12640021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12650021
         LA    RW1,DX422            LABEL RET                       STA 12660021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12670021
         LA    RW1,DX423            UNUSED                          STA 12680021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12690021
       LA    RW1,TGTINIT1          INIT1 ADCON                     STAN 12700021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12710021
         LA    RW1,DX436            UNUSED                          STA 12720021
       BALR  RS1,R15               BR TO PRINT MEMORY MAP LINE          12730021
       LA    R15,DSPLAC        SUBROUTINE ADDRESS                       12740021
         LA    RW1,VARTGT1                                              12750021
*  CALCULATE DISPLACEMENTS.                                             12760021
       LH    R2,MAXOV                                                   12770021
       AH    R2,BLCTR                                                   12780021
       AH    R2,DECBCT                                                  12790021
       STC   R2,CALBND                                                  12800021
         TM    CALBND,SOMEDISP     IS THERE SOME COUNT,ADD IF NOT       12810021
       BC    NOTZER,TGT15          YES, BR                              12820021
         LA    RW1,DX4(RW1)                                             12830021
TGT15    DS    0H                                                       12840021
         LA    R2,FOURBYTE                                              12850021
       LA    RW2,MAXOV                                                  12860021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         12870021
         LA    R2,FOURBYTE                                              12880021
       LA    RW2,BLCTR                                                  12890021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         12900021
         LA    R2,FOURBYTE                                              12910021
       LA    RW2,DECBCT                                                 12920021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         12930021
         LA    R2,DW8BYTES         DOUBLE-WORDS                         12940021
       LA    RW2,TSMAX        TEMPORARY STORAGE                         12950021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         12960021
         LA    R2,ONEBYTE                                               12970021
       LA    RW2,TS2MAX                                                 12980021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         12990021
         BAL   RS1,ROUND8          GET ONTO DOUBLE-WD BOUNDRY      STAN 13000021
         LA    R2,ONEBYTE                                               13010021
       LA    RW2,TS3MAX            TEMP STORAGE-3                       13020021
         BALR  RS1,R15             BR TO CALCULATE DISPLACEMENT         13030021
         BAL   RS1,ROUND8          GET ONTO DOUBLE-WD BOUNDRY      STAN 13040021
         LA    R2,ONEBYTE                                               13050021
       LA    RW2,TS4MAX            TEMP STORAGE-4                       13060021
         BALR  RS1,R15             BR TO CALCULATE DISPLACEMENT         13070021
         LA    R2,FOURBYTE                                              13080021
       LA    RW2,BLLCTR                                                 13090021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13100021
         LA    R2,TWOBYTE                                               13110021
         LA    RW2,VLCCTR                                               13120021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13130021
         LA    R2,FOURBYTE                                              13140021
         LA    RW2,SBLCTR                                               13150021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13160021
         LA    R2,FOURBYTE                                              13170021
       LA    RW2,INDEX1                                                 13180021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13190021
         LA    R2,FOURBYTE                                              13200021
       LA    RW2,SBSCTR                                                 13210021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13220021
         LA    R2,FOURBYTE                                              13230021
       LA    RW2,ONCTR                                                  13240021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13250021
         LA    R2,FOURBYTE                                              13260021
       LA    RW2,PFMCTR                                                 13270021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13280021
         LA    R2,FOURBYTE                                              13290021
       LA    RW2,PSVCTR                                                 13300021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13310021
* SAVE VNCTR FOR LATER USE                                              13320021
       LH    R2,VNCTR                                                   13330021
       STH   R2,VNLOC                                                   13340021
         LA    R2,FOURBYTE                                              13350021
       LA    RW2,VNLOC                                                  13360021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13370021
         LA    R2,FOURBYTE                                              13380021
       LA    RW2,SA2CTR                                                 13390021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13400021
         LA    R2,FOURBYTE                                              13410021
       LA    RW2,SA3CTR                                                 13420021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13430021
         LA    R2,ONEBYTE                                               13440021
       LA    RW2,XSWCTR                                                 13450021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13460021
* XSACTR IS 1 TOO HIGH.                                                 13470021
       LH    R2,XSACTR                                                  13480021
         LA    R2,DX2(R2)       ADD 3 TO DESIRED NUMBER OF BYTES        13490021
         SRL   R2,DX2           DIVIDE BY 4                             13500021
       STH   R2,XSACTR                                                  13510021
* XSACTR NOW CONTAINS NUMBER OF WORDS NEEDED.                           13520021
         LA    R2,FOURBYTE                                              13530021
       LA    RW2,XSACTR                                                 13540021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13550021
         LA    R2,FOURBYTE                                              13560021
       LA    RW2,PARMAX                                                 13570021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13580021
*                                                                       13590021
TGT40    LA    R2,FOURBYTE                                              13600021
       LA    RW2,RPTSAV                                                 13610021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT         13620021
         LA    R2,FOURBYTE                                              13630021
         LA    RW2,CKPCTR                                               13640021
         BALR  RS1,R15             BR TO CALCULATE DISPLACEMENT         13650021
         LA    R2,DW8BYTES                                              13660021
       LA    RW2,SEGCTR            VCON TBL                        STAN 13670021
       BALR  RS1,R15               BR TO CALCULATE DISPLACEMENT    STAN 13680021
       LA    RW2,TGT45             RETURN ADDR                          13690021
         TM    PHZSW,NOLIST    PMAP IN EFFECT                           13700021
         BC    NOTONE,NOSKIP1          NO, DONT EJECT             2657  13710021
*DEL                                                                    13720021
*DEL                                                                    13730021
*DEL                                                                    13740021
         BALR    R0,RB2       BR TO PH0                                 13750021
         DC    X'D6'             TO EJECT PAGE                          13760021
NOSKIP1    DS    0H                                                     13770021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 13780021
         BC    NOTEQ,TGT45         YES,SW WILL BE PUNCHED IN ROOT       13790021
TGT42    DS    0H                                                       13800021
         ST    RW2,C6WRK0                                               13810021
         SR    RW1,RW1                                                  13820021
         XC    C6WRK1(LX1),C6WRK1  INIT AREA TO X'00'                   13830021
         L     RW1,TGTLOC                                               13840021
         ST    RW1,LOCCTR         SAVE LOCATION                         13850021
         LA    R0,ONEBYTE                                               13860021
         LA    R1,C6WRK1                                                13870021
         L     R15,ATXPNH          GET SUBROUTINE ADDRESS FOR PNCH      13880021
         BALR  RS1,R15            INIT SAVE-AREA BYTE 1 TO X'00'        13890021
         SR    RW1,RW1                                                  13900021
         IC    RW1,COMMAD+NX1                                           13910021
         ST  RW1,C6WRK1                                                 13920021
       L     RW1,TGTLOC                                                 13930021
         LA    RW1,DX72(RW1)                                            13940021
       ST    RW1,LOCCTR                                                 13950021
         LA    R0,ESDTYP4                                               13960021
         LA    R1,C6WRK1                                                13970021
       L     R15,ATXPNH        INIT SWITCH CELL IN TGT                  13980021
       BALR  RS1,R15               BR TO PUNCH                          13990021
         XC    C6WRK1(LX20),C6WRK1                                      14000021
         LA    R0,DX20                                                  14010021
         LA    RW1,DX4(RW1)                                             14020021
         ST    RW1,LOCCTR                                               14030021
         BALR  RS1,R15             INITIALIZE TALLY THRU SORT RET       14040021
         LA    R0,DX8                                                   14050021
         LA    RW1,DX324(RW1)                                           14060021
         ST    RW1,LOCCTR    INITIALIZE SORT FILE SIZE                  14070021
         BALR  RS1,R15       AND SORT MODE SIZE                         14080021
         LA    R0,FOURBYTE                                              14090021
*PUNCH TEXT FOR BL AND BLL CELLS                                        14100021
       LH    RW3,DECBCT                                                 14110021
       SH    RW3,BLCTR             ANY BL CELLS                         14120021
       BC    ZERO,BLLINT           NO - DO BLL CELLS                    14130021
       LH    RW2,BLCTR            GET DISP OF CELLS                     14140021
       BAL    RS1,COMINT          PUNCH TEXT                            14150021
BLLINT EQU   *                                                          14160021
       LH    RW3,VLCCTR                                                 14170021
       SH    RW3,BLLCTR                                                 14180021
       LH    RW2,BLLCTR            GET DISP OF CELLS                    14190021
       BAL    RS1,COMINT          PUNCH TEXT                            14200021
         LH    RW3,PFMCTR                                               14210021
         SH    RW3,ONCTR                                                14220021
         BC    ZERO,XSWINT         NO ONCTL CELLS - NO PUNCH            14230021
         LH    RW2,ONCTR                                                14240021
         BAL   RS1,COMINT          GO TO COMMON CELL INIT RTE           14250021
XSWINT   LH    RW3,XSACTR                                               14260021
         SH    RW3,XSWCTR                                               14270021
         BC    ZERO,CKPINT         NO XSW  CELLS - NO PUNCH             14280021
         LH    RW2,XSWCTR                                               14290021
         BAL   RS1,COMINT          GO TO COMMON CELL INIT RTE           14300021
CKPINT   LA    RW1,DX1                                                  14310021
         ST    RW1,C6WRK1                                               14320021
         LH    RW3,SEGCTR                                               14330021
         SH    RW3,CKPCTR                                               14340021
         BC    ZERO,STV020         NO CKPT CELLS - NO PUNCH             14350021
         LH    RW2,CKPCTR                                               14360021
         LA    RS1,STV020                                               14370021
COMINT   DS    0H                                                       14380021
         SRL   RW3,DX2              GET # OF CELLS                      14390021
         L     RW1,TGTLOC                                               14400021
         AR    RW1,RW2                                                  14410021
         LR    RW2,RS1                                                  14420021
COMINT1  DS    0H                                                       14430021
         ST    RW1,LOCCTR                                               14440021
         BALR  RS1,R15             GO TO PUNCH TEXT                     14450021
         LA    RW1,DX4(RW1)                                             14460021
         BCT   RW3,COMINT1         LOOP TO PUNCH # OF CELLS             14470021
         BCR   UNCOND,RW2          RETURN                               14480021
STV020   DS    0H                                                       14490021
         L     RW2,C6WRK0                                               14500021
       BR    RW2                   BR TO NEXT LINE                      14510021
TGT45  DS    0H                                                         14520021
*                                                                       14530021
*      SAVE BLCTR AND RELLOC OF RPD=0 SO THAT INFORMATION IS            14540021
*      AVAILABLE AT ALL TIMES                                           14550021
       BC    UNCOND,PGTINT         CONTINUE WITH PH6                    14560021
       EJECT                                                            14570021
*=2    DSPLAC       SUBR TO CALCULATE DISPLACEMENTS                     14580021
*            CALLED BY  BALR 14,15                                      14590021
*            RW1 HAS CURRENT DISPLACEMENT.                              14600021
*            RW2 HAS ADDRESS OF COUNTER.                                14610021
*            REG. 2 HAS BOUND REQUIREMENT AND LENGTH OF CELL.           14620021
*            RW3 USED AS WORK REGISTER.                                 14630021
DSPLAC DS    0H                                                         14640021
       LR    RW3,R2                                                     14650021
       BCTR  RW3,R0            BOUNDARY MASK                            14660021
DSPL10 NR    RW3,RW1          PROPER BOUNDARY                           14670021
       BC    ZERO,DSPL20      YES                                       14680021
         LA    RW1,DX1(RW1)    NO, INCREMENT                            14690021
         BC    UNCOND,DSPLAC       AND TRY AGAIN                        14700021
DSPL20   MH    R2,DX0(RW2)      MULTIPLY COUNT BY LENGTH                14710021
         STH   RW1,DX0(RW2)    STORE DISPLACEMENT                       14720021
       STM   RS1,R15,SV1415                                             14730021
       L     R15,AMAPLC        FOR MEMORY MAP                           14740021
       BALR  RS1,R15               BR TO PRINT LINE OF MEMORY MAP       14750021
       LM    RS1,R15,SV1415                                             14760021
       AR    RW1,R2            NEXT DISPLACEMENT                        14770021
         BCR   UNCOND,RS1          RETURN                               14780021
       SPACE 2                                                          14790021
* ROUTINES TO ROUND UP CONTENTS OF RW1 TO MULTIPLE OF 2, 4 OR 8         14800021
*   RETURN BY  BCR  15,14                                               14810021
       DS    0H                                                         14820021
ROUND2   LA    RW1,DX1(RW1)                                             14830021
         SRL   RW1,DX1                                                  14840021
         SLL   RW1,DX1                                                  14850021
         BCR   UNCOND,RS1          RETURN                               14860021
       DS    0H                                                         14870021
ROUND4   LA    RW1,DX3(RW1)                                             14880021
         SRL   RW1,DX2                                                  14890021
         SLL   RW1,DX2                                                  14900021
         BCR   UNCOND,RS1          RETURN                               14910021
       DS    0H                                                         14920021
ROUND8   LA    RW1,DX7(RW1)                                             14930021
         SRL   RW1,DX3                                                  14940021
         SLL   RW1,DX3                                                  14950021
         BCR   UNCOND,RS1          RETURN                               14960021
       SPACE 2                                                          14970021
* ROUTINE TO MULTIPLY CONTENTS OF RW2 BY 2 AND ADD TO RW1               14980021
*   RETURN BY  BCR  15,14                                               14990021
       DS    0H                                                         15000021
M4ADD    SLL   RW2,DX2                                                  15010021
       AR    RW1,RW2                                                    15020021
         BCR   UNCOND,RS1          RETURN                               15030021
       EJECT                                                            15040021
* HEADINGS AND LISTING INFORMATION                                      15050021
CCLIST   DC    C'CONDENSED LISTING'                                     15060021
CMEMAP DC    C'MEMORY MAP'                                              15070021
CCTGT  DC    C'TGT'                                                     15080021
CCPGT  DC    C'PGT'                                                     15090021
NOID     DC    C'NOPRGMID'                                              15100021
CCYCLE DC    C'CYCLE='                                                  15110021
CCSAVE DC    FL1'8'                                                     15120021
       DC    C'SAVE AREA'                                               15130021
       DC    FL1'5'                                                     15140021
       DC    C'SWITCH'                                                  15150021
       DC    FL1'4'                                                     15160021
       DC    C'TALLY'                                                   15170021
       DC    FL1'8'                                                     15180021
       DC    C'SORT SAVE'                                               15190021
       DC    FL1'9'                                                     15200021
       DC    C'ENTRY-SAVE'                                              15210021
CCSORT DC    FL1'13'                                                    15220021
       DC    C'SORT CORE SIZE'                                          15230021
       DC    FL1'7'                                                     15240021
       DC    C'RET CODE'                                                15250021
       DC    FL1'7'                                                     15260021
       DC    C'SORT RET'                                                15270021
       DC    FL1'12'                                                    15280021
       DC    C'WORKING CELLS'                                           15290021
       DC    FL1'13'                                                    15300021
       DC    C'SORT FILE SIZE'                                          15310021
         DC    FL1'13'                                                  15320021
         DC    C'SORT MODE SIZE'                                        15330021
         DC    FL1'9'                                                   15340021
         DC    C'PGT-VN TBL'                                            15350021
         DC    FL1'9'                                                   15360021
         DC    C'TGT-VN TBL'                                            15370021
       DC    FL1'6'                                                STAN 15380021
       DC    C'VCONPTR'                                            STAN 15390021
       DC    FL1'15'                                                    15400021
         DC    C'LENGTH OF VN TBL'                                      15410021
       DC    FL1'8'                                                     15420021
       DC    C'LABEL RET'                                               15430021
       DC    FL1'5'                                                     15440021
       DC    C'UNUSED'                                                  15450021
       DC    FL1'10'                                               STAN 15460021
       DC    C'INIT1 ADCON'                                        STAN 15470021
       DC    FL1'5'                                                STAN 15480021
       DC    C'UNUSED'                                             STAN 15490021
CCOVFL DC    FL1'13'                                                    15500021
       DC    C'OVERFLOW CELLS'                                          15510021
       DC    FL1'7'                                                     15520021
       DC    C'BL CELLS'                                                15530021
       DC    FL1'12'                                                    15540021
       DC    C'DECBADR CELLS'                                           15550021
       DC    FL1'11'                                                    15560021
       DC    C'TEMP STORAGE'                                            15570021
       DC    FL1'13'       '                                            15580021
       DC    C'TEMP STORAGE-2'                                          15590021
       DC    FL1'13'                                                    15600021
       DC    C'TEMP STORAGE-3'                                          15610021
       DC    FL1'13'                                                    15620021
       DC    C'TEMP STORAGE-4'                                          15630021
       DC    FL1'8'                                                     15640021
       DC    C'BLL CELLS'                                               15650021
         DC    FL1'8'                                                   15660021
         DC    C'VLC CELLS'                                             15670021
         DC    FL1'8'                                                   15680021
         DC    C'SBL CELLS'                                             15690021
         DC    FL1'10'                                                  15700021
         DC    C'INDEX CELLS'                                           15710021
         DC    FL1'11'                                                  15720021
         DC    C'SUBADR CELLS'                                          15730021
         DC    FL1'10'                                                  15740021
         DC    C'ONCTL CELLS'                                           15750021
         DC    FL1'11'                                                  15760021
         DC    C'PFMCTL CELLS'                                          15770021
         DC    FL1'11'                                                  15780021
         DC    C'PFMSAV CELLS'                                          15790021
         DC    FL1'7'                                                   15800021
         DC    C'VN CELLS'                                              15810021
       DC    FL1'11'                                                    15820021
       DC    C'SAVE AREA =2'                                            15830021
       DC    FL1'11'                                                    15840021
       DC    C'SAVE AREA =3'                                            15850021
         DC    FL1'10'                                                  15860021
         DC    C'XSASW CELLS'                                           15870021
         DC    FL1'8'                                                   15880021
         DC    C'XSA CELLS'                                             15890021
       DC    FL1'10'                                                    15900021
       DC    C'PARAM CELLS'                                             15910021
       DC    FL1'10'                                                    15920021
       DC    C'RPTSAV AREA'                                             15930021
       DC    FL1'10'                                                    15940021
       DC    C'CHECKPT CTR'                                             15950021
       DC    FL1'7'                                                STAN 15960021
       DC    C'VCON TBL'                                           STAN 15970021
CCVIRT DC    FL1'12'                                                    15980021
       DC    C'VIRTUAL CELLS'                                           15990021
       DC    FL1'19'                                                    16000021
       DC    C'PROCEDURE NAME C'                                        16010021
       DC    C'ELLS'                                                    16020021
       DC    FL1'19'                                                    16030021
       DC    C'GENERATED NAME C'                                        16040021
       DC    C'ELLS'                                                    16050021
       DC    FL1'16'                                                    16060021
       DC    C'DCB ADDRESS CELL'                                        16070021
       DC    C'S'                                                       16080021
       DC    FL1'8'                                                     16090021
       DC    C'VNI CELLS'                                               16100021
       DC    FL1'7'                                                     16110021
       DC    C'LITERALS'                                                16120021
       DC    FL1'15'                                                    16130021
DISPLY DC    C'DISPLAY LITERALS'                                        16140021
SVRW2  DS    F                                                          16150021
SV1415 DS    2F                                                         16160021
CALBND DS    C                                                          16170021
SOMEDISP EQU   X'01'               THERE IS SOME COUNT                  16180021
       EJECT                                                            16190021
IKF602   CSECT                                                          16200021
*=1    COMMON AREA POINTERS TO PROGRAM GLOBAL TABLE--PART 1             16210021
PGTINT DS    0H                                                         16220021
       SR    RW3,RW3                                                    16230021
       LH    RW2,VIRCTR                                                 16240021
       STH   RW3,VIRCTR       START OF VIRTUALS IN PGT                  16250021
         SLL   RW2,DX1                                                  16260021
       STH   RW2,VIRNUM       NUM OF VIRTUALS FOR TAMER                 16270021
       LH    RW2,LTLCTR                                                 16280021
         SLL   RW2,DX1                                                  16290021
       STH   RW2,LTLNUM       NUM OF LITERALS FOR TAMER                 16300021
       LH    RW2,PNCTR                                                  16310021
         SLL   RW2,DX1                                                  16320021
       STH   RW2,PNNUM                                                  16330021
       LH    RW2,GNCTR                                                  16340021
         SLL   RW2,DX1                                                  16350021
       STH   RW2,GNNUM                                                  16360021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 16370021
         BC    EQ,NXTINS           NO, BRANCH                           16380021
         LA    RW2,THREE           YES, GET LEN VNPTY TBL ENTRY         16390021
       MH    RW2,VNCTR             GET SIZE OF VNPTY TBL                16400021
         LA    RW2,DX3(RW2)         ROUND UP                            16410021
         SRL   RW2,DX2              TO MULTIPLE OF 4                    16420021
         SLL   RW2,DX2                                                  16430021
       STH   RW2,VNSIZE            INITIALIZE PARLIST                   16440021
         SPACE 10                                                       16450021
NXTINS DS    0H                                                         16460021
       L     RW1,EOF3         SET UP EOFADR FOR F3                      16470021
       ST    RW1,EOFADR                                                 16480021
*                                                                       16490021
* DO NOT OPEN SYSOU                                                     16500021
       EJECT                                                            16510021
*=1    PROCESS PROCEDURE NAME USAGE TABLE                               16520021
*      1 BIT/PN   IF=1 PN HAS BEEN USED SO GIVE IT A RELATIVE PN NU     16530021
*                      FROM RPNCTR AND PUT IT IN CORRESPONDING CELL     16540021
*                      IN PNTBL                                         16550021
*                   =0 PN HAS NOT BEEN USED, PUT ZEROS IN CORRESPON     16560021
*                      PNTBL CELL                                       16570021
*      TABLE PASSED FROM PHASE 5                                        16580021
       SPACE 5                                                          16590021
PNUPRO DS    0H                                                         16600021
       LA    R1,APNTBL                                                  16610021
       L     R15,AXPRIM                                                 16620021
       BALR  RS1,R15               BR TO XPRIME RTN                     16630021
       LH    RW2,PNUCTR                                                 16640021
GETPNU STH   RW2,PNUCTR                                                 16650021
       SR    RW1,RW1                                                    16660021
       D     RW1,C6F32                                                  16670021
       L     R0,C6M14               XL4'80000000'                       16680021
         SRL   R0,DX0(RW1)           REMAINDER=MODULO 32                16690021
         SLL   RW2,DX2                                                  16700021
      L     R1,APNUTB                                                   16710021
      L     R15,ATABLE                                                  16720021
      BALR  RS1,R15                GET TABLE ADDR AND LENGTH            16730021
      STH   R2,PNXNUM                                                   16740021
      LR    RW3,R1         LOC OF PNUTBL                                16750021
         N     R0,DX0(RW3,RW2)       WORD IN PNUTBL                     16760021
       L     R1,APNTBL              GET A CELL (2 BYTES) IN PNTBL       16770021
       L     R15,AINSRT             (ADDR IN R2 ON RETURN)              16780021
       BC    ZERO,STZPNT           NOT USED                             16790021
       BALR  RS1,R15               BR TO INSERT RTN                     16800021
       LH    RW1,RPNCTR            STORE NEXT AVAILABLE RPN=            16810021
         LA    RW1,DX1(RW1)                                             16820021
         STH   RW1,DX0(R2)                                              16830021
       STH   RW1,RPNCTR                                                 16840021
       BC    UNCOND,UPPNU          BR TO INCREMENT PN NUMBER            16850021
STZPNT BALR  RS1,R15               BR TO INSERT RTN                     16860021
       SR    R0,R0                   STORE ZERO IN PNTBL                16870021
         STH   R0,DX0(R2)                                               16880021
UPPNU  DS    0H                                                         16890021
       LH    RW2,PNUCTR                                                 16900021
         LA    RW2,DX1(RW2)                                             16910021
       CH    RW2,PNCTR             NO OF ITEMS IN PNUTBL                16920021
       BC    LOW,GETPNU            MORE                                 16930021
         EJECT                                                          16940021
*      RELEASE PNUTBL, MAKE PNTBL STATIC, INITIALIZE GNTBL              16950021
*      NOTE- RPNCTR CONTAINS REL NUMBER PNS.                            16960021
       LA    R1,APNUTB                                                  16970021
       L     R15,ATABRL                                                 16980021
       BALR  RS1,R15               BR TO RELEASE TABLE                  16990021
       LA    R1,APNTBL        XSTATC WILL LOAD R1 WITH TIB ADDRESS      17000021
       L     R15,ASTATC                                                 17010021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              17020021
       LA    R1,AGNTBL                                                  17030021
       L     R15,AXPRIM                                                 17040021
       BALR  RS1,R15               BR TO PRIME TABLE                    17050021
       SPACE 2                                                          17060021
       SR    RW1,RW1                                                    17070021
       LH    RW2,GNCTR                                                  17080021
       LTR   RW2,RW2                                                    17090021
       BC    ZERO,STZGN2           NO GN'S                              17100021
STZGNT L     R1,AGNTBL                                                  17110021
       L     R15,AINSRT             INSERT ZEROS IN ENTIRE TABLE        17120021
       BALR  RS1,R15               BR TO INSERT RTN                     17130021
         STH   RW1,DX0(R2)                                              17140021
       BCT   RW2,STZGNT            MORE GN'S                            17150021
STZGN2 DS    0H                                                         17160021
       LA    R1,AGNTBL        XSTATC WILL LOAD R1 WITH TIB ADDRESS      17170021
       L     R15,ASTATC                                                 17180021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              17190021
       EJECT                                                            17200021
* PRFTWO                                                                17210021
*                                                                       17220021
*=1 PROCESS OPTIMIZATION A-TEXT                                         17230021
*=        (LTLDEF AND VIRDEF)                                           17240021
*                                                                       17250021
PRFTWO EQU   *                                                          17260021
*DEL                                                               4207 17270021
*DEL                                                               4207 17280021
*DEL                                                               4207 17290021
*DEL                                                               4207 17300021
*DEL                                                               4207 17310021
*DEL                                                               4207 17320021
*DEL                                                               4207 17330021
*DEL                                                               4207 17340021
         LH    RW1,VIRNUM          NO OF VIRTUALS * 2             42071 17350021
         SLL   RW1,DX1            ASSUME HALF VIRTS UNIQUE        42071 17360021
         STH   RW1,ACVNUM          MAX SIZE OF CVIRTB             42071 17370021
         MVI   ALVNUM+DX1,DX8        AND LVIRTB                   42071 17380021
*DEL                                                                    17390021
*DEL                                                                    17400021
*DEL                                                                    17410021
*DEL                                                                    17420021
*DEL                                                                    17430021
*DEL                                                                    17440021
*DEL                                                                    17450021
*DEL                                                                    17460021
*DEL                                                                    17470021
*DEL                                                                    17480021
*DEL                                                                    17490021
*DEL                                                                    17500021
*DEL                                                                    17510021
*DEL                                                                    17520021
*DEL                                                                    17530021
       LH    RW1,VIRCTR                                                 17540021
       A     RW1,LOCPGT                                                 17550021
       ST    RW1,LOCCTR       DISP OF VIRTS                             17560021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 17570021
         BC    EQ,REGPRM           NO, BRANCH                           17580021
       LA    R1,AVNPTY       YES, GET PRIME PARLIST                     17590021
       L     R15,AXPRIM                                                 17600021
       BALR  RS1,R15         PRIME  VNPTY TABLE                         17610021
REGPRM   DS    0H                                                 56154 17620021
*DEL                                                                    17630021
*DEL                                                                    17640021
*DEL                                                                    17650021
*DEL                                                                    17660021
*DEL                                                                    17670021
       LA    R1,ALTLTB                                                  17680021
       L     R15,AXPRIM            PRIME LTLTBL                         17690021
       BALR  RS1,R15               BR TO PRIME TABLE                    17700021
       LA    R1,AFILTB                                                  17710021
       L     R15,AXPRIM                                                 17720021
       BALR  RS1,R15         PRIME FILTBL                               17730021
       LA    R1,ACVIRT                                                  17740021
       L     R15,AXPRIM            PRIME CVIRTB                         17750021
       BALR  RS1,R15               BR TO PRIME TABLE                    17760021
       LA    R1,ALVIRT                                                  17770021
       L     R15,AXPRIM            PRIME LVIRTBL                        17780021
       BALR  RS1,R15               BR TO PRIME TABLE                    17790021
       LA    R1,AVIRPT                                                  17800021
       L     R15,AXPRIM            PRIME VIRPTR                         17810021
       BALR  RS1,R15               BR TO PRIME TABLE                    17820021
*   CONTBL AND CONDIS TABLES ARE LAST TO BE PRIMED SINCE          56154 17830021
*   THEIR SIZES MAY INCREASE AS OPT A-TEXT IS READ.               56154 17840021
         LA    R1,ACONTB                                          56154 17850021
         L     R15,AXPRIM                                         56154 17860021
         BALR  RS1,R15                 PRIME CONTBL TO 3K         56154 17870021
         LA    R1,ACONDS                                          56154 17880021
         L     R15,AXPRIM                                         56154 17890021
         BALR  RS1,R15                 PRIME CONDIS TO 3K         56154 17900021
         SR    R6,R6                                                    17910021
XXBEG    CH    R6,VIRNUM                                                17920021
         BNL   XXOUT                   BRANCH IF NOT LOW                17930021
         L     R1,AVIRPT                                                17940021
         L     R15,AINSRT                                               17950021
         BALR  RS1,R15                 BRANCH TO AINSRT                 17960021
         LA    R6,DX2(R6)                                               17970021
         B     XXBEG                   BRANCH UNCOND TO XXBEG           17980021
XXOUT    EQU   *                                                        17990021
       LA    F2REG,ASTOP           ENTER V(ILBOSTOP) INTO CVIRTBL       18000021
       B     VIRRTN                CONTINUE WITH PHASE6                 18010021
READF2 EQU   *                                                          18020021
         TM    PH1BYTE,F3TEXT        WAS THERE ANY OPT TXT WRITTEN7707  18030021
         BC    ZERO,F2EOF          NO, DO EOF PROCESSING NOW      7707  18040021
       BALR  R0,RB2                BR TO PH0                            18050021
       DC    X'03'                 READ OPT. A-TEXT                     18060021
       BC    ZERO,F2EOF       END OF FILE                               18070021
       LR    F2REG,R0                                                   18080021
F2NEXT   CLI   DX0(F2REG),NEWBLOCK GET ANOTHER BLOCK                    18090021
       BC    EQ,READF2        IF NEEDED                                 18100021
F2COD    CLI   DX0(F2REG),VIRDEF                                        18110021
       BC    EQ,VIRRTN   VIRTUAL ROUTINE                                18120021
         CLI   DX0(F2REG),LTLDEF                                        18130021
       BC    EQ,LTLRTN   LITERAL ROUTINE                                18140021
         CLI   DX0(F2REG),DISPLTDF                                      18150021
       BC    EQ,LTLDIS        DISPLAY LITERAL                           18160021
         MVC   C6WRK0(LX2),A6GNL    OR A6PNL                            18170021
       LH    RW1,C6WRK0                                                 18180021
         CLI   DX0(F2REG),GNDF                                          18190021
       BC    EQ,GNEQUR             BR TO GN EQUATE RTN                  18200021
         CLI   DX0(F2REG),VNDF     IS THIS A VNPTY TBL ELEMENT          18210021
       BC    EQ,F2VNPT             YES,CONSTRUCT VNPTY TBL              18220021
         CLI   DX0(F2REG),VIRDF                                         18230021
       BC    EQ,DCVIRT             VIRTUAL POINTER ELEMENT              18240021
         CLI   DX0(F2REG),PNDF           PN EQUATE                42071 18250021
         BC    EQ,PNEQUR           YES                            42071 18260021
         L     R15,AERR250         ADDRESS OF ERR250              42071 18270021
         BR    R15             BRANCH TO ERR250  RTN              42071 18280021
AERR250  DC    A(ERR250)           ADDRESS CON FOR ERR250         42071 18290021
VNPTYL EQU   3                    LENGTH OF VNPTY TBL ENTRY             18300021
VNPTYL4   EQU   4                                                       18310021
F2VNPT EQU   *                                                          18320021
         CLI   DX1(F2REG),INDEPSEG IS THIS A VN FOR INDEP SEGMENT       18330021
         BC    LO,F2VN05           NO, BRANCH                           18340021
       LH    RW1,INDVN            YES,GET CURRENT CT OF INDEP VN'S      18350021
         LA    RW1,DX1(RW1)        BUMP CTR                             18360021
       STH   RW1,INDVN                                                  18370021
F2VN05 EQU   *                                                          18380021
       L     R1,AVNPTY             GET TIB ADDRESS                      18390021
       L     R15,AINSRT           GET ADDR OF INSERT SUBRT              18400021
       BALR  RS1,R15               UPON RETURN R2=ADDR OF AVAIL SLO     18410021
         MVC   DX0(VNPTYL,R2),DX1(F2REG) INSERT ENTRY INTO VNPTY TBL    18420021
         LA    F2REG,VNPTYL4(F2REG) POINT TO NEXT OPT A-TXT ELT         18430021
       B     F2NEXT                GET NEXT ELEMENT                     18440021
F2EOF  EQU   *                                                          18450021
       TM    PHZSW1,XREF           IS XREF REQUESTED                    18460021
         BC    EQ,F2SEG            NO, BRANCH                           18470021
       BALR  R0,RB2                BR TO PH0                            18480021
*                                                                       18490021
       DC    X'63'                 REWIND UT3 FOR REF ELMNTS            18500021
       DC    X'00'                 INDICATE-READ WAS LAST ON UT3        18510021
F2SEG    CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 18520021
         BC    EQ,ENOPAT           NO, BRANCH                           18530021
*                                                                       18540021
*     SORT VNPTY TBL BY PTY #                                           18550021
*                                                                       18560021
       L     R1,AVNPTY             GET TIB ADDRESS                      18570021
         LA    R1,DX0(R1)                                               18580021
       CR    R1,RB2                HAS VNPTY TBL BEEN PRIME'ED          18590021
       BC    LOW,ENOPAT            NO,BR                                18600021
       L     R15,ADSTAT            GET STATIC RTN ADDRESS               18610021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              18620021
       L     R1,AVNPTY             GET TIB ADDRESS                      18630021
       L     R15,ATABLE            GET STARTING ADDR OF VNPTY IN R1     18640021
       BALR  RS1,R15               AND SIZE IN R2                       18650021
       LTR   R2,R2                 ANY ENTRIES IN VNPTY TBL             18660021
         BC    ZERO,ENOPAT         NO, BRANCH                           18670021
       LR    RW1,R1                YES,GET STARTING ADDR                18680021
         LA    RW3,DX0(R1,R2)       END+1                               18690021
F2VN10 LA    RW2,VNPTYL(RW1)       NEXT ENTRY ADDR                      18700021
       CR    RW1,RW3               ALL DONE                             18710021
       BC    NOTLO,ENOPAT         YES,BR                                18720021
F2VN15 CR    RW2,RW3               IS PRESENT PASS FINISHED             18730021
       BC    LO,F2VN20             NO,BR                                18740021
       LA    RW1,VNPTYL(RW1)       YES,START NEXT PASS                  18750021
       B     F2VN10                START NEXT PASS                      18760021
F2VN20   CLC   DX0(LX1,RW1),DX0(RW2) ARE ENTRIES ORDERED                18770021
       BC    NOTHI,F2VN25          YES,BR                               18780021
         MVC   VNHOLD(VNPTYL),DX0(RW1) NO,MOVE HI TO SAVE AREA          18790021
         MVC   DX0(VNPTYL,RW1),DX0(RW2) SWAP HI AND LO                  18800021
         MVC   DX0(VNPTYL,RW2),VNHOLD GET HI FROM SAVE AREA             18810021
F2VN25 LA    RW2,VNPTYL(RW2)       BUMP POINTER                         18820021
       B     F2VN15                CHECK PASS STATUS                    18830021
       BC    UNCOND,ENOPAT         CONTINUE WITH PH6                    18840021
       SPACE 2                                                          18850021
*      SET UP FOR NEXT RECORD ON F2                                     18860021
PROCFL SR    RW1,RW1                                                    18870021
       IC    RW1,LTLLNG(F2REG)     LENGTH OF LITERAL                    18880021
         LA    RW1,DX3(RW1)         FIRST THREE BYTES                   18890021
F2INC  AR    F2REG,RW1             ADD OLD VALUE                        18900021
       BC    UNCOND,F2NEXT         READ NEXT ELEMENT                    18910021
PROCFV   LA    RW1,DX12             12 BYTE VIRDEF                      18920021
       BC    UNCOND,F2INC          POINT TO NEXT ELEMENT                18930021
       DS    0F               ALIGN                                     18940021
ACONTB DC    X'00'            VARIABLE-LENGTH ENTRIES                   18950021
       DC    AL3(CONTBL)      IN CONTBL                                 18960021
CONNUM   DC    X'0C00'       PRIME TO 3K                          56154 18970021
       DC    H'0'                                                       18980021
       DS    0F                                                         18990021
ACONDS DC    X'00'            VARIABLE-LENGTH ENTRIES                   19000021
       DC    AL3(CONDIS)                                                19010021
CONNU2   DC    X'0C00'       PRIME TO 3K                          56154 19020021
       DC    H'0'                                                       19030021
ASTOP  DC    H'0'                                                       19040021
       DC    H'1'                                                       19050021
       DC    CL8'ILBOSTP0'                                              19060021
       DC    X'FF'                                                      19070021
       EJECT                                                            19080021
* LTLDIS + LTLRTN                                                       19090021
*=2    PROCESS LITERAL DEFINITION SO THAT ADDRESS OF                    19100021
*=  A LITERAL CAN BE FOUND BY REFERENCING                               19110021
*=  TAMER TABLE 'LTLTBL'                                                19120021
*                                                                       19130021
LTLDIS DS    0H                                                         19140021
         OI    LTLDSW,LTLDISPL     DISPLAY TYPE                         19150021
       L     R1,ACONDS                                                  19160021
         BC    UNCOND,LTLR05       GET TABLE STARTING POINT             19170021
LTLRTN EQU   *                                                          19180021
         NI    LTLDSW,LTLNODSP     NOT DISPLAY TYPE                     19190021
       L     R1,ACONTB                                                  19200021
LTLR05 L     R15,ATABLE                                                 19210021
       BALR  RS1,R15               GET LITERAL TABLE ADDR AND SZ        19220021
       ST    R1,LSTART                                                  19230021
       AR    R1,R2                                                      19240021
       ST    R1,LEND                                                    19250021
         LA    RW3,ONEBYTE         BOUNDARY                             19260021
         TM    LTLBND(F2REG),FOUR8ORC  ANY ALIGNMENT                    19270021
       BC    ZERO,BOUND            NO                                   19280021
       BC    NOTONE,LTLR25         YES, FULL OR HALFWORD                19290021
         LA    RW3,DW8BYTES        DOUBLE-WORD                          19300021
         BC    UNCOND,BOUND        NOW HAVE DW BOUNDARY                 19310021
LTLR25   LA    RW3,TWOBYTE                                              19320021
         TM    LTLBND(F2REG),HALFWRD  HALF-WORD                         19330021
       BC    ZERO,BOUND            YES                                  19340021
         LA    RW3,FOURBYTE                                             19350021
BOUND  STH   RW3,BDINCR       SAVE INCREMENT                            19360021
       L     RW1,LSTART                                                 19370021
OKBOUN C     RW1,LEND         STILL IN TABLE                            19380021
       BC    NOTLO,NOMTCH     NO                                        19390021
       SR    RW3,RW3          MATCH COUNT ZERO                          19400021
       IC    RW3,LTLLNG(F2REG)     SET TO SIZE OF LITERAL               19410021
       LR    RW2,RW1                                                    19420021
       S     RW2,LSTART                                                 19430021
       STH   RW2,LMATCH       DISP OF MATCH LOCATION                    19440021
       LR    RW2,RW1         DISPLACEMENT AND START ADDR                19450021
       AR    RW2,RW3                                                    19460021
       C     RW2,LEND         ENOUGH ROOM IN TABLE                      19470021
       BC    NOTHI,COMP10          YES                                  19480021
       S     RW2,LEND         NO                                        19490021
       SR    RW3,RW2          USE REMAINDER                             19500021
COMP10 BCTR  RW3,R0                 DECREMENT FOR EXECUTE               19510021
       LA    RW2,LTLCON(F2REG)                                          19520021
       EX    RW3,COMPNX            COMPARE                              19530021
       BC    NOTEQ,CMUNEQ     NOT A MATCH                               19540021
         LA    RW3,DX1(RW3)    UP MATCH COUNT                           19550021
       SR    R0,R0                                                      19560021
       IC    R0,LTLLNG(F2REG)       GET LENGTH                          19570021
       CLR   R0,RW3                 ALL COMPARE                         19580021
       BC    EQ,SETDIS             YES, OUT                             19590021
       AR    RW2,RW3          UP INPUT LOC                              19600021
       BC    UNCOND,CALCL2         NO, EXPAND TABLE                     19610021
CMUNEQ AH    RW1,BDINCR            POSITION TO NEXT BYTE ON             19620021
       BC    UNCOND,OKBOUN    PROPER BOUNDARY                           19630021
CALCLN SR    R0,R0              END OF TABLE                            19640021
       IC    R0,LTLLNG(F2REG)  LENGTH                                   19650021
CALCL2 SR    R0,RW3                 MINUS MATCHES                       19660021
       STH   R0,LTLINC         SAVE                                     19670021
       L     R1,ACONTB                                                  19680021
         TM    LTLDSW,LTLDISPL     DISPLAY TYPE                         19690021
       BC    ZERO,CALCL3           NO, BR TO GET TABLE SPACE            19700021
       L     R1,ACONDS         DISPLAY TYPE                             19710021
CALCL3 L     R15,AINSRT                                                 19720021
       BALR  RS1,R15            GET TABLE SPACE                         19730021
       LH    RW3,LTLINC                                                 19740021
       BCTR  RW3,R0                LENGTH - 1                           19750021
       EX    RW3,STRINS       MOVE DATA                                 19760021
SETDIS LH    RW3,LMATCH                                                 19770021
       N     RW3,C15BIT                                                 19780021
       L     R1,ALTLTB                                                  19790021
       L     R15,AINSRT        CALL INSERT TO                           19800021
       BALR  RS1,R15            GET TABLE SPACE                         19810021
         STH   RW3,DX0(R2)      STORE POINTER                           19820021
         TM    LTLDSW,LTLDISPL     DISPLAY TYPE                         19830021
       BC    ZERO,PROCFL           NO, BACK TO READ F2                  19840021
         OI    DX0(R2),HION        HIGH-ORDER BIT ON IF DISPLAY         19850021
         BC    UNCOND,PROCFL       BACK TO READ F2                      19860021
NOMTCH S     RW1,LSTART                                                 19870021
       STH   RW1,LMATCH                                                 19880021
       L     R1,ACONTB                                                  19890021
         TM    LTLDSW,LTLDISPL     DISPLAY TYPE                         19900021
       BC    ZERO,NOMT02           NO, USE CONTBL ADDRESS               19910021
       L     R1,ACONDS                                                  19920021
NOMT02 L     R15,ATABLE                                                 19930021
*                                                                       19940021
       LR    RW2,R1            SAVE TIB ADDRESS FOR INSERT              19950021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              19960021
       SR    RW1,R2                                                     19970021
       LTR   R0,RW1            SLACK BYTES                              19980021
       BC    ZERO,NOMT04           NO SLACK BYTES                       19990021
       L     R15,AINSRT        GET TABLE SPACE                          20000021
       LR    R1,RW2            RESTORE TIB ADDRESS                      20010021
       BALR  RS1,R15               GET TABLE SPACE                      20020021
       LR    RW3,R0                                                     20030021
       BCTR  RW3,R0                LENGTH - 1                           20040021
       LA    RW2,ZERO7X                                                 20050021
       EX    RW3,STRINS                                                 20060021
NOMT04 LA    RW2,LTLCON(F2REG)                                          20070021
       SR    RW3,RW3                                                    20080021
       BC    UNCOND,CALCLN         NEXT ENTRY                           20090021
COMPNX   CLC   DX0(LX1,RW1),DX0(RW2)                                    20100021
STRINS   MVC   DX0(LX1,R2),DX0(RW2)                                     20110021
       EJECT                                                            20120021
*VIRRTN                                                                 20130021
*=2    PROCESS VIRTUAL DEFINITION                                       20140021
*=         FOUND ON F2                                                  20150021
*                                                                       20160021
VIRRTN DS    0H                                                         20170021
         NI    VRCSW,VRCLNK        LINK TYPE                            20180021
       L     R1,ALVIRT                                                  20190021
         TM    VIRTYP(F2REG),ALLON                                      20200021
       BC    NOTZER,VIRTAB    LINK TYPE                                 20210021
         OI    VRCSW,VRCCALL       CALL TYPE                            20220021
       L     R1,ACVIRT         CALL TYPE                                20230021
VIRTAB L     R15,ATABLE                                                 20240021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              20250021
       ST    R1,LSTART                                                  20260021
       AR    R1,R2                                                      20270021
       ST    R1,LEND                                                    20280021
       L     RW2,LSTART                                                 20290021
VRUNEQ S     RW2,LSTART                                                 20300021
       N     RW2,C15BIT                                                 20310021
       STH   RW2,LMATCH       DISP OF COMPARE LOC                       20320021
       A     RW2,LSTART                                                 20330021
       C     RW2,LEND                                                   20340021
       BC    NOTLO,VRTNOT     NOT IN TABLE                              20350021
         CLC   DX0(LX8,RW2),VIRBCD(F2REG)                               20360021
       BC    EQ,VRFOUN        MATCH                                     20370021
         LA    RW2,DX8(RW2)     NEXT ENTRY                              20380021
       BC    UNCOND,VRUNEQ         LOOP FOR NEXT ENTRY                  20390021
VRTNOT LH    RW1,VIRCTR                                                 20400021
         LA    RW1,DX4(RW1)                                             20410021
       L     R1,ACVIRT                                                  20420021
         TM    VIRTYP(F2REG),ALLON                                      20430021
       BC    ZERO,VRBCDX           NO, NOT END OF BLOCK                 20440021
         LA    RW1,DX4(RW1)                                             20450021
       L     R1,ALVIRT                                                  20460021
VRBCDX STH   RW1,VIRCTR                                                 20470021
       L     R15,AINSRT                                                 20480021
       BALR  RS1,R15               BR TO INSERT RTN                     20490021
         MVC   DX0(LX8,R2),VIRBCD(F2REG) STORE BCD                      20500021
VRFOUN L     R1,AVIRPT                                                  20510021
         L     R15,ATABLE                                               20520021
       BALR  RS1,R15               BR TO INSERT RTN                     20530021
         MVC   C6WRK0(LX2),VIRNBR(F2REG)    GET VIR NUM                 20540021
         LH    R2,C6WRK0                                                20550021
         BCTR  R2,R0              SUBTRACT  1                           20560021
         SLL   R2,DX1                  DEVELOP INDEX                    20570021
         AR    R2,R1                   POINT TO CORRECT ENTRY           20580021
       LH    RW1,LMATCH                                                 20590021
       N     RW1,C15BIT                                                 20600021
         STH   RW1,DX0(R2)      DISPLACEMENT IN TABLE (BITS 1-15)       20610021
         OC    DX0(LX1,R2),VRCSW BIT 0 ON IF CALL TYPE                  20620021
       BC    UNCOND,PROCFV    GET NEXT F2 ELEMENT                       20630021
         EJECT                                                          20640021
*  VIRTUAL POINTER ROUTINE                                              20650021
*  PROCESS VIRTUAL CONNECTED TO DCB                                     20660021
*                                                                       20670021
DCVIRT EQU   *                                                          20680021
         NI    DX0(F2REG),INITOFF  CLEAR HIGH-ORDER BYTE                20690021
       L     R1,AFILTB                                                  20700021
       L     R15,AINSRT       CALL TO INSERT                            20710021
       BALR  RS1,R15               BR TO INSERT RTN                     20720021
         MVC   DX0(LX8,R2),DX4(F2REG) STORE ELEMENT WITH NAME FIRST     20730021
         MVC   DX8(LX4,R2),DX0(F2REG)                                   20740021
       BC    UNCOND,PROCFV    GET NEXT F2 ELEMENT                       20750021
       EJECT                                                            20760021
*=1    PROCESS GN EQUATE STRINGS                                        20770021
*      FORMAT //08 NN LLLL RRRR RRRR ...//                              20780021
*                                                                       20790021
*             LLLL GN= TO WHICH OTHERS ARE TO BE EQUATED                20800021
*             RRRR GN=S WHICH ARE TO BE EQUATED TO LLLL                 20810021
*             NN   NUMBER OF GN='S IN STRING                            20820021
*                                                                       20830021
GNEQUR DS    0H                                                         20840021
       AH    RW1,RPNCTR            KEEP COUNT OF GN'S FROM END OF P     20850021
GNE020 SR    RW2,RW2                                                    20860021
       IC    RW2,A6GNCT                                                 20870021
       BCTR  RW2,R0                 NO OF RR GN'S                       20880021
       ST    F2REG,DCSAVI     SAVE POINTER TO INPUT RECORD              20890021
GNE040 L     R1,AGNTBL                                                  20900021
       L     R15,ATABLE                                                 20910021
       BALR  RS1,R15            TABLE ADDRESS IN R1                     20920021
         MVC   C6WRK0(LX2),A6GNR                                        20930021
       LH    RW3,C6WRK0                                                 20940021
       BCTR  RW3,R0                SUBTRACT 1                           20950021
         SLL   RW3,DX1              PROPER LOC IN GNTBL                 20960021
         STH   RW1,DX0(RW3,R1)       STORE RGN NUMBER                   20970021
         LA    F2REG,DX2(F2REG) POINT TO NEXT RRRR                      20980021
       BCT   RW2,GNE040            ANY MORE RR'S                        20990021
       L     F2REG,DCSAVI     RESTORE INPUT POINTER                     21000021
       IC    RW2,A6GNCT            LENGTH OF STRING                     21010021
         LA    RW1,DX2(RW2,RW2)                                         21020021
       BC    UNCOND,F2INC          GO GET NEXT F2 ELEMENT               21030021
       SPACE 5                                                          21040021
*=1    PROCESS PN EQUATE STRINGS                                        21050021
*      FORMAT //0C NN PPPP RRRR RRRR ...//                              21060021
*                                                                       21070021
*             PPPP IS PN= TO WHICH RR'S ARE TO BE EQUATED               21080021
*             RRRR IS A GN=                                             21090021
*             NN   IS NO OF ITEMS FOLLOWING                             21100021
*                                                                       21110021
*      GET RPN= OF PN GIVEN AND INSERT INTO PROPER LOCATION IN GNTB     21120021
*                                                                       21130021
PNEQUR DS    0H                                                         21140021
       BCTR  RW1,R0                POINT TO PROPER LOCATION             21150021
         SLL   RW1,DX1                                                  21160021
       L     R1,APNTBL                                                  21170021
       L     R15,ATABLE                                                 21180021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              21190021
         LH    RW1,DX0(RW1,R1)                                          21200021
       BC    UNCOND,GNE020         REL PN= TO BE PUT INTO GNTBL         21210021
       EJECT                                                            21220021
* ENOPAT                                                                21230021
*=1       END OF OPTIMIZATION A-TEXT                                    21240021
*=     RESOLVE GNTBL SO KNOW NUM GN'S                                   21250021
ENOPAT DS    0H                                                         21260021
       MVC   RGNCTR,RPNCTR         SAVE HI-COUNT OF USED PN'S           21270021
       SR    RW1,RW1                                                    21280021
       L     R1,AGNTBL                                                  21290021
         LA    R1,DX0(R1)                                               21300021
       C     R1,COSADR                                                  21310021
       BC    NOTHI,ENO090      NO GN'S                                  21320021
       L     R15,ATABLE                                                 21330021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              21340021
ENO020   SLL   RW1,DX1                                                  21350021
         LH    RW3,DX0(R1,RW1)  GET ITEM IN GNTBL                       21360021
       LTR   RW3,RW3                                                    21370021
       BC    NOTZER,ENO060         BRANCH IF EQUATED TO SOMETHING       21380021
       LH    RW3,RPNCTR            ZERO=NOT EQUATED,USE RELPN CTR       21390021
         LA    RW3,DX1(RW3)                                             21400021
         STH   RW3,DX0(R1,RW1)                                          21410021
       STH   RW3,RPNCTR                                                 21420021
       BC    UNCOND,ENO080         ANY MORE ITEMS IN GNTBL              21430021
ENO060 CH    RW3,RGNCTR                                                 21440021
       BC    NOTHI,ENO080          EQUATED TO PN, DONT CHANGE           21450021
       SH    RW3,RGNCTR                                                 21460021
       BCTR  RW3,R0                 EQUATED TO GN,GET RESOLVED VALU     21470021
         SLL   RW3,DX1              FROM CORRESPONDING CELL IN GNTBL    21480021
         LH    RW3,DX0(R1,RW3)  AND INSERT HERE                         21490021
         STH   RW3,DX0(R1,RW1)                                          21500021
ENO080   LA    RW1,DX2(RW1)         UP POINTER TO GNTBL                 21510021
         SRL   RW1,DX1                                                  21520021
       CH    RW1,GNCTR             END OF GNTBL                         21530021
       BC    LOW,ENO020            BR IF MORE ITEMS IN GNTBL            21540021
       SPACE 5                                                          21550021
* CALCULATE LENGTH OF PGT                                               21560021
ENO090 DS    0H                                                         21570021
       LA    R15,M4ADD                                                  21580021
       LH    RW1,VIRCTR            LENGTH OF VIRTUALS                   21590021
       LH    RW2,RGNCTR        NUMBER OF PN CELLS                       21600021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          21610021
       LH    RW2,RPNCTR                                                 21620021
       SH    RW2,RGNCTR                                                 21630021
       STH   RW2,GNCTR             SAVE                                 21640021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          21650021
       LH    RW2,DCBCTR                                                 21660021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          21670021
PGT02  DS    0H                                                         21680021
       LH    RW2,VNCTR                                                  21690021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          21700021
       STH   RW2,VNCTR        SAVE NUMBER OF BYTES                      21710021
       L     R1,ACONTB                                                  21720021
       L     R15,ATABLE                                                 21730021
       BALR  RS1,R15               BR TO MULTIPLY BY 4 AND ADD          21740021
* CALCULATE NUMBER OF OVERFLOW CELLS NEEDED                             21750021
       SR    RW2,RW2                                                    21760021
       LR    RW3,RW1                                                    21770021
       AR    RW3,R2                                                     21780021
PGT03  C     RW3,C6M6         F'4095'                                   21790021
       BC    NOTHI,PGT04           NO OVERFLOW CELLS                    21800021
       SH    RW3,CH4092                                                 21810021
         LA    RW2,DX1(RW2)                                             21820021
         BC    UNCOND,PGT03        ANY MORE OVFL CELLS                  21830021
PGT04  STH   RW2,PGTOV                                                  21840021
         STH   RW2,OVFCTR          SAVE OVFLCTR FOR SEG                 21850021
       BAL   RS1,M4ADD             BR TO MULTIPLY BY 4 AND ADD          21860021
       BAL   RS1,ROUND8        LOC OF DISPLAY LITERALS                  21870021
       AR    RW1,R2                                                     21880021
       L     R1,ACONDS                                                  21890021
       L     R15,ATABLE                                                 21900021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              21910021
       AR    RW1,R2            ADD LENGTH OF DISPLAY LITERALS           21920021
       BAL   RS1,ROUND2            BR TO ROUND TO HALFWORD BOUND        21930021
       A     RW1,LOCPGT                                                 21940021
       ST    RW1,LOCPGM       START OF PROCEDURE                        21950021
* PUNCH NECESSARY OVERFLOW CELLS                                        21960021
       LA    INPUTR,PGT400         GET IN-LINE SRTN RET ADDR            21970021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 21980021
       BC    NOTEQ,PGT400          YES,PUNCH OVFL CELLS LATER           21990021
PGT40  DS    0H                    ENTERED FROM SEGM CODE TO PUNCH      22000021
         LH    RW2,OVFCTR        GET OVFL CTR FOR SEG                   22010021
       L     RW1,LOCPGT                                                 22020021
       ST    RW1,LOCCTR                                                 22030021
         BC    UNCOND,PGT042       BR TO CHECK OVFL CELL COUNT          22040021
PGT041 AH    RW1,H4096                                                  22050021
       ST    RW1,NXADDR       CONTENTS OF OVERFLOW CELL                 22060021
         LA    R0,FOURBYTE                                              22070021
       LA    R1,NXADDR                                                  22080021
       L     R15,ATXPNH                                                 22090021
       BALR  RS1,R15            PUNCH TEXT                              22100021
       BCTR  RW2,R0                SUBTRACT 1                           22110021
PGT042 LTR   RW2,RW2          MORE OVERFLOW CELLS                       22120021
       BC    NOTZER,PGT041    YES                                       22130021
       BR    INPUTR                BR TO NEXT INSTR,OR RET TO SEG C     22140021
PGT400 DS    0H                                                         22150021
       SR    RW3,RW3                                                    22160021
       LH    RW2,PGTOV                                                  22170021
       STH   RW3,PGTOV                                                  22180021
         SLL   RW2,DX2                                                  22190021
       AR    RW3,RW2                                                    22200021
       LH    RW2,VIRCTR                                                 22210021
       STH   RW3,VIRCTR                                                 22220021
       AR    RW3,RW2                                                    22230021
       LH    RW2,RGNCTR                                                 22240021
       STH   RW3,PNCTR                                                  22250021
         SLL   RW2,DX2                                                  22260021
       AR    RW3,RW2                                                    22270021
       LH    RW2,GNCTR                                                  22280021
       STH   RW3,GNCTR                                                  22290021
         SLL   RW2,DX2                                                  22300021
       AR    RW3,RW2                                                    22310021
       LH    RW2,DCBCTR                                                 22320021
       STH   RW3,DCBCTR                                                 22330021
         SLL   RW2,DX2                                                  22340021
PGTIN1 DS    0H                                                         22350021
       AR    RW3,RW2                                                    22360021
         LH    RW2,VNCTR           NO VNS                               22370021
         STH   RW3,VNILOC          DISP OF VNS                          22380021
         LA    RW1,DX0(RW2,RW3)                                         22390021
       BAL   RS1,ROUND8            BR TO ROUND TO DW BOUNDARY           22400021
       STH   RW1,LTLCTR                                                 22410021
ENO100 DS    0H                                                         22420021
*=        FINISH UP LITERALS AND VIRTUALS                               22430021
*  GET LENGTH OF ALVIRT                                                 22440021
       L     R1,ALVIRT             GET PARAM LIST ADDRESS               22450021
       L     R15,ATABLE                                                 22460021
       BALR  RS1,R15               GET LENGTH OF LINK VIRTUALS          22470021
       STH   R2,LNGLNK             SAVE FOR SEGMENTATION                22480021
       LA    INPUTR,SETLTL1                                             22490021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 22500021
       BC    NOTEQ,SETLTL          YES,PUNCH LATER                      22510021
PNVIRT DS    0H                    ENTERED FROM SEGM CODE               22520021
       L     R1,ALVIRT                                                  22530021
       L     R15,ATABLE                                                 22540021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              22550021
       STH   R2,LNGLNK                                                  22560021
*  PUNCH TEXT FOR LINK VIRTUALS                                         22570021
STV030 L     RW1,LOCPGT                                                 22580021
       AH    RW1,VIRCTR                                                 22590021
       ST    RW1,LOCCTR                                                 22600021
       LTR   R0,R2                                                      22610021
         BC    ZERO,STV035         BR, NO LINK VIRTUALS                 22620021
       L     R15,ATXPNH                                                 22630021
       BALR  RS1,R15               PUNCH TEXT                           22640021
* PUNCH ESD'S, TEXT AND RLD'S FOR VIRTUALS IN FILTBL AND CVIRT          22650021
STV035 EQU   *                                                          22660021
       L     R1,LOCCTR                                                  22670021
       ST    R1,LOCSAV        SAVE LOCCTR                               22680021
         OI    DCBSW,DCBFLTB       SET SW FOR FILTBL PROCESSING         22690021
       L     R1,AFILTB                                                  22700021
       L     R15,ATABLE                                                 22710021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              22720021
STV036 EQU   *                                                          22730021
       LR    RW3,R1           TABLE START                               22740021
         LA    RW1,DX0(R1,R2)  TABLE END                                22750021
STV040 CR    RW3,RW1          IN TABLE?                                 22760021
       BC    NOTLO,STV050     NO - GO TO CHECK IF THROUGH WITH ESD'     22770021
         TM    DCBSW,DCBFLTB       ARE WE PROCESSING FILTBL             22780021
       BC    NOTONE,STV041    NO - SET UP FOR ESD'S                     22790021
         L     R1,DX8(RW3)     YES, SET UP LOCCTR                       22800021
       ST    R1,LOCCTR                                                  22810021
STV041 LR    R1,RW3           BCD  LOCATION                             22820021
       LH    RW2,ESDID                                                  22830021
         LA    RW2,DX1(RW2)    UP ESD NUMBER                            22840021
       STH   RW2,ESDID                                                  22850021
         LA    R0,ESDTYP2          ER TYPE                              22860021
       L     R15,AESD                                                   22870021
       BALR  RS1,R15               PUNCH ESD                            22880021
       LA    R1,ZERO7X         ZERO TEXT                                22890021
         LA    R0,FOURBYTE                                              22900021
       L     RW2,LOCCTR       SAVE FOR RLD                              22910021
       L     R15,ATXPNH                                                 22920021
       BALR  RS1,R15            PUNCH 4 BYTES OF ZEROES                 22930021
       LR    R1,RW2                                                     22940021
         LA    R0,DX28          FLAG BYTE                               22950021
*  IF SPECIAL NAME, MAKE NON-BRANCH TYPE                                22960021
         CLC   DX0(LX4,RW3),VTRTBL                                      22970021
       BC    NOTEQ,STV060          NOT A TABLE SUBRTN                   22980021
         LA    R2,SIXSUFFX                                              22990021
       LA    RW2,VTRTBL                                                 23000021
STV055   CLC   DX4(LX4,RW3),DX4(RW2) DOES SUFFIX MATCH                  23010021
       BC    EQ,STV056             YES                                  23020021
         LA    RW2,DX4(RW2)                                             23030021
       BCT   R2,STV055             BR TO CHECK SUFFIXES                 23040021
         BC    UNCOND,STV060       NO MATCH, OUT OF TABLE               23050021
STV056 N     R0,C6M2                                                    23060021
STV060 L     R15,ARLD                                                   23070021
       BALR  RS1,R15               PUNCH RLD CARD                       23080021
         LA    RW3,DX8(RW3)    NEXT BCD LOCATION FOR CVIRT              23090021
         TM    DCBSW,DCBFLTB       ARE WE PROCESSING FILTBL             23100021
       BC    NOTONE,STV045         NOT FILTBL PROCESS, PUNCH RLD        23110021
         LA    RW3,DX4(RW3)    NEXT BCD LOCATION FOR FILTBL             23120021
STV045 BC    UNCOND,STV040         ANY MORE ENTRIES IN TABLE            23130021
STV050 EQU   *                                                          23140021
         TM    DCBSW,DCBFLTB       ARE WE PROCESSING FILTBL             23150021
       BC    NOTONE,SETLTL    END OF ESD/RLD PUNCHING                   23160021
         NI    DCBSW,INITOFF       END PROCESSING FILTBL-SW OFF         23170021
       L     R1,LOCSAV                                                  23180021
       ST    R1,LOCCTR        RESTORE LOCCTR                            23190021
       L     R1,ACVIRT        PROCESS CVIRT                             23200021
       L     R15,ATABLE                                                 23210021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              23220021
       BC    UNCOND,STV036         GO PROCESS CVIRTB                    23230021
* SET LITERAL POINTERS TO PROPER DISPLACEMENTS                          23240021
SETLTL BR    INPUTR                BR TO NEXT INSTR OR RET TO SEG C     23250021
SETLTL1  L     R1,ACONTB                                                23260021
       L     R15,ATABLE                                                 23270021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              23280021
       STH   R2,DLTLCT                                                  23290021
       L     R1,ALTLTB                                                  23300021
       L     R15,ATABLE                                                 23310021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              23320021
       LR    RW3,R1            START                                    23330021
         LA    RW1,DX0(R1,R2)    END + 1                                23340021
ENCOMP CLR   RW3,RW1                                                    23350021
       BC    NOTLO,LTLPNC          NO MORE ELEMENTS IN TABLE            23360021
         LH    RW2,DX0(RW3)                                             23370021
       N     RW2,C15BIT                                                 23380021
       AH    RW2,LTLCTR       ADD                                       23390021
         TM    DX0(RW3),HION       IF HIGH-ORDER ON ITS DISPLAY         23400021
       BC    ZERO,ENCOM2           BR NOT DISPLAY LITERAL               23410021
       AH    RW2,DLTLCT       DISPLAY TYPE                              23420021
ENCOM2 DS    0H                                                         23430021
         STH   RW2,DX0(RW3)                                             23440021
         LA    RW3,DX2(RW3)    NEXT PTR                                 23450021
       BC    UNCOND,ENCOMP         CHECK ELEMENTS IN TABLE              23460021
LTLPNC EQU   *                                                          23470021
         LA    INPUTR,STATABC  RET ADDR FOR IN-LINE SUBRTN              23480021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 23490021
         BC    NOTEQ,STATAB    YES,PUNCH LIT LATER(ROOT SEG)            23500021
PNLIT  DS    0H                    ENTERED FROM SEGMENTATION CODE       23510021
       L     RW1,LOCPGT                                                 23520021
       AH    RW1,LTLCTR                                                 23530021
       ST    RW1,LOCCTR                                                 23540021
       ST    RW1,LDMLOC                                                 23550021
       L     R1,ACONTB                                                  23560021
       L     R15,ATABLE                                                 23570021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              23580021
       LTR   R0,R2                                                      23590021
       BC    ZERO,LTLPN2           LENGTH IS ZERO                       23600021
       ST    R1,LDMVAL                                                  23610021
       STH   R0,LDMLEN                                                  23620021
       L     R15,ATXPNH                                                 23630021
       BALR  RS1,R15           PUNCH CONTBL                             23640021
       SR    R1,R1              FIRST TYPE LITERAL POOL DUMP            23650021
       L     R15,ALTDMP                                                 23660021
       BALR  RS1,R15               GO DUMP LITERAL POOL                 23670021
LTLPN2 L     R1,ACONDS                                                  23680021
       L     R15,ATABLE                                                 23690021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              23700021
       LTR   R0,R2                                                      23710021
       BC    ZERO,LTLREL           GO RELEASE TABLES                    23720021
       ST    R1,LDMVAL                                                  23730021
       STH   R0,LDMLEN                                                  23740021
       L     RW2,LOCCTR       DISPLAY                                   23750021
       ST    RW2,LDMLOC                                                 23760021
       L     R15,ATXPNH                                                 23770021
       BALR  RS1,R15               PUNCH TEXT                           23780021
         LA    R1,DX1           SECOND TYPE LITERAL POOL DUMP           23790021
       L     R15,ALTDMP                                                 23800021
         BALR  RS1,R15            GO DUMP POOL                          23810021
LTLREL DS    0H                                                         23820021
* RELEASE CONTBL CONDIS + FILTBL                                        23830021
         LA    R1,ACONTB          XTABRL WILL LOAD R1 WITH              23840021
         L     R15,ATABRL         TIB ADDRESS                           23850021
         BALR  RS1,R15            GO RELEASE                            23860021
         LA    R1,ACONDS          XTABRL WILL LOAD R1 WITH              23870021
         L     R15,ATABRL         TIB ADDRESS                           23880021
         BALR  RS1,R15            GO RELEASE                            23890021
         LA    R1,AFILTB          XTABRL WILL LOAD R1 WITH              23900021
         L     R15,ATABRL         TIB ADDRESS                           23910021
       BALR  RS1,R15               GO RELEASE TABLE                     23920021
         MVI   OU6CDN,BLANK        BLANK CARD NO FIELD FOR TRACE        23930021
         MVC   OU6CDN+NX1(LX4),OU6CDN                                   23940021
STATAB   DS    0H                                                       23950021
         BR    INPUTR        BR TO NEXT INSTR OR RET TO SEG C           23960021
STATABC  DS    0H                                                       23970021
* MAKE LTLTBL, VIRPTR, CVIRTB + LVIRTB STATIC                           23980021
         LA    R1,ALTLTB     XSTATC WILL LOAD R1 WITH TIB ADDRESS       23990021
       L     R15,ASTATC                                                 24000021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              24010021
       LA    R1,AVIRPT        XSTATC WILL LOAD R1 WITH TIB ADDRESS      24020021
       L     R15,ASTATC                                                 24030021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              24040021
       LA    R1,ACVIRT        XSTATC WILL LOAD R1 WITH TIB ADDRESS      24050021
       L     R15,ASTATC                                                 24060021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              24070021
       LA    R1,ALVIRT        XSTATC WILL LOAD R1 WITH TIB ADDRESS      24080021
       L     R15,ASTATC                                                 24090021
       BALR  RS1,R15               BR TO MAKE TABLE STATIC              24100021
*=1    PUT PGT INTO MEMORY MAP                                          24110021
*                                                                       24120021
PRPGT  DS    0H                                                         24130021
       L     R15,APUT                                                   24140021
       BALR  RS1,R15               PRINT BLANK LINE                     24150021
       BALR  RS1,R15               PRINT BLANK LINE                     24160021
       L     RW1,LOCPGT                                                 24170021
       ST    RW1,GTLOC                                                  24180021
         MVC   OU6LC(LX3),CCPGT                                         24190021
       ST    RW1,C6WRK0                                                 24200021
       L     R15,AS6010        CONVERT FOR LIST                         24210021
       BALR  RS1,R15               BR TO CONVERT RTN                    24220021
         MVC   OU6REC+NX44(LX5),C6WRK4                                  24230021
       L     R15,APUT                                                   24240021
       BALR  RS1,R15               PRINT LINE                           24250021
       BALR  RS1,R15               PRINT BLANK LINE                     24260021
       LA    RW3,CCOVFL                                                 24270021
       ST    RW3,MAPTXT                                                 24280021
       LH    RW1,PGTOV                                                  24290021
       L     R15,AMAPLC                                                 24300021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24310021
       LA    RW3,CCVIRT                                                 24320021
       ST    RW3,MAPTXT                                                 24330021
       LH    RW1,VIRCTR                                                 24340021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24350021
       LH    RW1,PNCTR                                                  24360021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24370021
       LH    RW1,GNCTR                                                  24380021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24390021
       LH    RW1,DCBCTR                                                 24400021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24410021
       LH    RW1,VNILOC                                                 24420021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24430021
       LH    RW1,LTLCTR                                                 24440021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24450021
       LH    RW1,LTLCTR                                                 24460021
       AH    RW1,DLTLCT                                                 24470021
       BALR  RS1,R15               PRINT A LINE OF MEMORY MAP           24480021
       L     R15,APUT                                                   24490021
       BALR  RS1,R15               PRINT BLANK LINE                     24500021
* PROGRAM LOCATION NOW KNOWN                                            24510021
       L     RW1,LOCPGM                                                 24520021
       ST    RW1,LOCCTR                                                 24530021
       BC    UNCOND,PRDONE         CONTINUE WITH PHASE6                 24540021
       EJECT                                                            24550021
PRDONE DS    0H                                                         24560021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     24570021
       L     R15,APUT          PRINT BLANK LINE                         24580021
       BALR  RS1,R15               PRINT BLANK LINE                     24590021
*=L                                                                     24600021
*      PRIME & SET STATIC QTBL & ERRTBL IF NEEDED                       24610021
       LH    RW1,ODOCTR                                                 24620021
         LTR   RW1,RW1            ARE THERE ANY Q-RTES                  24630021
         BC    ZERO,NOQTBL        NO-BRANCH AROUND PRIME CODE           24640021
         SLL   RW1,DX1                                                  24650021
       STH   RW1,QSIZ         SIZE OF QTBL                              24660021
       LA    R1,AQTBL                                                   24670021
       L     R15,AXPRIM            PRIME QTBL                           24680021
       BALR  RS1,R15            PRIME QTBL                              24690021
         LA    R1,AQTBL                                                 24700021
         L     R15,ASTATC                                               24710021
         BALR  RS1,R15             SET QTBL STATIC                      24720021
         L     R1,AQTBL           TIB ADDRESS                           24730021
         LA    R1,DX0(R1)          ELIMINATE HI BYTE                    24740021
         L     R1,DX0(R1)          TAMM ADDRESS                         24750021
         MVC   DX4(LX2,R1),QSIZ     TABLE SIZE INTO N1 OF TAMM          24760021
*                                                                       24770021
NOQTBL   DS    0H                                                       24780021
         CLI   ERRSEV,WLEVEL       ANY E-TEXT                           24790021
         BC    HI,ERRPRIM          YES - C OR HIGHER - NEED TBL         24800021
         BC    LO,NOEPRIM          NO  - DON'T NEED ERRTBL              24810021
         TM    PHZSW,FLGWRN        YES - W - TEST FLAGE OR W            24820021
         BC    ZERO,NOEPRIM        FLAGE - DON'T NEED ERRTBL            24830021
ERRPRIM  OI    NOETEXT,ETX2DO      THERE IS E-TEXT TO PROCESS           24840021
         LA    R1,AERRTB                                                24850021
         L     R15,AXPRIM                                               24860021
         BALR  RS1,R15             PRIME ERRTBL                         24870021
         LA    R1,AERRTB                                                24880021
         L     R15,ASTATC                                               24890021
         BALR  RS1,R15             SET ERRTBL STATIC                    24900021
         L     R1,AERRTB          TIB ADDRESS                           24910021
         LA    R1,DX0(R1)          ELIMINATE HI BYTE                    24920021
         L     R1,DX0(R1)          TAMM ADDRESS                         24930021
         MVC   DX4(LX2,R1),C6256    TABLE SIZE INTO N1 OF TAMM          24940021
         OI    DOEOTSW,DOEOTBL     NEED END OF TABLE MARKER             24950021
NOEPRIM  DS    0H                                                       24960021
* SET FILTBL, CONDIS, AND CONTBL STATIC PRIOR TO GETALL           56154 24970021
         LA    R1,AFILTB          XSTATC WILL LOAD R1 WITH TIB ADDR     24980021
         L     R15,ASTATC                                         56154 24990021
         BALR  RS1,R15            BR TO MAKE TABLE STATIC         56154 25000021
         LA    R1,ACONTB          XSTATC WILL LOAD R1 WITH TIB ADDR     25010021
         L     R15,ASTATC                                         56154 25020021
         BALR  RS1,R15            BR TO MAKE TABLE STATIC         56154 25030021
         LA    R1,ACONDS          XSTATC WILL LOAD R1 WITH TIB ADDR     25040021
         L     R15,ASTATC                                         56154 25050021
         BALR  RS1,R15            BR TO MAKE TABLE STATIC         56154 25060021
* GET SPACE FOR RLD TABLE                                               25070021
         L     R15,AGETALL                                              25080021
         BALR  RS1,R15             GO TO PH0 FOR SPACE                  25090021
         ST    R0,ARLDTB           R0 = STARTING ADDRESS                25100021
         ST    R1,RLDSIZ           R1 = LENGTH                          25110021
REGMV1 DS    0H                                                         25120021
*      SET UP REGISTER ASSIGNMENTS FOR RPD=0 (INLINE CODING)            25130021
       L     R15,AUSING                                                 25140021
       BALR  RS1,R15               BR TO SET UP REG ASSIGNMENTS         25150021
* LIST REGISTERS ASSIGNED                                               25160021
       TM    PHZSW,NOLIST                                               25170021
       BC    ZERO,NOBLST           YES, DON'T LIST BL REGS              25180021
         TM    NOBLS,NOBLSON       ARE THERE ANY BL'S                   25190021
       BC    ZERO,NOBLST           YES, THERE ARE NO BL'S               25200021
         MVC   OU6REC+NX2(LX19),CCREG                                   25210021
       L     R15,APUT                                                   25220021
       BALR  RS1,R15           HEADING                                  25230021
       BALR  RS1,R15           BLANK LINE                               25240021
       LA    RW2,STAT06                                                 25250021
         LA    RW1,DX6                                                  25260021
REGMV    MVC   OU6REC+NX3(LX3),CCREG                                    25270021
         MVC   OU6REC+NX11(LX4),CCBLI                                   25280021
* CONVERT AND MOVE REGISTER NUMBER                                      25290021
       LR    R2,RW2            SAVE RW2                                 25300021
       L     R15,AS6200                                                 25310021
       BALR  RS1,R15               BR TO CONVERT RTN                    25320021
         MVC   OU6REC+NX7(LX1),C6WRK4                                   25330021
       LR    RW2,R2            RESRORE                                  25340021
* IF NECESSARY, CHANGE TO BLS                                           25350021
         TM    DX2(RW2),XX0F                                            25360021
       BC    ZERO,CONVBL           ONLY 1 BL                            25370021
         MVI   OU6REC+NX13,ESS                                          25380021
* CONVERT AND MOVE BL NUMBER                                            25390021
CONVBL LR    R1,RW1           SAVE REGISTER NUMBER                      25400021
         IC    RW1,DX3(RW2)                                             25410021
       LR    R2,RW2            SAVE RW2                                 25420021
       L     R15,AS6200                                                 25430021
       BALR  RS1,R15               BR TO CONVERT RTN                    25440021
         MVC   OU6REC+NX15(LX1),C6WRK4                                  25450021
       LR    RW2,R2            RESRORE                                  25460021
       L     R15,APUT         PUT OUT LINE                              25470021
       BALR  RS1,R15               PRINT A LINE                         25480021
         LA    RW1,DX1(R1)     NEXT REGISTER                            25490021
         TM    DX0(RW2),XX20                                            25500021
         LA    RW2,DX4(RW2)    NEXT CELL                                25510021
       BC    ZERO,REGMV       MORE REGISTERS ASSIGNED                   25520021
       L     R15,APUT                                                   25530021
       BALR  RS1,R15            BLANK LINE                              25540021
NOBLST DS    0H                                                         25550021
       L     RB1,ARB1B                                                  25560021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 25570021
         BCR   EQ,RB1              NO, BRANCH                           25580021
       EJECT                                                            25590021
*******************************************************************     25600021
*    SEGMENTATION PROCESSING                                            25610021
*******************************************************************     25620021
*                                                                       25630021
*    COMBINE SECTIONS OF EQUAL PTY INTO SEGMENTS                        25640021
*                                                                       25650021
SEGPROC  DS    0H                                                       25660021
       L     R1,ASGTBL             SPECIFY TIB FOR SEGTBL               25670021
       L     R15,ATABLE            GET ADDR OF TABLES SUBRTN            25680021
       BALR  RS1,R15               UPON RETURN R1=TBL ADDR,R2=SIZE      25690021
       ST    R1,SEGTAD             SAVE TBL ADDRESS                     25700021
       STH   R2,SEGSZ              SAVE SIZE IN PARLIST                 25710021
         MVC   FSTSEC(LX1),DX0(R1)   SAVE PTY OF 1ST SECTION            25720021
       LR    RW1,R1                GET STARTING ADDR OF SEGTBL          25730021
       AR    R1,R2                 COMPUTE END OF SEGTBL ADDRESS        25740021
       ST    R1,SEGEND             SAVE                                 25750021
COMPTY   CLI   DX0(RW1),XX00        IS THIS SECTION OF PTY ZERO(ROOT    25760021
         BC    NOTEQ,NOROOT        NO, BRANCH                           25770021
         LA    RW1,DX5(RW1)         YES,IGNORE-ROOT HANDLED LAST        25780021
       B     COMPTY                SEARCH FOR SECTION OF NONZERO PT     25790021
NOROOT   MVC   CURPTY(LX1),DX0(RW1)  SAVE PTY OF SEGM BEING PROCESSED   25800021
*   GENERATE SEGMENT'S NAME AS A COMBINATION  OF PROG NAME AND PTY#     25810021
       LA    INPUTR,NMOUT1                                              25820021
SEGNM  DS    0H                                                         25830021
         LA    RW2,DX6              INITIALIZE LOOP CTRL REG            25840021
       LA    RW3,PROGID            GET PROG NAME ADDRESS                25850021
NMLOOP   LA    RW3,DX1(RW3)         BUMP POINTER                        25860021
         CLI   DX0(RW3),BLANK      FOUND A BLANK TO APPEND PTY NO       25870021
         BC    EQ,NMOUT            YES, BRANCH                          25880021
       BCT   RW2,NMLOOP            NO,SCAN UNTIL  6 CHAR  PROCESSED     25890021
NMOUT  LR    R0,RW1                SAVE SEGTBL ENTRY ADDR               25900021
       SR    RW1,RW1                                                    25910021
       IC    RW1,CURPTY            GET PTY OF SECTION BEING PROCESS     25920021
         LA    RW2,PTY10           SET  COMPARE PTY TO 10          2963 25930021
         CR    RW1,RW2           IS CURPTY LESS THAN TEN           2963 25940021
         BC    NOTLO,NMOUT0         NO, CONTINUE WITH CURPTY       2963 25950021
         UNPK  C6WRK3(FOURBYTE),CURPTY(TWOBYTE)  ******            2963*25960021
                        YES, UNPACK TO FOF#                        2963 25970021
         MVC   TARG0(TWOBYTE,RW3),C6WRK4  MOVE NOT EX BY CONVERT   2963 25980021
         BCR   UNCOND,INPUTR      SKIP NEXT SECTIONOF CODE         2963 25990021
NMOUT0   DS    0H                                                  2963 26000021
       L     R15,AS6200            GET ADDR OF CONVERT RTN              26010021
       BALR  RS1,R15               CONVERT FOR CLIST                    26020021
*  THE FOLLOWING INSTRUCTION WILL BE EXECUTED BY THE CONV RTN           26030021
         MVC   DX0(LX1,RW3),C6WRK4   APPEND PTY# TO PROG NAME           26040021
       BR    INPUTR                BR TO NMOUT1                         26050021
NMOUT1 DS    0H                                                         26060021
       LR    RW1,R0                RESTORE                              26070021
       LR    RW2,RW1               GET ADDR OF CURR ENTRY IN SEGTBL     26080021
         TM    SEGSW1,EJECT   EJECT THIS TIME                           26090021
         BC    ZERO,NMOUT2    NO,RESET FOR ALL OTHER TIMES              26100021
         BALR  R0,RB2         YES,  BRANCH TO PHASE0                    26110021
         DC    X'D6'          PAGE EJECT                                26120021
         BC    UNCOND,NMOUT3  CONTINUE  PROCESSING                      26130021
NMOUT2   DS    0H                                                       26140021
         TM    PHZSW,NOLIST        PMAP                                 26150021
         BC    ZERO,NMOUT3    NO, NEVER EJECT                           26160021
         OI    SEGSW1,EJECT  FOR ALL OTHER SEGS                         26170021
NMOUT3   DS    0H                                                       26180021
       L     R15,APUT              GET PRINT RTN ADDRESS                26190021
       BALR  RS1,R15               PRINT BLANK LINE                     26200021
         MVC   OU6REC+NX25(L'SEGMSG),SEGMSG                             26210021
         MVC   OU6REC+NX40(LX2),C6WRK4 GET PTY NUMBER                   26220021
       BALR  RS1,R15               PRINT HEADER LINE                    26230021
       BALR  RS1,R15               PRINT BLANK LINE                     26240021
*                                                                       26250021
*   PUNCH OVERLAY,INSERD,ESD CARDS FOR SEGMTS OF NONZERO PTY            26260021
*                                                                       26270021
         XC    LOCCTR(LX4),LOCCTR   INITIALIZE SEGMENTS LOC CTR         26280021
       L     R15,AESD              GET ADDR OF PUNCH RTN                26290021
         OI    SEGSW,SEGOVLY       SET OVERLAY CARD SW                  26300021
       BALR  RS1,R15               PUNCH OVERLAY CARD                   26310021
         OI    SEGSW,SEGNSRT       SET INSERT CARD SW                   26320021
       BALR  RS1,R15               PUNCH INSERT CARD                    26330021
       LA    R1,PROGID             SPECIFY NAME ADDRESS                 26340021
       SR    R0,R0                 SPECIFY TYPE=0                       26350021
       BALR  RS1,R15               PUNCH ESP-CSECT CARD                 26360021
         TM    SEGSW,SEGNMBLK      WAS PROG NAME INIT'LY BLANK          26370021
         BC    ONES,NOTFST         NO, BRANCH                           26380021
         OI    SEGSW,SEGNMBLK      MARK THAT SEG NAME WAS BLANK         26390021
         MVC   SEGNSA(LX8),PROGID   SAVE SEGMENTS NAME                  26400021
NOTFST EQU   *                                                          26410021
*                                                                       26420021
*  EXTRACT DISK ADDR OF SECTIONS PROC. A-TEXT AND ISSUE POINT MAC       26430021
*                                                                       26440021
POINT0 LR    RW2,RW1               SAVE CURR ENTRY ADDR                 26450021
POINT1   MVC   C6WRK0(LX4),DX1(RW2)  EXTRACT DISK ADDR FROM SEGTBL      26460021
       L     R1,C6WRK0             INPUT REG = DISK ADDRESS             26470021
         BALR  R0,RB2              BR TO PH0                            26480021
        DC    X'91'                POINT/READ                           26490021
*   UPON RETURN FROM PHASE 00 R0 CONTAINS ADDR OF SECTIONS A-TEXT       26500021
       LR    INPUTR,R0            SAVE A-TEXT ADDR                      26510021
         OI    DX0(RW2),XX80        SET SECTION FOUND SWITCH            26520021
         MVI   FGET,FGETNEW        GET NEW BLOCK                        26530021
         OI    TESTSW,TSTREAL      INIDCATE THAT A-TXT IS IN CORE       26540021
       ST    RW1,SEGCOM            SAVE COMPARE ENTRY ADRESS            26550021
       ST    RW2,SEGCUR           SAVE CURRENT ENTRY ADDRESS            26560021
       ST    INPUTR,ADTEST         SAVE A-TEXT ADDRESS                  26570021
       BR    RB1                  BR TO MAIN LINE TO PROCESS A-TEXT     26580021
*******************************************************************     26590021
         EJECT                                                          26600021
*******************************************************************     26610021
SEGBRK DS    0H                                                         26620021
         L     RB3,APGTIN          RESTORE BASE REG                     26630021
         CLI   CURPTY,XX00          IS ROOT SEGM BEEING PROCESSED       26640021
         BC    EQ,ROOT4            YES, BR TO ROOT CODE                 26650021
       L     RW1,SEGCOM            RESTORE RW1                          26660021
       L     RW2,SEGCUR           SPECIFY CURRENT ENTRY ADDR            26670021
POINT2 EQU   *      ENTER HERE FROM MAIN LINE TO FIND NEXT SECTION      26680021
         LA    RW2,DX5(RW2)         POINT TO NEXT ENTRY IN SEGTBL       26690021
       C     RW2,SEGEND            HAS END OF SEGTBL BEEN REACHED       26700021
       BC    NOTLO,ENDTBL          YES,BR                               26710021
         CLC   CURPTY(LX1),DX0(RW2)  IS THIS ENTRY OF EQUAL PTY         26720021
         BC    NOTEQ,POINT2        NO, GET NEXT ENTRY                   26730021
       B     POINT1                YES,GET SECTION'S A-TEXT             26740021
ENDTBL EQU   *                     PUNCH END CARD                       26750021
         OI    SEGSW,SEGENDCD      GET CONTROL/PNCH END8 RTN SEG        26760021
         MVC   LNSECT(LX4),LOCCTR   SPECIFY LN OF CURRENT SEGMENT       26770021
       L     R15,AFTER            GET ADDR OF RTN TO PUNCH END CRD      26780021
       BALR  RS1,R15               PUNCH END CARD                       26790021
POINT3   LA    RW1,DX5(RW1)         BUMP COMPARE ADDRESS                26800021
       C     RW1,SEGEND            HAVE NON-ZERO PTY SECTS BEEN PRO     26810021
       BC    NOTLO,ROOT0           YES,PROCESS ROOT SEGM LAST           26820021
         TM    DX0(RW1),HION       WAS THIS ENTRY ALREADY DONE          26830021
         BC    ONES,POINT3         YES, GET NEXT ENTRY                  26840021
         CLI   DX0(RW1),XX00        IS THIS ENTRY FOR THE ROOT SEGM     26850021
         BC    EQ,POINT3           YES, BRANCH                          26860021
         MVC   PROGID(LX8),DCPRID   NO,RESTORE PROG NAME                26870021
       B     NOROOT                PROCESS NEXT SEGMENT                 26880021
*                                                                       26890021
*   PROCESS THE ROOT SEGMENT                                            26900021
*                                                                       26910021
ROOT0  DS    0H                                                         26920021
         NI    SEGSW,SEGNOEND      RESET'PNCH END & RET TO SEG'SW       26930021
         MVI   CURPTY,XX00          INDICATE ROOT PTY NMBR              26940021
         TM    PHZSW,NOLIST         PNAP                                26950021
         BC    ZERO,NOSKIP2    NO, DONT EJECT PAGE                      26960021
         BALR    R0,RB2      BR TO PH0                                  26970021
         DC    X'D6'         TO EJECT PAGE                              26980021
NOSKIP2  DS    0H                                                       26990021
         L     R15,APUT            GET PRINT RTN ADDR                   27000021
         MVC   OU6REC+NX25(L'ROOTMG),ROOTMG                             27010021
       BALR  RS1,R15               PRINT ROOT SEGM HEADER LINE          27020021
       BALR  RS1,R15               PRINT BLANK LINE                     27030021
         MVC   PROGID(LX8),DCPRID   RESTORE PROG NAME                   27040021
       SR    R0,R0                 SPECIFY TYPE ZERO ESD                27050021
       LA      R1,PROGID                                                27060021
       L     R15,AESD              GET PUNCH RTN ADDR                   27070021
       BALR  RS1,R15               PUNCH ESD TYPE ZERO CARD             27080021
       L     RB1,AFIRST            GET BASE REG                         27090021
         L     RW2,OVFLLOC         GET OVFL ADDR                  0339  27100021
         ST    RW2,LOCCTR           SAVE AS TARGET ADDR           0339  27110021
         BAL   INPUTR,TGTOVCL      PUNCH OVERFLOW CELLS IN TGT    0339  27120021
         BAL   RW2,TGT42          PUNCH SAVE-AREA AND SWITCH CELL       27130021
       L     R15,ATGTCON                                                27140021
       BALR  RS1,R15               PUNCH TGT CONSTANTS AND ADCONS       27150021
       L     RW2,TGTLOC            GET TGT LOC                          27160021
         LA    RW2,DX416(RW2)       *****TEMP*****                      27170021
       ST    RW2,LOCCTR            SAVE TARGET ADDR                     27180021
       L     RW2,TGTLOC            COMPUTE ADCON VALUE                  27190021
       AH    RW2,VCONAD                                                 27200021
       ST    RW2,D6REL             SAVE RELOC VALUE                     27210021
         L     RB1,ARB1B           GET ADDRESSABILITY                   27220021
         L     R15,ARLDRTE                                              27230021
       BALR  RS1,R15               ENTER VCON TBL ADDR INTO RLDTBL      27240021
         MVI   TARG0(R2),XX04       LENGTH OF ADCON                     27250021
         OI    TARG0(R2),ATYP       SET FLAG BYTE                       27260021
         MVC   TARG(LX3,R2),LOCCTR+NX1                                  27270021
         MVC   RELC4(LX4,R2),D6REL                                      27280021
*    PUNCH VCONS FOR NON-RESIDENT SEGMENTS                              27290021
*                                                                       27300021
       L       RW2,SEGTAD          GET SEGTBL ADDRESS                   27310021
SEG40  C     RW2,SEGEND            ALL DONE                             27320021
       BC    NOTLO,SEG50           YES,BR                               27330021
         CLI   DX0(RW2),XX00        IS THIS SEG OF PTY ZSERO            27340021
         BC    NOTEQ,SEG42         NO, BRANCH                           27350021
         LA    RW2,DX5(RW2)         YES,IGNORE                          27360021
       B     SEG40                 COMPARE AGAIN                        27370021
SEG42    MVC   CURPTY(LX1),DX0(RW2)  GET PTY NMBR                       27380021
         NI    CURPTY,M7F          GET RID OF HIGH ORDER BIT            27390021
       ST    RW2,SEGCUR            SAVE CURRENT ENTRY ADDR              27400021
         MVC   PROGID(LX8),DCPRID   RESTORE PROGRAM NAME                27410021
       BAL   INPUTR,SEGNM          GENERATE A NAME                      27420021
       LH    R0,VCONAD             GET VCON TBL ADDR                    27430021
       A     R0,TGTLOC                                                  27440021
       ST    R0,LOCCTR             SAVE                                 27450021
       LA    R1,CURPTY                                                  27460021
         LA    R0,FOURBYTE         SPECIFY LENGTH                       27470021
       L     R15,ATXPNH                                                 27480021
       BALR  RS1,R15               PUNCH TEXT                           27490021
       L     RW2,LOCCTR            GET TARGET ADDR FOR VCON             27500021
         LA    R0,FOURBYTE         SPECIFY LENGTH                       27510021
       LA    R1,ZERO7X             PUNCH ZEROS                          27520021
       BALR    RS1,R15             PUNCH ZEROS                          27530021
       LH    RW1,ESDID                                                  27540021
         LA    RW1,DX1(RW1)         STEP ESDID                          27550021
       STH     RW1,ESDID                                                27560021
         LA    R0,ESDTYP2          TYPE 2 ESD (EXTRN)                   27570021
       LA    R1,PROGID             EXTERNAL NAME ADDRESS                27580021
       L     R15,AESD                                                   27590021
       BALR  RS1,R15               PUNCH VCON                           27600021
       LR    R1,RW2                GET TARGET ADDR                      27610021
       LA      R0,X'1C'            SPECIFY FLAG BYTE                    27620021
       L     R15,ARLD                                                   27630021
       BALR  RS1,R15               PUNCH RLD CARD                       27640021
       LH    R1,VCONAD             GET VCON TBL DISPL                   27650021
         LA    R1,DX8(R1)           BUMP POINTER                        27660021
       STH   R1,VCONAD                                                  27670021
       L     RW2,SEGCUR            RESTORE SEGTBL ENTRY ADDR            27680021
SEG46    CLC   DX0(LX1,RW2),DX5(RW2) IS NEXT ENTRY OF THE SAME PTY      27690021
         BC    NOTEQ,SEG48         NO, BRANCH                           27700021
         LA    RW2,DX5(RW2)         YES,IGNORE                          27710021
       B     SEG46                 COMPARE AGAIN                        27720021
SEG48    LA    RW2,DX5(RW2)                                             27730021
       B     SEG40                 COMPARE LOOP                         27740021
SEG50  DS    0H                                                         27750021
         MVI   CURPTY,XX00          RESTORE PTY                         27760021
       BAL   INPUTR,PGT40          PUNCH OVERFLOW CELLS                 27770021
       BAL   INPUTR,PNVIRT         PUNCH VIRTUALS                       27780021
       BAL   INPUTR,PNLIT          PUNCH LITERALS                       27790021
         MVC   LOCCTR(LX4),LOCPGM   GET LOC CTR FOR ROOT'S PROCEDURE    27800021
       L     RW1,SEGTAD            GET SEGTBL ADDRESS                   27810021
ROOT1  DS    0H                                                         27820021
       C     RW1,SEGEND            HAVE ALL SECTS BEEN PROCESSED        27830021
       BC    NOTLO,ROOT5           YES,BR                               27840021
         CLI   DX0(RW1),XX00        IS THIS ENTRY FOR ROOT SEGM         27850021
         BC    EQ,ROOT3            YES, BRANCH                          27860021
ROOT2    EQU   *   ENTERED IN LINE AND AT END OF BLOCK/FILE             27870021
         LA    RW1,DX5(RW1)        NO,POINT TO NEXT ENTRY               27880021
       B     ROOT1                 NEXT ENTRY                           27890021
ROOT3  EQU   *                     EXTRACT DISK ADDR FOR ROOT SEGM      27900021
       LR    RW2,RW1               SAVE ENTRY ADDRESS                   27910021
         MVC   C6WRK0(LX4),DX1(RW2)  GET DISK ADDRESS                   27920021
       L     R1,C6WRK0             INPUT REG=DISK ADDR                  27930021
         BALR  R0,RB2              BRANCH TO PH0                        27940021
        DC    X'91'                POINT/READ                           27950021
       LR    INPUTR,R0             GET A-TEXT ADDRESS                   27960021
       ST    INPUTR,ADTEST                                              27970021
       ST    RW1,SEGCUR            SAVE CURR ENTRY ADDRESS              27980021
         MVI   FGET,FGETNEW        1ST TIME ENTRY/GET NEW BLOCK         27990021
         OI    TESTSW,TSTREAL      INDICATE THAT A-TXT IS IN CORE       28000021
       L     RB1,ARB1B             GET BASE VALUE                       28010021
       BR    RB1                  BR TO MAIN LINE TO PROCESS A-TEXT     28020021
ROOT4  DS    0H                                                         28030021
       L     RB3,APGTIN           RESTORE BASE REG                      28040021
       L     RW1,SEGCUR            GET ADDR OF CURRENT ENTRY IN SET     28050021
       B     ROOT2                 NEXT ENTRY                           28060021
ROOT5  EQU   *      RELEASE SEGTBL-ALL SECTIONS PROCESSED               28070021
       L     R1,ASGTBL             GET TIB ADDR                         28080021
       L     R15,RELADD            GET RELEASE RTN ADDRESS              28090021
       BALR  RS1,R15               RELEASE SEGTBL                       28100021
*                                                                       28110021
*                                                                       28120021
* JOIN MAIN LINE TO PROCESS DATA A-TEXT                                 28130021
* TURN OFF A SWITCH SO THE FTER RTN DOES NOT RETURN TO SEGM. CODE       28140021
         NI    SEGSW,SEGNOEND      RESET SW'DON'T PNCH END & RET        28150021
       L     RB3,ABTALL            PROVIDE BASE REG                     28160021
       L     R15,EOF3                                                   28170021
       BR    R15                   BR TO EOF3                           28180021
       DS    0F                                                         28190021
ABTALL DC    A(BTALLY)                                                  28200021
SEGMSG DC    C'SEGMENT OF PTY'                                          28210021
ROOTMG DC    C'ROOT SEGMENT'                                            28220021
       DS    0H                                                         28230021
*******************************************************************     28240021
       EJECT                                                            28250021
IKF603   CSECT                                                          28260021
*                                                                       28270021
*=1    RESET BASE REGISTER--OK BECAUSE ALL PREVIOUS CODING              28280021
*=     NO LONGER REFERRED TO OR EXECUTED                                28290021
       USING *,RB1                                                      28300021
       USING BTALLY,RB3                                                 28310021
RB1BAS EQU   *                                                          28320021
       L     RB3,ADSCT2                                                 28330021
       TM    INTSW,S6WON           HAVE WE BEEN THRU HERE BEFORE        28340021
       BO    SE6000              YES-BRANCH-ONLY WANT TO EXEC ONCE      28350021
       OI    INTSW,S6WON           FIRST TIME THRU                      28360021
         LA    RS1,AINIT1                                               28370021
RLDRTE   DS    0H         SUBRTE TO GET ADDRESS FOR NEXT RLD ENTRY      28380021
         TM    SWRLDFUL,RLDOVFL    IS TABLE FULL                        28390021
         BC    ZERO,RLDOK          NO - BRANCH                          28400021
         L     R2,ARLDTB           YES - ALWAYS GIVE TABLE              28410021
         BCR   UNCOND,RS1          START FOR INSERT AND RETURN          28420021
RLDOK    DS    0H                                                       28430021
         L     R0,RLDINDEX         # BYTES USED THUS FAR                28440021
         LR    R1,R0                                                    28450021
         LA    R1,DX8(R1)                                               28460021
         CL    R1,RLDSIZ           WILL THIS ENTRY FIT                  28470021
         BC    HI,RLDOVFLO         NO - GO PRINT MSG                    28480021
         L     R2,ARLDTB                                                28490021
         AR    R2,R0               ADDRESS FOR INSERT = R2              28500021
         ST    R1,RLDINDEX                                              28510021
         BCR   UNCOND,RS1          RETURN                               28520021
* PUNCH INIT1 ADCON IN THE TGT                                          28530021
AINIT1   DS    0H                                                       28540021
         MVI   TARG0(R2),XX04      SPECIFY LENGTH                       28550021
         OI    TARG0(R2),ATYP      ADCON TYPE                           28560021
         L     RW2,TGTLOC          GET TGT ADDRESS                      28570021
         LA    RW2,TGTINIT1(RW2)   COMPUTE TARGET ADDRESS               28580021
         ST    RW2,C6WRK0                                               28590021
         MVC   TARG(LX3,R2),C6WRK0+NX1                                  28600021
         MVC   RELC4(LX4,R2),ZERO7X INIT ADDRESS (0)                    28610021
       BC    UNCOND,SE6000         GET NEXT ELEMENT                     28620021
ADSCT2 DC    A(BTALLY)                                                  28630021
RLDOVFLO DS    0H                                                       28640021
         MVI   ERRSEV,DLEVEL       INDICATE DISASTER MSG                28650021
         OI    SWRLDFUL,RLDOVFL    INDICATE RLDTBL IS FULL              28660021
         BALR  R0,RB2              PAGE EJECT                           28670021
         DC    X'D6'                                                    28680021
         MVC   OU6CDN(LX95),RLDMSG                                      28690021
         ST    RS1,RS1SAVE         SAVE RETURN REG                      28700021
         L     RS1,APUTM                                                28710021
         L     R15,APUT                                                 28720021
         BALR  RS1,RS1            PRINT MESSAGE                         28730021
         TM    PHZSW1,MAPSP       MAPSUP                          41518 28740021
         BC    ZERO,RLD4XREF         NO                           41518 28750021
         NI    PHZSW,NO6OPR        RESET OPTIONS                  41518 28760021
         NI    PHZSW1,CLISTR         HERE TOO                     41518 28770021
RLD4XREF  DS    0H                                                41518 28780021
         L     RS1,RS1SAVE         RESTORE RETURN REG                   28790021
         BALR  R0,RB2              EJECT                                28800021
         DC    X'D6'                                                    28810021
         TM    NOETEXT,ETX2DO      IS THERE ANY E-TEXT TO PROCESS       28820021
         BC    ONES,RLDRTE         ETEXT TO PROCESS - CONTINUE          28830021
         TM    PHZSW1,XREF                                              28840021
         BC    ONES,RLDRTE         XREF TO PROCESS CONTINUE             28850021
         TM    PHZSW1,MAPSP        MAPSUP                         41518 28860021
         BC    ZERO,DOEOJ             NO                          41518 28870021
         L     RB1,AFIRST                                         41518 28880021
         USING FIRST,RB1                                          41518 28890021
         BC    UNCOND,MSGMS1        PRINT MAPSUP STATS            41518 28900021
         USING RB1BAS,RB1                                         41518 28910021
DOEOJ    DS    0H                                                 41518 28920021
         BALR  R0,RB2              RETURN TO PH0 - EOJ                  28930021
         DC    X'B0'                                                    28940021
       EJECT                                                            28950021
*=1          PROCEDURE STATEMENT PROCESSING                             28960021
*                                                                       28970021
*                                                                       28980021
SE6010 DS    0H                                                         28990021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     29000021
         CLI   OU6LST,BLANK        ANY LISTING TEXT LEFT IN LINE        29010021
       BC    EQ,SE6011        NO                                        29020021
       L     R15,APUT                    YES,PRINT                      29030021
       BALR  RS1,R15               BR TO PRINT                          29040021
*=L                                                                     29050021
SE6011 DS    0H                                                         29060021
         NI    CLSEGSW,XX00        TURN SWITCH OFF                      29070021
         TM    A6CDNO,HION                                              29080021
         BZ    SE6016              NO, IT'S A PN, BRANCH                29090021
         OI    CLSEGSW,HION        TURN SWITCH ON                       29100021
         NI    A6CDNO,M7F        YES, GET RID OF HIGH-BYTE              29110021
SE6016   DS    0H                                                       29120021
         MVC   CDNOSAV(LX2),A6CDNO                                      29130021
         TM    PHZSW3,VERBR        IS VERB ON                           29140021
         BZ    SE6012              NOVERB, BRANCH                       29150021
       LA    RW2,SE6000       EOF RETURN                                29160021
*DEL                                                                    29170021
*DEL                                                                    29180021
         ST    INPUTR,SAVER4                                            29190021
         L     R15,AGET   GET SOURCE CARD RCD                           29200021
       BALR  RS1,R15               BR TO GET RECORD                     29210021
         CLI   DX0(INPUTR),XX7C    LISTING A-TEXT ?                     29220021
         BNE   SE6020              NO, BRANCH TO CHOOSE RTN             29230021
         LR    F4REG,INPUTR        POINTS TO LISTING A-TEXT             29240021
         L     INPUTR,SAVER4       POINTS TO A CARD NUMBER              29250021
SE6012 DS    0H                                                         29260021
         MVI   OU6CDN,BLANK                                             29270021
         MVC   OU6CDN+NX1,OU6CDN                                        29280021
*DEL                                                                    29290021
*DEL                                                                    29300021
*DEL                                                                    29310021
*DEL                                                                    29320021
SE6013   DS    0H                                                       29330021
         MVC   C6WRK0(LX2),CDNOSAV                                      29340021
         MVC   XFCDNO,CDNOSAV      SAVE CARD NO FOR XREF TABLES BLDG.   29350021
       LH    RW1,C6WRK0                                                 29360021
       USING S6200,R15                                                  29370021
       L     R15,AS6200                                                 29380021
       BAL   RS1,S6210             BR TO CONVERT                        29390021
         MVC   OU6CDN(LX0),C6WRK4   EXECUTED BY SUBR                    29400021
       TM    PHZSW1,CLIST                                               29410021
       BC    ZERO,SE6014           NOT CLIST                            29420021
         MVC   OUCCDN(LX5),OU6CDN                                       29430021
       DROP  R15                                                        29440021
SE6014 DS    0H                                                         29450021
         MVI   PNBCDS,BLANK                                             29460021
         MVC   PNBCDS+NX1(LX29),PNBCDS                                  29470021
         MVC   PNBCDS(LX5),OU6CDN   SAVE CARD NUMBER FOR TRACE          29480021
*DEL                                                                    29490021
*DEL                                                                    29500021
         TM    PHZSW3,VERBR        IS VERB ON                           29510021
         BC    ZERO,SE6015         NOVERB, BRANCH                       29520021
         IC    RW1,DX1(F4REG)                                           29530021
       N     RW1,C6MA                                                   29540021
         LR    RW2,RW1                                                  29550021
         AH    RW2,GETLEN                                               29560021
         STH   RW2,GETLEN                                               29570021
         SH    RW1,C61      DECREMENT 1 FOR EX OF MVC                   29580021
         TM    CLSEGSW,HION                                             29590021
         BNZ   VERBF4        VERB                                       29600021
         EJECT                                                          29610021
*=2    PROCEDURE NAME (LISTING A-TEXT)                                  29620021
*      FORMAT //NN BCD-NAME//                                           29630021
*                                                                       29640021
*             WHERE NN=LENGTH OF ELT, BUT WITH HI-ORDER BIT=1           29650021
*                                                                       29660021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     29670021
       EX    RW1,MVCPN             PN TO COL 9 ON                       29680021
         MVI   OU6STR,ASTER        * TO LISTING LINE                    29690021
       L     R15,APUT     PRINT LINE                                    29700021
       BALR  RS1,R15               BR TO PRINT                          29710021
*=L                                                                     29720021
         LR    INPUTR,F4REG                                             29730021
       BC    UNCOND,SE6000         GET NEXT ELEMENT                     29740021
MVCVRB EQU     *                                                        29750021
MVCPN    MVC   OU6LST(LX0),DX2(F4REG)   PMAP MOVE                       29760021
MVCVRBC  MVC   OUCLST(LX0),DX2(F4REG)   CLIST MOVE                      29770021
SE6015   DS    0H                                                       29780021
         TM    PHZSW1,CLIST        IS IT CLIST                          29790021
         BC    ONES,SE6030         YES, BRANCH                          29800021
         L     R15,APUT                                                 29810021
         BALR  RS1,R15                                                  29820021
         BC    UNCOND,SE6000       GET NEXT ELEMENT                     29830021
       SPACE 5                                                          29840021
*=2    VERB (LISTING A-TEXT)                                            29850021
*      FORMAT //NN VERB-NAME//                                          29860021
*                                                                       29870021
*             WHERE NN=LENGTH OF ELT                                    29880021
*                                                                       29890021
*                                                                       29900021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     29910021
VERBF4   DS    0H                                                       29920021
         MVC   C6WRK0(LX2),CDNOSAV                                      29930021
       CH    RW1,C6H9                                                   29940021
       BC    NOTHI,VER010          VERB LESS THAN 10 CHARS              29950021
       LH    RW1,C6H9         ONLY USE 10 CHARS                         29960021
VER010 EQU   *                                                          29970021
         TM    PHZSW1,CLIST                                             29980021
         BC    ZERO,SE6029         BYPASS CLIST CODE                    29990021
         EX    RW1,MVCVRBC         MOVE VERB TO O/P AREA                30000021
         BC    UNCOND,SE6030       GO TO FINISH CLIST WORK              30010021
SE6029   DS    0H                                                       30020021
       EX    RW1,MVCVRB                                                 30030021
         LR    INPUTR,F4REG                                             30040021
         BC    UNCOND,SE6080       BYPASS CLIST CODE                    30050021
SE6030   DS    0H                                                       30060021
*DEL                                                                    30070021
*DEL                                                                    30080021
         TM    CLSEGSW,HION       IS IT CARD NO. FOR VERB               30090021
         BC    ZERO,SE6000        BYPASS CLIST CODE                     30100021
         NI    CLSEGSW,X'FF'-HION RESET SWITCH                          30110021
         TM    PHZSW3,VERBR        IS VERB ON                           30120021
         BC    ONES,SE6050         YES, VERB ALREADY PRINTED, BRANCH    30130021
         CLC   SAVCDNO,CDNOSAV     VERB FROM SAME CARD # ?              30140021
         BC    EQ,SE6040           YES                                  30150021
         MVC   SAVCDNO,CDNOSAV     NO - SAVE NEW CARD #                 30160021
         SP    VRBCNT,VRBCNT       REINITIALIZE VERB # COUNTER          30170021
SE6040   DS    0H                                                       30180021
         AP    VRBCNT,DECONE       ADD 1 TO VERB # COUNTER              30190021
         MVC   OUCLST+NX1(LX4),VRBCON                                   30200021
         MVC   OUCLST+NX5(LX4),EDWD1                                    30210021
         ED    OUCLST+NX5(LX4),VRBCNT                                   30220021
SE6050   DS    0H                                                       30230021
         MVC   C6WRK0(LX4),LOCCTR   MOVE LOCATION CTR TO WORK AREA      30240021
         L     R15,AS6010                                               30250021
         BALR  RS1,R15             CONVERT                              30260021
         MVC   OUCLC(LX6),C6WRK3   NOW TO O/P AREA                      30270021
         L     R15,APUT                                                 30280021
         USING PUT,R15                                                  30290021
         BAL   RS1,PUTC            PUT 1/3 OF LINE                      30300021
         TM    PHZSW3,VERBR                                             30310021
         BC    ZERO,SE6000         GET NEXT ELEMENT                     30320021
         LR    INPUTR,F4REG                                             30330021
         SPACE 5                                                        30340021
*        PROCEDURE A-TEXT ELEMENTS ARE READ FROM FILE 4; THE            30350021
*        CORRECT ROUTINE IS CHOSEN USING BRANCH-TABLE SE6025;           30360021
*              RETURN FROM EACH SUBROUTINE IS TO                        30370021
*                       SE6000 OR SE6080 FOR NEW RECORD                 30380021
*                       SE6020           FOR NEXT CODE                  30390021
*              END-OF-FILE EXIT FROM GET IS ENDF3                       30400021
*              ERROR ROUTINE FOR DIAGNOSTICS IS ERR040,ERR080,          30410021
*                    ERR110, OR ERR250.                                 30420021
*                                                                       30430021
*=L                                                                     30440021
SE6000 DS    0H                                                         30450021
*                                                                       30460021
SE6080   L     R15,AGET            GET ELT FROM F1                      30470021
       BALR  RS1,R15               GET NEXT ELEMENT                     30480021
         SPACE 6                                                        30490021
*                                                                       30500021
*   GET NEXT CODE.  USE BRANCH TABLE SE6025                             30510021
*                                                                       30520021
SE6020 DS    0H                                                         30530021
       SR    RW1,RW1                                                    30540021
       IC    RW1,GOTCOD                                                 30550021
       BC    UNCOND,SE6025-OP(RW1)    BRANCH-TABLE, CHOOSE RTN          30560021
         SPACE 8                                                        30570021
*        DESCRIPTIVE ELEMENT                                            30580021
*                                                                       30590021
NONINS DS    0H                                                         30600021
       L     R15,AS6800             FORMAT AND PRINT LINE               30610021
       BALR  RS1,R15               BR TO FORMAT/PRINT RTN               30620021
       BC    UNCOND,SE6020         GET NEXT CODE                        30630021
       EJECT                                                            30640021
*                                                                       30650021
*      COMMON ENTRANCE FOR NEW BLOCK OF ASSEMBLED A-TEXT ONLY           30660021
*      RW1=EOF ADDR                                                     30670021
*      RW2=LOC OF A-TEXT BLOCK                                          30680021
SU6010 DS    0H                                                         30690021
       L     R15,AS6800                                                 30700021
       BALR  RS1,R15               FORMAT AND PRINT LINE                30710021
       ST    RW1,EOFADR                                                 30720021
       ST    RW2,ADTEST                                                 30730021
         NI    FGET,FGETNEW        GET NEW BLOCK                        30740021
***    BC    UNCOND,R6010     FOLLOWS SO NO BRANCH                      30750021
       SPACE 5                                                          30760021
*=1   PROCESS OP AND ADDRESS ELEMENTS AND PRINT LISTING LINE            30770021
*     EXIT WHEN ENCOUNTER ELEMENT NOT ASSOCIATED WITH AN OP             30780021
*                                                                       30790021
*      A NOTE ON SYMBOLIC OPERANDS--                                    30800021
*      THERE ARE 3 FULL WORDS WHICH CORRESPOND TO THE LISTING LINE      30810021
*      FIELD OU6SO1 AND 3 FULL WORDS FOR OU6SO2. OU6SO1 WILL EXPLAI     30820021
*      THE ITEM REFERRED TO BY BASE-1, DISPLACEMENT-1 AND OU6SO2        30830021
*      LIKEWISE FOR BASE-2, DISPLACEMENT-2 (EXCEPT WHERE THERE IS N     30840021
*      B-1, D-1 FOR AN INSTR, EG RX-TYPE OR RS-TYPE, WHEN OU6SO1 WI     30850021
*     EXPLAIN B-2,D-2)                                                  30860021
*      THESE 6 FULL WORDS ARE SB1D1C- CODE FOR SYMBOLIC OPERAND 1       30870021
*                             SB2D2C- CODE FOR SYMBOLIC OPERAND 2       30880021
*                             SB1D1N- NUMBER OR DISP OF SYM OP 1        30890021
*                             SB2D2N- NUMBER OR DISP OF SYM OP 2        30900021
*                             SB1D1P- ANY PLUS VALUE TO BE ADDED TO     30910021
*                             SB2D2P- ANY PLUS VALUE TO BE ADDED TO     30920021
*      THESE FIELDS ARE FILLED AS THE ELEMENTS ARE ENCOUNTERED AND      30930021
*      CONVERTED TO LISTING LINE ELEMENTS BY ROUTINE S6800              30940021
R6010  DS    0H                                                         30950021
       L     R15,AGET                                                   30960021
       BALR  RS1,R15               GET RECORD OF PROCEDURE-ATEXT        30970021
R6020  EQU   *                                                          30980021
         NI    GTOVFL,INITOFF      INIT TO ZERO                         30990021
       CLI   GOTCOD,OP        IS ELT OP DESCRIPTIVE                     31000021
       BC    LOW,R6200        YES                                       31010021
       BC    HI,NONINS        NO                                        31020021
       SPACE 5                                                          31030021
*=1                                OP ELEMENT                           31040021
*      FORMAT //48 CC RR //                                             31050021
*                                                                       31060021
*             WHERE CC IS MACHINE OP CODE (00 FOR CNOP)                 31070021
*                   RR IS VALUE TO BE PLACED IN SECOND BYTE OF INST     31080021
OPPRO    CLI   C6OP,XX00       FIRST OP ELT                             31090021
       BC    EQ,R6040                     YES                           31100021
       L     R15,AS6800    TO PRINT ROUTINE                             31110021
       BALR  RS1,R15               FORMAT AND PRINT LINE                31120021
R6040  DS    0H                                                         31130021
       NI    STAT14,YAVAL6         MAKE NON-PERMANENT REGS AVAILABL     31140021
       NI    STAT15,YAVAL6         AS FAR AS PHASE6 IS CONCERNED        31150021
         CLI   A6OPCD,NOPOPCD      CNOP                                 31160021
       BC    EQ,PCNOP    GO TO PROCESS CNOP IF OPCODE=0                 31170021
*                             OTHERWISE                                 31180021
         MVC   C6OP(LX2),A6OPCD SAVE NEW OP AND ABS VALUE               31190021
       NI    S6BNO,S6WOFF               RESET HFWD 2 SW                 31200021
       NI    S6PLNO,S6WOFF              RESET PL NO SW                  31210021
*                                                                       31220021
       BC    UNCOND,R6010               PROCESS NEXT ELEMENT            31230021
*                                                                       31240021
         SPACE 3                                                        31250021
*=1                         //CNOP  RR//   ALIGN TO PROPER BOUNDARY     31260021
*                                   WHERE RR=4   CNOP 0,4               31270021
*                                           =8   CNOP 2,4               31280021
*                                           =C   CNOP 0,8               31290021
*                                           =10  CNOP 2,8               31300021
*                                           =14  CNOP 4,8               31310021
*                                           =18  CNOP 6,8               31320021
*                                                                       31330021
PCNOP  DS    0H                                                         31340021
       L     RW2,LOCCTR                                                 31350021
       N     RW2,C6M1         GET LOW-ORDER 3 BITS OF LOCCTR/2          31360021
         SRL   RW2,DX1                                                  31370021
       A     RW2,ACNOPT                                                 31380021
       SR    RW1,RW1                                                    31390021
       IC    RW1,A6ABSV       RR-4 TO RW1                               31400021
       SH    RW1,C64                                                    31410021
         IC    RW1,DX0(RW1,RW2) NO OF BCR 0,0 INSTRS TO RW1             31420021
       LTR   RW1,RW1                                                    31430021
       BC    ZERO,SE6080      NONE TO BE GENERATED                      31440021
MOBCRS   MVC   C6OP(LX2),CNOPLT SET UP AS IF INPUT                      31450021
       L     R15,AS6800        PRINT AND PUNCH                          31460021
       BALR  RS1,R15               FORMAT AND PRINT LINE                31470021
       BCT   RW1,MOBCRS       IF MORE, PROCESS                          31480021
       BC    UNCOND,SE6080    GET NEXT A-TEXT ELT                       31490021
         EJECT                                                          31500021
*        PROCEDURE A-TEXT OP CODES.     BRANCH TO APPROPRIATE           31510021
*        ROUTINE TO PROCESS ELEMENT USING BRANCH-TABLE R6202.           31520021
*                                                                       31530021
*                                                                       31540021
R6200  DS    0H                                                         31550021
       SR    RW1,RW1                                                    31560021
       IC    RW1,GOTCOD                                                 31570021
       BC  UNCOND,R6202-ULNG(RW1) USE CODE TO SELECT RTN FRM TBL        31580021
         SPACE 3                                                        31590021
*=1                                BDISP ELEMENT                        31600021
*=     FORMAT //70 BDDD //                                              31610021
*                                                                       31620021
*             WHERE B IS REGISTER SPECIFICATION                         31630021
*                   DDDD IS DISPLACEMENT SPECIFICATION                  31640021
*                                                                       31650021
R6210    MVC   C6WRK0(LX2),A6BDPB WORD FOR CONVERSION                   31660021
R6215  LH    RW1,C6WRK0                 BD                              31670021
R6217  STH   RW1,C6WRK0       WORK AREA                                 31680021
       N     RW1,C6M6                   DELETE B                        31690021
       SR    RW2,RW2                    CLEAR REG                       31700021
R6222  EQU   *                                                          31710021
       IC    RW2,C6WRK0                 BX                              31720021
         SRL   RW2,DX4                   RIGHT-JUSTIFY B                31730021
       TM    S6BNO,S6WON                HAS B1 BEEN INITIALIZED         31740021
       BC    ONES,R6230                   YES                           31750021
       OI    S6BNO,S6WON                NO,SET 1                        31760021
       STC   RW2,C6B1S                  INIT B1                         31770021
       STH   RW1,C6D1S                  INIT D1                         31780021
       CH    RW1,H4096                                                  31790021
       BC    NOTLO,R6225           WILL OVERFLOW 4096 SO CORRECT        31800021
       BC    UNCOND,R6010               PROCESS NEXT ELEMENT            31810021
R6230  STC   RW2,C6B2S                  INIT B2                         31820021
       STH   RW1,C6D2S                  INIT D2                         31830021
       OI    S6PLNO,S6WON               SET 1                           31840021
       CH    RW1,H4096                                                  31850021
       BC    NOTLO,R6235           WILL OVERFLOW 4096 SO CORRECT        31860021
       BC    UNCOND,R6010               PROCESS NEXT ELEMENT            31870021
R6225    TM    GTOVFL,GTOVFLON     DID EITHER GLOBTBL OVERFLOW          31880021
       BC    NOTZER,R6600          GET GLOBAL TABLE OVERFLOW CELL       31890021
       LH    RW1,SAVOVF                                                 31900021
       STH   RW1,C6D1S                                                  31910021
       BC    UNCOND,R6520          TAKE CARE OF GREATER THAN 4096       31920021
R6235    TM    GTOVFL,GTOVFLON     DID EITHER GLOBTBL OVERFLOW          31930021
       BC    NOTZER,R6601          GET GLOBAL TABLE OVERFLOW CELL       31940021
       LH    RW1,SAVOVF                                                 31950021
       STH   RW1,C6D2S                                                  31960021
       BC    UNCOND,R6540          TAKE CARE OF GREATER THAN 4096       31970021
*                                  ALTERNATE ENTRY TO R6210 CODE        31980021
R6220  DS    0H                                                         31990021
       STH   RW2,C6WRK0                                                 32000021
         BC    UNCOND,R6222        CONTINUE WITH BDISP ELT              32010021
       SPACE 2                                                          32020021
*      FORMAT //AC//  USE P6LNG AS LENGTH FIELD OF INSTR                32030021
*                                                                       32040021
R6240  DS    0H                                                         32050021
       LH    RW2,P6LNG                                                  32060021
R6242  STC   RW2,C6RS                                                   32070021
       BC    UNCOND,R6010          GET NEXT ELT                         32080021
       SPACE 5                                                          32090021
*=1                                BL ELEMENT                           32100021
*        FORMAT  //5C  OI  KK //                                        32110021
*                                                                       32120021
*              WHERE I=0  BL-I                                          32130021
*                      1  BLL                                           32140021
*                      4  SBL-I                                         32150021
*                   KK=PARTICULAZ BL OF ABOVE TYPE                      32160021
*                                                                       32170021
R6260  DS    0H                                                         32180021
       OI    GTOVFL,TSGTR                                               32190021
       LA    RW3,R6272                                                  32200021
       SR    RW1,RW1                    CLEAR REGISTER                  32210021
       IC    RW1,A6BLK        K OF ADDR ATTR                            32220021
       BCTR  RW1,R0                SUBTRACT 1                           32230021
         SLL   RW1,DX2                   LENGTH OF A BL IS 4 BYTES      32240021
         SPACE 3                                                        32250021
*                                                                       32260021
*      FOR BL, DETERMINE TYPE, GET DISP FROM COMTBL AND INSERT          32270021
*      REG 13 FOR BASE                                                  32280021
*                                                                       32290021
         CLI   A6BLI,XX00                                               32300021
       BC      EQ,BLTIBL    BL-I                                        32310021
         CLI   A6BLI,XX01                                               32320021
       BC      EQ,BLTBLL    BLL                                         32330021
         CLI   A6BLI,XX04                                               32340021
       BC      EQ,BLTISB    SBL-I                                       32350021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           32360021
         SPACE 3                                                        32370021
*                                                                       32380021
BLTIBL DS      0H                                                       32390021
       LA    RW2,XBLIC-XSYMC       SYMBOLIC FOR BL-I                    32400021
       AH      RW1,BLCTR    START OF BL CELLS IN TGT OR SGT             32410021
       BC    UNCOND,R6265          GO CREATE SYMBOLIC OPERANDS          32420021
         SPACE 3                                                        32430021
*                                                                       32440021
*      BLL--USE BLLCTR                                                  32450021
*                                                                       32460021
BLTBLL DS      0H                                                       32470021
         SPACE 4                                                        32480021
       LA      RW2,XBLLC-XSYMC    TO PICK UP SYMBOLICS                  32490021
       AH      RW1,BLLCTR   START OF BLL CELLS                          32500021
       BC    UNCOND,R6265          GO CREATE SYMBOLIC OPERANDS          32510021
BLTISB DS      0H                                                       32520021
       LA      RW2,XSBLC-XSYMC    TO PICK UP SYMBOLICS                  32530021
       AH      RW1,SBLCTR   START OF SBL CELLS                          32540021
R6265  DS    0H                                                         32550021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     32560021
*      CREATE SYMBOLIC OPERANDS                                         32570021
       A       RW2,AXSYMC                                               32580021
       TM    S6BNO,S6WON                                                32590021
       BC    ONES,R6268            B1 HAS BEEN INITIALIZED              32600021
         MVC   SB1D1N+NX3(LX1),A6BLK                                    32610021
         MVC   SB1D1C(LX4),DX0(RW2)                                     32620021
       BCR   UNCOND,RW3            COMPLETE THIS PASS R6272             32630021
R6268  DS    0H                                                         32640021
         MVC   SB2D2N+NX3(LX1),A6BLK                                    32650021
         MVC   SB2D2C(LX4),DX0(RW2)                                     32660021
       BCR   UNCOND,RW3            COMPLETE THIS PASS R6272             32670021
*=L                                                                     32680021
R6270  DS      0H                                                       32690021
R6272  DS    0H                                                         32700021
       L     RW2,C6M4         INSERT REG 13 FOR BASE                    32710021
       BC      UNCOND,R6220 GO TO CREATE BN AND DN                      32720021
*                                                                       32730021
USER15 DS    0H                                                         32740021
       L     RW2,C6M4A                                                  32750021
       BC    UNCOND,R6220          GO CREATE BN AND DN                  32760021
*                                                                       32770021
       SPACE 5                                                          32780021
*=1                                PN ELEMENT                           32790021
*      FORMAT  // 4C NNNN //                                            32800021
*                                                                       32810021
*              WHERE NNNN IS PN=                                        32820021
*      FROM PN= GET RPN=, THEN COMPUTE ITS DISP FROM PGT AND USE RE     32830021
*      IF RGNSW ON ALL REFERENCES TO GNS OR PNS MUST ALREADY BE         32840021
*      RELATIVE                                                         32850021
R6300  DS    0H                                                         32860021
       OI    GTOVFL,PGTR                                                32870021
         MVC   C6WRK0(LX2),A6PNNO                                       32880021
       LH    RW1,C6WRK0                                                 32890021
         CLI   RGNSW,INITOFF       AREN'T WE PROCESSING INIT CODE       32900021
       BC    EQ,R6304              REL GN SW IS ZERO                    32910021
R6303B DS    0H                                                         32920021
       LR    RW3,RW1                    SAVE NO FOR LISTING             32930021
       BCTR  RW1,R0                SUBTRACT 1                           32940021
         SLL   RW1,DX2                                                  32950021
       AH    RW1,PNCTR                                                  32960021
       BC    UNCOND,R6303D         CONTINUE                             32970021
R6304  DS    0H                                                         32980021
       L     R15,AGETPN                                                 32990021
       BALR  RS1,R15               GET PN NUMBER                        33000021
       BC    ZERO,ERR040      RW1=LOC IN PGT ON RETURN                  33010021
R6303D CH    RW1,GNCTR                                                  33020021
       BC    LOW,R6317             PGT ADDR LT GN                       33030021
       L     RW2,XGNC                                                   33040021
       SH    RW3,RGNCTR                 USE REL GN FOR LISTING          33050021
       BC    UNCOND,R6318          R1 WILL POINT TO R6315               33060021
*                                                                       33070021
R6317  DS    0H                                                         33080021
       TM    PHZSW1,XREF           IS XREF OPTION SPECIFIED             33090021
       BC    ZERO,R6316            NO,BR                                33100021
         CLI   RGNSW,RGNINIT       ARE WE PROCESSING INIT CODE          33110021
         BC    EQ,R6316      YES, DON'T PRODUCE XREF ELEMEMT            33120021
         TM    QRTNSW,QRTNON       ARE WE PROCESSING Q-RTNS             33130021
         BC    ONES,R6316          YES, DON'T PRODUCE XREF ELEMENT      33140021
       LA    RS1,R6316             SPECIFY RET ADDR FOR IN-LINE RTN     33150021
R6317A   DS  0H                                                         33160021
         MVI   C6WRK0,INITOFF                                           33170021
R63179   MVC   C6WRK0+NX1(LX2),A6PNNO GET PN NUMBER                     33180021
         OI    XFCDNO,HION         INDICATE-THIS PN REF CRD NUMB        33190021
R63180   LA    R3,DX5               SPECIFY LENGTH OF REF ELMNT         33200021
       LA    R2,C6WRK0             SPECIFY ADDR OF ELEMNT               33210021
         MVC   C6WRK0+NX3(LX2),XFCDNO GET CARD NUMBER(REF)              33220021
       BALR  R0,RB2                BR TO PH0                            33230021
       DC    X'13'                 WRITE ON UT3                         33240021
       BR    RS1                   RETURN OR FALL THRU                  33250021
R6316  DS    0H                                                         33260021
       L     RW2,XPNC                                                   33270021
R6318  LA    R1,R6315                                                   33280021
R6307  DS    0H                                                         33290021
         SPACE 4                                                        33300021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     33310021
*      SET UP SYMBOLIC OPERANDS                                         33320021
*                                                                       33330021
       TM    S6BNO,S6WON                                                33340021
       BC      ONES,R6320          B1 HAS BEEN INITIALIZED              33350021
       ST    RW3,SB1D1N                                                 33360021
       ST    RW2,SB1D1C                                                 33370021
       BC      UNCOND,R6310        JUST INIT B1, CONTINUE               33380021
R6320  ST    RW3,SB2D2N                                                 33390021
       ST    RW2,SB2D2C                                                 33400021
*=L                                                                     33410021
R6310    EQU   *                                                        33420021
         BCR   UNCOND,R1           IN-LINE RETURN TO R6315              33430021
R6315  DS    0H                                                         33440021
       L     RW2,C6M5         INSERT REG 12 FOR BASE                    33450021
       BC    UNCOND,R6220               TO CREATE BN AND DN             33460021
       SPACE 5                                                          33470021
*=1                                GN ELEMENT                           33480021
*      FORMAT  // 50 NNNN //                                            33490021
*              WHERE NNNN IS GN=                                        33500021
*      FROM GN= GET RELATIVE GN= OR EQUATED PN= TO COMPUTE DISP FRO     33510021
*      PGT, USE REG 12 AS BASE                                          33520021
R6325  DS    0H                                                         33530021
       OI    GTOVFL,PGTR                                                33540021
         MVC   C6WRK0(LX2),A6GNNO                                       33550021
       LH    RW1,C6WRK0                                                 33560021
         CLI   RGNSW,INITOFF       AREN'T WE PROCESSING INIT CODE       33570021
       BC    NOTEQ,R6303B          RELATIVE GN SW ON, DO PN CODE        33580021
       L     R15,AGETPN                                                 33590021
       USING GETPN,R15                                                  33600021
       BAL   RS1,GETGN             GO GET PN NUMBER                     33610021
       DROP  R15                                                        33620021
       BC    ZERO,ERR040           ERROR EXIT                           33630021
       BC    UNCOND,R6303D       RW1 = RELLOC IN PGT, RW3 = RGN OR      33640021
       SPACE 5                                                          33650021
*=1                                    VN ELEMENT                       33660021
*      FORMAT  //54 NNNN //                                             33670021
*      WHERE NNNN=VN=                                                   33680021
R6350  DS    0H                                                         33690021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 33700021
         BC    NOTEQ,R6360         YES, BRANCH                          33710021
R63501 DS    0H                                                         33720021
       OI    GTOVFL,TSGTR                                               33730021
       LH    R0,VNLOC                                                   33740021
       L     RW2,XVNC                                                   33750021
       LA    R1,R6270                                                   33760021
R6351    CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 33770021
         BC    NOTEQ,R6353         YES, USE POSITION OF VN INSTEAD      33780021
*                                                                       33790021
R6352    MVC   C6WRK0(LX2),A6VNNO                                       33800021
       LH    RW1,C6WRK0                                                 33810021
R6353  LR    RW3,RW1               GET VN= IF PROGRAM NOT SEGMENTED     33820021
*                                  POSITION OF VN= IN VNPTY IS SEGM     33830021
         BCTR  RW1,R0              COMPUTE DISPLACEMENT                 33840021
         SLL   RW1,DX2                                                  33850021
       AR    RW1,R0                                                     33860021
*      REST OF PROCESSING IDENTICAL TO PNREF                            33870021
       BC    UNCOND,R6307          GO FINISH WITH PNREF CODING          33880021
         SPACE 3                                                        33890021
*                                                                       33900021
*   VN REF PROCESSING IF PROGRAM IS SEGMENTED.TO COMPUTE THE DISPL      33910021
*   FROM THE BEGINING OF TGT THE POSITION OF THE VN NUMBER IN THE V     33920021
*   TABLE WILL BE USED                                                  33930021
*                                                                       33940021
R6360    CLI   SPVNRF,INITOFF      IS VN NUMBER TO BE USED              33950021
         LH    RW1,INITVN         NEW COUNT OF VN'S                     33960021
       BNE   R63501                USE VN NMBR ONE                      33970021
       L     R1,AVNPTY             USE POSITION OF VN 1 IN VNPTY TBL    33980021
       L     R15,ATABLE            GET ADDR OF TABLES SUBRTN            33990021
       BALR  RS1,R15               UPON RETURN R1=TBL ADDR,R2=SIZE      34000021
       SR    RW1,RW1               INITIALIZE VN POSITION CTR           34010021
R6362    CLC   DX1(LX2,R1),A6VNNO    DO VN NUMBERS MATCH                34020021
         LA    RW1,DX1(RW1)         BUMP POSITION CTR                   34030021
         LA    R1,DX3(R1)           POINT TO NEXT ENTRY IN VNPTY TBL    34040021
         BC    NOTEQ,R6362         NO MATCH, TRY NEXT ENTRY             34050021
       B     R63501                VN NUMBERS MATCH-BR                  34060021
       SPACE 5                                                          34070021
*        FORMAT    // 90    VNI REFERENCE                               34080021
GENVNI DS    0H                                                         34090021
       OI    GTOVFL,PGTR                                                34100021
       LH    R0,VNILOC                                                  34110021
       L     RW2,XVNIC                                                  34120021
       LA    R1,R6315                                                   34130021
       BC    UNCOND,R6352          GO FINISH WITH VNREF CODING          34140021
       SPACE 5                                                          34150021
*=1                                ADR ELEMENT                          34160021
*      FORMAT  //78 IDDD KK TTTTTT //                                   34170021
*              WHERE I=0   BL-I                                         34180021
*                     1   BLL                                           34190021
*                     2   BLS                                           34200021
*                     4   SBL-I                                         34210021
*                     6   SUBSCRIPT CELL (NOT A BL TYPE)                34220021
*                     3   SEE NOTE                                      34230021
*                                                                       34240021
*                   KK=NO OF CELL OF ABOVE TYPE                         34250021
*                   DDD=DISP OF ITEM FROM ADDR IN SPECIFIED CELL        34260021
*                   TTTTTT=DICTIONARY PTR   BITS 0-1  UNUSED            34270021
*                                                2-14 DICT SEGMENT      34280021
*                                                15-23 DISP IN SEGM     34290021
*                                                                       34300021
*      IN GENERAL, AN ADR ELT IS USED TO REFER TO A DATA NAME. THE      34310021
*      TECHNIQUE IS TO LOAD A REGISTER WITH THE BASE LOCATER (OR        34320021
*      SUBSCRIPT CELL) SPECIFIED (AT OBJECT TIME THAT IS) AND THEN      34330021
*      TO REFER TO THAT DATA NAME THROUGH THE DISP GIVEN IN THE ADR     34340021
*      ELEMENT AND THE GENERAL REGISTER JUST LOADED.                    34350021
*                                                                       34360021
*      THE DICTIONARY POINTER IS USED AS A SYMBOLIC OPERAND IN THE      34370021
*      LISTING AND HAS A CORRESPONDENCE TO THE ITEM IN THE GLOSSARY     34380021
*                                                                       34390021
*      NOTE-IF I=3, THE MEANING IS THAT THE ADDRESS OF THE DATA NAM     34400021
*      HAS ALREADY BEEN LOADED INTO A REGISTER. IN THIS CASE THE DA     34410021
*      NAME IS REFERRED TO BY MEANS OF A ZERO DISP FROM THE REGISTE     34420021
*      SPECIFIED IN THE LOW-ORDER 4-BITS OF DDD.                        34430021
*                                                                       34440021
R6400  DS    0H                                                         34450021
       OI    PLUSFT,S6WON                                               34460021
R6410  IC      RW2,A6ADRI   GET I                                       34470021
       N     RW2,C6M10                                                  34480021
         SRL   RW2,DX4         ADJUST TO LOW HEX DIGIT                  34490021
       STC   RW2,GOTCOD                                                 34500021
         CLI   GOTCOD,XX03                                              34510021
       BC      EQ,R6498           GO TO PROCESS SUBSCRIPTING            34520021
         CLI   GOTCOD,XX0B                                              34530021
       BC    EQ,R6498              GO PROCESS SUBSCRIPTING              34540021
         CLI   GOTCOD,XX0A          CHANGE TO CONFORM                   34550021
       BC    NOTEQ,R6411B          NOT X'0A' SO OK FOR REG ASSIGN       34560021
         MVI   GOTCOD,XX02                                              34570021
R6411B DS    0H                                                         34580021
         EJECT                                                          34590021
*------      REGISTER ASSIGNMENT                                        34600021
*------                                                                 34610021
*------                                                                 34620021
         MVC   BLELT(LX1),GOTCOD                                        34630021
         MVC   BLELT+NX1(LX1),A6ADRK                                    34640021
       L     R15,ASRCHR        FIND AN AVAILABLE REG                    34650021
       BALR  RS1,R15               GO FIND REG                          34660021
         CLI   LOADSW,INITOFF      DON'T WE NEED TO GEN LOAD INST       34670021
       BC    NOTEQ,R6419A     NOT ALREADY LOADED                        34680021
R6411  STC   RW3,C6WRK1                                                 34690021
*      SET UP    C6WRK0=RDDD                                            34700021
         MVC   C6WRK0(LX2),A6ADRI                                       34710021
         MVZ   C6WRK0(LX1),C6WRK1                                       34720021
       BC    UNCOND,R6494A         GO SET UP SYMBOLIC OPERANDS          34730021
R6419A DS    0H                                                         34740021
         NI    LOADSW,INITOFF      RESET-DON'T NEED TO GEN LOAD         34750021
         MVC   C6INSV(LX9),C6OP     SAVE CURRENT INSTR                  34760021
         MVC   SBDSAV(LX20),SB1D1C   AND SYMBOLIC OPERANDS              34770021
         MVC   SB1D1C(LX20),SBDINI   REINITIALIZE SYMBOLIC OP AREA      34780021
         MVI   C6OP,XX58                 FOR CURRENT OP OF L            34790021
       STC   RW3,C6RS                                                   34800021
*------                                                                 34810021
*------                                                                 34820021
*------                                                                 34830021
R6420  SR    RW1,RW1                    CLEAR REGISTER                  34840021
       IC    RW1,A6ADRK                 BASE LOCATOR NUMBER             34850021
       L     R15,AGENLD                                                 34860021
       BALR  RS1,R15               LOAD REG SPECIFIED                   34870021
         MVC   C6WRK0(LX2),A6ADRI   WORD FOR CONVERSION                 34880021
         MVZ   C6WRK0(LX1),C6RS     REG USED FOR B                      34890021
         MVC   C6OP(LX9),C6INSV     RESTORE CURRENT INSTR               34900021
         MVC   SB1D1C(LX20),SBDSAV   AND SYMBOLIC OPERANDS              34910021
R6494A DS    0H                                                         34920021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     34930021
*      SET UP SYMBOLIC OPERANDS                                         34940021
         CLC   A6ADRP,C6FFF        ALL F'S IN DICTIONARY PTR MEANS      34950021
         BC    NOTEQ,R6494B      NOT ALL F                        43941 34960021
         NI    PLUSFT,S6INIT00     RESET PLUS ELT SWITCH          43941 34970021
         BC    UNCOND,R6215         DONT PRINT ALL F DICT PTR     43941 34980021
R6494B   DS    0H                                                 43941 34990021
         BAL   RS1,TDNR10         GO DO XREF REF IF REQUIRED       PM12 35000021
         TM    PHZSW,NOLIST                                        PM12 35010021
         BC    ZERO,R6215         NO MAP - DON'T FORMAT PRINT LINE PM12 35020021
*                FOLLOWING 2 INSTS MUST NOT BE SEPARATED                35030021
       L       RW2,AXSYMC                                               35040021
       USING   XSYMC,RW2                                                35050021
       TM    S6BNO,S6WON                                                35060021
       BC      ONES,R6495          B1 HAS BEEN INITIALIZED              35070021
         MVC   SB1D1N+NX1(LX3),A6ADRP DICT PTR                          35080021
         MVC   SB1D1C(LX4),XDNC                                         35090021
       BC    UNCOND,R6496          B1 JUST INIT CONTINUE                35100021
R6495    MVC   SB2D2N+NX1(LX3),A6ADRP                                   35110021
         MVC   SB2D2C(LX4),XDNC                                         35120021
       DROP    RW2                                                      35130021
R6496  DS    0H                                                         35140021
       TM    PLUSFT,S6WON                                               35150021
       BC    ZERO,R6215       NO PLUS ELT FOLLOWING                     35160021
       LH    RW1,C6WRK0       SAVE BDISP CALCULATED IN RW1              35170021
         NI    PLUSFT,S6INIT00     RESET-NOT ADR WITH PLUS ELT          35180021
*      PLUS AFTER ADR ELT HAS ALREADY BEEN INCLUDED IN D ADDR PARAM     35190021
*      AND IS ONLY PROCESSED HERE FOR SYMBOLIC REFERENCE                35200021
         NI    C6WRK0,INITOFF                                           35210021
         MVC   C6WRK0+NX1(LX3),A6ADIN                                   35220021
       L     RW2,C6WRK0                                                 35230021
       TM    S6BNO,S6WON                                                35240021
       BC    ONES,R6497            B1 HAS BEEN INITIALIZED              35250021
       ST    RW2,SB1D1P                                                 35260021
         BC    UNCOND,R6217        CONTINUE WITH BDISP CODING           35270021
R6497  DS    0H                                                         35280021
       ST    RW2,SB2D2P                                                 35290021
         BC    UNCOND,R6217        CONTINUE WITH BDISP CODING           35300021
*=L                                                                     35310021
*                                                                       35320021
*      USE REGISTER SPECIFIED (IT HAS ALREADY BEEN SET) INSTEAD         35330021
*      OF NORMAL LOAD REG-REG IS IN LOW ORDER 4 BITS OF D-FIELD         35340021
*                                                                       35350021
R6498  DS      0H                                                       35360021
       IC    RW2,A6ADRD       REGISTER                                  35370021
       N     RW2,C6M2                                                   35380021
         SLL   RW2,DX12                                                 35390021
         CLC   A6ADRP,C6FFF        ALL F'S IN DICT PTR MEANS      58979 35400021
         BC    EQ,R6499            DON'T PRINT IT                 58979 35410021
         ST    RW2,RW2SAV          SAVE REGISTER 7                58979 35420021
         BAL   RS1,TDNR10          GO DO XREF IF REQUIRED         58979 35430021
         L     RW2,RW2SAV          RESTORE REGISTER 7             58979 35440021
R6499    DS    0H                                                 58979 35450021
       SR    RW1,RW1          DISP = 0                                  35460021
       BC      UNCOND,R6220 GO TO CREATE BN AND DN                      35470021
         SPACE 3                                                        35480021
*                                                                       35490021
*              PRODUCE XREF ELT IF REQUIRED                             35500021
*                                                                       35510021
TDNR10 DS    0H                                                         35520021
       LR    RW1,RS1                                                    35530021
       TM    PHZSW1,XREF           IS XREF OPTION SPECIFIED             35540021
       BCR   ZERO,RS1              NO,RETURN                            35550021
         TM    QRTNSW,QRTNON       ARE WE PROCESSING QRTNS              35560021
         BCR   ONES,RS1             YES, DON'T PRODUCE XREF             35570021
         CLI   RGNSW,RGNINIT       ARE WE PROCESSING INIT CODE          35580021
         BCR   EQ,RS1        YES, DON'T PRODUCE XREF ELEMEMT            35590021
         L     RW2,C6WRK0          SAVE BDDD                            35600021
         MVC   C6WRK0(LX3),A6ADRP   GET DICT PTR                        35610021
         NI    XFCDNO,XX7F            TURN OFF HI BIT              0657 35620021
       BAL   RS1,R63180            WRITE REF ELMNT                      35630021
         ST    RW2,C6WRK0          RESTORE BDDD                         35640021
       BR    RW1                   RETURN                               35650021
         EJECT                                                          35660021
*        FORMAT    //80 NNNNNN //   PLUS ELEMENT                        35670021
*        WHERE    NNNNNN= VALUE TO MODIFY AN ADDR                       35680021
R6500  DS    0H                                                         35690021
         MVI   C6WRK0,INITOFF                                           35700021
         MVC   C6WRK0+NX1(LX3),A6PLIN INCREMENT TO AREA FOR L           35710021
R6502  DS    0H                                                         35720021
         TM    A6PLIN,HION                                              35730021
       BC    ZERO,R6505            NO, SKIP                             35740021
         MVI   C6WRK0,ALLON        MAKE COMPLEMENT SO SUBTRACT          35750021
R6505  DS    0H                                                         35760021
       L     RW1,C6WRK0                 FULL INCREMENT                  35770021
       LR    RW2,RW1                                                    35780021
       TM    S6PLNO,S6WON               SHOULD INCREMENT MODIFY D2      35790021
       BC    ONES,R6510                   YES                           35800021
       AH    RW1,C6D1S                    NO,D1                         35810021
       STH   RW1,C6D1S                  FOR UPDATED D1                  35820021
*=L    CODING FROM HERE TO NEXT *=L CARD NOT EXECUTED IF NOLIST MOD     35830021
       ST    RW2,SB1D1P       FOR SYMBOLIC OPERAND                      35840021
       IC    RW2,C6B1S                                                  35850021
       C     RW1,C6M6                                                   35860021
       BC    HI,R6520         DISP GREATER THAN 4095                    35870021
*=L                                                                     35880021
       BC    UNCOND,R6010               PROCESS NEXT ELEMENT            35890021
R6510  AH    RW1,C6D2S                  D2                              35900021
       STH   RW1,C6D2S                  FOR UPDATED D2                  35910021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             35920021
       ST    RW2,SB2D2P       FOR SYMBOLIC OPERAND                      35930021
       IC    RW2,C6B2S                                                  35940021
       C     RW1,C6M6                                                   35950021
       BC    HI,R6540         DISP GREATER THAN 4095                    35960021
*=L                                                                     35970021
       BC    UNCOND,R6010               PROCESS NEXT ELEMENT            35980021
         SPACE 5                                                        35990021
*      FORMAT //A8//  USE P6PLUS AS PLUS ELT                            36000021
*                                                                       36010021
R6512  DS    0H                                                         36020021
         MVC   C6WRK0(LX4),P6PLUS                                       36030021
       BC    UNCOND,R6502          DO PLUS ELT CODING                   36040021
         EJECT                                                          36050021
*                                                                       36060021
*      DISP GREATER THAN 4095--GENERATE CODING TO ADD 4095 TO           36070021
*                              CONTENTS OF BASE AND SUBTRACT 4095       36080021
*                              FROM DISP FOR THIS INSTR                 36090021
*                            --GET A FREE REG (OR ONE USED IN THIS      36100021
*                              INSTR IF NON-PERM) TO ADJUST             36110021
R6520  DS    0H                                                         36120021
         CLI   C6B1S,REG14                                              36130021
R6521  BC    LO,R6532              BASE REG LT 14                       36140021
       BC    HI,R6534              BASE REG 15                          36150021
       TM    STAT14,AVAIL5    14 USED HERE BUT MAY BE RESERVED BY P     36160021
       BC    ONES,R6538            R14 AVAIL                            36170021
       OI    STAT14,AVAIL6                                              36180021
         LA    RW2,REG14                                                36190021
       XC    CELL14,CELL14                                              36200021
       NI    STAT14,PGTOFF                                              36210021
R6522  DS    0H                                                         36220021
       IC    RW3,C6B2S                                                  36230021
       TM    S6PLNO,S6WON          SHOULD INCREMENT MODIFY D2           36240021
       BC    ONES,R6524            YES                                  36250021
       IC    RW3,C6B1S                                                  36260021
R6524    SLL   RW3,DX4                                                  36270021
         MVC   C6INSV(LX9),C6OP                                         36280021
         MVC   SBDSAV(LX20),SB1D1C                                      36290021
         MVC   SB1D1C(LX20),SBDINI                                      36300021
       STC    RW3,C6RS                                                  36310021
       STC   RW2,C6B1S                                                  36320021
         MVI   C6OP,XX41                                                36330021
         MVC   C6D1S(LX2),C6M6+NX2                                      36340021
       L     R15,AS6800                                                 36350021
       BALR  RS1,R15               FORMAT AND PRINT LINE                36360021
       SR    RW3,RW3                                                    36370021
       IC    RW3,C6RS                                                   36380021
         SRL   RW3,DX4                                                  36390021
         MVC   C6OP(LX9),C6INSV                                         36400021
         MVC   SB1D1C(LX20),SBDSAV                                      36410021
       TM    S6PLNO,S6WON          SHOULD INCREMENT MODIFY D2           36420021
       BC    ONES,R6528            YES                                  36430021
       STC   RW3,C6B1S                                                  36440021
       LH    RW1,C6D1S                                                  36450021
       S     RW1,C6M6                                                   36460021
       STH   RW1,C6D1S                                                  36470021
       L     RW1,SB1D1P                                                 36480021
       C     RW1,C6M6                                                   36490021
       BC    HI,R6526              MORE THAN 4095 SO SUBTACT            36500021
       SR    RW1,RW1                                                    36510021
R6525  ST    RW1,SB1D1P                                                 36520021
       BC    UNCOND,R6010          GET NEXT ELT                         36530021
R6526  DS    0H                                                         36540021
       S     RW1,C6M6              SUBTRACT 4095 FROM DISPLACEMNT       36550021
       BC    UNCOND,R6525          GO SAVE AND EXIT                     36560021
R6528  DS    0H                                                         36570021
       STC   RW3,C6B2S                                                  36580021
       LH    RW1,C6D2S                                                  36590021
       S     RW1,C6M6                                                   36600021
       STH   RW1,C6D2S                                                  36610021
       L     RW1,SB2D2P                                                 36620021
       C     RW1,C6M6                                                   36630021
       BC    HI,R6530              MORE THAN 4095 SO SUBTACT            36640021
       SR    RW1,RW1                                                    36650021
R6529  ST    RW1,SB2D2P                                                 36660021
       BC    UNCOND,R6010          GET NEXT ELT                         36670021
R6530  S     RW1,C6M6              SUBTRACT 4095 FROM DISPLACEMNT       36680021
       BC    UNCOND,R6529          GO SAVE AND EXIT                     36690021
R6532  DS    0H                                                         36700021
       TM    STAT14,AVL56                                               36710021
       BC    ZERO,R6537            GO MARK AVAIL R14                    36720021
       BC    UNCOND,R6539          GO MARK AVAIL R15                    36730021
R6534  DS    0H                                                         36740021
       TM    STAT15,AVAIL5                                              36750021
       BC    ONES,R6536            R15 IS AVAIL                         36760021
R6534A DS    0H                                                         36770021
       OI    STAT15,AVAIL6                                              36780021
         LA    RW2,REG15                                                36790021
       XC    CELL15,CELL15                                              36800021
       NI    STAT15,PGTOFF                                              36810021
       BC    UNCOND,R6522          CONTINUE WITH CODING                 36820021
R6536  DS    0H                                                         36830021
R6537    LA    RW3,REG14                                                36840021
       OI    STAT14,AVAIL6                                              36850021
       BC    UNCOND,R6524          CONTINUE WITH CODING                 36860021
R6538  DS    0H                                                         36870021
R6539    LA    RW3,REG15                                                36880021
       OI    STAT15,AVAIL6                                              36890021
       BC    UNCOND,R6524          CONTINUE WITH CODING                 36900021
*                                                                       36910021
R6540    CLI   C6B2S,REG14                                              36920021
       BC    UNCOND,R6521          ALTERNATE ENTRY TO R6520             36930021
       SPACE 5                                                          36940021
*      GET GLOBAL TABLE OVERFLOW CELL                                   36950021
*                                                                       36960021
R6600  DS    0H                                                         36970021
         NI    BDNUM,BDNUM1        PROCESSING B1 D1                     36980021
         BC    UNCOND,R6602        SKIP SETTING ON BDNUM                36990021
R6601    OI    BDNUM,BDNUM2        PROCESSING B2 D2                     37000021
R6602  EQU   *                                                          37010021
       L     R15,AGLDOV                                                 37020021
       BALR  RS1,R15               GEN LOAD GLOBAL TBL OVERFLOW C       37030021
         BC    UNCOND,R6010        GET NEXT ELT                         37040021
       SPACE 2                                                          37050021
*        FORMAT  //68 NNNN //   LITERAL REFERENCE                       37060021
*        WHERE  NNNN= LITERAL NUMBER                                    37070021
*      TO PROCESS LITERAL REFERENCE, GET DISP FOR THIS LITERAL          37080021
*    AND USE R12 AS A BASE. LTL=N IS CALLED LITERAL REFERENCE NO.  LITS 37090021
*                                                                       37100021
LTLPRO DS    0H                                                         37110021
       OI    GTOVFL,PGTR                                                37120021
         CLI   VIRTSW,INITOFF      HAS VIRTBL BEEN MADE(NOT KILLD       37130021
       BC    EQ,R6554              THERE IS A LTLTBL                    37140021
       LH    RW1,LTLCTR                                                 37150021
       SR    RW3,RW3                                                    37160021
       BC    UNCOND,R6556          SET UP SYMBOLIC OPERANDS             37170021
R6554  DS    0H                                                         37180021
       L     R1,ALTLTB                                                  37190021
       L     R15,ATABLE                                                 37200021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              37210021
         MVC   LTRFCT,A6LTLR      GET LITERAL NO.                  LITS 37220021
         LH    RW2,LTRFCT          GET LITERAL NO.                 LITS 37230021
         BCTR  RW2,R0              DECREMENT LIT # FOR INDEXING         37240021
         SLL   RW2,DX1         * 2 FOR INDEX VALUE                      37250021
         LH    RW1,DX0(RW2,R1)                                          37260021
         N     RW1,HWFS                MASK OUT HI ORDER 16 BITS  53557 37270021
       LR    RW3,RW1                                                    37280021
       SH    RW3,LTLCTR                                                 37290021
*                                                                       37300021
*      SET UP SYMBOLIC OPERANDS                                         37310021
R6556  DS    0H                                                         37320021
       L     RW2,XLITC                                                  37330021
       BC    UNCOND,R6318          SET UP BDISP                         37340021
       SPACE 5                                                          37350021
*        FORMAT  //58 NNNN//     VIRREF ELEMENT                         37360021
R6700  DS    0H                       WHERE NN=VIR NUMBER               37370021
       OI    GTOVFL,PGTR                                                37380021
         CLI   VIRTSW,INITOFF      HAS VIRTBL BEEN MADE(NOT KILLD       37390021
       BC    EQ,R6710              THERE IS A LTLTBL                    37400021
       LH    RW1,VIRCTR                                                 37410021
       BC    UNCOND,R6725          SET UP SYMBOLIC OPERANDS             37420021
R6710  DS    0H                                                         37430021
         MVC   C6WRK0(LX2),A6VIRN                                       37440021
       LH    RW2,C6WRK0       GET REFERENCE NUMBER                      37450021
       BCTR  RW2,R0                SUBTRACT 1                           37460021
         SLL   RW2,DX1         INDEX VALUE                              37470021
       L     R1,AVIRPT                                                  37480021
       L     R15,ATABLE                                                 37490021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              37500021
         LA    RW1,DX0(RW2,R1)                                          37510021
       LH    RW2,VIRCTR       DISP OF VIRTUALS                          37520021
         LH    RW3,DX0(RW1)    DISP IN TABLE                            37530021
       N     RW3,C15BIT                                                 37540021
       L     R1,ALVIRT                                                  37550021
         TM    DX0(RW1),HION                                            37560021
       BC    ZERO,R6722       LINK TYPE                                 37570021
       AH    RW2,LNGLNK                                                 37580021
       L     R1,ACVIRT                                                  37590021
R6722  L     R15,ATABLE                                                 37600021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              37610021
       AR    R1,RW3            LOC OF BCD                               37620021
         TM    DX0(RW1),HION                                            37630021
       BC    ZERO,R6723            LINK TYPE                            37640021
         SRL   RW3,DX1                                                  37650021
R6723    LA    RW1,DX0(RW3,RW2) DISP FROM PGT START                     37660021
         MVI   C6WRK0,BLANK                                             37670021
       L     RW2,C6WRK0       NO SYMBOLICS FOR 'S6800'                  37680021
       TM    S6BNO,S6WON                                                37690021
       BC    ONES,R6724            B1 HAS BEEN INITIALIZED              37700021
         MVC   OU6SO1+NX2(LX8),DX0(R1)                                  37710021
         MVI   OU6SO1,VEE                                               37720021
         MVI   OU6SO1+NX1,LFTPAREN                                      37730021
         MVI   OU6SO1+NX10,RTPAREN                                      37740021
         BC    UNCOND,R6318        CONTINUE WITH BDISP CODING           37750021
R6724    MVC   OU6SO2+NX2(LX8),DX0(R1)                                  37760021
         MVI   OU6SO2,VEE                                               37770021
         MVI   OU6SO2+NX1,LFTPAREN                                      37780021
         MVI   OU6SO2+NX10,RTPAREN                                      37790021
         BC    UNCOND,R6318        CONTINUE WITH BDISP CODING           37800021
*      SET UP SYMBOLIC OPERANDS                                         37810021
R6725  DS    0H                                                         37820021
       L     RW2,XVIRC                                                  37830021
         LA    RW3,ONEBYTE                                              37840021
       BC    UNCOND,R6318          CONTINUE WITH BDISP CODING           37850021
       SPACE 5                                                          37860021
*        FORMAT  //60 TT DD //   GTREF1 ELEMENT                         37870021
*       WHERE TT= TYPE CODE; DD= DISP IN BYTES FROM SPECIFIED AREA      37880021
R6750  DS    0H                                                         37890021
       SR    RW1,RW1                                                    37900021
       IC    RW1,A6GT1D     DISP IN BYTES                               37910021
       SR    RW2,RW2                                                    37920021
       IC    RW2,A6GT1C     KIND OF CELL                                37930021
         AH    RW1,GT1KND-NX2(RW2)  DISP(CONSTANT)                      37940021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             37950021
*      SET UP SYMBOLIC OPERANDS                                         37960021
         SLL   RW2,DX1                                                  37970021
       A       RW2,AXGT1C                                               37980021
       TM    S6BNO,S6WON                                                37990021
       BC      ONES,R6760          B1 HAS BEEN INITIALIZED              38000021
         MVC   SB1D1N+NX3(LX1),A6GT1D                                   38010021
         MVC   SB1D1C(LX4),DX0(RW2)                                     38020021
       BC      UNCOND,R6270 GO TO SET REG 13 AS BASE                    38030021
R6760    MVC   SB2D2N+NX3(LX1),A6GT1D                                   38040021
         MVC   SB2D2C(LX4),DX0(RW2)                                     38050021
*=L                                                                     38060021
       BC    UNCOND,R6270   GO TO SET REG 13 AS B                       38070021
         EJECT                                                          38080021
*        FORMAT  //64  TT  NN //  GTREF2 ELEMENT                        38090021
*       WHERE TT= TYPE CODE; NN= IDENTIFYING NUMBER                     38100021
*      SET UP SYMBOLIC OPERANDS                                         38110021
R6800  DS    0H                                                         38120021
       SR      RW2,RW2                                                  38130021
       IC      RW2,A6GT2C                                               38140021
       LR    RW3,RW2                                                    38150021
       A       RW2,AXGT2C                                               38160021
       TM    S6BNO,S6WON                                                38170021
       BC      ONES,R6800B         B1 HAS BEEN INITIALIZED              38180021
         MVC   SB1D1C(LX4),DX0(RW2)                                     38190021
         MVC   SB1D1N+NX2(LX2),A6GT2N                                   38200021
       BC      UNCOND,R6800D       JUST INIT B1                         38210021
R6800B   MVC   SB2D2C(LX4),DX0(RW2)                                     38220021
         MVC   SB2D2N+NX2(LX2),A6GT2N                                   38230021
*=L                                                                     38240021
R6800D DS      0H                                                       38250021
         MVC   C6WRK0(LX2),A6GT2N  NUMBER OF CELL                       38260021
       LH    RW1,C6WRK0                                                 38270021
       BCTR  RW1,R0                SUBTRACT 1                           38280021
*                                                                       38290021
*                                                                       38300021
*      FOR EACH TYPE OF GT2REF DISP= (NO OF CELL -1)* LENGTH OF CEL     38310021
*      DISP=(NO OF CELL - 1)*(LENGTH OF CELL) + START OF GROUP          38320021
*      BASE=R13 EXCEPT IF DCBADR CELL                                   38330021
*           R12 IF DCBADR CELL                                          38340021
*                                                                       38350021
       SR    R1,R1                                                      38360021
       LR    RW2,RW3                                                    38370021
         SRL   RW2,DX2                                                  38380021
       IC    R1,R6804(RW2)   GET NO OF BYTES TO SHIFT                   38390021
       EX    R0,R6802          EX SHIFT (MULT) INSTR                    38400021
       EX    R0,R6806(RW3)                                              38410021
       OI    GTOVFL,PGTR                                                38420021
       CLI   A6GT2C,DCB                                                 38430021
       BC    EQ,R6315         GO TO INSERT R 12 FOR BASE                38440021
       MVI   GTOVFL,TSGTR                                               38450021
         CLI   A6GT2C,XX5C        IS IT INDX                      8953  38460021
         BC    NOTEQ,R6272          GO TO USE R13 AS BASE         8953  38470021
         L     R15,AGET                                           8953  38480021
         BALR  RS1,R15           GET B4 ELT                       8953  38490021
         STM   R0,R15,SAVEXR               SAVE REGS              8953  38500021
         BAL   RS1,MAC066A        DO XREF FOR INDX NM             8953  38510021
         LM    R0,R15,SAVEXR            RESTORE REGS              8953  38520021
         BC    UNCOND,R6272        GO USE R13 AS BASE             8953  38530021
R6802    SLL   RW1,DX0(R1)                                              38540021
R6804  DC    X'0201020202020002'        NO. BYTES TO SHIFT              38550021
       DC    X'0000000200020100'                                        38560021
         DC    X'0202020202000002'                                      38570021
       DC    X'02'                                                      38580021
*                                                                       38590021
*                                                                       38600021
         EJECT                                                          38610021
*=1  END OF FILE ON F3                                                  38620021
ENDF3  DS    0H                                                         38630021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 38640021
         BC    EQ,EOFNOS           NO, BRANCH                           38650021
         CLI   CURPTY,XX00          HAS EOF BEEN REACHED IN ROOT        38660021
         BC    EQ,EOFNOS           YES, BRANCH                          38670021
       L     R15,ASEGBR            GET ADDR OF SEGM CTRL RTN            38680021
       BR    R15                   RESTURN BACK TO SEGMENTATION COD     38690021
EOFNOS DS    0H                                                         38700021
         CLI   C6OP,NOPOPCD                                             38710021
       BC    EQ,NOPRT              THIS IS A CNOP, GO PROCESS           38720021
       L     R15,AS6800                                                 38730021
       BALR  RS1,R15               GO FORMAT AND PRINT LINE             38740021
NOPRT  EQU   *                                                          38750021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             38760021
         CLI   OU6LST,NOLIST       ANY LISTING TEXT LEFT IN LINE        38770021
       BC    EQ,ENDPTX             NO                                   38780021
       L     R15,APUT                                                   38790021
       BALR  RS1,R15               PRINT LAST OF LISTING IN LINE        38800021
*=L                                                                     38810021
       BC    UNCOND,ENDPTX         GO TO EOF FOR PROC A-TEXT            38820021
         EJECT                                                          38830021
ERR040   DS    0H             LOGIC                                     38840021
ERR080   EQU   *              ERROR                                     38850021
ERR110   EQU   *              DISCOVERED IN                             38860021
ERR250   EQU   *              PHASE 6                                   38870021
         MVI   P6ESW,ALLON                                              38880021
         MVI   OU6REC,BLANK                                             38890021
         MVC   OU6CDN(LX119),OU6REC                                     38900021
         L     R15,APUT                                                 38910021
         L     RS1,APUTM                                                38920021
         BALR  RS1,RS1            PRINT BLANK LINE                      38930021
*                                                                       38940021
         MVC   OU6CDN(LX64),MSGABA                                      38950021
         L     RS1,APUTM                                                38960021
         L     R15,APUT                                                 38970021
         BALR  RS1,RS1             PRINT MESSAGE                        38980021
         BALR  RS1,RS1            PRINT BLANK LINE                      38990021
         OI    SWITCH,NO6A              DON'T CALL 6A                   39000021
         L     RB1,ARB1B       SET UP BASE REG 8                  56990 39010021
         TM    PHZSW1,MAPSP        MAP SUPPRESS                         39020021
         BC    ZERO,ER6010         NO                                   39030021
         L     RB1,AFIRST                                               39040021
         USING FIRST,RB1                                                39050021
         BC    UNCOND,MSGMS        PRINT MAP SUPPRESSIMSG & STATS.      39060021
ER6010   DS    0H                                                       39070021
         L     R15,APRSTAT         PRINT STATISTICS                     39080021
         BALR  RS1,R15             GO PRINT STATISTICS                  39090021
ER6000   DS    0H                                                       39100021
         L     RB1,AFIRST                                               39110021
         USING FIRST,RB1                                                39120021
         BC    UNCOND,NOOPTST      RETURN TO PH0                        39130021
         DROP  RB1                                                      39140021
         USING RB1BAS,RB1                                               39150021
       EJECT                                                            39160021
*=1    FOR PNDEF, CREATE AN RLDTBL ENTRY                                39170021
*        FORMAT   //30 PP NNNN //                                       39180021
*        WHERE    PP=PRIORITY NUMBER OF SEG IN WHICH PN LOCATED         39190021
*                 NNNN= PN NUMBER                                       39200021
PNDEFR DS    0H                                                         39210021
         CLI   A6PNPR,INITOFF      IS THIS PN FOR ROOT SEGM             39220021
         BC    NOTEQ,PNDEF1        NO, BRANCH                           39230021
         CLI   FSTPND,INITOFF      IS THIS 1ST PN IN ROOT SEGMENT       39240021
         BC    NOTEQ,PNDEF1        NO, BRANCH                           39250021
         MVC   ROOTPN(LX2),A6PNNO  YES,SAVE PN NO.                      39260021
         MVI   FSTPND,ALLON        RESET FIRST PN SWITCH                39270021
PNDEF1 EQU   *                                                          39280021
       BAL   RS1,PNCLTP           CLEAR TEMP REGISTER ASSIGNMENTS       39290021
         MVC   C6WRK0(LX2),A6PNNO                                       39300021
       LH    RW1,C6WRK0                                                 39310021
       L     R15,AGETPN                                                 39320021
       BALR  RS1,R15            RW1=DISP IN PGT                         39330021
       BC    ZERO,SE6080           GET NEXT ELEMENT                     39340021
         MVI   OU6NAM,PEE                                               39350021
PN000  DS    0H                                                         39360021
*      GET RLDTBL ENTRY FROM TAMER                                      39370021
         BAL   RS1,RLDRTE          GET ADDRESS FOR INSERT IN RLDTBL     39380021
       A     RW1,LOCPGT                                                 39390021
       ST    RW1,C6WRK0     TARGET ADDR                                 39400021
         MVC   TARG(LX3,R2),C6WRK0+NX1                                  39410021
         MVC   RELC4(LX1,R2),CURPTY GET PRIORITY NUMBER                 39420021
         MVC   RELC(LX3,R2),LOCCTR+NX1 GET RELATIVE ADDR VALUE          39430021
         MVI   DX0(R2),NTYP          PN-GN TYPE                         39440021
PN010  EQU   *                                                          39450021
       TM    PHZSW,NOLIST                                               39460021
       BC    ZERO,SE6080           NOLIST, SO GET NEXT ELT              39470021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             39480021
         MVC   OU6NAM+NX1(LX3),PNMSG                                    39490021
       LR    RW1,RW3                                                    39500021
       L     R15,AS6200                                                 39510021
       USING S6200,R15                                                  39520021
       BAL   RS1,S6210             CONVERT                              39530021
         MVC   OU6NAM+NX4(LX0),C6WRK4 EX BY SUBR-PN OR GN NUMBER        39540021
       DROP  R15                                                        39550021
         MVC   OU6OPN(LX3),PNEQU                                        39560021
         MVI   OU6OPD,ASTER                                             39570021
         MVC   C6WRK0(LX4),LOCCTR LOCATION CTR TO LISTING LINE          39580021
       L     R15,AS6010                                                 39590021
       BALR  RS1,R15               CONVERT                              39600021
         MVC   OU6LC(LX6),C6WRK3                                        39610021
       L     R15,APUT                                                   39620021
       BALR  RS1,R15               PRINT LINE                           39630021
*=L                                                                     39640021
       BC    UNCOND,SE6080         GET NEXT ELT                         39650021
PNMSG  DC    C'N=0'                                                     39660021
PNEQU  DC    C'EQU'                                                     39670021
PNCLTP DS    0H                                                         39680021
       SR    R0,R0                CLEAR TEMPORARY REGISTER              39690021
       STH   R0,CELL14            REGISTER ASSIGNMENTS                  39700021
       STH   R0,CELL15                                                  39710021
       NI    STAT14,PGTOFF                                              39720021
       NI    STAT15,PGTOFF                                              39730021
         BCR   R15,RS1                RETURN                            39740021
       EJECT                                                            39750021
*=1    FOR GNDEF CREATE AN RLDTBL ENTRY                                 39760021
*        FORMAT  //34 NNNN //                                           39770021
*        WHERE    NNNN=  GN NUMBER                                      39780021
*                                                                       39790021
GNDEFR DS    0H                                                         39800021
         MVC   C6WRK0(LX2),A6GNNO                                       39810021
       LH    RW1,C6WRK0                                                 39820021
       L     R15,AGETPN                                                 39830021
       USING GETPN,R15                                                  39840021
       BAL   RS1,GETGN             GET GN NUMBER                        39850021
       DROP  R15                                                        39860021
       SH    RW3,RGNCTR                                                 39870021
       BC    NOTPOS,SE6080         GET NEXT ELT                         39880021
         MVI   OU6NAM,GEE                                               39890021
       BAL   RS1,PNCLTP           CLEAR TEMP REGISTER ASSIGNMENTS       39900021
       BC    UNCOND,PN000   GO TO PROCESS LIKE PN                       39910021
       EJECT                                                            39920021
*                                                                       39930021
*=1    FOR VNDEF CREATE INDIRECT RLDTBL ENTRY FROM IT AND               39940021
*      PNREF OR GNREF FOLLOWING                                         39950021
*                                                                       39960021
*      FORMAT  //38 PP NNNN//                                           39970021
*      WHERE   PP=PRIORITY NUMBER, NNNN=VN NUMBER                       39980021
*                                                                       39990021
       DS    0H                                                         40000021
VNDEFR EQU   *                                                          40010021
*                                                                       40020021
         MVC   SAVVNO(LX2),A6VNNO   SAVE VN NUMBER                      40030021
         MVC   SAVPTY(LX1),A6VNPR   GET PRIORITY                        40040021
         MVC   SAVPTY1(LX1),A6VNPR     SAVE PTY IF VNDEF EQU GNREF      40050021
         NI    SAVPTY,HION         SAVE SWITCH                          40060021
       L     R15,AGET              GET GET-RTN ADDRESS                  40070021
       BALR  RS1,R15               READ EQU MACRO THAT FOLLOWS          40080021
*                                                                       40090021
*                                                                       40100021
       L     R15,AGET                                                   40110021
         BALR  RS1,R15            READ PN OR GN REF FOLLOWING           40120021
VNDEF1 EQU   *                                                          40130021
       L     R15,AGETPN                                                 40140021
       CLI   GOTCOD,GNREF                                               40150021
       BC    EQ,VNDFA              THIS IS A GNREF                      40160021
         MVC   SAVPNO(LX2),A6PNNO                                       40170021
         LH    RW1,SAVPNO          GET OBJECT ADDRESS                   40180021
       BALR  RS1,R15               GET PN REF                           40190021
         BC    UNCOND,VNDFB        CONTINUE WITH PN CODING              40200021
       USING GETPN,R15                                                  40210021
VNDFA    DS    0H                                                       40220021
         MVC   SAVPNO(LX2),A6GNNO                                       40230021
         LH    RW1,SAVPNO          GET OBJECT ADDRESS                   40240021
         BAL   RS1,GETGN           GET RELATIVE GN                      40250021
       DROP  R15                                                        40260021
VNDFB  A     RW1,LOCPGT                                                 40270021
       ST    RW1,DCSAVI                                                 40280021
       SPACE 2                                                          40290021
*      SET UP LISTING LINE                                              40300021
*      VN-NNNN EQU *          INITIALIZED TO PN-NNNN                    40310021
       SPACE 5                                                          40320021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             40330021
*=L                                                                     40340021
VNDEF2 DS    0H                                                         40350021
*      GET AN RLD TABLE ENTRY                                           40360021
*            BYTE 0 = 10100100     VN TYPE OF LENGTH 4                  40370021
*            BYTE 1-3=  TARGET ADDR  (VN=-1)*4+VNILOC+LOGPGT            40380021
*            BYTE 4-7   OBJECT ADDR  (PNDEF=-1)*4+PNCTR+LOCPGT          40390021
         BAL   RS1,RLDRTE          GET ADDRESS FOR INSERT IN RLDTBL     40400021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 40410021
         BC    NOTEQ,VNDEF6        YES, BRANCH                          40420021
       LH    RW1,SAVVNO                                                 40430021
VNDEF4   BCTR  RW1,R0              SUBTRACT 1                           40440021
         SLL   RW1,DX2                                                  40450021
       AH    RW1,VNILOC                                                 40460021
       A     RW1,LOCPGT                                                 40470021
       ST    RW1,C6WRK1                                                 40480021
         MVC   TARG(LX3,R2),C6WRK1+NX1 GET TARGET ADDR                  40490021
         MVC   RELC4(LX1,R2),A6PNPR GET PRIORITY NUMBER                 40500021
         CLI   A6GN,XX50               IS THIS GNREF                    40510021
         BNE   VNDEF5                  NO, BR - PTY IS OK               40520021
         MVC   RELC-NX1(LX1,R2),SAVPTY1    YES, GET PTY                 40530021
VNDEF5   EQU   *                                                        40540021
         OC    RELC4(LX1,R2),SAVPTY PUNCH SWITCH                        40550021
         MVC   RELC(LX3,R2),DCSAVI+NX1 GET RELATIVE ADDR VALUE          40560021
         MVI   DX0(R2),VTYP          VN TYPE (INDIRECT PN REF)          40570021
       BC    UNCOND,SE6080         GET NEXT ELEMENT                     40580021
VNDEF6 L     R1,AVNPTY             SPECIFY TIB ADDRESS                  40590021
       LR    RW3,R2                SAVE RLD TBL ENTRY ADDRESS           40600021
       L     R15,ATABLE                                            STAN 40610021
         BALR  RS1,R15             GET TABLE ADDR AND SIZE         STAN 40620021
*  SEARCH VNPTY TABLE AND SAVE POSITION OF FOUND VN                STAN 40630021
       SR    RW1,RW1               INITIALIZE POSITION, CTR        STAN 40640021
VNDEF8   CLC   DX1(LX2,R1),SAVVNO   FOUND ?                         STA 40650021
         LA    RW1,DX1(RW1)         BUMP CTR                        STA 40660021
         LA    R1,DX3(R1)           POINT TO NEXT ENTRY             STA 40670021
         BC    NOTEQ,VNDEF8        NOT FOUND, TRY AGAIN                 40680021
       LR    R2,RW3                RESTORE RLDTBL ENTRY ADDRESS         40690021
       B     VNDEF4                FOUND,JOIN MAIN ROUTINE         STAN 40700021
       EJECT                                                            40710021
*=1    FOR MACRO DETERMINE TYPE AND PROCESS ACCORDINGLY                 40720021
       SPACE 3                                                          40730021
MACPRO DS    0H                                                         40740021
         SR    RW1,RW1                                                  40750021
       IC    RW1,A6MACD            GET MACRO TYPE                       40760021
         L     RW2,MACLST(RW1)                                          40770021
         BCR   UNCOND,RW2          BR TO BR-TABLE FOR MACRO RTNS        40780021
*                                                                       40790021
       EJECT                                                            40800021
*=2    ENTRY ELEMENT                                                    40810021
       DS    0H                                                         40820021
MAC010 EQU   *                                                          40830021
       L     R15,AGET                                                   40840021
       BALR  RS1,R15               GET AN ELEMENT                       40850021
       SR    RW1,RW1                                                    40860021
         STH   RW1,CELL14                                               40870021
         STH   RW1,CELL15                                               40880021
       IC    RW1,A6BCDL                                                 40890021
         CLC   DCPRID(LX8),A6BCDL+NX1 IS ENTRY NAME EQ CSECT NAME       40900021
       BC    EQ,MAC014             YES,DON'T PUNCH ESD TYPE 1           40910021
         NI    STAT14,PGTOFF                                            40920021
         NI    STAT15,PGTOFF                                            40930021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             40940021
       TM    PHZSW,NOLIST                                               40950021
       BC    ZERO,MAC012           NOLIST, SO SKIP FOLLOWING CODE       40960021
       BCTR  RW1,R0                SUBTRACT 1 FROM BCD LENGTH           40970021
       EX    RW1,ENTMOV  MOVE NAME TO LISTING                           40980021
         LA    RW1,DX1(RW1)                                             40990021
         MVC   OU6OPN(LX5),ENTMSG                                       41000021
         MVC   C6WRK0(LX4),LOCCTR                                       41010021
       L     R15,AS6010                                                 41020021
       BALR  RS1,R15               CONVERT                              41030021
         MVC   OU6LC(LX6),C6WRK3                                        41040021
       L     R15,APUT                                                   41050021
       BALR  RS1,R15       WRITE LINE                                   41060021
*=L                                                                     41070021
MAC012 DS    0H                                                         41080021
*=1    PUNCH ESD CARD FOR ENTRY POINT                                   41090021
         LA    R0,ESDTYP1          TYPE                                 41100021
         LA    R1,DX2(INPUTR)        LOCATION OF NAME                   41110021
       L     R15,AESD                                                   41120021
       BALR  RS1,R15               PUNCH ESD CARD                       41130021
MAC014 DS    0H                                                         41140021
       AH    RW1,GETLEN  INCREMENT LRL BY NUMBER OF CHARS               41150021
       STH   RW1,GETLEN                                                 41160021
       BC    UNCOND,SE6080         GET NEXT ELEMENT                     41170021
ENTMOV   MVC   OU6OPD(LX0),A6BCDL+NX1                                   41180021
ENTMSG DC    C'ENTRY'                                                   41190021
       EJECT                                                            41200021
*=1    START-SAVE LOCCTR OF FIRST EXECUTABLE INSTRUCTION                41210021
*            (CAN USE IDENTL OF RPD ZERO IN COMMON)                     41220021
MAC080 DS    0H                                                         41230021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE   LIST)     41240021
       TM    PHZSW,NOLIST                                               41250021
       BC    ZERO,MAC070           NOLIST, SKIP FOLLOWING CODING        41260021
         MVC   OU6NAM(LX16),STMSG   MOVE  START EQU * TO LIST LINE      41270021
         MVC   C6WRK0(LX4),LOCCTR   WITH CURRENT LOCATION COUNTER       41280021
       L     R15,AS6010                                                 41290021
       BALR  RS1,R15               CONVERT                              41300021
         MVC   OU6LC(LX6),C6WRK3                                        41310021
       L     R15,APUT                                                   41320021
       BALR  RS1,R15               PRINT LINE                           41330021
*=L                                                                     41340021
*                                                                       41350021
MAC070 DS    0H                                                         41360021
         MVC   IDENTL(LX4),LOCCTR                                       41370021
         XC    CELL14,CELL14       SET R14 & 15 DESTROYED SINCE    STAN 41380021
         XC    CELL15,CELL15       CODE MAY PRECEED PROC DIV       STAN 41390021
         NI    STAT14,PGTOFF                                       STAN 41400021
         NI    STAT15,PGTOFF                                       STAN 41410021
       BC    UNCOND,SE6080         GET NEXT ELEMENT                     41420021
STMSG  DC    C'START    '                                               41430021
       DC    C'EQU   *'                                                 41440021
       EJECT                                                            41450021
*=2    BLCHNG--NOTICE OF BASE LOCATOR CHANGE                            41460021
MAC020 DS    0H                                                         41470021
*      GET BLREF OF WHICH WAS CHANGED                                   41480021
*      SEARCH FOR A REGISTER WHICH HAS IT LOADED                        41490021
*      IF PERMANENT ASSIGNMENT, RELOAD                                  41500021
*      IF TEMPORARY ASSIGNMENT, SET TO SPECIFY AS NOT LOADED            41510021
*      OTHERWISE EXIT                                                   41520021
       L     R15,AGET                                                   41530021
       BALR  RS1,R15               GET ELEMENT                          41540021
       CLI   GOTCOD,BLREF                                               41550021
         MVC   BLELT(LX2),A6BLI                                         41560021
       MVC   GOTCOD,A6BLI                                               41570021
       L     R15,ASRCHR        FIND ASSOC REGISTER                      41580021
       USING SRCHR,R15                                                  41590021
       BAL   RS1,SRCHG             FIND ASSOC REGISTER                  41600021
       DROP  R15                                                        41610021
       LTR   RW3,RW3                                                    41620021
       BC    ZERO,SE6080      NONE FOUND                                41630021
       CH    RW3,C6H14D                                                 41640021
       BC    NOTLO,MAC025          R14 OR R15                           41650021
       STC   RW3,C6RS         GENERATE LOAD INSTR                       41660021
         MVI   C6OP,XX58                                                41670021
       SR    RW1,RW1                                                    41680021
       IC    RW1,A6BLK                                                  41690021
       L     R15,AGENLD                                                 41700021
       BALR  RS1,R15               GEN LOAD OF REG                      41710021
       BC    UNCOND,SE6080         GET NEXT ELT                         41720021
*      TEMPORARY ASSIGNMENT                                             41730021
MAC025 DS    0H                                                         41740021
       BC    EQ,MAC028             R14                                  41750021
MAC026 DS    0H                                                         41760021
       XC    CELL15,CELL15                                              41770021
       BC    UNCOND,SE6080         GET NEXT ELT                         41780021
MAC028 DS    0H                                                         41790021
       XC    CELL14,CELL14                                              41800021
       BC    UNCOND,SE6080         GET NEXT ELT                         41810021
*                                                                       41820021
*=1    ENDOPT                                                           41830021
MAC030 DS    0H                                                         41840021
       BC    UNCOND,SE6080         GET NEXT ELT                         41850021
       EJECT                                                            41860021
*=1    DC--GET DC DEFINITION                                            41870021
MAC090 DS      0H                                                       41880021
       L     R15,AGET                                                   41890021
       BALR  RS1,R15               GET ELT                              41900021
       BAL   RS1,MAC092            DO DC SUBRTN                         41910021
       BC    UNCOND,SE6080    GO TO GET MORE A-TEXT                     41920021
MAC092 DS    0H                                                         41930021
       ST    RS1,DCSAVR                                                 41940021
       SR      RW1,RW1                                                  41950021
       IC      RW1,A6DCL    GET LENGTH OF DC                            41960021
       LH      RW3,GETLEN   ADJUST LRL FOR GET ROUTINE                  41970021
       AR      RW3,RW1                                                  41980021
       STH     RW3,GETLEN                                               41990021
*=L   IF NO LIST MODE, GO TO NMODC3.                                    42000021
*=     CODING FROM HERE TO SUBSEQUENT *=L CARD NOT EXECUTED IF          42010021
*=     NO LIST MODE                                                     42020021
       TM    PHZSW,NOLIST                                               42030021
       BC    ZERO,NMODC3           NOLIST, SKIP NEXT CODING             42040021
         MVC   SAVLOC(LX4),LOCCTR   SAVE LOCCTR AND INPUT POINTER       42050021
       ST    INPUTR,DCSAVI                                              42060021
TSTDC1 CH      RW1,C68      IS LENGTH MORE THAN 8 (ONLY 8 CHARS/LIN     42070021
       BC      HI,MOR8DC    YES                                         42080021
       LR    R0,RW1        NO-USE LENGTH                                42090021
TSTDC2   MVC   OU6OPN(LX2),MACDCO MOVE CONSTANTS TO LISTING LINE        42100021
         MVC   OU6OPD(LX2),MACDCX                                       42110021
         MVC   C6WRK0(LX4),SAVLOC  MOVE LOCCTR TO LISTING LINE          42120021
       L     R15,AS6010                                                 42130021
       BALR  RS1,R15               CONVERT                              42140021
         MVC   OU6LC(LX6),C6WRK3                                        42150021
       L       RW3,SAVLOC   UP LOCCTR BY LENGTH (OR 8 MAX)              42160021
       AR    RW3,R0                                                     42170021
       ST      RW3,SAVLOC                                               42180021
         MVC   C6WRK0(LX4),A6DCV  MOVE FIRST 4 CHARS OF VALUE TO CON    42190021
       L     R15,AS6010                                                 42200021
       BALR  RS1,R15               CONVERT                              42210021
       CH    R0,C64                                                     42220021
       BC      HI,MOR4DC    USE 4 CHARS IF MORE THAN 4                  42230021
       LR    RW3,R0                                                     42240021
TSTDC3   SLL   RW3,DX1                                                  42250021
       BCTR  RW3,R0                SUBTRACT 1 FOR EX INSTR              42260021
       EX      RW3,MOVDC1   MOVE FIRST CHARS (4 MAX) TO LISTING LIN     42270021
       EX      RW3,MOVDC2                                               42280021
       CH    R0,C64                                                     42290021
       BC      NOTHI,NMODC1        LESS THAN OR 4 CHARACTERS, OUT       42300021
         MVC   C6WRK0(LX4),A6DCV+NX4 CONVERT AND MOVE NEXT 4 (OR FEWER  42310021
       L     R15,AS6010          CHARACTERS                             42320021
       BALR  RS1,R15               CONVERT                              42330021
       LR    RW3,R0                                                     42340021
       SH      RW3,C64                                                  42350021
         SLL   RW3,DX1                                                  42360021
       BCTR  RW3,R0                SUBTRACT 1 FOR EX INSTR              42370021
       EX      RW3,MOVDC3                                               42380021
       EX      RW3,MOVDC4                                               42390021
NMODC1   IC    RW3,MACDCX+NX1                                           42400021
       LR    RW2,R0                                                     42410021
         SLL   RW2,DX1                                                  42420021
         STC   RW3,OU6OPD+NX2(RW2) INSERT FINAL QUOTE MARK AFTER CON    42430021
       L     R15,APUT     PRINT LINE                                    42440021
       BALR  RS1,R15               PRINT LINE                           42450021
       CH      RW1,C68      ANY MORE OF DC LEFT FOR NEXT LINE           42460021
       BC      NOTHI,NMODC2 NO                                          42470021
       SH      RW1,C68      YES-ADJUST REMAINING LENGTH AND PROCESS     42480021
         LA    INPUTR,DX8(INPUTR)                                       42490021
       BC      UNCOND,TSTDC1       PROCESS REST OF DC                   42500021
NMODC2 L       INPUTR,DCSAVI  RESTORE INPUTR FOR GET ROUTINE            42510021
*=L                                                                     42520021
NMODC3 DS    0H                                                         42530021
       LA    R1,A6DCV      LOCATION OF CON FOR PUNCH RTNE               42540021
       SR    R0,R0                                                      42550021
       IC    R0,A6DCL                    LENGTH OF CON FOR PUNCH RT     42560021
       L     R15,ATXPNH      PUNCH AND UP LOCCTR ACCORDINGLY            42570021
       BALR  RS1,R15               PUNCH TEXT                           42580021
       L     RS1,DCSAVR                                                 42590021
       BCR   UNCOND,RS1        EXIT                                     42600021
MOR8DC   LA    R0,DW8BYTES         IF LEN GT 8, USE 8 AT A TIME         42610021
       BC      UNCOND,TSTDC2       PROCESS REST OF DC                   42620021
MOR4DC   LA    RW3,FOURBYTE        IF LEN GT 4, CONVERT 4 ATA TIM       42630021
       BC    UNCOND,TSTDC3         PROCESS REST OF DC                   42640021
MOVDC4   MVC   OU6OPD+NX10(LX0),C6WRK1                                  42650021
MOVDC2   MVC   OU6OPD+NX2(LX0),C6WRK1                                   42660021
MOVDC3   MVC   OU6OP+NX8(LX0),C6WRK1                                    42670021
MOVDC1   MVC   OU6OP(LX0),C6WRK1                                        42680021
MACDCO DC      C'DC'                                                    42690021
MACDCX DC    C'X'''                                                     42700021
       EJECT                       CONVERT                              42710021
**                                                                      42720021
*      DUMMY PN  FOR XREF                                               42730021
*            //44 50  4C  PP  NNNN  //                                  42740021
*             WHERE  PP IS PRIORITY                                     42750021
*                    NNNN IS PN NUMBER                                  42760021
MAC050  DS  0H                                                          42770021
         L    R15,AGET                                                  42780021
         BALR    RS1,R15         GET   SECOND PART                      42790021
         TM    PHZSW1,XREF                                              42800021
         BC    ZERO,SE6080         NO, GO GET NEXT ELEMENT              42810021
         LA    RS1,SE6080      SPECIFY RETURN ADDR FOR IN-LINE BR       42820021
         BC    UNCOND,R6317A         GO DO PN ELT                       42830021
         EJECT                                                          42840021
*                                                                       42850021
*=1    ADCON                                                            42860021
*                                                                       42870021
MAC060 DS    0H                                                         42880021
       L     R15,AGET                                                   42890021
       BALR  RS1,R15               GET NEXT ELT                         42900021
       CLI   GOTCOD,CSELT                                               42910021
       BC    EQ,MAC065             CALLING SEQ DISPL ELT                42920021
       CLI   GOTCOD,CSDPTR                                              42930021
       BC    EQ,MAC066             CALLING SEQ DICT PTR                 42940021
         CLI   GOTCOD,XXEC          IS THIS A FILE REF ELMT             42950021
       BC    EQ,MAC068             YES,BR                               42960021
       CLI   GOTCOD,PNREF                                               42970021
       BC    EQ,KAR021             PNREF ELT                            42980021
         MVC   OU6OPN(LX5),MACADC                                       42990021
         MVI   OU6OPD,EL                                                43000021
       LA    RW1,SE6080                                                 43010021
       ST    RW1,RETADC                                                 43020021
       IC    R0,A6RAS                                                   43030021
       N     R0,C6M2      L ADCON                                       43040021
         STC   R0,OU6OPD+NX1                                            43050021
       SR    RW2,RW2                                                    43060021
       IC    RW2,A6RAT   TYPE OF CELL                                   43070021
       TM    PHZSW,NOLIST                                               43080021
       BC    ZERO,MAC062           NOLIST, SKIP NEXT CODING             43090021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             43100021
         OI    OU6OPD+NX1,MF0                                           43110021
       LR    RW1,RW2                                                    43120021
         SRL   RW1,DX2                                                  43130021
       MH    RW1,C6H7                                                   43140021
       A     RW1,ARLTBL                                                 43150021
         MVC   OU6OPD+NX2(LX7),DX0(RW1)                                 43160021
*=L                                                                     43170021
MAC062 DS    0H                                                         43180021
         CLI   A6RAT,XX68          IS TYPE GT HIGHEST TYPE CODE         43190021
       BC    HI,ERR110            YES,ERROR BRANCH                      43200021
       EX    R0,TYTBL(RW2)                                              43210021
       BC    UNCOND,BLS030    IF NOT ALREADY AT SPECIALIZED ROUTINE     43220021
         EJECT                                                          43230021
*                                                                       43240021
*=1    ADCON INIT1                                                      43250021
*                                                                       43260021
BINIT1 SR    RW2,RW2                                                    43270021
*                           LATER PUNCH RLD                             43280021
BIN010 DS    0H                                                         43290021
BIN012   DS    0H                                                       43300021
         ST    RW2,PROG2                                                43310021
       LA    R1,PROG2                                                   43320021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             43330021
       TM    PHZSW,NOLIST                                               43340021
       BC    ZERO,BIN014           NOLIST, SKIP NEXT CODING             43350021
         MVC   C6WRK0(LX4),LOCCTR                                       43360021
       L     R15,AS6010                                                 43370021
       BALR  RS1,R15               CONVERT                              43380021
         MVC   OU6LC(LX6),C6WRK3                                        43390021
         MVC   C6WRK0(LX4),PROG2                                        43400021
       L     R15,AS6010                                                 43410021
       BALR  RS1,R15               CONVERT                              43420021
*=L                                                                     43430021
BIN014 DS    0H                                                         43440021
         TM    OU6OPD+NX1,XX01                                          43450021
       BC    ZERO,ACON4            ADCON OF LENGTH 4                    43460021
         LA    R1,DX1(R1)   ADCON OF LENGTH 3                           43470021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             43480021
         MVC   OU6OP(LX6),C6WRK3                                        43490021
         BC    UNCOND,BIN020       CONTINUE WITH ADCON CODING           43500021
ACON4    DS    0H                                                       43510021
         MVC   OU6OP(LX8),C6WRK1                                        43520021
BIN020   DS    0H                                                       43530021
         TM    SEGSW2,RLDPNCHD     IS RLD TO BE PUNCHED                 43540021
         BC    ONES,BIN024         NO, ALREADY PUNCHED                  43550021
*=L                                                                     43560021
         IC    R0,OU6OPD+NX1                                            43570021
       N     R0,C6M2                     COUNT TO R0                    43580021
       L     RW1,LOCCTR            SAVE LOCCTR                          43590021
       L     R15,ATXPNH                                                 43600021
       BALR  RS1,R15                 PUNCH TEXT                         43610021
       LH    RW2,ESDID             OS                                   43620021
         LA    RW3,DX1                                                  43630021
       STH   RW3,ESDID             ESDID FOR ADCON                      43640021
       LR    R1,RW1                 LOC OF ADCON                        43650021
       BCTR  R0,R0              CONVERT LENGTH                          43660021
         SLL   R0,DX2            FOR FLAG BYTE                          43670021
       L     R15,ARLD                                                   43680021
       BALR  RS1,R15                 PUNCH RLD                          43690021
       STH   RW2,ESDID             RESTORE ESDID                        43700021
BIN022 EQU   *                                                          43710021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             43720021
       L     R15,APUT                                                   43730021
       BALR  RS1,R15               PRINT LINE                           43740021
*=L                                                                     43750021
       L     RW1,RETADC       RETURN ADDRESS                            43760021
         BCR   UNCOND,RW1          RETURN                               43770021
BIN024   NI    SEGSW2,SGSW2OFF     RESET ZERO DC V(SEGM) SW             43780021
       L     RW1,LOCCTR            BUMP LOCCTR                          43790021
         LA    RW1,DX4(RW1)                                             43800021
       ST    RW1,LOCCTR                                                 43810021
       B     BIN022                GO PRINT LINE AND RETURN             43820021
       EJECT                                                            43830021
IKF604   CSECT                                                          43840021
*=1    ADCON  TALLY                                                     43850021
*                                                                       43860021
BTALLY DS    0H                                                         43870021
       L     RW2,RELLOC                                                 43880021
         AH    RW2,GT1KND+NX4                                           43890021
*                           LATER PUNCH RLD                             43900021
       BC    UNCOND,BIN010         DO COMMON CODE FOR ADCON INIT1       43910021
       SPACE 2                                                          43920021
ADBLI  DS    0H                                                         43930021
       LH    RW3,BLCTR                                                  43940021
         BC    UNCOND,BLS030       GO TO COMMON PROCESSING              43950021
       SPACE 2                                                          43960021
*                                                                       43970021
*                                                                       43980021
*=1    ADCON   VLC=                                                     43990021
BVLCI  DS      0H                                                       44000021
       LH      RW3,VLCCTR                                               44010021
BVLCA  DS    0H                                                         44020021
         LA    RW1,DX1                                                  44030021
BLS040 DS    0H                                                         44040021
         MVC   C6WRK0(LX2),A6RAN                                        44050021
       LH      RW2,C6WRK0                                               44060021
       ST    RW2,DCSAVN                                                 44070021
       BCTR  RW2,R0                SUBTRACT 1                           44080021
         SLL   RW2,DX0(RW1)                                             44090021
       AR    RW2,RW3               DISP FROM TGT OR SGT                 44100021
       A     RW2,RELLOC                                                 44110021
       BC    UNCOND,BAD010         PROCESS CHKPT OR NORMAL              44120021
BLS030 DS    0H                                                         44130021
         LA    RW1,DX2                                                  44140021
       BC    UNCOND,BLS040         JOIN MAIN LINE PROCESSING            44150021
TSADCN DS    0H                                                         44160021
       LH    RW3,TSMAX                                                  44170021
       SR    RW1,RW1                                                    44180021
       BC    UNCOND,BLS040         JOIN MAIN LINE PROCESSING            44190021
*                                                                       44200021
*      ADCON PN=                                                        44210021
BPN    DS    0H                                                         44220021
         MVC   C6WRK0(LX2),A6RAN                                        44230021
       LH    RW1,C6WRK0                                                 44240021
       L     R15,AGETPN                                                 44250021
       BALR  RS1,R15               GET PN NUMBER                        44260021
BPN010 A     RW1,LOCPGT                                                 44270021
       ST    RW3,DCSAVN                                                 44280021
       LR    RW2,RW1                                                    44290021
       BC      UNCOND,BAD010       PROCESS CHKPT OR NORMAL              44300021
*                                                                       44310021
*=1    ADCON   LITERAL=                                                 44320021
*                                                                       44330021
BLITRF DS      0H                                                       44340021
       L     R1,ALTLTB                                                  44350021
       L     R15,ATABLE                                                 44360021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              44370021
         MVC   LTRFCT,A6RAN        GET LITERAL NO                       44380021
         LH    RW1,LTRFCT                                          LITS 44390021
         BCTR  RW1,R0              DECREMENT LIT # FOR INDEXING         44400021
         SLL   RW1,DX1       *2 FOR INDEX VALUE                         44410021
         LH    RW2,DX0(RW1,R1)  DISP FROM PGT                           44420021
         N     RW2,HWFS                MASK OUT HI ORDER 16 BITS  53557 44430021
       SH    RW2,LTLCTR                                                 44440021
       ST    RW2,DCSAVN                                                 44450021
       AH    RW2,LTLCTR                                                 44460021
       A       RW2,LOCPGT   ADD START OF PGT TO DISP                    44470021
BAD010 LA    RW3,SE6020                                                 44480021
       ST    RW3,RETADC       NORMAL RETURN                             44490021
       L     R15,AGET          EXAMINE NEXT ELEMENT                     44500021
       BALR  RS1,R15               GET NEXT ELT                         44510021
       CLI   GOTCOD,PLUS                IS IT PLUS                      44520021
       BC    NOTEQ,BAD013     NO                                        44530021
       LA    RW3,SE6080       READ NEXT ELEMENT RETURN                  44540021
       ST    RW3,RETADC                                                 44550021
         MVC   C6WRK0+NX1(LX3),A6PLIN                                   44560021
         MVI   C6WRK0,INITOFF      ASSUME POSITIVE                      44570021
         TM    A6PLIN,HION                                              44580021
       BC    ZERO,BAD012           MAKE POSITIVE                        44590021
         MVI   C6WRK0,ALLON        NEGATIVE                             44600021
BAD012 A     RW2,C6WRK0       ADD IN PLUS ELEMENT                       44610021
BAD013 DS    0H                                                         44620021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             44630021
       TM    PHZSW,NOLIST                                               44640021
       BC    ZERO,BIN012           NOLIST, SKIP CODING                  44650021
       LR    R1,RW2       SAVE REG                                      44660021
       LA    RW3,OU6OPD                                                 44670021
       L     RW1,DCSAVN                                                 44680021
       L     R15,AS6200                                                 44690021
       USING S6200,R15     CONVERT NO TO DECIMAL FOR LISTING            44700021
       BAL   RS1,S6210             CONVERT                              44710021
       DROP  R15                                                        44720021
         MVC   DX7(LX0,RW3),C6WRK4   EXECUTED BY S6200                  44730021
       CLI   GOTCOD,PLUS                IS IT PLUS                      44740021
       BC    NOTEQ,BAD015     NO PLUS                                   44750021
         MVI   DX8(RW3),PLUSSIGN                                        44760021
         LA    RW3,DX1(RW3)                                             44770021
         MVC   C6WRK0(LX2),A6PLIN+NX1                                   44780021
       LH    RW1,C6WRK0                                                 44790021
       L     R15,AS6200                                                 44800021
       USING S6200,R15                                                  44810021
       BAL   RS1,S6210         CONVERT FOR LISTING                      44820021
       DROP  R15                                                        44830021
         MVC   DX8(LX0,RW3),C6WRK4 EXECUTED BY S6200                    44840021
         LA    RW3,DX1(RW3)                                             44850021
BAD015 DS    0H                                                         44860021
         MVI   DX8(RW3),RTPAREN                                         44870021
       LR    RW2,R1                                                     44880021
*=L                                                                     44890021
         BC    UNCOND,BIN012       LATER PUNCH RLD                      44900021
         SPACE 2                                                        44910021
*                                                                       44920021
*=1    ADCON INIT3                                                      44930021
*                                                                       44940021
BINIT3 DS      0H                                                       44950021
       L     RW2,LINIT3                                                 44960021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      44970021
*                                                                       44980021
*=1    ADCON CHECKPOINT ROUTINE                                         44990021
*                                                                       45000021
BCKPTR DS      0H                                                       45010021
       L     RW2,CKLOC                                                  45020021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45030021
*                                                                       45040021
*=1    ADCON PGT                                                        45050021
*                                                                       45060021
BPGT   DS      0H                                                       45070021
       L     RW2,LOCPGT                                                 45080021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45090021
*                                                                       45100021
*=1    ADCON   TGT                                                      45110021
*                                                                       45120021
BTGT   DS      0H                                                       45130021
       L     RW2,RELLOC                                                 45140021
*                           LATER PUNCH RLD                             45150021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45160021
*                                                                       45170021
*=1    ADCON INIT2                                                      45180021
*                                                                       45190021
BINIT2 DS      0H                                                       45200021
       L     RW2,LINIT2                                                 45210021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45220021
*                                                                       45230021
*=1    ADCON START                                                      45240021
*                                                                       45250021
BSTART DS      0H                                                       45260021
       L     RW2,IDENTL                                                 45270021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45280021
*                                                                       45290021
*                                                                       45300021
*=1      ADCON GN=                                                      45310021
BGN      DS    0H                                                       45320021
         MVC   C6WRK0(LX2),A6RAN                                        45330021
       LH    RW1,C6WRK0                                                 45340021
       L     R15,AGETPN                                                 45350021
       USING GETPN,R15                                                  45360021
       BAL   RS1,GETGN             GET GN NUMBER                        45370021
       DROP  R15                                                        45380021
       CH    RW1,GNCTR                                                  45390021
       BC    LOW,BGN020            USE PN FOR PROCESSING                45400021
       SH    RW3,RGNCTR       USE REL GN= FOR LISTING                   45410021
       BC    UNCOND,BPN010         PROCESS LIKE PN                      45420021
BGN020 DS    0H                                                         45430021
         MVI   OU6OPD+NX2,PEE      CHANGE SYMBOLIC TO PN                45440021
       BC    UNCOND,BPN010         PROCESS LIKE PN                      45450021
         SPACE 1                                                        45460021
*                                                                       45470021
*=1    ADCON VIRTUAL                                                    45480021
*                                                                       45490021
BVIRT  DS    0H                                                         45500021
       BC    UNCOND,SE6080         GET NEXT ELT                         45510021
*                                                                       45520021
*=1    ADCON VNLOC                                                      45530021
BVNLOC DS    0H                                                         45540021
       LH    RW2,VNLOC                                                  45550021
       A     RW2,RELLOC                                                 45560021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45570021
*                                                                       45580021
*=1    ADCON VNILOC                                                     45590021
BVNIL  DS    0H                                                         45600021
       LH    RW2,VNILOC                                                 45610021
       A     RW2,LOCPGT                                                 45620021
       BC    UNCOND,BIN010         LATER PUNCH RLD                      45630021
*                                                                       45640021
*   PROCESS AN EXTERNAL ADSCON,TYPE=68                                  45650021
*                                                                       45660021
EXTADC EQU   *                                                          45670021
       LH    RW1,ESDID            GET ESD VALUE                         45680021
         LA    RW1,DX1(RW1)        STEP UP                              45690021
       STH   RW1,ESDID                                                  45700021
         LA    R0,ESDTYP2          SPECIFY ESDTYPE 2                    45710021
       LA    R1,SEGNSA            GET SEGM NAME ADDR                    45720021
       L     R15,AESD                                                   45730021
       BALR  RS1,R15              PUNCH ESD TYPE 2 CARD                 45740021
*   PUNCH TEXT OF ZEROS FOR EXTERNAL REF                                45750021
       LA    R1,ZERO7X            GET ADDR OF ZERO TEXT                 45760021
         LA    R0,FOURBYTE         SPECIFY LENGTH                       45770021
       L     RW2,LOCCTR           SAVE LOC CTR FOR RLD                  45780021
       L     R15,ATXPNH                                                 45790021
       BALR  RS1,R15              PUNCH 4 BYTES OF ZEROS                45800021
*   PUNCH RLD CARD                                                      45810021
       LR    R1,RW2               SPECIFY LOC OF ADCON                  45820021
       ST    R1,LOCCTR             RESTORE LOC CTR                      45830021
       LA    R0,X'0C'              FLAG BYTE(NON-BRANCH VCON)           45840021
       L     R15,ARLD                                                   45850021
       BALR  RS1,R15              PUNCH RLD CARD                        45860021
         OI    SEGSW2,RLDPNCHD     RLD ALREADY PUNCHED                  45870021
       B     BINIT1               ASSEMBLE ADCON                        45880021
       EJECT                                                            45890021
*                                                                       45900021
*      RELADR FOUND-CREATE ADCON                                        45910021
*      CREATE A DC CONSISTING OF, OPTIONALLY, A BASE CODE, AND A        45920021
*      3-BYTE DISPLACEMENT OF INDICATED ITEM FROM APPROPRIATE           45930021
*      GLOBAL TABLE                                                     45940021
*      GLOBAL TABLE INDICATED BY BASE CODE  0C=PGT                      45950021
*                                           0D=TGT                      45960021
*      USE DCDEF CODING AFTER SETTING UP DC                             45970021
*                                                                       45980021
MAC065 DS    0H                                                         45990021
         TM    A6CSB,ALLON                                              46000021
       BC    NOTZER,CALCBC         BASE CODE                            46010021
         MVI   CSDCWA,XX03                                              46020021
         LA    RW3,CSDCWA+NX1                                           46030021
       CLI   A6CST,CSLIT                                                46040021
       BC    EQ,CSL020             TYPE=LITERAL                         46050021
MACA65 DS    0H                                                         46060021
         MVC   C6WRK0(LX2),A6CSN                                        46070021
       LH    RW2,C6WRK0                                                 46080021
         BCTR  RW2,R0              SUBTRACT 1                           46090021
       CLI   A6CST,CSTS                                                 46100021
       BC    EQ,CST010             TEMPORARY STORAGE                    46110021
       CLI   A6CST,CSVLCI                                               46120021
       BC    EQ,CSV010             VLC TYPE I                           46130021
       CLI   A6CST,CSVLCO                                               46140021
       BC    EQ,CSV010             VLC TYPE O                           46150021
         SLL   RW2,DX2                                                  46160021
MACB65 DS    0H                                                         46170021
       CLI   A6CST,CSSUB                                                46180021
       BC    EQ,CSS010             CALLING SEQ SUBADDR                  46190021
       SR    RW1,RW1                                                    46200021
       IC    RW1,A6CST                                                  46210021
         EX    R0,CSTBL-NX4(RW1)                                        46220021
         L     RW1,CSCON-NX4(RW1)                                       46230021
       ST    RW1,C6WRK0                                                 46240021
         MVC   OU6SO1(LX4),C6WRK0                                       46250021
MACE65 DS    0H                                                         46260021
         MVC   C6WRK0(LX2),A6CSN                                        46270021
       LH    RW1,C6WRK0                                                 46280021
MACC65 DS    0H                                                         46290021
       STH   RW2,C6WRK0                                                 46300021
         MVC   DX1(LX2,RW3),C6WRK0                                      46310021
         MVI   DX0(RW3),INITOFF                                         46320021
       LR    R1,RW3                                                     46330021
       TM    PHZSW,NOLIST                                               46340021
       BC    ZERO,CREATD           NOLIST, SKIP CODING                  46350021
       L     R15,AS6200                                                 46360021
       USING S6200,R15                                                  46370021
       BAL   RS1,S6210             CONVERT                              46380021
       DROP  R15                                                        46390021
         MVC   OU6SO1+NX4,C6WRK4                                        46400021
         LA    RW3,OU6SO1+NX5(RW2)                                      46410021
CREATD DS    0H                                                         46420021
     LA      RW1,SE6020                                                 46430021
       ST    RW1,RETADC                                                 46440021
       L     R15,AGET             EXAMINE NEXT ELEMENT                  46450021
       BALR  RS1,R15               GET NEXT ELT                         46460021
       CLI   GOTCOD,PLUS          IS IT PLUS                            46470021
       BC    NOTEQ,KAR020         NO                                    46480021
     LA      RW1,SE6080                                                 46490021
       ST    RW1,RETADC                                                 46500021
         MVC   C6WRK0+NX1(LX3),A6PLIN                                   46510021
         MVI   C6WRK0,INITOFF      ASSUME POSITIVE                      46520021
         TM    A6PLIN,HION                                              46530021
       BC    ZERO,KAR010           KEEP POSITIVE                        46540021
         MVI   C6WRK0,ALLON        NEGATIVE                             46550021
KAR010 DS    0H                                                         46560021
       L     RW2,C6WRK0                                                 46570021
         MVC   C6WRK0(LX2),DX1(R1)                                      46580021
       AH    RW2,C6WRK0                                                 46590021
       STH   RW2,C6WRK0                                                 46600021
         MVC   DX1(LX2,R1),C6WRK0                                       46610021
       TM    PHZSW,NOLIST                                               46620021
       BC    ZERO,KAR020           NOLIST, SKIP CODING                  46630021
         MVI   DX0(RW3),PLUSSIGN                                        46640021
         MVC   C6WRK0(LX2),A6PLIN+NX1                                   46650021
       LH    RW1,C6WRK0                                                 46660021
       L     R15,AS6200                                                 46670021
       USING S6200,R15                                                  46680021
       BAL   RS1,S6210             CONVERT                              46690021
       DROP  R15                                                        46700021
         MVC   DX1(LX0,RW3),C6WRK4                                      46710021
KAR020 DS    0H                                                         46720021
         MVC   PNBSVG(LX2),GETLEN                                       46730021
       ST    INPUTR,PNBSAV                                              46740021
         LA    INPUTR,CSDCWA-NX1                                        46750021
       BAL   RS1,MAC092            DO DC COMMON CODE                    46760021
       L     INPUTR,PNBSAV                                              46770021
         MVC   GETLEN(LX2),PNBSVG                                       46780021
       L     RW1,RETADC                                                 46790021
       BCR   UNCOND,RW1            RETURN                               46800021
CSBLO  DS    0H                                                         46810021
         MVI   A6CST,XX2C      DUMMY TYPE TO FIT IN TABLE SINCE LITE    46820021
*                             NOT TESTED AFTER THIS TIME                46830021
         MVI   CSDCWA+NX1,XX0B                                          46840021
         BC    UNCOND,MACA65       GO TO COMMON ADCON PROCESS           46850021
CALCBC DS    0H                                                         46860021
         MVI   CSDCWA,XX04                                              46870021
         LA    RW3,CSDCWA+NX2                                           46880021
         MVI   CSDCWA+NX1,XX0D                                          46890021
       CLI   A6CST,CSLIT                                                46900021
         BC    NOTEQ,MACA65        GO TO COMMON ADCON PROCESS           46910021
         MVI   CSDCWA+NX1,XX0C                                          46920021
CSL020 DS    0H                                                         46930021
       L     R1,ALTLTB                                                  46940021
       L     R15,ATABLE                                                 46950021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              46960021
         MVC   LTRFCT,A6CSN       GET LITERAL NO.                  LITS 46970021
       LH    RW1,LTRFCT                                                 46980021
         BCTR  RW1,R0              DECREMENT LITERAL NO FOR INDEX       46990021
         SLL   RW1,DX1                                                  47000021
         LH    RW2,DX0(RW1,R1) DISP                                     47010021
         N     RW2,HWFS                MASK OUT HI ORDER 16 BITS  53557 47020021
       LR    RW1,RW2                                                    47030021
       SH    RW1,LTLCTR                                                 47040021
         MVC   OU6SO1(LX4),XLITC                                        47050021
       BC    UNCOND,MACC65         CREATE ADCON                         47060021
CSV010 DS    0H                                                         47070021
         SLL   RW2,DX1                                                  47080021
       BC    UNCOND,MACB65         CREATE ADCON                         47090021
CST010 DS    0H                                                         47100021
       LR    RW1,RW2                                                    47110021
       AH    RW2,TSMAX                                                  47120021
         MVC   OU6SO1(LX4),XTSC                                         47130021
       BC    UNCOND,MACC65         CREATE ADCON                         47140021
CSS010 DS    0H                                                         47150021
       AH    RW2,SUBCTR                                                 47160021
         MVC   OU6SO1(LX4),XSUBC                                        47170021
       BC    UNCOND,MACE65         CREATE ADCON                         47180021
       EJECT                                                            47190021
KAR021 DS    0H                   PROCESS GO TO DPNG ON STRING          47200021
         MVI   CSDCWA,TWOBYTE      LENGTH OF DC                         47210021
         MVC   C6WRK0(LX2),A6PNNO                                       47220021
       LH    RW1,C6WRK0                                                 47230021
       L     R15,AGETPN                                                 47240021
       BALR  RS1,R15               GET PN NUMBER                        47250021
       BC    ZERO,ERR040          REL PN NUMBER ON RETURN               47260021
*                                                                       47270021
       TM    PHZSW1,XREF           IS XREF SPECIFIED                    47280021
       BC    ZERO,KAR022           NO,BR                                47290021
         CLI   RGNSW,RGNINIT       ARE WE PROCESSING INIT CODE          47300021
         BC    EQ,KAR022     YES, DON'T PRODUCE XREF ELEMEMT            47310021
         TM    QRTNSW,QRTNON       ARE WE PROCESSING QRTNS              47320021
         BC    ONES,KAR022         YES, DON'T PRODUCE XREF ELEMENT      47330021
         MVI   C6WRK0,INITOFF                                           47340021
       BAL   RS1,R63179            WRITE PN REF ELMT                    47350021
KAR022 DS    0H                                                         47360021
       LR    RW1,RW3                                                    47370021
         BCTR  RW3,R0              SUBTRACT 1                           47380021
         MVC   OU6SO1(LX4),XPNC                                         47390021
       STH   RW3,C6WRK0                                                 47400021
         MVC   CSDCWA+NX1(LX2),C6WRK0                                   47410021
       L     R15,AS6200                                                 47420021
       USING S6200,R15                                                  47430021
       BAL   RS1,S6210             CONVERT                              47440021
       DROP  R15                                                        47450021
         MVC   OU6SO1+NX4(LX0),C6WRK4                                   47460021
         MVC   PNBSVG(LX2),GETLEN                                       47470021
       ST    INPUTR,PNBSAV                                              47480021
         LA    INPUTR,CSDCWA-NX1                                        47490021
       BAL   RS1,MAC092            DO DC COMMON CODE                    47500021
       L     INPUTR,PNBSAV                                              47510021
         MVC   GETLEN(LX2),PNBSVG                                       47520021
       BC    UNCOND,SE6080         GET NEXT ELT                         47530021
       EJECT                                                            47540021
*                                                                       47550021
*                                                                       47560021
*  CALLING SEQUENCE DICTIONARY POINTER                                  47570021
*                                                                       47580021
*                                                                       47590021
MAC066 DS    0H                                                         47600021
         LA    RS1,SE6080             PICK UP RETURN REG          8953  47610021
MAC066A  DS    0H                                                 8953  47620021
       TM    PHZSW1,XREF           IS XREF SPECIFIED                    47630021
         BCR   ZERO,RS1            NO, BRANCH                     8953  47640021
         CLI   RGNSW,RGNINIT       ARE WE PROCESSING INIT CODE          47650021
         BCR   EQ,RS1              YES,NO XREF                    8953  47660021
         TM    QRTNSW,QRTNON       ARE WE PROCESSING QRTNS              47670021
         BCR   ONES,RS1            YES,NO XREF                    8953  47680021
         CLC   A6CSPT(LX3),C6FFF    IS THIS A TALLY REF                 47690021
         BCR   EQ,RS1              YES,NO XREF                    8953  47700021
         MVC   C6WRK0(LX3),A6CSPT   GET SUBSCR DN DICT PTR              47710021
MAC067   NI    XFCDNO,XX7F             TURN OFF HI BIT             0657 47720021
         ST    RS1,SAVERS1                                        8953  47730021
         BAL   RS1,R63180          GO WRITE DN REF TST            8953  47740021
         L     RS1,SAVERS1                                        8953  47750021
          BR    RS1               GET NEXT ELT OR FINISH 64 ELT   8953  47760021
*                                                                       47770021
*        FILE REF ELEMENT(B8)                                           47780021
*                                                                       47790021
*      FORMAT     //B8 DDDDDD//                                         47800021
*                                                                       47810021
MAC068 DS    0H                                                         47820021
       TM    PHZSW1,XREF           IS XREF REQUESTED                    47830021
       BC    ZERO,SE6080           NO,BR                                47840021
         CLI   RGNSW,RGNINIT       ARE WE PROCESSING INIT CODE          47850021
         BC    EQ,SE6080     YES, DON'T PRODUCE XREF ELEMEMT            47860021
         TM    QRTNSW,QRTNON       ARE WE PROCESSING QRTNS              47870021
         BC    ONES,SE6080         YES, DON'T PRODUCE XREF ELEMENT      47880021
         MVC   C6WRK0(LX3),A6FLDP   YES,GET DICTIONARY POINTER          47890021
         LA    RS1,SE6080        SET RS1 FOR SAVE ABOVE           8953  47900021
       B     MAC067                WRITE A FILE REF ELMT FOR PHASE      47910021
       EJECT                                                            47920021
*                                                                       47930021
*=1    RESERVE  SET REG 14 OR 15 RESERVED BY PHASE 5, SET DESTROYED     47940021
MAC100 DS    0H                                                         47950021
       BAL   RW2,GETREG            GET REG 14 OR 15 USING GET           47960021
       BC    NOTEQ,MAC102          R15                                  47970021
       OI    STAT14,AVAIL5                                              47980021
         BC    UNCOND,MAC028           DO BLCHNG                  8307  47990021
MAC102 OI    STAT15,AVAIL5                                              48000021
         BC    UNCOND,MAC026           DO BLCHNG                  8307  48010021
       SPACE 2                                                          48020021
*=1    DESTROY  SET REG 14 OR 15 DESTROYED                              48030021
MAC120 DS    0H                                                         48040021
       BAL   RW2,GETREG            GET R14/R15 USING GET RTN            48050021
       BC    UNCOND,MAC025         DO BLCHNG (CC=0/R14,1/R15,2/R?       48060021
       SPACE 2                                                          48070021
*=1    FREE     SET REG 14 OR 15 FREE                                   48080021
MAC110 DS    0H                                                         48090021
       BAL   RW2,GETREG            GET R14/R15                          48100021
       BC    NOTEQ,MAC112          R15                                  48110021
       NI    STAT14,YAVAL5                                              48120021
       BC    UNCOND,SE6080         GET NEXT ELT                         48130021
MAC112 DS    0H                                                         48140021
       NI    STAT15,YAVAL5                                              48150021
       BC    UNCOND,SE6080         GET NEXT ELT                         48160021
       SPACE 2                                                          48170021
GETREG L     R15,AGET                                                   48180021
       BALR  RS1,R15               GET ELT R14/R15                      48190021
       IC    RW1,A6REGR                                                 48200021
       N     RW1,C6M2                                                   48210021
       CH    RW1,C6H14             REG GOTTEN : R14 CC=0/R14,1/15       48220021
         BCR   UNCOND,RW2          RETURN TO BR ON CONDIT CODE          48230021
       EJECT                                                            48240021
*=1    INIT--LOAD PERMANENT REGISTER ASSIGNMENTS                        48250021
MAC130 DS    0H                                                         48260021
       L     R15,AINITR                                                 48270021
       BALR  RS1,R15               GEN LOAD PERMANENT REG ASSIGND       48280021
       BC    UNCOND,SE6080         GET NEXT ELT                         48290021
       SPACE 2                                                          48300021
*=1    BEGINNING OF Q-RTNES - DESTROY REGISTER ASSIGNMENTS              48310021
MAC140 DS    0H                                                         48320021
         OI    QRTNSW,QRTNON       WE ARE PROCESSING Q-RTNS             48330021
       LA    RW1,CELL06                                                 48340021
       LA    RW2,CELL15                                                 48350021
       SR    RW3,RW3                                                    48360021
MAC142 CR    RW1,RW2                                                    48370021
       BC    HI,SE6080             ALL DONE DESTROYING REGS GET         48380021
         STH   RW3,DX0(RW1)                                             48390021
         LA    RW1,DX4(RW1)                                             48400021
         BC    UNCOND,MAC142       LOOP TO CHECK IF DONE                48410021
       EJECT                                                            48420021
*=1    ORIGIN - SAVE CURRENT LOCCTR, SET LOCCTR TO GN LOC               48430021
MAC150 L     RW1,LOCCTR                                                 48440021
       ST    RW1,LOCORG       SAVE LOCCTR                               48450021
       L     R15,AGET                                                   48460021
       BALR  RS1,R15               GET ELT                              48470021
         MVC   C6WRK0(LX2),A6GNNO                                       48480021
       LH    RW1,C6WRK0                                                 48490021
       L     R15,AGETPN                                                 48500021
       USING GETPN,R15         GET RESOLVED PN OR GN NUMBER             48510021
       BAL   RS1,GETGN         RW1 CONTAINS LOC IN PGT                  48520021
       DROP  R15                                                        48530021
       A     RW1,LOCPGT                                                 48540021
       L     R15,ASRCRL                                                 48550021
       BALR  RS1,R15            SEARCH RLDTBL                           48560021
       C     RW1,C6F0                                                   48570021
       L     R15,AGET                                                   48580021
       BALR  RS1,R15               GET ELT                              48590021
       CLI   GOTCOD,PLUS                                                48600021
       BC    NOTEQ,ERR040          NOT PLUS, PH6 ERROR                  48610021
         MVC   C6WRK0(LX2),A6PLIN+NX1  ONLY LAST 2 BYTES                48620021
       AH    RW1,C6WRK0                                                 48630021
       ST    RW1,LOCCTR       NEW LOCCTR                                48640021
         BC    UNCOND,SE6080       GET NEXT ELT                         48650021
       SPACE 3                                                          48660021
*=1    REORIGIN - RESTORE LOCCTR                                        48670021
MAC160 L     RW1,LOCORG                                                 48680021
       ST    RW1,LOCCTR                                                 48690021
         BC    UNCOND,SE6080       GET NEXT ELT                         48700021
*=1    SEGMENT INITIALIZATION                                           48710021
MAC180 L     R1,AVNPTY             GET PARLIST ADDR                     48720021
       L     R15,ATABLE       GET VNPTY TB ADDR                         48730021
       BALR  RS1,R15          UPON RETURN-R1=STARTING ADDR,R2=SIZE      48740021
       LTR   R2,R2            ANY ENTRIES IN VNPTY TBL                  48750021
         BC    ZERO,MAC186         NO - PROCESS NEXT A-TEXT ELT         48760021
       LR    RW1,R1           GET VNPTY TBL ADDR                        48770021
       SR    R0,R0            INITIALIZE 1ST TIME FOUND SWITCH          48780021
       SR    RW2,RW2          INITIALIZE POSITION COUNTER               48790021
       SR    RW3,RW3          INITIALIZE CTR OF ENTRIES OF EQUAL PT     48800021
*                                                                       48810021
*  SEARCH VNPTY TBL AND COMPUTE POSITION OF ENTRIES OF DESIRED PTY      48820021
*                                                                       48830021
MAC182   LA    R15,DX0(R1,R2)       END OF TBL ADDR                     48840021
       CR    RW1,R15               HAS END OF TBL BEEN REACHED          48850021
       BC    NOTLO,MAC184     YES,BR                                    48860021
         CLC   A6MAPR(LX1),DX0(RW1) IS PTY EQUAL TO PTY OF SEGM BEING I 48870021
         MVC   C6WRK0+NX2(LX2),DX1(RW1) SAVE VN #                       48880021
         LA    RW2,DX1(RW2)    BUMP POSITION CTR                        48890021
         LA    RW1,DX3(RW1)    POINT TO NEXT ENTRY IN VNPTY TBL         48900021
         BC    NOTEQ,MAC182        BR, PRIORITIES NOT EQUAL             48910021
         LA    RW3,DX1(RW3)    COUNT NO. OF ENTRIES OF EQUAL PTY        48920021
       LTR   R0,R0                 IS THIS 1ST MATCH                    48930021
         BC    NOTEQ,MAC182        NO, BRANCH                           48940021
         LA    R0,DX1               SET A SWITCH TO EXECUTE INSTR.      48950021
*                                  THAT FOLLOWS ONLY ONCE               48960021
       STH   RW2,C6WRK0            SAVE POSITION OF THIS ENTRY          48970021
         MVC   POS1(LX2),C6WRK0+NX2  SPECIFY VN #                       48980021
       B     MAC182                SEARCH FOR MORE ENTRIES              48990021
MAC184 LTR   RW3,RW3               ANY VN'S FOR THIS SEGMENT            49000021
         BC    EQ,MAC186           BR, NO VN'S                          49010021
         MVC   POS2(LX2),C6WRK0                                         49020021
         SLL   RW3,DX2              GET LENGTH IN BYTES                 49030021
       LA    RW2,SEGTXT            GET ADDRESS OF INITIALIZE A-TXT      49040021
       L     R15,ACODLU                                                 49050021
       BALR  RS1,R15               PROCESS INITIALIZE A-TXT             49060021
MAC186   LA    R0,THREE            THREE BYTES                          49070021
       STH   R0,GETLEN             THIS IS A 3-BYTE MACRO ELMNT         49080021
         MVI   FGET,FGETNOT        CONTINUE WITH OLD BLK,REAL ATX       49090021
       B     SE6080                PROCESS NEXT A-TXT EL                49100021
*  BEGINNING OF GROUP-SEGMENT INITIALIZATION  A-TEXT                    49110021
SEGTXT DC    X'48D200AC5400'       MOVE SEGMENT'S VN CELLS              49120021
POS1   DS    XL2                                                        49130021
       DC    X'A89000'                                                  49140021
POS2   DS    XL2                                                        49150021
       DC    X'A800'                                                    49160021
*  END OF GROUP                                                         49170021
       EJECT                                                            49180021
*=1    FOR PNBCD CREATE THE FOLLOWING IN-LINE                           49190021
*      DC    X'04'           LENGTH-1 OF CARD NUMBER                    49200021
*      DC    CL5'CARD NUMBER'                                           49210021
*                        FORMAT //3C// ( NO FIELDS)                     49220021
PNBPRO DS    0H                                                         49230021
PNB030 DS    0H                                                         49240021
         MVC   PNBSVG(LX2),GETLEN                                       49250021
       ST    INPUTR,PNBSAV                                              49260021
         LA    INPUTR,PNBCDL-NX1                                        49270021
PNB032 DS    0H                                                         49280021
       BAL   RS1,MAC092            CREATE DC                            49290021
       L     INPUTR,PNBSAV                                              49300021
         MVC   GETLEN(LX2),PNBSVG                                       49310021
*      INCREMENT LOCATION COUNTER IF ODD                                49320021
       L     RW1,LOCCTR                                                 49330021
         LA    RW1,DX1(RW1)                                             49340021
         SRL   RW1,DX1                                                  49350021
         SLL   RW1,DX1                                                  49360021
       ST    RW1,LOCCTR                                                 49370021
       BC    UNCOND,SE6080    GO TO GET MORE A-TEXT                     49380021
         EJECT                                                          49390021
*                                                                       49400021
*=1    PROCESS ANY SPECIAL ELT NEEDED FOR INIT2 OR INIT3 CODING         49410021
*      FORMAT  //88 CC //                                               49420021
*      WHERE                                                            49430021
*            CC=01  CONTENTS VNCTR                                      49440021
*               03  ONCTL CELLS (PFMCTR-ONCTR)                          49450021
*               02  DECB CELLS (TSMAX-DECBCT)                           49460021
*               04  XSW CELLS (XSA-XSW)                                 49470021
*               05  PFMCTL CELLS (PSVCTR-PFMCTL)                        49480021
*               07  BL CELLS (DECBCT-BLCTR)                             49490021
*                                                                       49500021
*            IF HI-ORDER BIT=1 SUBTRACT 1                               49510021
*            VALUE TO BE PLACED IN C6RS (IMMEDIATE OR LENGTH FIELD)     49520021
*                                                                       49530021
GENIMM DS    0H                                                         49540021
         IC    RW1,A6CODE+NX1  GET TYPE                                 49550021
       N     RW1,C6MA                                                   49560021
         SLL   RW1,DX2                                                  49570021
         EX    R0,LATBL(RW1)                                            49580021
       EX    R0,SUBTBL(RW1)                                             49590021
GEN010 DS    0H                                                         49600021
         TM    A6CODE+NX1,HION                                          49610021
       BC    ZERO,GEN020           DON'T NEED TO SUBTRACT 1             49620021
       BCTR  RW2,R0                SUBTRACT 1, HI ORDER BIT=1           49630021
GEN020 DS    0H                                                         49640021
       BC    UNCOND,R6242          GO PUT VALUE IN C6RS                 49650021
         SPACE 3                                                        49660021
*                                                                       49670021
*      FORMAT //8C CC//                                                 49680021
*      WHERE                                                            49690021
*            CC=01  DISP OF INSTR=VNCTR  BASE=0                         49700021
*               02  DISP=TSMAX-DECBCT                                   49710021
*               03  DISP=PFMCTR-ONCTR                                   49720021
*               04  DISP=XSA-XSW                                        49730021
*               05  DISP=PSVCTR-PFMCTL                                  49740021
*               07  DISP=DECBCT-BLCTR                                   49750021
*                                                                       49760021
*                                                                       49770021
*            CREATE BDISP-LIKE ELT OF ABOVE COMPONENTS                  49780021
*            HI-ORDER BIT OF CC=1 AS ABOVE                              49790021
*                                                                       49800021
GENBD  DS    0H                                                         49810021
         IC    RW1,A6CODE+NX1  TYPE                                     49820021
       N     RW1,C6MA                                                   49830021
         SLL   RW1,DX2                                                  49840021
         EX    R0,LATBL(RW1)                                            49850021
       EX    R0,SUBTBL(RW1)                                             49860021
       LR    RW1,RW2                                                    49870021
       SR    RW2,RW2                                                    49880021
       BC    UNCOND,R6220          GO COMPLETE BDISP ELT                49890021
         EJECT                                                          49900021
*                                                                       49910021
*      IDENTLOC ELT //9C//                                              49920021
*            FROM THIS ELEMENT CREATE FULL-WORD IN-LINE OF              49930021
*            DC     F'IDENTLOC'                                         49940021
*            PREVIOUS CODING WILL ALIGN PROPERLY                        49950021
GIDENL DS    0H                                                         49960021
         MVI   PNBCDL,XX04                                              49970021
         MVC   PNBCDL+NX1(LX4),IDENTL                                   49980021
       BC    UNCOND,PNB030         GO COMPLETE IN-LINE DC'S             49990021
         EJECT                                                          50000021
*                                                                       50010021
*=1  END OF PROCEDURE A-TEXT                                            50020021
ENDPTX DS    0H                                                         50030021
         USING PUT,R15             FORCE LAST LINE IF CLIST             50040021
         L     R15,APUT                                                 50050021
         BAL   RS1,PUTCEND         GO TO END-OF-CLIST-PRINT RTE         50060021
*                                                                       50070021
       L     RW1,LOCCTR                                                 50080021
       ST    RW1,CKLOC   SAVE HI VALUE OF LOCCTR FOR INIT2              50090021
*=1  DESTROY LTLTBL, VIRTBL                                             50100021
*                                                                       50110021
       LA    R1,ALTLTB        XTABRL WILL LOAD R1 WITH TIB ADDRESS      50120021
       L     R15,ATABRL                                                 50130021
       BALR  RS1,R15               GO RELEASE TABLE                     50140021
*                                                                       50150021
*                                                                       50160021
       LA    R1,AVIRPT        XTABRL WILL LOAD R1 WITH TIB ADDRESS      50170021
       L     R15,ATABRL                                                 50180021
       BALR  RS1,R15               GO RELEASE TABLE                     50190021
*    DESTROY CVIRTB + LVIRTB                                            50200021
       LA    R1,ACVIRT        XTABRL WILL LOAD R1 WITH TIB ADDRESS      50210021
       L     R15,ATABRL                                                 50220021
       BALR  RS1,R15               GO RELEASE TABLE                     50230021
       LA    R1,ALVIRT        XTABRL WILL LOAD R1 WITH TIB ADDRESS      50240021
       L     R15,ATABRL                                                 50250021
       BALR  RS1,R15               GO RELEASE TABLE                     50260021
         OI    VIRTSW,NOVIRTBL     VIRTUAL TABLE KILLED/NOT MADE        50270021
       TM    PHZSW1,XREF           IS XREF SPECIFIED                    50280021
         BC    EQ,PDATEX           NO, BRANCH                           50290021
       BALR  R0,RB2                BR TO PH0                            50300021
       DC    X'61'                 REWIND UT1 FOR DN,PN DEFS            50310021
       DC    X'00'                 INDICATE-READ WAS LAST ON UT1        50320021
         LA    R2,AC77             ADDRESS OF 77                        50330021
         LA    R3,ONEBYTE                                               50340021
         BALR  R0,RB2              WRITE EOF INDICATOR FOR GA           50350021
         DC    X'13'                                                    50360021
*                                                                       50370021
         BALR  R0,RB2              PURGE BUFFER SO THAT E-TEXT          50380021
         DC    X'F3CC'             MAY BE WRITTEN IN NEW BLOCK          50390021
       EJECT                                                            50400021
*=1   PROCESS DATA A-TEXT AND E-TEXT                                    50410021
*                                                                       50420021
*    POSITION TO END OF LISTING TEXT                                    50430021
*                                                                       50440021
PDATEX DS    0H                                                         50450021
       LA    RW2,PDT030       EOF RETURN                                50460021
         OI    F4SW,F4POS01        POSITION TO 01                       50470021
       L     R15,AGETF4                                                 50480021
       BALR  RS1,R15               GET AN ELT FROM FILE 4               50490021
         NI    F4SW,F4NOTLST       NO LONGER IN LISTING TEXT            50500021
*                                                                       50510021
         SPACE 3                                                        50520021
*    DATA A-TEXT OR E-TEXT                                              50530021
*                                                                       50540021
       LR    INPUTR,F4REG          INITIAL VALUE                        50550021
         OI    F4SW,F4INPUTR       USE INPUTR                           50560021
* GET NEXT DATA OR ERROR ELEMENT                                        50570021
PDT020 L     R15,AGETF4                                                 50580021
       LA    RW2,PDT030       EOF RETURN                                50590021
       BALR  RS1,R15               GET AN ELT FROM FILE 4               50600021
         CLI   DX0(INPUTR),INITOFF   TYPE IS ERR OR DATA A TEXT         50610021
       BC    NOTEQ,D6000           DATA A-TEXT                          50620021
         EJECT                                                          50630021
*=1  PROCESS E-TEXT ELEMENT                                             50640021
*                                                                       50650021
       SR    RW1,RW1                                                    50660021
         IC    RW1,DX1(INPUTR)      LENGTH OF VF                        50670021
         LA    RW1,DX2(RW1)                                             50680021
PDT040 DS    0H                                                         50690021
       STH   RW1,G4LEN                                                  50700021
         TM    DX2(INPUTR),ALLON                                        50710021
       BC    ZERO,PDT041          MESSAGE DEF                           50720021
         TM    ETXSW,ETXNTWRN      NOT WARNING LEVEL                    50730021
       BC    ZERO,PDT020          IGNORE THIS PARAMETER                 50740021
         BC    UNCOND,PDT042       CONTINUE PROCESSING DATA A-TXT       50750021
PDT041   NI    ETXSW,ETXWRN        RESET, WARNING LEVEL                 50760021
         TM    DX7(INPUTR),MF0                                          50770021
       BC    NOTZER,PDT042        NOT WARNING, PROCESS                  50780021
         TM    PHZSW,FLAGW         WARNING LEVEL                        50790021
       BC    ZERO,PDT020          DON'T FLAG WARNINGS                   50800021
PDT042   OI    ETXSW,ETXNTWRN      NOT WARNING LEVEL                    50810021
         OI    ERF4SW,ERF4ON       PH7 TO PRINT ERROR MSG               50820021
PDT022 LH    RW1,G4LEN                                                  50830021
       AH    RW1,ERRCUR                                                 50840021
       STH   RW1,ERRCUR                                                 50850021
       LH    RW1,G4LEN                                                  50860021
         TM    SWITCH+NX1,NOFITSW                                       50870021
         BC    ONES,USEF3          TABLE FULL - USE F3                  50880021
       L     R1,AERRTB                                                  50890021
         L     R15,ATABLE          GET ADDRESS OF ERRTBL                50900021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              50910021
       LH      R3,EINDEX           GET INDEX INTO TABLE                 50920021
         LA    R2,ALLON            MAX TABLE SIZE-1 FOR EOTBL           50930021
         SR    R2,RW1              LESS NEXT ENTRY                      50940021
         CLR   R2,R3                                                    50950021
         BC    LO,NOFIT            GO PUT E-TEXT ON F3                  50960021
         BCTR  RW1,R0              SUBTRACT 1                           50970021
         AR    R1,R3               ADD INDEX TO TABLE START             50980021
       EX    RW1,MVCETX       MOVE E-TEXT TO TABLE                      50990021
         AH    R3,G4LEN            INCREMENT INDEX FOR NEXT             51000021
         STH   R3,EINDEX           INSERT AND SAVE IT                   51010021
         BC    UNCOND,PDT020       GET NEXT ELT                         51020021
*                                                                       51030021
NOFIT    DS    0H                                                       51040021
         LR    R2,R1              GET ADDRESS FOR WRITE                 51050021
         TM    PHZSW1,XREF         WAS XREF SPECIFIED                   51060021
         BC    ONES,NOFIT1         YES - F3 HAS BEEN REWOUND            51070021
         BALR  R0,RB2              NO - I'LL DO IT MYSELF               51080021
         DC    X'63'               REWIND                               51090021
         DC    X'00'               READ WAS LAST I/O                    51100021
NOFIT1   DS    0H                                                       51110021
*                                  R3 ALLREADY HAS LENGTH               51120021
         BALR  R0,RB2              WRITE TABLE OUT ON F3                51130021
         DC    X'13'                                                    51140021
         LA    R1,AERRTB                                                51150021
         L     R15,ATABRL                                               51160021
         BALR  RS1,R15             RELEASE ERRTBL                       51170021
         NI    DOEOTSW,INITOFF     INDICATE DON'T INSERT END            51180021
*                                  OF TABLE MARKER                      51190021
         OI    SWITCH+NX1,NOFITSW  INDICATE DON'T USE TABLE AGAIN       51200021
USEF3    DS    0H                                                       51210021
         LR    R2,INPUTR           E-TXT ADDRESS                        51220021
         LR    R3,RW1                    LENGTH                         51230021
         BALR  R0,RB2              WRITE E-TEXT                         51240021
         DC    X'13'                                                    51250021
         BC    UNCOND,PDT020       GET NEXT                             51260021
*                                                                       51270021
MVCETX   MVC   DX0(LX1,R1),DX0(INPUTR) MOVE E-TEXT TO TABLE             51280021
       EJECT                                                            51290021
*                                                                       51300021
*=1  IDENTIFY AND PROCESS DATA A-TEXT ELEMENT                           51310021
*=     (REFERRED TO IN COMMENTS CARDS AS D6000)                         51320021
*                                                                       51330021
D6000  SR    RW1,RW1                                                    51340021
       IC    RW1,A6CODE                                                 51350021
         L     RW2,D6TBL-NX4(RW1)                                       51360021
         BCR   UNCOND,RW2          USE D6TBL,BR-TBL/DATA A-TXT RT       51370021
         SPACE 4                                                        51380021
D6ERR  L     R15,AGETF4                                                 51390021
       USING GETF4,R15                                                  51400021
       LA    RW2,PDT030       EOF RETURN                                51410021
         BC    UNCOND,G4ER3        PUT OUT MSG, GO TO EOF               51420021
       EJECT                                                            51430021
*                                                                       51440021
*=1    CONDEF   // 28 LLLLLL TT SSSS VALUE //                           51450021
*                                                                       51460021
*              LLLLLL  IS RELLOC OF CONSTANT                            51470021
*              TT      IS TYPE--00  HEX                                 51480021
*                               01  ALPHA                               51490021
*                               FF  ALL                                 51500021
*              SSSS    SIZE                                             51510021
*              VALUE   CONSTANT (IF TYPE=ALL ONLY 1 BYTE)               51520021
*                                                                       51530021
D6CON    MVC   LOCCTR+NX1(LX3),A6CONL RELLOC                            51540021
         NI    LOCCTR,INITOFF                                           51550021
         SR    RW1,RW1                                            9374  51560021
         ST    RW1,C6WRK0                                         9374  51570021
         MVC   C6WRK0+NX2,A6CONS        SIZE                      9374  51580021
         L     RW1,C6WRK0                                         9374  51590021
         TM    A6CONT,ALLON        TYPE                                 51600021
       BC    ONES,ALLCON           TYPE=ALL                             51610021
*                                                                       51620021
NALL   LR    R0,RW1            LENGTH                                   51630021
         LA    R1,DX7(INPUTR)        POINT R1 TO VALUE                  51640021
       LH    RW1,G4LEN                                                  51650021
       AR    RW1,R0                                                     51660021
       STH   RW1,G4LEN        INCR LRL FOR GETF4                        51670021
*                                                                       51680021
       L     R15,ATXPNH        PUNCH DATA                               51690021
       BALR  RS1,R15               GO PUNCH                             51700021
       BC    UNCOND,PDT020         GO GET NEXT ELT                      51710021
         SPACE 3                                                        51720021
*                                                                       51730021
*      ALL CONDEF--MOVE TO MAX WORK AREA                                51740021
*                                                                       51750021
ALLCON   DS    0H                                                       51760021
         SR    RW3,RW3                                                  51770021
         IC    RW3,A6CONLV         GET LENGTH OF VALUE                  51780021
         LTR   RW3,RW3           IS THERE ANY LENGTH               3808 51790021
         BC    ZERO,D6ERR        NO, CANT DIVIDE BY ZERO, ERROR    3808 51800021
         LR    R2,RW1              SAVE TOTAL LENGTH                    51810021
         SR    RW1,RW1             CLEAR EVEN REGISTER                  51820021
         LA    RW2,DX256            DETERMINE MAXIMUM NO OF TIMES       51830021
         DR    RW1,RW3             ALL LIT CAN BE PROPAGATED IN         51840021
         LR    RW1,RW2             ALLWRK                               51850021
         LA    R1,ALLWRK                                                51860021
ALLMOVE  DS    0H                                                       51870021
         EX    RW3,MOVEALL         MOVE ALL LIT(LENGTH OF VALUE)        51880021
         AR    R1,RW3              ADD LENGTH TO ALLWRK ADDRESS         51890021
         BCT   RW1,ALLMOVE         LOOP TO FILL ALLWRK WITH VALUE       51900021
         MR    RW1,RW3             RW2 HAS MAX NO(X LENGTH IN RW3)      51910021
         LR    R0,RW2              LENGTH OF ALLWRK                     51920021
ALLTST   DS    0H                                                       51930021
         CR    R2,R0               MORE THAN ALLWRK LENGTH              51940021
         BC    HI,PUNALL           NO - PUNCH ALLWRK LENGTH             51950021
         LR    R0,R2                                                    51960021
PUNALL   DS    0H                                                       51970021
         LA    R1,ALLWRK                                                51980021
         L     R15,ATXPNH                                               51990021
         BALR  RS1,R15             GO PUNCH                             52000021
         CR    R2,R0               ANY MORE                             52010021
         BC    NOTHI,FIXLEN        NO - GO ADJUST LRL                   52020021
         SR    R2,R0                                                    52030021
         BC    UNCOND,ALLTST       GO PUNCH SOME MORE                   52040021
FIXLEN   DS    0H                                                       52050021
         AH    RW3,G4LEN           LENGTH OF VALUE                      52060021
         LA    RW3,DX1(RW3)         ADJUST FOR COUNT BYTE               52070021
         STH   RW3,G4LEN                                                52080021
         BC    UNCOND,PDT020       GET NEXT ELEMENT                     52090021
*                                                                       52100021
MOVEALL  MVC   DX0(LX0,R1),A6CONV                                       52110021
       EJECT                                                            52120021
*=1   DCBADEF   // 04 LLLLLL DD //                                      52130021
*                                                                       52140021
*              LLLLLL  IS RELLOC OF DCB                                 52150021
*              DD      IS DCB NUMBER                                    52160021
*                                                                       52170021
D6DCB  SR    RW1,RW1                                                    52180021
       IC    RW1,A6DCBN            GET DCB NUMBER                       52190021
       BCTR  RW1,R0                SUBTRACT 1                           52200021
D6DC10   SLL   RW1,DX2              *4                                  52210021
       AH    RW1,DCBCTR             + DCBCTR IS DISPLACEMENT            52220021
       A     RW1,LOCPGT             + LOCPGT                            52230021
       ST    RW1,D6TARG            IS TARGET LOCATION                   52240021
       MVI   D6TARG,DTYP           DATA BLOCK TYPE                      52250021
         BAL   RS1,RLDRTE          GET ADDRESS FOR INSERT IN RLDTBL     52260021
         MVC   DX0(LX4,R2),D6TARG     ENTER TYPE, TARGET ADDRESS        52270021
         MVI   RELC4(R2),XX00      SPECIFY PTY ZERO                     52280021
         MVC   RELC(LX3,R2),A6DCBL GET RELATIVE ADDR VALUE              52290021
       BC    UNCOND,PDT020         GET NEXT                             52300021
         SPACE 3                                                        52310021
*                                                                       52320021
*                                                                       52330021
*=1   BLKADEF   // 0C LLLLLL KK RRRR SSSS //                            52340021
*                                                                       52350021
*              LLLLLL  IS RELLOC OF THE BLOCK                           52360021
*              KK      IS THE BL NUMBER                                 52370021
*              RRRR     IS UNUSED                                       52380021
*              SSSS    IS THE SIZE OF THE BLOCK IN WORDS                52390021
*                                                                       52400021
D6BLK  LA    RW2,BLCTR                                                  52410021
       BC    UNCOND,D6AL10         TO COMMON PROCESSOR                  52420021
       EJECT                                                            52430021
*=1   WSADEF    // 24 LLLLLL KK SSSSSS //                               52440021
*                                                                       52450021
*              LLLLLL  IS RELLOC OF THE WS AREA                         52460021
*              KK      IS THE BL NUMBER                                 52470021
*              SSSSSS  IS SIZE OF THE AREA IN WORDS                     52480021
*                                                                       52490021
*      ENTRIES TO THE RLDTBL WILL BE CONSTRUCTED FROM WHICH 1 ADCON     52500021
*      BL/4096-CHUNK-OF-WORKING-STORAGE PLUS 1 BL FOR THE REMAINING     52510021
*      LESS THAN 4096 BYTE CHUNK.  THESE BL'S ARE KK, KK+1, KK+2,..     52520021
*      KK+N.   THE RELATIVE ADDRESS OF THE WORKING-STORAGE SECTION      52530021
*      GOES INTO BL=KK, THAT ADDR + 4096 INTO BL=KK+1 , ETC.            52540021
*                                                                       52550021
*      EXAMPLE   //24 000140 01 000100 //                               52560021
*                BECOMES   BL=01  DC  A(140)  STORED INTO TGT           52570021
*                                                                       52580021
*                //24 000800 03 000900 //                               52590021
*                                                                       52600021
*                BECOMES   BL=03  DC  A(800)                            52610021
*                          BL=04  DC  A(1800)                           52620021
*                          BL=05  DC  A(2800)                           52630021
*                                                                       52640021
*                NEXT BL DEFINED BY PHASE 2 WILL BE BL=06               52650021
*                                                                       52660021
D6WSA  LA    RW2,BLCTR                                                  52670021
         NI    D6SIZE,INITOFF                                           52680021
         MVC   D6SIZE+NX1(LX3),A6WSS STORE SIZE                         52690021
       BC    UNCOND,D6AL20         TO COMMON PROCESSOR                  52700021
*                                                                       52710021
*                                                                       52720021
*=1   DECBADEF  // 08 LLLLLL DD RRRR SSSS //                            52730021
*                                                                       52740021
*              LLLLLL  IS RELLOC OF THE DECB                            52750021
         SPACE 3                                                        52760021
*              DD      IS DECB NUMBER                                   52770021
*              RRRR    IS RPD NUMBER                                    52780021
*              SSSS    IS SIZE OF THE DECB IN WORDS                     52790021
*                                                                       52800021
D6DECB LA    RW2,DECBCT                                                 52810021
*                                                                       52820021
*=1    COMMON PROCESSING OF DATA A-TEXT                                 52830021
*                                                                       52840021
D6AL10   XC    D6SIZE(LX4),D6SIZE                                       52850021
         MVC   D6SIZE+NX2(LX2),DX7(INPUTR) STORE SIZE                   52860021
D6AL20 L     RW1,D6SIZE                                                 52870021
         SLL   RW1,DX2              CHANGE SIZE                         52880021
       ST    RW1,D6SIZE            TO BYTES                             52890021
       ST    RW1,D6SSS             CURRENT SIZE                         52900021
D6AL25   LH    RW2,DX0(RW2)         COUNTER DISPLACEMENT                52910021
D6AL30 SR    RW1,RW1                                                    52920021
         IC    RW1,DX4(INPUTR)      COUNTER NUMBER                      52930021
       BCTR  RW1,R0                SUBTRACT 1                           52940021
D6AL40   SLL   RW1,DX2              *4                                  52950021
         AR    RW1,RW2             + COUNTER DISPLACEMENT               52960021
       A     RW1,RELLOC                                                 52970021
         MVC   D6REL+NX1(LX3),DX1(INPUTR) STORE RELATIVE LOCATION       52980021
         BC    UNCOND,D6AL50       CONTINUE WITH PH6                    52990021
D6AL45 AH    RW1,GTLNG                                                  53000021
D6AL50 DS    0H                                                         53010021
       ST    RW1,D6TARG            TARGET ADDRESS                       53020021
D6AL55 MVI   D6TARG,DTYP           DATA BLOCK TYPE                      53030021
         BAL   RS1,RLDRTE          GET ADDRESS FOR INSERT IN RLDTBL     53040021
         MVC   DX0(LX4,R2),D6TARG     ENTER TYPE, TARGET ADDRESS        53050021
         MVI   RELC4(R2),XX00      SPECIFY PTY ZERO                     53060021
         MVC   RELC(LX3,R2),D6REL+NX1 GET RELATIVE ADDR VALUE           53070021
         CLC   D6SSS(LX4),FW4096    GT 4096                             53080021
         BC    NOTHI,PDT020        NO, GET NEXT ELT                     53090021
       ST    RW1,D6RW1             YES, SAVE RW1                        53100021
       L     RW1,D6TARG                                                 53110021
         LA    RW1,DX4(RW1)         TARGET IS NEXT WORD                 53120021
       ST    RW1,D6TARG                                                 53130021
       L     RW1,D6REL                                                  53140021
       A     RW1,FW4096            LOCATION IS 4096 GREATER             53150021
       ST    RW1,D6REL                                                  53160021
       L     RW1,D6SSS                                                  53170021
       S     RW1,FW4096            REMAINDER                            53180021
       ST    RW1,D6SSS             OF BLOCK                             53190021
       L     RW1,D6RW1                                                  53200021
       BC    UNCOND,D6AL55         LOOP TO INSERT AGAIN                 53210021
       EJECT                                                            53220021
*=1    QDEF  //34 GGGG//                                                53230021
*              KK    IS SBL NUMBER                                      53240021
*              GGGG  IS Q-RTN NUMBER                                    53250021
*            HI-ORDER BIT OF GGGG ON IF BSAM                            53260021
*                                                                       53270021
D6SBL  DS    0H                                                         53280021
         MVC   C6WRK0(LX2),A6QGN                                        53290021
       LH    RW1,C6WRK0                                                 53300021
       N     RW1,C15BIT                                                 53310021
       L     R15,AGETPN                                                 53320021
       USING GETPN,R15                                                  53330021
       BAL   RS1,GETGN         GET REL GN=                              53340021
       DROP  R15                                                        53350021
       L     RW1,C15BIT                                                 53360021
         LA    RW1,DX1(RW1)                                             53370021
       LH    RW2,C6WRK0                                                 53380021
       NR    RW1,RW2                                                    53390021
       OR    RW3,RW1                                                    53400021
       STH   RW3,C6WRK0                                                 53410021
       L     R1,AQTBL          GET SPACE IN QTBL                        53420021
         L     R15,ATABLE                                               53430021
         BALR  RS1,R15             GET ADDRESS OF QTBL                  53440021
         LH    R2,QINDEX           GET INDEX INTO TABLE                 53450021
         AR    R1,R2              ADD THE TWO                           53460021
         MVC   DX0(LX2,R1),C6WRK0    DO   INSERT                        53470021
         LA    R2,DX2(R2)           INCREMENT INDEX FOR NEXT INSERT     53480021
         STH   R2,QINDEX           AND SAVE IT                          53490021
       BC    UNCOND,PDT020         GET NEXT ELT                         53500021
*                                                                       53510021
*                                                                       53520021
*                                                                       53530021
*                                                                       53540021
*=1    ACONDEF  //2C LLLLLL SS AAAAAA //                                53550021
*                                                                       53560021
*              LLLLLL-TARGET LOC                                        53570021
*              SS    -SIZE OF ADCON                                     53580021
*              AAAAAA-REL ADDR WHICH IS CON                             53590021
*                                                                       53600021
D6ACON DS      0H                                                       53610021
         MVC   LOCCTR+NX1(LX3),A6ACOL  SET LOCCTR TO TARGET LOCATION    53620021
         BAL   RS1,RLDRTE          GET ADDRESS FOR INSERT IN RLDTBL     53630021
         MVC   DX0(LX1,R2),A6ACOS    LENGTH                             53640021
         OI    DX0(R2),ATYP         ADCON TYPE                          53650021
         MVC   TARG(LX3,R2),A6ACOL GET TARGET ADDR                      53660021
         MVC   RELC(LX3,R2),A6ACOA  GET RELATIVE ADDRESS                53670021
         NI    RELC4(R2),XX00      SPECIFY PTY ZERO                     53680021
       BC      UNCOND,PDT020       GET NEXT ELT                         53690021
       EJECT                                                            53700021
*                                                                       53710021
*=1    EOF REACHED ON F4                                                53720021
*                                                                       53730021
PDT030 DS    0H                                                         53740021
*                                                                       53750021
*=1   MAKE ALL RLDTBL ENTRIES DIRECT BY                                 53760021
*      MATCHING RELLOC OF V AND I TYPES WITH                            53770021
*      TARGET OF N TYPES. WHEN MATCH IS FOUND,                          53780021
*      REPLACE V OR I TYPE RELLOC WITH                                  53790021
*      CORRESPONDING N TYPE RELLOC.                                     53800021
*      V AND I TYPES ARE IDENTIFIED BY 1 IN BIT 2 OF TYPE.              53810021
*      N TYPES ARE IDENTIFIED BY 1 IN BIT 3 OF TYPE.                    53820021
*                                                                       53830021
D6RLT    DS    0H                                                       53840021
         TM    SWRLDFUL,RLDOVFL    DID RLDTBL OVERFLOW                  53850021
         BC    ONES,D6PN30         YES - DON'T PROCESS                  53860021
         L     R1,ARLDTB           GET TABLE ADDRESS                    53870021
         L     R2,RLDINDEX         GET TABLE LENGTH                     53880021
         LA    RW2,DX0(R1,R2)    END OF TABLE                           53890021
       LR    RW3,R1            CURRENT N COMPARE                        53900021
       LR    RW1,R1            TABLE START                              53910021
D6RL10   TM    DX0(RW1),XX20        IS NEXT ENTRY I OR V                53920021
       BC    ZERO,D6RL30           NO                                   53930021
D6RL20   TM    DX0(RW3),XX10        IS CURRENT COMPARE N                53940021
       BC    ZERO,D6RL40           NO, TRY NEXT                         53950021
         CLC   RELC(LX3,RW1),TARG(RW3)                                  53960021
       BC    NOTEQ,D6RL40          TRY NEXT                             53970021
         MVC   RELC(LX3,RW1),RELC(RW3) REPLACE RELLOC                   53980021
D6RL30 LA    RW1,RLNG(RW1)                                              53990021
       CR    RW1,RW2               MORE ENTRIES IN TABLE                54000021
       BC    NOTLO,D6SR10          NO, FINISHED                         54010021
         L     R1,ARLDTB                                                54020021
         L     R2,RLDINDEX                                              54030021
       LR    RW3,R1            START OF TABLE                           54040021
       BC    UNCOND,D6RL10         TRY TO MATCH NEXT                    54050021
D6RL40 LA    RW3,RLNG(RW3)         NEXT COMPARE LOC                     54060021
       CR    RW3,RW2               STILL IN TABLE                       54070021
       BC    LO,D6RL20             YES                                  54080021
         MVC   RELC(LX3,RW1),THRZS  NO COMPARE, SET                     54090021
       BC    UNCOND,D6RL30         RELLOC ZERO                          54100021
*                                                                       54110021
THRZS  DC    X'000000'                                                  54120021
       EJECT                                                            54130021
*=1  SORT RLDTBL IN ASCENDING ORDER OF TARGET ADDRESSES                 54140021
*                                                                       54150021
D6SR10   DS    0H                                                       54160021
         L     R1,ARLDTB                                                54170021
         L     R2,RLDINDEX                                              54180021
       LR    RW1,R1            START                                    54190021
         LA    RW3,DX0(R1,R2)    END + 1                                54200021
D6SR20 LA    RW2,RLNG(RW1)         NEXT COMPARE LOC                     54210021
       CR    RW1,RW3               FINISHED                             54220021
       BC    NOTLO,D6PN10          YES                                  54230021
D6SR25 CR    RW2,RW3               MORE TO COMPARE                      54240021
       BC    LO,D6SR30             YES                                  54250021
       LA    RW1,RLNG(RW1)         NO, INCREMENT TARGET LOC             54260021
       BC    UNCOND,D6SR20         FOR NEXT COMPARE SERIES              54270021
D6SR30   CLC   TARG(LX3,RW1),TARG(RW2) IS OLD LOW STILL LOW             54280021
       BC    NOTHI,D6SR40          YES                                  54290021
         MVC   D6SRSV(RLNG),DX0(RW1) NO                                 54300021
         MVC   DX0(RLNG,RW1),DX0(RW2) SWAP OLD AND NEW LOW              54310021
         MVC   DX0(RLNG,RW2),D6SRSV                                     54320021
D6SR40 LA    RW2,RLNG(RW2)         UP COMPARE LOC                       54330021
       BC    UNCOND,D6SR25         GO COMPARE AGAIN                     54340021
         SPACE 3                                                        54350021
*                                                                       54360021
*                                                                       54370021
*=1    PUNCH TEXT AND RLDS FROM RLDTBL                                  54380021
*                                                                       54390021
D6PN10   DS    0H                                                       54400021
         L     R1,ARLDTB                                                54410021
         L     R2,RLDINDEX                                              54420021
       LR    RW1,R1                                                     54430021
         LA    RW3,DX0(R1,R2)                                           54440021
D6PN20 CR    RW1,RW3               STILL IN TABLE                       54450021
       BC    NOTLO,D6PN30          NO, FINISHED                         54460021
         IC    R0,DX0(RW1)                                              54470021
       N     R0,C6M2            GET LENGTH (LAST 4 BITS)                54480021
         XC    LOCCTR(LX1),LOCCTR   TARGET                              54490021
         MVC   LOCCTR+NX1(LX3),TARG(RW1) TO LOCCTR                      54500021
       L     RW2,LOCCTR       SAVE LOCCTR             )                 54510021
         TM    DX0(RW1),HION                                            54520021
       BC    ZERO,D6PN35        ALREADY PUNCHED                         54530021
         MVC   D6PNTX(LX4),RELC4(RW1)   MOVE DATA                       54540021
       LA    R1,D6PNTX              DATA ADDRESS                        54550021
         TM    DX0(RW1),THREE      IF THREE-BYTE ADCON                  54560021
       BC    NOTONE,D6PN27         INCREMENT DATA                       54570021
         LA    R1,DX1(R1)             ADDRESS BY 1                      54580021
D6PN27 EQU   *                                                          54590021
       L     R15,ATXPNH                                                 54600021
       BALR  RS1,R15                 PUNCH TEXT                         54610021
D6PN35 EQU   *                                                          54620021
         TM    DX0(RW1),XX40    CREATE RLD ONLY                         54630021
       BC    ZERO,D6PN28         FOR I OR A TYPE                        54640021
       LR    R1,RW2            LOC OF ADCON                             54650021
       LH    RW2,ESDID             SAVE ADCON                           54660021
         MVC   ESDID(LX2),C61                                           54670021
       BCTR  R0,R0              CONVERT LENGTH                          54680021
         SLL   R0,DX2            FOR FLAG BYTE                          54690021
       L     R15,ARLD                                                   54700021
       BALR  RS1,R15                 PUNCH RLD                          54710021
       STH   RW2,ESDID             RESTORE ESDID                        54720021
D6PN28 EQU   *                                                          54730021
       LA    RW1,RLNG(RW1)         NEXT                                 54740021
       BC    UNCOND,D6PN20         GO COMPARE AGAIN                     54750021
D6PN30 EQU   *                                                          54760021
       EJECT                                                            54770021
*                                                                       54780021
*=1    FOLLOWING CODING CAN OVERLAY FROM D6000 (DATA A-TEXT             54790021
*=     IDENTIFICATION AND PROCESSING)                                   54800021
*      SET FOR ASSEMBLED INPUT                                          54810021
         NI    QRTNSW,INITOFF      RESET QRTN SW                        54820021
       L     R15,AUSING                                                 54830021
       BALR  RS1,R15               SET UP ADDR'ABILITY                  54840021
         OI    TESTSW,TSTREAL      F3 PROCESSING FINISHED               54850021
         OI    RGNSW,RGNINIT       PROCESSING INIT CODING               54860021
         NI    FGET,FGETNEW        GET NEW BLOCK                        54870021
         L     RW1,CKLOC                                                54880021
         ST    RW1,LOCCTR          RESET LOCCTR                         54890021
         SPACE 3                                                        54900021
*=1    CHECKPOINT PROCESSING                                            54910021
*                                                                       54920021
*                                                                       54930021
*      GENERATE CHECKPOINT ROUTINE IF RERUN CLAUSE SPECIFIED            54940021
*             AND SAVE LOCCTR AFTER IT                                  54950021
*                                                                       54960021
PCKPT  DS    0H                                                         54970021
       L     R15,AS6800                  PRINT LAST LINE                54980021
       BALR  RS1,R15               FORMAT AND PRINT LINE                54990021
       BC    UNCOND,GINIT2         CONTINUE PROCESSING- INIT CODE       55000021
       EJECT                                                            55010021
*=1    GENERATE INIT2 CODING                                            55020021
*                                                                       55030021
*                                                                       55040021
GINIT2 DS    0H                                                         55050021
         XC    CELL14(LX2),CELL14                                       55060021
         XC    CELL15(LX2),CELL15                                       55070021
       L     RW1,LOCCTR                                                 55080021
       ST    RW1,LINIT2                                                 55090021
       L     RW2,AINOS2                                                 55100021
OTIN2  DS    0H                                                         55110021
         MVC   OU6NAM(LX5),CINIT2                                       55120021
       BAL   RW1,SU6010            GO DO COMMON ASSEM A-TXT CODE        55130021
*=1      GENERATE INIT3                                                 55140021
GINIT3   DS    0H                                                       55150021
         L     R15,AS6800          PRINT PRECEDING LINE                 55160021
         BALR  RS1,R15             FORMAT AND PRINT LINE                55170021
         L     RW1,LOCCTR          SAVE LOCATION COUNTER                55180021
         ST    RW1,LINIT3          AT START OF INIT3                    55190021
         L     RW2,AINIT3                                               55200021
OTIN3    DS    0H                                                       55210021
         MVC   OU6NAM(LX5),CINIT3                                       55220021
         BAL   RW1,SU6010          GO DO COMMON ASSEM A-TXT CODE        55230021
FTIN2  DS    0H                                                         55240021
*                                                                       55250021
       LH    RW1,VIRCTR                                                 55260021
       LTR   RW1,RW1                                                    55270021
       BC    ZERO,FSEC0      NO PGT OVFL CELLS                          55280021
       L     RW2,ASECT0                                                 55290021
       BAL   RW1,SU6010        INIT PGT OVFL CELLS                      55300021
FSEC0  DS    0H                                                         55310021
*                                                                       55320021
       LH    RW1,LTLCTR                                                 55330021
       SH    RW1,PNCTR                                                  55340021
       BC    ZERO,FSEC1      NO PN'S, GN'SY OR D&B'S                    55350021
       L     RW2,ASECT1                                                 55360021
       BAL   RW1,SU6010       GENERATE PGT INITIALIZATION               55370021
         CLI   SEGLMT,NOTSEGTD     IS SOURCE PROGRAM SEGMENTED          55380021
       L     RW2,ASEC1B           SKIP A TEXT FOR SEGM PROGR            55390021
         BC    NOTEQ,FSEC1A        YES, BRANCH                          55400021
FSEC0A BAL   RW1,SU6010           INITIALIZE PGT FOR NOT SEGM PROGR     55410021
FSEC1  DS    0H                                                         55420021
*                                                                       55430021
       LH    RW3,TSMAX                                                  55440021
       SH    RW3,MAXOV                                                  55450021
         BC    ZERO,FSECX2         NO TGT OVFLO CELLS                   55460021
       L     RW2,ASECX2                                                 55470021
         BAL   RW1,SU6010          INIT TGT OVFLO CELLS                 55480021
FSECX2 DS    0H                                                         55490021
         B     RNEW                GEN CODING TO INIT VN CELLS          55500021
FSEC1A L     RW2,ASEC1A           GET ADDR OF INIT2 TEXT FOR SEGM       55510021
       B     FSEC0A               INITIALIZE PGT FOR SEGM PROG          55520021
FSECR  DS    0H                                                         55530021
       EJECT                                                            55540021
RNEW     DS    0H                                                       55550021
*                                                                       55560021
*      GENERATE CODING TO INITIALIZE VN CELLS                           55570021
*                                                                       55580021
         LA    RS1,FTINP                                                55590021
GATTV  DS    0H                                                         55600021
       LH    RW3,VNCTR                                                  55610021
       LTR   RW3,RW3     NO VNI CELLS                                   55620021
       BCR   ZERO,RS1         NO                                        55630021
       LA    RW2,VNATX                                                  55640021
         MVI   SPVNRF,SPVN1        USE VN1 IF PROG SEGMENTED            55650021
         MVI   VNOVFL,ALLON        SWITCH FOR INIT3              21795  55660021
       L     R15,ACODLU                                                 55670021
       BCR   UNCOND,R15            GO CODE UP A-TXT                     55680021
FTINP  DS    0H                                                         55690021
         MVI   VNOVFL,INITOFF      UNUT3 SW OFF                   21795 55700021
         CLI   C6OP,NOPOPCD                                             55710021
       BC    EQ,EINRG              CNOP, SO DON'T PRINT LINE            55720021
       L     R15,AS6800                                                 55730021
       BALR  RS1,R15               FORMAT AND PRINT LINE                55740021
EINRG  DS    0H                                                         55750021
*      GENERATE CODING TO INITIALIZE ANY QRTNES WHICH DEPEND ON W-S     55760021
       LH    RW3,ODOCTR                                                 55770021
       LTR   RW3,RW3                                                    55780021
       BC    ZERO,QINTF            NO QRTN'S, CONTINUE                  55790021
       MVC   QATEXT,QTEXTC                                              55800021
       SR    RW3,RW3                                                    55810021
GQINT  STH   RW3,SAVBCT                                                 55820021
         SLL   RW3,DX1                                                  55830021
       L     R1,AQTBL                                                   55840021
       L     R15,ATABLE                                                 55850021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              55860021
         LH    RW1,DX0(R1,RW3)                                          55870021
       LR    RW2,RW1                                                    55880021
       N     RW1,C15BIT                                                 55890021
       STH   RW1,QNUM                                                   55900021
       CLR   RW1,RW2                                                    55910021
       BC    EQ,QINTB              NUMBERS MATCH                        55920021
       L     RW2,AXQTXT                                                 55930021
       BAL   RW1,SU6010            GO DO COMMON ASSEM A-TXT CODE        55940021
       LA    RW2,QATEXT                                                 55950021
       BAL   RW1,SU6010            GO DO COMMON ASSEM A-TXT CODE        55960021
       L     RW2,AYQTXT                                                 55970021
         BC    UNCOND,QINTC        CONTINUE                             55980021
QINTB  LA    RW2,QATEXT                                                 55990021
QINTC  BAL   RW1,SU6010            GO DO COMMON ASSEM A-TXT CODE        56000021
       SR    RW3,RW3                                          8267      56010021
       STH   RW3,CELL14                                       8267      56020021
       STH   RW3,CELL15                                       8267      56030021
       LH    RW3,SAVBCT                                                 56040021
         LA    RW3,DX1(RW3)                                             56050021
       CH    RW3,ODOCTR                                                 56060021
       BC    NOTEQ,GQINT           NOT DONE YET                         56070021
QINTF  EQU   *                                                          56080021
*   GENERATE REGISTER ASSIGNMENT                                        56090021
         CLI   C6OP,NOPOPCD                                             56100021
       BC    EQ,QINTF2             CNOP, SO DON'T PRINT LINE            56110021
       L     R15,AS6800                                                 56120021
       BALR  RS1,R15               FORMAT AND PRINT LINE                56130021
QINTF2 DS    0H                                                         56140021
       L     R15,AINITR                                                 56150021
       BALR  RS1,R15               GO GEN LOAD OF PERM REGS             56160021
QINTX  DS    0H                                                         56170021
       L     RW2,AINI3B                                                 56180021
YCHAP  DS    0H                                                         56190021
       BAL     RW1,SU6010          GO DO COMMON ASSEM A-TXT CODE        56200021
       L     R15,AS6800             PRINT LAST LINE                     56210021
       BALR  RS1,R15               FORMAT AND PRINT LINE                56220021
*      SAVE HI VALUE OF LOCATION COUNTER FOR LENGTH OF CSECT            56230021
       L       RW1,LOCCTR                                               56240021
         ST    RW1,LNSECT                                               56250021
*        RELEASE QTBL                                                   56260021
       LA    R1,AQTBL         XTABRL WILL LOAD R1 WITH TIB ADDRESS      56270021
       L     R15,ATABRL                                                 56280021
       BALR  RS1,R15               RELEASE QTBL                         56290021
       EJECT                                                            56300021
*=1    PUNCH AND LIST INIT1                                             56310021
*                                                                       56320021
*                                                                       56330021
*      SET UP GET ROUTINE FOR INIT1                                     56340021
*                                                                       56350021
GINIT1 DS    0H                                                         56360021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 56370021
         BC    NOTEQ,OSIN12        YES, BRANCH                          56380021
OSIN0  EQU   *                                                          56390021
         NI    FGET,FGETNEW        GETNEW BLOCK                         56400021
       XC    LOCCTR,LOCCTR    ZERO LOCCTR-OR DUMMY START                56410021
       L     RW2,AINIOS                                                 56420021
OSIN1  DS    0H                                                         56430021
         MVC   OU6NAM(LX5),CINIT1                                       56440021
       BAL   RW1,SU6010       GENERATE INIT1 CODING                     56450021
       L     R15,AS6800                                                 56460021
       BALR  RS1,R15               FORMAT AND PRINT LINE                56470021
       L     RW1,LOCCTR                                                 56480021
       ST    RW1,C6WRK0                                                 56490021
       L     R15,AS6010            CONVERT LOCCTR TO DECIMAL            56500021
       BALR  RS1,R15               CONVERT                              56510021
         MVC   OU6LC(LX6),C6WRK3                                        56520021
         MVC   OU6OPN(LX2),DSCON    SET UP DS 15F FORPRINTING           56530021
         MVC   OU6OPD(LX3),DS15F                                        56540021
       L     R15,APUT              PRINT DS 15F                         56550021
       BALR  RS1,R15               PRINT                                56560021
         LA    RW1,DX60(RW1)        INCREMENT LOCATION COUNTER          56570021
       ST    RW1,LOCCTR                                                 56580021
         TM    PH1BYTE,INITBIT     APPLY CORE INDEX SPECIFIED           56590021
       BC    NOTONE,FPRIDX         NO-GO TO PRINT PROGRAM-ID            56600021
       L     RW2,AINI1A            YES, GENERATE CODING                 56610021
       BAL   RW1,SU6010            CONVERT                              56620021
       L     R15,AS6800            PRINT LAST LINE                      56630021
       BALR  RS1,R15               FORMAT AND PRINT LINE                56640021
FPRIDX LA    RW2,FFPRID            PRINT PROGRAM-ID                     56650021
       ST    RW2,ADTEST                                                 56660021
       LA    RW1,FTER                                                   56670021
       ST    RW1,EOFADR                                                 56680021
         NI    FGET,FGETNEW        GET NEW BLOCK                        56690021
         BC    UNCOND,SE6080       GO GET NEXT ELT                      56700021
OSIN12 L     RW1,ASEGLB            GET INIT1 TXT ADDR              STAN 56710021
         MVI   DX3(RW1),XX68        CHANGE TO A VCON                STA 56720021
       B     OSIN0                 CONTINUE WITH INIT1 CODING      STAN 56730021
FTER   DS    0H                                                         56740021
       EJECT                                                            56750021
*=1    CODING FROM HERE ON UNTIL 'CONSTANTS' CAN BE SEPARATE            56760021
*=     MEMORY LOAD                                                      56770021
*=1    FORCE OUT LAST CARDS                                             56780021
       ST    RS1,SVRET             SAVE RET ADDRESS                     56790021
       SR    R0,R0                        TEXT                          56800021
       L     R15,ATXPNH                                                 56810021
       BALR  RS1,R15               PUNCH TEXT                           56820021
       SR    R0,R0                        RLD                           56830021
       L     R15,ARLD                                                   56840021
       BALR  RS1,R15               PUNCH RLD CARD                       56850021
*=1    PUNCH END CARD                                                   56860021
         MVC   ENDFLD(LX5),ENDCON                                       56870021
         MVC   ENDCONDP(LX75),ENDCONST                                  56880021
         MVC   ENDCONDP(LX3),C6F0  BRANCH TO INIT1 AT LOAD END          56890021
         MVC   ENDLEN(LX4),LNSECT                                       56900021
ENDBPS DS      0H                                                       56910021
         MVC   ENDESDID(LX2),C61   ESDID                                56920021
*  GENERATE CARD NUMBER                                                 56930021
         AP    CRDNUM(LX3),DECONE(LX1) UP CARD NUMBER                   56940021
         UNPK  ENDCRDNO(LX4),CRDNUM(LX3)                                56950021
         OI    ENDZONE,MF0         CHANGE ZONE                          56960021
         MVC   ENDPRGID(LX4),PROGID                                     56970021
**                                                                      56980021
**     FOR  OS/360 PUT LENGTH OF OBJECT TIME CSECT INTO END CARD        56990021
**     (SAVED IN LCSECT   DS   F)                                       57000021
**                                                                      57010021
*                                                                       57020021
END010 LR    R1,RB2                                                     57030021
       LA    R2,ENDFLD                                                  57040021
       LA   R3,EIGHTY                                                   57050021
       BALR  R0,R1                 BR TO PH0                            57060021
       DC    X'17'                 PUNCH FROM SYSPCH                    57070021
         TM    SEGSW,SEGENDCD      CONTROL TO BE RET TO SEGT-CD         57080021
         BC    ZERO,END020         NO, BR -END OF ROOT/NO SEGMENT       57090021
       L     RS1,SVRET             RESTORE RETURN REG                   57100021
       BR    RS1                  RETURN TO SEGMENTATION CODE           57110021
END020 DS    0H                                                         57120021
         CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 57130021
         BC    EQ,END015           NO, BRANCH                           57140021
         OI    SEGSW,SEGENTRY      YES, SET ENTRY CARD SWITCH           57150021
       L     R15,AESD                                                   57160021
       BALR  RS1,R15               PUNCH ENTRY CARD                     57170021
END015 DS    0H                                                         57180021
       L     RW1,LOCPGM                                                 57190021
       ST    RW1,LOCCTR       SAVE PROGRAM BEGINNING                    57200021
*   RELEASE PNTBL AND GNTBL                                             57210021
       LA    R1,APNTBL                                                  57220021
       L     R15,ATABRL                                                 57230021
       BALR  RS1,R15               RELEASE PNTBL                        57240021
       LA    R1,AGNTBL                                                  57250021
       L     R15,ATABRL                                                 57260021
       BALR  RS1,R15               RELEASE GNTBL                        57270021
*  RELEASE VNPTY TABLE                                                  57280021
         LA    R1,AVNPTY                                                57290021
       L     R15,ATABRL                                                 57300021
       BALR  RS1,R15               RELEASE VNPTY                        57310021
*                                                                       57320021
         TM    DOEOTSW,DOEOTBL     NEED END-OF-TBL MARKER               57330021
         BC    ZERO,NOETBL         E-TEXT IS ON F3 - DON'T NEED         57340021
         L     R1,AERRTB           END OF TABLE INDICATOR -BRANCH       57350021
         L     R15,ATABLE                                               57360021
         BALR  RS1,R15             GET TABLE  ADDRESS                   57370021
         AH    R1,EINDEX                                                57380021
         MVI   DX0(R1),XX77         PUT IN EOTAB INDICATOR              57390021
NOETBL   DS    0H                                                       57400021
       TM    PHZSW,LISTX                                                57410021
       BC    ONES,END023           MAP SO SKIP LINES                    57420021
         TM    PHZSW1,CLIST                                             57430021
         BC    ZERO,END024         NO PH6 PRINTED O/P SO AT TOP OF      57440021
END023   DS    0H                                                       57450021
         MVI   OU6REC,BLANK        CLEAR PRINT AREA                     57460021
         MVC   OU6CDN(LX119),OU6REC                                     57470021
         L     R15,APUT                                                 57480021
         USING PUT,R15                                                  57490021
         BAL   RS1,PUTM            PRINT 3 BLANK LINES                  57500021
         BAL   RS1,PUTM            AFTER PROCEDURE OR                   57510021
         BAL   RS1,PUTM            CONDENSED MAP                        57520021
END024   DS    0H                                                       57530021
         TM    PHZSW1,XANDM        NO MAPSUP AND                        57540021
         BC    NOTONE,END026        NO XREF - PROCEED NORMALLY          57550021
         CLI   ERRSEV,ELEVEL       HAVE ANY E-LEVEL DIAG.OCCURRED       57560021
         BC    LO,END026           PROCEED NORMALLY                     57570021
         L     RB1,AFIRST                                               57580021
         USING FIRST,RB1                                                57590021
         BAL   RS1,MSGMS1          GO PRINT MAPSUPPRESS MSG, STATIS     57600021
         DROP  RB1                 AND THEN DO PH6A                     57610021
       USING RB1BAS,RB1                                                 57620021
END026   DS    0H                                                       57630021
         L     R15,APRSTAT                                              57640021
         BALR  RS1,R15             GO PRINT STATISTICS                  57650021
         TM    ERF4SW,ERF4ON       ANY ERRORS                           57660021
         BC    ONES,END025         YES - CALL NEXT PHASE                57670021
         SR    RW2,RW2                                                  57680021
       CH    RW2,SEQERR           ANY SEQUENCE ERRORS                   57690021
       BC    EQ,CLOSE               NO                                  57700021
         TM    PHZSW,FLAGW         WARNING LEVEL                        57710021
         BC    ONES,END025         NEED PHASE 7                         57720021
CLOSE    DS    0H                                                       57730021
         TM    PHZSW1,XREF                                              57740021
         BC    ONES,END030         NEED 6A                              57750021
         BALR  R0,RB2              END OF JOB                           57760021
         DC    X'B0'                                                    57770021
*                                                                       57780021
END025   DS    0H                                                       57790021
         OI    SWITCH+NX1,DOPH7     TELL 6A TO CALL PH7                 57800021
END030   DS    0H                                                       57810021
         LA    R1,COSADR                                                57820021
         BALR  R0,RB2              CALL NEXT PHASE                      57830021
         DC    X'A0'                                                    57840021
       EJECT                                                            57850021
IKF605   CSECT                                                          57860021
ERR010 DS    0H                                                         57870021
*                                                                       57880021
*=1            CONSTANTS                                                57890021
*                                                                       57900021
C6CNST DS    0C                                                         57910021
C6M1   DC    A(7)                                                       57920021
C6M2   DC    A(15)                                                      57930021
C6M3   DC    A(255)                                                     57940021
C6M4   DC    A(53248)    R13                                            57950021
C6M4A  DC    A(MC6M4A)        R15                                       57960021
C6M4B  DC    A(MC6M4B)             R11                                  57970021
C6M5   DC    A(49152)    R12                                            57980021
C6M6   DC    A(4095)                                                    57990021
C6MA   DC    A(M7F)                                                     58000021
C15BIT DC    F'32767'                                                   58010021
C6M7   DC    F'65535'                                                   58020021
C6M9   DC    A(M1FF)                                                    58030021
C6M13  DC    A(M1FFF)                                                   58040021
C6M10  DC    A(MF0)                                                     58050021
C6P0   DC    X'0C'       PACKED DECIMAL ZERO                            58060021
DECONE DC    X'1C'            DECIMAL +1                                58070021
CCREG  DC    C'REGISTER ASSIGNM'                                        58080021
       DC    C'ENT'                                                     58090021
CCBLI    DC    C'BL ='                                                  58100021
C69    DC    A(MF9)                                                     58110021
C6F0   DC      F'0'                                                     58120021
FW127  DC    F'127'                                                     58130021
C6F32  DC    F'32'                                                      58140021
C6M14  DS    0F                                                         58150021
       DC    X'80000000'                                                58160021
CHD64  DS    0H                                                         58170021
H4096  DC    H'4096'                                                    58180021
CH4092 DC    H'4092'                                                    58190021
C61    DC    H'1'                                                       58200021
C62    DC    H'2'                                                       58210021
C63    DC    H'3'                                                       58220021
C64    DC    H'4'                                                       58230021
C6H5   DC    H'5'                                                       58240021
C6H6   DC    H'6'                                                       58250021
C6H12    DC    H'12'                                                    58260021
C6H14  DC    H'14'                                                      58270021
C610   DC    H'16'                                                      58280021
C630   DC    H'48'                                                      58290021
C6H7   DC    H'7'                                                       58300021
C68   DC    H'8'                                                        58310021
C6H9   DC    H'9'                                                       58320021
C6256  DC    H'256'                                                     58330021
MAXPRM DC    H'32512'                                                   58340021
       DS    0H                                                         58350021
C6H14D DC    X'00E0'                                                    58360021
C6FFF    DC    X'FFFFFF'                                                58370021
CINIT1 DC    C'INIT1'                                                   58380021
CINIT2 DC    C'INIT2'                                                   58390021
CINIT3 DC      C'INIT3'                                                 58400021
DSCON  DC    C'DS'                                                      58410021
DS15F  DC    C'15F'                                                     58420021
*  TEXT OF MESSAGES                                                     58430021
RLDMSG   DC    C'IKF6007I-D    TA'                                      58440021
         DC    C'BLE OVERFLOW. PM'                                      58450021
         DC    C'AP LOAD MODULE A'                                      58460021
         DC    C'ND DECK WILL BE '                                      58470021
         DC    C'INCOMPLETE. INCR'                                      58480021
         DC    C'EASE SIZE PARM.'                                       58490021
MSGABA   DC    C'IKF6005I-D    CO'                                      58500021
         DC    C'MPILER ERROR. CO'                                      58510021
         DC    C'MPILATION WILL N'                                      58520021
         DC    C'OT BE COMPLETE. '                                      58530021
*DEL                                                                    58540021
MSMSG    DC    C'IKF6006I-E     S'                                47939 58550021
         DC    C'UPMAP SPECIFIED '                                47939 58560021
         DC    C'AND E LEVEL DIAG'                                47939 58570021
         DC    C'NOSTIC HAS OCCUR'                                47939 58580021
         DC    C'RED. PMAP CLIST '                                47939 58590021
         DC    C'LOAD AND DECK WI'                                47939 58600021
         DC    C'LL BE IGNORED.'                                  47939 58610021
SMSG1    DC    C'*STATISTICS*'                                          58620021
SMSG2    DC    C'SOURCE RECORDS ='                                      58630021
SMSG3    DC    C'*OPTIONS IN EFFECT*'                                   58640021
SMSG4    DC    C'DATA'                                                  58650021
SMSG5    DC    C'PROCEDURE '                                            58660021
SMSG6    DC    C'DIVISION STATEMENTS ='                                 58670021
SMSG7    DC    C'DICTIONARY SPILL'                                      58680021
         DC    C' DURING MERGE PH'                                      58690021
         DC    C'ASE HAS OCCURRED'                                      58700021
SMSG8    DC    C'SIZE ='                                                58710021
SMSG9    DC    C'LINECNT ='                                             58720021
SMSG10   DC    C'BUF ='                                                 58730021
SMSG11   DC    C'SPACE ,'                                               58740021
SMSG12   DC    C'FLAGW,   SEQ,   '                                      58750021
         DC    C'SOURCE'                                                58760021
SMSG13   DC    C'  DMAP,   PMAP, '                                      58770021
         DC    C'  CLIST,   SUPMA'                                      58780021
         DC    C'P,   XREF,   LOA'                                      58790021
         DC    C'D,   DECK, APOST'                                      58800021
         DC    C',   TRUNC,   LIB'                                      58810021
         DC    C',   VERB        '                                      58820021
SMSG14   DC    C'  ZWB           '                                      58830021
         DC    C'                '                                      58840021
         DC    C'                '                                      58850021
         DC    C'                '                                      58860021
         DC    C'                '                                      58870021
         DC    C'                '                                      58880021
SMSGNO   DC    C'NO'                                                    58890021
EDWD1    DC    X'4020202020202020'                                      58900021
VRBCON   DC    C'VERB'                                                  58910021
QUOTE  DC    C'QUOTE'                                                   58920021
CNOPLT DC    X'0700'     BCR 0,0                                        58930021
SBDINI DC      C'    '      SYMBOLIC OPERAND INITIALIZATION AREA        58940021
       DC      XL8'0'                                                   58950021
       DC      C'    '                                                  58960021
       DC      XL8'0'                                                   58970021
ENDCON DC    X'02'                                                      58980021
       DC    C'END'                                                     58990021
       DC    C' '                                                       59000021
QTEXTC EQU   *                                                          59010021
       DC    X'48583050000048053300'  L  3,GN=  BALR  3,3               59020021
VNATX  DC    X'48D200AC540000019000000100'       INIT3 TEXT        2179 59030021
SBLATX DC    X'48D200AC5C0C01A85C0401A800'                              59040021
CRPD   DC    C'RPD='                                                    59050021
ZERO7X DC    XL7'0'                                                     59060021
*  BEGINNING OF GROUP                                                   59070021
VTRTBL   DC    C'ILBO'             PREFIX FOR TABLE SUBROUTINES         59080021
         DC    C'ATB0'                                                  59090021
         DC    C'ETB0'                  SUFFIXES                        59100021
         DC    C'ITB0'                  FOR                             59110021
         DC    C'TRN0'                  TABLE                           59120021
         DC    C'UTB0'                  SUBROUTINES                     59130021
         DC    C'WTB0'                                                  59140021
*  END OF GROUP                                                         59150021
LTDHEX DC    C'LITERAL POOL (HE'                                        59160021
       DC    C'X)'                                                      59170021
LTDBCD DC    C'DISPLAY LITERALS'                                        59180021
       DC    C' (BCD)'                                                  59190021
LTDTL  DC    C'TL'                                                      59200021
EMESLS DC    C'ERRMSG  '                                                59210021
RLDBC1   BCR   R0,RS1              EXECUTED BY RLD RTN                  59220021
DUMMYS DC    F'256'           DUMMY START                               59230021
       DS    0F               SYMBOLIC OPERANDS                         59240021
XPNC   DC    C'PN=0'                                                    59250021
XGNC   DC    C'GN=0'                                                    59260021
XVNC   DC    C'VN=0'                                                    59270021
XVNIC  DC    C'VNI='                                                    59280021
XLITC  DC    C'LIT+'                                                    59290021
XVIRC  DC    C'VIR='                                                    59300021
XTSC   DC    C'TS+0'                                                    59310021
XSUBC  DC    C'SBS='                                                    59320021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   59330021
CSTBL  DS    0F                                                         59340021
         LH    RW2,GT1KND+NX4                                           59350021
       AH    RW2,PARMAX                                                 59360021
       AH    RW2,BLCTR                                                  59370021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           59380021
       AH    RW2,SBLCTR                                                 59390021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           59400021
       AH    RW2,VLCCTR                                                 59410021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           59420021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           59430021
       AH    RW2,BLLCTR                                                 59440021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           59450021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         59460021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   59470021
CSCON  DS    0F                                                         59480021
       DC    C'TLY+'                                                    59490021
       DC    C'PRM='                                                    59500021
         DC    C'BL ='                                                  59510021
         DC    C'    '       **NOT PRESENTLY USED**                     59520021
         DC    C'SBL='                                                  59530021
         DC    C'    '       **NOT PRESENTLY USED**                     59540021
         DC    C'VLC='                                                  59550021
         DC    C'    '       **NOT PRESENTLY USED**                     59560021
         DC    C'    '       **NOT PRESENTLY USED**                     59570021
       DC    C'BLL='                                                    59580021
         DC    C'BL ='                                                  59590021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         59600021
*                                                                       59610021
*      OTHER ADDRESS CONSTANTS                                          59620021
EOF3   DC    A(ENDF3)         WHERE TO GO AT END OF F3                  59630021
AESD   DC    A(ESDCRD)                                                  59640021
AGET   DC    A(GET)                                                     59650021
AGETF4 DC    A(GETF4)                                                   59660021
APUT   DC    A(PUT)                                                     59670021
AS6800 DC    A(S6800)                                                   59680021
AS6200 DC    A(S6200)                                                   59690021
ATXPNH DC    A(TXPNCH)                                                  59700021
ADTEST DS    F                                                          59710021
AS6010 DC    A(S6010)                                                   59720021
AINI1A DC    A(INIT1A)                                                  59730021
AINIOS DC    A(INITOS)                                                  59740021
APGTIN DC    A(PGTINT)                                                  59750021
AFTER    DC    A(FTER)                                                  59760021
ATGTCON  DC    A(TGTCON)                                                59770021
AINOS2 DC    A(INOS2)                                                   59780021
ARLD   DC    A(RLDCRD)                                                  59790021
AMAPLC DC    A(MAPLOC)                                                  59800021
APUTM    DC    A(PUTM)                                                  59810021
ASRCRL DC    A(SRCRLD)                                                  59820021
AXPRIM DC    A(XPRIME)                                                  59830021
ASTATC DC    A(XSTATC)                                                  59840021
ATABRL DC    A(XTABRL)                                                  59850021
ATABLE DC    A(TABLES)                                                  59860021
ALTDMP DC    A(LTDMP)                                                   59870021
AXGT1C DC    A(XSAVC-4)                                                 59880021
AXGT2C DC    A(XDCBC)                                                   59890021
AXSYMC DC    A(XSYMC)                                                   59900021
ACNOPT DC    A(CNOPT)                                                   59910021
AINIT3 DC    A(INIT3)                                                   59920021
AINI3B DC    A(INIT3B)                                                  59930021
AXQTXT DC    A(XQTXT)                                                   59940021
AYQTXT DC    A(YQTXT)                                                   59950021
ARLTBL DC    A(RLTBL)                                                   59960021
AMNEUT DC    A(C6TBL)                                                   59970021
ASECT0 DC    A(SECT0)                                                   59980021
ASECT1 DC    A(SECT1)                                                   59990021
ASEC1A DC    A(SECT1A)                                                  60000021
ASEC1B DC    A(SECT1B)                                                  60010021
ASECX2 DC    A(SECTX2)                                                  60020021
AGETPN DC    A(GETPN)                                                   60030021
ACODLU DC    A(CODLUP)                                                  60040021
ARB1B  DC    A(RB1BAS)                                                  60050021
*                                                                       60060021
AGENLD DC    A(GENLD)                                                   60070021
AGLDOV DC    A(GLDOV)                                                   60080021
ASRCHR DC    A(SRCHR)                                                   60090021
AINITR DC    A(INITR)                                                   60100021
AUSING DC    A(USING)                                                   60110021
APRSTAT  DC    A(PRSTAT)                                                60120021
STATSAV  DS    F                   TO SAVE RETURN REG IN STATISTICS     60130021
SAVER4   DS    F                                                        60140021
VRBCNT   DC    X'000C'             CNTR FOR VERB # FOR CLIST            60150021
SAVCDNO  DC    X'0000'             TO SAVE OLD CARD # FOR CLIST         60160021
CDNOSAV  DS    CL2                 SAVED CARD NUMBER                    60170021
P6ESW    DC    X'0'                INTERNAL ERROR IN PH6                60180021
CLIST3   DC    H'0'                SWITCH TO DETERMINE WHICH PORTIO     60190021
*                                  OF CLIST O/P AREA TO MOVE INFO I     60200021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   60210021
MACLST   DS    0F            MUST BE IN ORDER TILL MAC140               60220021
         DC    A(ERR080)                                                60230021
         DC    A(MAC010)                                                60240021
         DC    A(MAC020)                                                60250021
         DC    A(MAC030)                                                60260021
       DC    A(SE6080)                                                  60270021
       DC    A(SE6080)                                                  60280021
         DC    A(MAC060)                                                60290021
         DC    A(MAC070)                                                60300021
         DC    A(MAC080)                                                60310021
         DC    A(MAC090)                                                60320021
         DC    A(MAC100)                                                60330021
         DC    A(MAC110)                                                60340021
         DC    A(MAC120)                                                60350021
         DC    A(MAC130)                                                60360021
         DC    A(MAC150)                                                60370021
         DC    A(MAC160)                                                60380021
         DC    A(MAC140)                                                60390021
ASEGBR DC    A(SEGBRK)             TYPE=44  SEGM CTRL BREAK             60400021
       DC    A(0)                  TYPE=48                              60410021
       DC    A(MAC180)        TYPE=4C   SEGM INITIAL. ELEMENT           60420021
         DC    A(MAC050)         TYPE=50  DUMMY PN                      60430021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         60440021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   60450021
D6TBL    DS    0F                                                       60460021
         DC    A(D6DCB)                                                 60470021
         DC    A(D6DECB)                                                60480021
         DC    A(D6BLK)                                                 60490021
         DC    A(D6ERR)                                                 60500021
         DC    A(D6ERR)                                                 60510021
         DC    A(D6ERR)                                                 60520021
         DC    A(D6ERR)                                                 60530021
         DC    A(D6ERR)            ***NO LONGER USED***                 60540021
         DC    A(D6WSA)                                                 60550021
         DC    A(D6CON)                                                 60560021
         DC    A(D6ACON)                                                60570021
         DS    F                   30                                   60580021
         DC    A(D6SBL)                                                 60590021
         DS    F                                                        60600021
       DS    F                     3C                                   60610021
       DS    F                     40                                   60620021
       DS    F                     44                                   60630021
       DC    A(D6DNDEF)            48                                   60640021
       DC    A(D6PNDEF)            4C                                   60650021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         60660021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   60670021
LATBL  DS    0H                                                         60680021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           60690021
       LH    RW2,VNCTR                                                  60700021
       LH    RW2,SA2CTR                                                 60710021
       LH    RW2,PFMCTR                                                 60720021
       LH    RW2,XSACTR                                                 60730021
       LH    RW2,PSVCTR                                                 60740021
       LH    RW2,BLSEND                                                 60750021
       LH    RW2,SBSCTR                                                 60760021
       LH    RW2,SBLCTR                                                 60770021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           60780021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         60790021
***  BEGINNING OF A GROUP WHICH MUST BE IN ORDER  ***                   60800021
R6806  AH    RW1,DCBCTR                                                 60810021
       AH    RW1,VLCCTR                                                 60820021
       AH    RW1,ONCTR                                                  60830021
       AH    RW1,PFMCTR                                                 60840021
       AH    RW1,PSVCTR                                                 60850021
       AH    RW1,DECBCT                                                 60860021
       AH    RW1,XSACTR                                                 60870021
       AH    RW1,PARMAX                                                 60880021
       AH    RW1,WCMAX                                                  60890021
       AH    RW1,TSMAX                                                  60900021
       AH    RW1,XSWCTR                                                 60910021
       AH    RW1,SUBCTR                                                 60920021
       AH    RW1,TS2MAX                                                 60930021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           60940021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           60950021
       AH    RW1,SA2CTR                                                 60960021
       AH    RW1,SA3CTR                                                 60970021
       AH    RW1,RPTSAV                                                 60980021
       AH    RW1,MAXOV                                                  60990021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           61000021
       AH    RW1,CKPCTR                                                 61010021
       AH    RW1,TS3MAX                                                 61020021
       AH    RW1,TS4MAX                                                 61030021
       AH    RW1,INDEX1                                                 61040021
       AH    RW1,IOPTRCTR                                               61050021
***  END OF A GROUP WHICH MUST BE IN ORDER  ***                         61060021
MACADC   DC    C'ADCON'                                                 61070021
*                                                                       61080021
* CONSTANT AND STORAGE AREA                                             61090021
APNUTB DC    A(PNUTBL)         MUST BE RELOCATED                        61100021
PNXNUM DS    H                                                          61110021
       DS    H                                                          61120021
       DS    0F                                                         61130021
ARLDTB   DS    F                   ADDRESS RLD TBL                      61140021
RLDSIZ   DS    F                   SIZE OF RLD TBL                      61150021
RLDINDEX DC    F'0'                USED TO INDEX THROUGH RLDTBL         61160021
AQTBL  DC    X'02'                                                      61170021
       DC    AL3(QTBL)                                                  61180021
QSIZ   DC    H'0'             SET FROM ODOCTR                           61190021
       DC    H'0'                                                       61200021
       DS    0F                                                         61210021
*                                                                       61220021
D6TARG DS    F                CURRENT TARGET ADDRESS                    61230021
D6SIZE DS    F                TOTAL SIZE                                61240021
D6SSS  DS    F                NEW SIZE                                  61250021
D6REL  DS    F                CURRENT RELATIVE LOCATION                 61260021
D6RW1  DS    F                                                          61270021
FW4096 DC    F'4096'                                                    61280021
*  RLDTBL ENTRY TYPES                                                   61290021
*                                                                       61300021
       DS    0F                                                         61310021
ALTLTB DC    X'02'                      2-BYTE ENTRIES                  61320021
       DC    AL3(LTLTBL)                                                61330021
LTLNUM DC    H'0'                       N-BYTES                         61340021
       DC    H'0'                                                       61350021
       DS    0F                                                         61360021
AVIRPT DC    X'02'                2-BYTE ENTRIES                        61370021
       DC    AL3(VIRPTR)                                                61380021
VIRNUM DC    H'0'                       N-BYTES                         61390021
       DC    H'0'                                                       61400021
ACVIRT DS    0F                                                         61410021
       DC    X'08'           8-BYTE ENTRIES                             61420021
       DC    AL3(CVIRTB)                                                61430021
ACVNUM DC    H'0'             N BYTES                                   61440021
       DC    H'0'                                                       61450021
ALVIRT DS    0F                                                         61460021
       DC    X'08'           8-BYTE ENTRIES                             61470021
       DC    AL3(LVIRTB)                                                61480021
ALVNUM DC    H'0'             N BYTES                                   61490021
       DC    H'0'                                                       61500021
APNTBL DS    0F                                                         61510021
       DC    X'02'            2-BYTE ENTRIES                            61520021
       DC    AL3(PNTBL)                                                 61530021
PNNUM  DC    H'0'             PNCTR*2                                   61540021
       DC    H'0'                                                       61550021
AGNTBL DS    0F                                                         61560021
       DC    X'02'                                                      61570021
       DC    AL3(GNTBL)                                                 61580021
GNNUM  DC    H'0'             GNCTR*2                                   61590021
       DC    H'0'                                                       61600021
AFILTB DS    0F                                                         61610021
       DC    X'0C'                                                      61620021
       DC    AL3(FILTBL)                                                61630021
       DC    H'256'           ARBITRARY PRIMING VALUE                   61640021
       DC    H'0'                                                       61650021
AERRTB DS    0F                                                         61660021
       DC    X'00'           VARIABLE-LENGTH ENTRIES                    61670021
       DC    AL3(ERRTBL)                                                61680021
ERRSIZ DC    H'256'        ARBITRARY VALUE                              61690021
       DC    H'128'                                                     61700021
AVNPTY DC    X'03'                 PARLIST TO PRIME VNPTY TBL           61710021
       DC    AL3(VNPTY)                                                 61720021
VNSIZE DC    H'0'                  SIZE OF VNPTY TBL                    61730021
       DC    H'0'                  GROWTH FACTOR                        61740021
ASGTBL DC    X'05'                                                      61750021
       DC    AL3(SEGTBL)                                                61760021
SEGSZ  DS    H                     LENGTH OF SEGTBL                     61770021
       DS    H                     GROWTH FACTOR                        61780021
SVR1   DS    F                                                          61790021
SEGTAD DS    F                     SEGTBL ADDRESS                       61800021
SEGEND DS    F                     END OF SEGTBL ADDRESS                61810021
SEGCOM DS    F                     ADDR OF ENTRY IN SEGTBL              61820021
SEGCUR DS    F                    ADDR OF CURR ENTRY IN SEGTBL          61830021
SVRET  DS    F                     RETURN ADDRESS SAVE AREA             61840021
LNSECT DS    F                     LENGTH OF SEGM OR OBJ MODULE         61850021
RW2SAV   DS    F                   REGISTER 7 SAVE AREA           58979 61860021
AFIRST DC    A(FIRST)                                                   61870021
ASEGLB DC    A(SEGLAB)                                             STAN 61880021
       EJECT                                                            61890021
IKF606   CSECT                                                          61900021
*=1            WORK AREAS AND SWITCHES                                  61910021
*                                                                       61920021
*                                                                       61930021
*=1    PHASE 6 VALUES                                                   61940021
*                                                                       61950021
PH6SAV DS    18F                   PH6 SAVE AREA                        61960021
LOCPGT DS    F                LOCATION OF PGT                           61970021
LOCPGM DS    F                LOCATION OF PROCEDURE                     61980021
LOCORG DS    F                                                          61990021
TGTLOC DS    F                     LOC OF TGT                           62000021
OVFLLOC  DC    F'0'                OVERFLOW CELL ADDRESS IN TGT   0339  62010021
PGTOV  DS    H                                                          62020021
OVFCTR   DS    H                  OVERFLOW COUNTER FOR SEG              62030021
TGTOVFL  DC    H'00'               OVERFLOW CELL CTR FOR TGT/SEGM 0339  62040021
MAXOV  DS    H                                                          62050021
LNGLNK DS    H                                                          62060021
SEGCTR   DC    H'0'                NMBR OF NON-RESIDENT SEGMENTS        62070021
ESDID    DC    H'1'                CURRENT ESDID.INITIALY SET TO 1      62080021
VCONAD DS    H                     ADRR OF VCONS                        62090021
CURESD DS    H                     CURRENT ESDID ON RLD CARD            62100021
LTRFCT DS    H                CURRENT LITERAL REFERENCE NUMBER          62110021
GETLEN DS    H                LENGTH OF CURRENT INPUT ELT (FOR GET)     62120021
G4LEN  DS    H           LENGTH OF CURRENT F4 RECORD                    62130021
SAVVNO DS    H                                                          62140021
SAVPNO DS    H                                                          62150021
HWFS     DC    X'0000FFFF'      MASK FOR N INSTR                  53557 62160021
SVREG  DS    16F              REG SAVE AREA                             62170021
COSADR DS    F                     ADDRESS OF COS                       62180021
RETADC DS    F                RETURN AFTER MACRO ADCON                  62190021
RLDCT  DS    F                NO OF ENTRIES IN RLDCT                    62200021
SAVBCT   DS    H                                                        62210021
PNUCTR DS    H                COUNT OF ITEMS IN PNUTBL                  62220021
RPNCTR DS    H                COUNT OF USED PN'S                        62230021
GTLOC  DS    F                                                          62240021
LDMLOC DS    F                                                          62250021
LDMVAL DS    F                                                          62260021
LDMLEN DS    H                                                          62270021
LMATCH DS    H                                                          62280021
LSTART DS    F                                                          62290021
LEND   DS    F                                                          62300021
LTLINC DS    H                                                          62310021
BDINCR DS    H                                                          62320021
MAPTXT DS    F                                                          62330021
PREVDN DS    F           SAVE PREVIOUS WHEN PROCESS XREF TABLES         62340021
PREVPN EQU   PREVDN+2                                                   62350021
XRPSAV DS    CL4                                                        62360021
SEGSW1   DC    X'00'          00 DONT EJECT PAGE                        62370021
EJECT    EQU   X'FF'          FF EJECT PAGE                             62380021
SEGSW2 DC    X'00'                                                      62390021
RLDPNCHD EQU   X'80'               RLD ALREADY PUNCHED                  62400021
SGSW2OFF EQU   X'7F'               RESET SEGSW2                         62410021
XFCDNO DS    CL2                                                        62420021
VNHOLD EQU   XRPSAV               SAVE AREA TO SORT VNPTY TBL           62430021
SPVNRF   DC    X'00'               00-USE POSITION OF VN 1 IN VNPTY TBL 62440021
SPVN1    EQU   X'FF'               USE VN1                              62450021
SEGSW  DC    X'00'                 BIT 0-1   00-PUNCH ESD-CSECT CRD     62460021
*                                            01-PUNCH INSERT CARD       62470021
*                                           10-PUNCH OVERLAY CARD       62480021
*                                  BIT 2     1 -PROG.NAME WAS BLANK     62490021
*                                  BIT 3     0 -FIRST NONZERO PTY S     62500021
*                                  BIT 4     NOT USED                   62510021
*                                  BIT 5     1 =PUNCH EXTRN ESD CAR     62520021
*                                  BIT 6     1 = PUNCH END CRD AND      62530021
*                                            RETURN TO SEGMENT CODE     62540021
*                                  BIT 7    1 = PUNCH ENTRY CARD        62550021
*                                                                       62560021
SEGCSECT EQU   X'00'               PUNCH ESD CSECT CARD                 62570021
SEGOVLY  EQU   X'80'               PUNCH OVERLAY CARD                   62580021
SEGNSRT  EQU   X'40'               PUNCH INSERT CARD                    62590021
SEGNMBLK EQU   X'20'               PROGRAM NAME WAS BLANK               62600021
*        EQU   X'10'               WHEN OFF= FIRST NON ZERO PTYSG       62610021
*        EQU   X'08'               NOT USED                             62620021
*        EQU   X'04'               NOT USED                             62630021
SEGENDCD EQU   X'02'               PUNCH END CRD & RET TO SEG COD       62640021
SEGENTRY EQU   X'01'               PUNCH ESD ENTRY CARD                 62650021
SEGNMOK  EQU   X'DF'               RESET PROGRM NAME NOT BLANK          62660021
SEGNONST EQU   X'BF'               RESET /NOT PUNCH INSERT CARD         62670021
SEGNOEND EQU   X'FD'               RESET PNCH END & RET TO SEG CD       62680021
SEGNOVLY EQU   X'7F'               RESET OVERLAY CARD BIT               62690021
*                                                                       62700021
*                                                                       62710021
CURPTY DC    X'00'                 SECTION PRIORITY                     62720021
FSTPND DC    X'00'                SWITCH TO GET FIRST PN IN THE ROO     62730021
ROOTPN DS    2C                   SAVE AREA FOR ROOT'S FIRST PN NO.     62740021
FSTSEC DC    X'00'                SWITCH TO GET PTY OF 1ST SECTION      62750021
*                                  OR FF IS PROGRAM NOT SEGMENTED       62760021
SAVPTY DC    X'00'                                                      62770021
SAVPTY1  DC    X'00'                   PTY FOR VNDEF EQU GNREF          62780021
SEGNSA DS    2F                    SAVE SEGMENT NAME AREA               62790021
INDVN  DC    H'0'                 NO. OF VN'S IN INDEP SEGM             62800021
CLSEGSW  DC    X'00'                                                    62810021
       EJECT                                                            62820021
DLTLCT DS    H                     DISPLAY LITERAL COUNT                62830021
F4SW   DS    C      BIT 0 = 1 FOR NEW BLOCK NEEDED, 0 NOT NEEDED        62840021
*                       1 = 1 FOR USE INPUTR, 0 USE F4REG               62850021
*                       2 = 1 FOR  IN LISTING TEXT, 0 NON-LISTING       62860021
*                       3 = 1 FOR POSITION TO 01, 0 OTHER               62870021
*                       4 = 1 EOF REACHED, 0 NO EOF                     62880021
*                       5= 1 FOR PREMATURE END OF LISTING, 0 OTHER      62890021
F4NEWBLK EQU   X'80'               NEW BLOCK NEEDED                     62900021
F4INPUTR EQU   X'40'               USE INPUTR (OFF- USE F4REG)          62910021
F4LSTXT  EQU   X'20'               IN LISTING TEXT                      62920021
F4POS01  EQU   X'10'               POSITION TO 01                       62930021
F4EOF    EQU   X'08'               EOF REACHED                          62940021
F4LSTEND EQU   X'04'               PREMATURE END OF LISTING             62950021
F4BLKLST EQU   X'A0'               NEED NEW BLOCK,F4REG,LISTINGTX       62960021
F4NONWBK EQU   X'7F'               DON'T NEED NEW BLOCK                 62970021
F4NOTLST EQU   X'DF'               NOT IN LISTING TXT                   62980021
F4OTR    EQU   X'FB'               NOT PREMATURE END OF LISTING         62990021
*                                                                       63000021
*                                                                       63010021
LTLDSW DS    C                                                          63020021
LTLDISPL EQU   X'FF'               DISPLAY TYPE LITERAL                 63030021
LTLNODSP EQU   X'00'               NOT DISPLAY TYPE - LITERAL           63040021
*                                                                       63050021
VRCSW  DS    C                     VIRT CT SW                           63060021
VRCLNK   EQU   X'00'               LINK TYPE                            63070021
VRCCALL  EQU   X'80'               CALL TYPE                            63080021
*                                                                       63090021
NOBLS  DS    C                                                          63100021
NOBLSON  EQU   X'01'               THERE ARE BLS                        63110021
NOBLSOFF EQU   X'00'               THERE ARE NO BLS                     63120021
*                                                                       63130021
SWRLDFUL DC    X'00'               SET TO FF WHEN RLDTB OVFLO           63140021
RLDOVFL  EQU   X'FF'               RLDTBL OVERFLOW                      63150021
*                                                                       63160021
NOETEXT  DC    X'00'               FF WHEN ETEXT TO PROCESS             63170021
ETX2DO   EQU   X'FF'               THERE IS E-TEXT TO PROCESS           63180021
*                                                                       63190021
DOEOTSW  DC    X'00'         INDICATE NEED END OF TABLE MARKER          63200021
DOEOTBL  EQU   X'FF'               NEED END OF TABLE MARKER             63210021
*                                                                       63220021
INTSW  DC    XL1'0'               ONE TIME THRU A(INIT1) CODE           63230021
EINDEX   DC    H'0'                                                     63240021
QINDEX   DC    H'0'                                                     63250021
RS1SAVE  DS    F                                                        63260021
AC77     DC    X'77'                                                    63270021
ARLDRTE  DC    A(RLDRTE)                                                63280021
CRDNUM DS    3C               OBJECT CARD NUMBER                        63290021
VNOVFL DC    X'00'                 INIT3 BEEING PROCESSED SW       2179 63300021
INITVN   DC    H'01'             COUNT OF VN'S                          63310021
FFPRID DC    X'44246C04FFFFFFFF'   A-TEXT FOR INIT1                     63320021
       DC    X'44246C08'          MUST BE HERE BECAUSE 'PROGID'         63330021
DCPRID DS    8C                    IS STORED INTO IT.                   63340021
       DC    X'00'                                                      63350021
       DS    0F                                                         63360021
ETXSW  DS    C                                                          63370021
ETXWRN   EQU   X'00'               WARNING OR INITIALIZE 00             63380021
ETXNTWRN EQU   X'FF'               NOT WARNING IE PROCESS               63390021
*                                                                       63400021
ERRCUR DS    H                                                          63410021
NXADDR DS    F                                                          63420021
CKLOC  DS    F                HI-VALUE OF LOCCTR IN P-A-TEXT (WILL      63430021
*                             LOCATION OF CHECKPOINT RTNE)              63440021
EOFADR DS    F                CURRENT EOD ADDR FOR GET ROUTINE          63450021
LINIT2 DS    F                VALUE OF LOCCTR AT START OF INIT2         63460021
LINIT3 DS    F                VALUE OF LOCCTR AT START OF INIT3         63470021
DCSAVN DS    F                                                          63480021
PROG2  DS    F                                                          63490021
P6PLUS DS    F                                                          63500021
P6LNG  DS    H                                                          63510021
SAVLNG DS    H                                                          63520021
ENDFLD   DS    0CL80               CREATION AREA DOUBLE-SERVICE         63530021
ALLWRK   DS    0CL256              CREATION AREA FOR 'ALL' CONDEF       63540021
ALLWRK1  DS    4C                     ORG FOR ENDFLD                    63550021
ENDCONST DS    C                   +4   REPEAT CONSTANT                 63560021
ENDCONDP DS    9C                  +5        AREA                       63570021
ENDESDID DS    14C                 +14  ESDID AREA                      63580021
ENDLEN   DS    44C                 +28  LENGTH OF SEGM/OBJ MODULE       63590021
ENDPRGID DS    4C                  +72  PROGRAM ID AREA                 63600021
ENDCRDNO DS    3C                  +76  CARD NUMBER AREA                63610021
ENDZONE  DS    C                   +79  ZONE AREA                       63620021
ALLWRK2  DS    176C                -----REST OF 'ALL' AREA/CONDEF       63630021
       DS    0H                                                         63640021
REGMTX DS    0CL32       REGISTER ASSIGNMENT MATRIX                     63650021
*      STATNN  8 BITS/REGISTER DEFINED AS FOLLOWS                       63660021
*                   0=LAST AVAILABLE TO BE PERMANENTLY ASSIGNED         63670021
*                   1=FIRST AVAILABLE TO BE PERMANENTLY ASSIGNED        63680021
*                   7=RESERVED BY PHASE5 (NOT AVAILABLE UNTIL FREE)     63690021
*                   6=RESERVED BY PHASE6 (AVAILABLE TO USE FOR          63700021
*                     ITEM IT CONTAINS BUT DO NOT RELOAD                63710021
*                   2=LAST ASSIGNED PERMANENTLY                         63720021
*                   3=ASSIGNED TO 2ND HALF OF PGT (REG12+4096)          63730021
*      CELLNN  CONTAINS 0I KK ADDRESSING ELTS OF BL ASSIGNED TO THA     63740021
*              REGISTER                                                 63750021
STAT06 DS    C                                                          63760021
       DS    C                                                          63770021
CELL06 DS    H                                                          63780021
STAT07 DS    C                                                          63790021
       DS    C                                                          63800021
CELL07 DS    H                                                          63810021
STAT08 DS    C                                                          63820021
       DS    C                                                          63830021
CELL08 DS    H                                                          63840021
STAT09 DS    C                                                          63850021
       DS    C                                                          63860021
CELL09 DS    H                                                          63870021
STAT10 DS    C                                                          63880021
       DS    C                                                          63890021
CELL10 DS    H                                                          63900021
STAT11 DS    C                                                          63910021
       DS    C                                                          63920021
CELL11 DS    H                                                          63930021
STAT14 DS    C                                                          63940021
       DS    C                                                          63950021
CELL14 DS    H                                                          63960021
STAT15 DS    C                                                          63970021
       DS    C                                                          63980021
CELL15 DS    H                                                          63990021
BLELT  DS    H           HOLD AREA FOR I AND K OF BLDEF                 64000021
NUMAVL DS    H           NUM REGS AVAILABLE                             64010021
FRSBLW DS    H           NUM OF FIRST W-S BL                            64020021
NUMBLT DS    H           NUM BL'S                                       64030021
NUMBLW DS    H           NUM W-S BL'S                                   64040021
FAVAIL DS    F           PTR TO FIRST AVAIL REG                         64050021
NXTAVL DS    F           PTR TO NEXT AVAIL REG                          64060021
SAVOVF DS    H           SAVE DISP IF GT 4095                           64070021
DCSAVI DS    F                SAVE INPUTR WHEN PROCESSING DCDEF         64080021
*      THE NEXT THREE FIELDS ARE USED AS INPUT TO MAC090 WHEN A         64090021
*      PNBCD ELEMENT IS ENCOUNTERED                                     64100021
PNBCDL DC    X'06'            LENGTH+1 OF CARD NUMBER                   64110021
PNBCDN DC    X'04'           LENGTH-1 OF CARD NUMBER                    64120021
PNBCDS DS    30C              AREA WHEN PROCESSED AS DCDEF              64130021
CSDCWA DS    CL5         WORK AREA FOR CS DISP ELT                      64140021
D6SRSV DS    7C                                                         64150021
D6PNTX DS    4C                                                         64160021
PNBSAV DS    F           TEMP SAVE FOR INPUTR-PNBCD REF                 64170021
DCSAVR DS    F           SAVE FOR GR14 IN DCDEF SUBROUTINE              64180021
PNBSVG DS    CL2                                                        64190021
       DS    0H                                                         64200021
         SPACE 1                                                        64210021
C6OP   DS    C      HOLDS CURRENT OP                                    64220021
C6RS   DS    C      REG SAVE AREA                                       64230021
C6B1S  DS    C      B1 SAVE AREA                                        64240021
       DS    0H                                                         64250021
C6D1S  DS    2C     D1 SAVE AREA                                        64260021
C6B2S  DS    C      B2 SAVE AREA                                        64270021
       DS    0H                                                         64280021
C6D2S  DS    2C     D2 SAVE AREA                                        64290021
C6INSV DS    CL10                  CURRENT INSTRUCTION SAVE AREA        64300021
C6INS2 DS    CL10                                                       64310021
GOTCOD DS    C                TRANSLATED INPUT CODE                     64320021
SAVLOC DS    F      TEMP SAVE AREA FOR LOCCTR                           64330021
C6RW2  DS    F              SAVE AREA FOR RW2 IN CONVERSION ROUTINE     64340021
C6WRK0 DS    F      HOLDS HEX WORD FOR DECIMAL CONVERSION               64350021
*                                                                       64360021
       DS    0D                                                         64370021
C6WRK1 DS    C                                                          64380021
C6WRK2 DS    C                                                          64390021
C6WRK3 DS    C                                                          64400021
C6WRK4 DS    C                     WORK AREA                            64410021
C6WRK5 DS    C                                                          64420021
C6WRK6 DS    C                                                          64430021
C6WRK7 DS    C                                                          64440021
C6WRK8 DS    C                     WORK AREA                            64450021
         DS    CL12                                                     64460021
LOCSAV DS    F                SAVE AREA FOR LOCCTR DURING FILTBL        64470021
*                               PROCESSING                              64480021
SAVERS1  DC    F'0'              SAVE AREA FOR R14 FOR 645CXXXX ELT     64490021
SAVEXR   DS    16F'0'      SAVE REGS FOR 645CXXXXB4 ELT           8953  64500021
XX5C     EQU    X'5C'                                             8953  64510021
SB1D1C DS      F            B1D1  SYMBOLIC                              64520021
SB1D1N DS      F            B1D1  NUMBER OR DICT PTR                    64530021
SB1D1P DS      F            B1D1  PLUS AMT IF ANY                       64540021
SB2D2C DS      F            B2D2  SYMBOLIC                              64550021
SB2D2N DS      F            B2D2  NUMBER OR DICT PTR                    64560021
SB2D2P DS      F            B2D2  PLUS AMT IF ANY                       64570021
SBDSAV DS      6F           SYMBOLIC OPERANDS SAVE AREA                 64580021
SBDSV2 DS    CL24                                                       64590021
HOLD   DS    CL5                                                        64600021
* SAVE AREA FOR GET ROUTINE VARIABLES                                   64610021
SVINPR DS    F                                                          64620021
SVEOFA DS    F                                                          64630021
SVGETL DS    H                                                          64640021
SVTESW DS    C                                                          64650021
SVFGET DS    C                                                          64660021
*                   SWITCHES                                            64670021
DCBSW  DS    C                                                          64680021
DCBFLTB  EQU   X'FF'               PROCESSING FILTBL                    64690021
*                                                                       64700021
S6BNO  DS    C      B1 OR B2                                            64710021
BDNUM  DS    C                                                          64720021
BDNUM1   EQU   X'00'               PROCESSING B1 D1 ELEMENTS            64730021
BDNUM2   EQU   X'FF'               PROCESSING B2 D2 ELEMENTS            64740021
*                                                                       64750021
S6PLNO DS    C      ADD PLUS ELT TO D1 OR D2                            64760021
VIRTSW DS    C                FF=VIRTUAL TABLE KILLED OR NEVER MADE     64770021
NOVIRTBL EQU   X'FF'               VIRT TBL KILLED OR NEVER MADE        64780021
*                                                                       64790021
QRTNSW DS    C                1=IN QRTNES                               64800021
QRTNON   EQU   X'01'               IN QRTNS                             64810021
*                                                                       64820021
NOLOAD DS    C                SEARCH RTNE SWITCH                        64830021
SRCHNOLD EQU   X'FF'               SEARCH ONLY                          64840021
*                                                                       64850021
LOADSW DS    C           FF=NEED TO GENERATE LOAD INSTR                 64860021
GENLOAD  EQU   X'FF'               MUST GENERATE LOAD INSTRUCTION       64870021
*                                                                       64880021
GTOVFL DS    C                                                          64890021
RGNSW  DS    C                                                          64900021
RGNINIT  EQU   X'FF'               PROCESSING INIT CODING               64910021
*                                                                       64920021
PLUSFT DS    C                1=ADR W/PLUS ELT                          64930021
FGET   DS    C      FIRST TIME SWITCH FOR GET RTNE                      64940021
FGETNEW  EQU   X'00'               GET NEW BLOCK                        64950021
FGETNOT  EQU   X'FF'               DON'T GET NEW BLOCK                  64960021
*                                                                       64970021
       DS    100F    PATCH AREA UNDER EREG 12                           64980021
*      TESTSW SETTINGS                                                  64990021
*      00=REAL INPUT, STILL PROCESSING F3                               65000021
*      F0=REAL INPUT, F3 PROCESSING FINISHED                            65010021
*      FF=DUMMY INPUT (CHANGED WHEN TESTING ONLY)                       65020021
TESTSW DC    X'00'                                                      65030021
TSTREAL  EQU   X'F0'               REAL INPUT; F3 PROCESSING DONE       65040021
TSTDUM   EQU   X'FF'               DUMMY INPUT (CHANGE FOR TSTING       65050021
*                                                                       65060021
*                                                                       65070021
*     RLDCRD ROUTINE SWITCHES                                           65080021
RLDIF  DS    C                00 TILL CREATE RLD - THEN 80              65090021
RLDNO    EQU   X'00'               RLD NOT YET CREATED                  65100021
RLDIS    EQU   X'80'               RLD HAS BEEN CREATED                 65110021
*                                                                       65120021
RLDONE DS    C                00 FIRST TIME - THEN F0                   65130021
RLDFST   EQU   X'00'               FIRST-TIME                           65140021
RLDNOFST EQU   X'F0'               NOT FIRST-TIME                       65150021
*                                                                       65160021
RLDBC2 EQU   RLDBC1                                                     65170021
RLDFSW DS    C                00 UNLESS FORCE - THEN F0                 65180021
RLDNOFRC EQU   X'00'               NOT FORCE                            65190021
RLDFORCE EQU   X'F0'               FORCE                                65200021
*                                                                       65210021
RLDBC3 EQU   RLDBC1                                                     65220021
       DS    0H                                                         65230021
QATEXT DS    0CL10                      AREA FOR                        65240021
       DS    2H                                                         65250021
QNUM   DS    H                                                          65260021
       DS    2H                                                         65270021
       DC    C'PH6 PATCH AREA'                                          65280021
PATCH6 DS    500XL1                                                     65290021
       EJECT                                                            65300021
*=1            OUTPUT AREA - SYSOUT LISTING                             65310021
*                                                                       65320021
OU6REC DS    0CL120                                                     65330021
       DS    C                                                          65340021
OU6CDN DS    CL5              CARD NUMBER                               65350021
       DS    CL2                                                        65360021
OU6STR DS      CL1          ASTERISK                                    65370021
OU6LST DS      CL10         LISTING TEXT (PN OR VERB)                   65380021
       DS      CL1                                                      65390021
OU6LC  DS    CL6                        LOCATION COUNTER                65400021
       DS    CL2                                                        65410021
OU6OP  DS    CL2                        OP CODE                         65420021
       DS    CL1                                                        65430021
OU6R1  DS    CL1                        REGISTER 1                      65440021
OU6R2  DS    CL1                        REGISTER 2                      65450021
       DS    CL1                                                        65460021
OU6B1  DS    CL1                        BASE 1                          65470021
       DS    CL1                                                        65480021
OU6D1  DS    CL3                        DISPLACEMENT 1                  65490021
       DS    CL1                                                        65500021
OU6B2  DS    CL1                        BASE 2                          65510021
       DS    CL1                                                        65520021
OU6D2  DS    CL3                        DISPLACEMENT 2                  65530021
       DS      CL2                                                      65540021
OU6NAM DS      CL8          NAME                                        65550021
       DS    CL1                                                        65560021
OU6OPN DS    CL5                        OPERATION                       65570021
       DS    CL1                                                        65580021
OU6OPD DS      CL21         OPERANDS(ACTUAL)                            65590021
       DS      CL1                                                      65600021
OU6SO1 EQU    *                                                         65610021
OU6S1  DS      CL15         OPERAND 1 (SYMBOLIC)                        65620021
       DS      CL1                                                      65630021
OU6SO2 EQU    *                                                         65640021
OU6S2  DS      CL15         OPERAND 2 (SYMBOLIC)                        65650021
       DS      CL5                                                      65660021
       EJECT                                                            65670021
         ORG   OU6REC                                                   65680021
PMSGL1   DS    0CL120                                                   65690021
PMSG1    DS    CL12                *STATISTICS*                         65700021
         DS    CL5                                                      65710021
PMSG7    DS    0CL48               DICT. SPILL MSG.                     65720021
PMSG2    DS    CL16                SOURCE RCD =                         65730021
PMSG2N   DS    CL6                              NO.                     65740021
         DS    CL5                                                      65750021
PMSG4    DS    CL4                 DATA                                 65760021
         DS    CL1                                                      65770021
PMSG6    DS    CL21                DIV. STATEMENTS =                    65780021
PMSG4N   DS    CL6                                   NO.                65790021
         DS    CL5                                                      65800021
PMSG5    DS    CL31                PROC. DIV. STATEMENTS =              65810021
PMSG5N   DS    CL6                                         NO.          65820021
         SPACE 3                                                        65830021
         ORG   OU6REC                                                   65840021
PMSGL2   DS    0CL120                                                   65850021
PMSG3    DS    CL19                *OPTIONS IN EFFECT*                  65860021
         DS    CL5                                                      65870021
PMSG8    DS    CL6                 SIZE =                               65880021
PMSG8N   DS    CL8                        NO.                           65890021
         DS    CL2                                                      65900021
PMSG10   DS    CL5                 BUF =                                65910021
PMSG1N   DS    CL8                       NO.                            65920021
         DS    CL2                                                      65930021
PMSG9    DS    CL9                 LINECNT =                            65940021
         DS    CL1                                                      65950021
PMSG9N   DS    CL2                           NO.                        65960021
         DS    CL2                                                      65970021
PMSG11   DS    0CL7                SPACE =                              65980021
         DS    CL5                                                      65990021
PMSGSP   DS    CL1                        1,2 OR 3                      66000021
         DS    CL2                                                      66010021
PMSG12   DS    0CL22                                                    66020021
         DS    CL4                                                      66030021
PMSGFL   DS    CL1                      E OR W                          66040021
         DS    CL2                                                      66050021
NOSQ     DS    CL2                                                      66060021
         DS    CL5                 YES PARAMS WILL BE MOVED HERE        66070021
NOSOU    DS    CL2                 AS ONE CONSTANT - THE WORD           66080021
         DS    CL27                'NO' WILL BE LATER PLUGGED IN        66090021
*                                  WHEREVER NEEDED                      66100021
         SPACE 3                                                        66110021
         ORG   OU6REC                                                   66120021
PMSGL3   DS    0CL120                                                   66130021
PMSG3A   DS    CL19                *OPTIONS IN EFFECT*                  66140021
         DS    CL5                                                      66150021
PMSG13   DS    0CL96                                                    66160021
NODMP    DS    CL2                                                      66170021
         DS    CL6                                                      66180021
NOPMP    DS    CL2                                                      66190021
         DS    CL6                                                      66200021
NOCLST   DS    CL2                                                      66210021
         DS    CL7                                                      66220021
NOSUPMAP DS    CL2                                                      66230021
         DS    CL8                                                      66240021
NOXREF   DS    CL2                                                      66250021
         DS    CL6                                                      66260021
NOLD     DS    CL2                                                      66270021
         DS    CL6                                                      66280021
NODK     DS    CL2                                                      66290021
         DS    CL6                                                      66300021
NOAPOST  DS    CL5                                                      66310021
         DS    CL2                                                      66320021
NOTRUNC  DS    CL2                                                      66330021
         DS    CL7                                                      66340021
NOLIB    DS    CL2                                                      66350021
         DS    CL5                                                      66360021
NOVERB   DS    CL2                                                      66370021
         DS    CL6                                                      66380021
NOPDT    DS    CL2                                                      66390021
         DS    CL4                                                      66400021
         SPACE 5                                                        66410021
         ORG   OU6REC                                                   66420021
PMSGL4   DS    0CL120                                                   66430021
PMSG3B   DS    CL19                *OPTIONS IN EFFECT*                  66440021
         DS    CL5                                                      66450021
PMSG14   DS    0CL96                                                    66460021
NOZWB    DS    CL2                                                      66470021
         DS    CL94                                                     66480021
         EJECT                                                          66490021
OUCREC   DS    0CL120              OUTPUT AREA FOR CONDENSED LIST       66500021
         DS    CL1                                                      66510021
OUCREC1 DS   CL25                                                       66520021
         DS    CL20                                                     66530021
OUCREC2 DS   CL25                                                       66540021
         DS    CL20                                                     66550021
PUTCWK   DS    0CL25                                                    66560021
OUCCDN   DS    CL5                 CARD NUMBER                          66570021
         DS    CL3                                                      66580021
OUCLST   DS    CL10                VERB                                 66590021
         DS    CL1                                                      66600021
OUCLC    DS    CL6                 LOCATION COUNTER                     66610021
         DS    CL4                                                      66620021
       EJECT                                                            66630021
*=1            EXECUTE TABLES                                           66640021
***  EACH OF THESE GROUPS MUST BE INTACT  ***                           66650021
SE6025 DS    0H                                                         66660021
         BC    UNCOND,OPPRO   48   PROC A-TEXT OP ELTS & ASSOC EL       66670021
         BC    UNCOND,PNDEFR  30               PN ELTS/CREATE RLD       66680021
         BC    UNCOND,GNDEFR  34               GN ELTS                  66690021
         BC    UNCOND,VNDEFR  38               VN ELTS                  66700021
         BC    UNCOND,PNBPRO  3C        CREATEIN-LINE DC FROM PN        66710021
       BC    UNCOND,SE6080         READ NEXT ELT                        66720021
         BC    UNCOND,SE6080  98   READ NEXT ELT                        66730021
         BC    UNCOND,SE6080  40   READ NEXT ELT                        66740021
         BC    UNCOND,MACPRO  44        IDENT  MACRO TYPE               66750021
         BC    UNCOND,SE6010  2C   CARD NUMBER                          66760021
         BC    UNCOND,GIDENL  9C               IDENTLOC ELT             66770021
R6202  DS    0H                                                         66780021
         BC    UNCOND,R6240   AC   USE LENGTH ELT                       66790021
         BC    UNCOND,R6512   A8   USE PLUS ELT                         66800021
         BC    UNCOND,R6400   A4   ADR W/PLUS                           66810021
         BC    UNCOND,GENBD   8C   SPECIAL BDISP                        66820021
         BC    UNCOND,R6300   4C   PNREF                                66830021
         BC    UNCOND,R6325   50   GNREF                                66840021
         BC    UNCOND,R6350   54   VNREF                                66850021
         BC    UNCOND,R6700   58   VIRREF                               66860021
         BC    UNCOND,R6260   5C   BLREF                                66870021
         BC    UNCOND,R6750   60   GTREF1                               66880021
         BC    UNCOND,R6800   64   GTREF2                               66890021
         BC    UNCOND,LTLPRO  68   LTLREF                               66900021
         BC    UNCOND,R6210   70   BDISP                                66910021
         BC    UNCOND,R6410   78   ADR                                  66920021
         BC    UNCOND,R6500   80   PLUS                                 66930021
         BC    UNCOND,GENVNI  90   VNIREF                               66940021
         BC    UNCOND,GENIMM  88   SPECIAL IMMEDIATE FIELD              66950021
         BC    UNCOND,R6010   94   GET NEXT ELT                         66960021
GT1KND DC    H'0'           SAVE-AREA DISP IN TGT                       66970021
       DC    H'72'  SWITCH    DISP IN TGT                               66980021
       DC    H'76'  TALLY     DISP IN TGT                               66990021
       DC    H'80'  DEBUG     DISP IN TGT                               67000021
       DC    H'84'  ECB       DISP IN TGT                               67010021
       DS    H                     ***NOT USED PRESENTLY**              67020021
       DS    H                     ***NOT USED PRESENTLY**              67030021
TYTBL  BC      UNCOND,BINIT1       ADCON TYPE = INIT1                   67040021
       BC      UNCOND,BTALLY                    TALLY                   67050021
       LH    RW3,PARMAX                                                 67060021
       BC    UNCOND,ADBLI                       BLI                     67070021
       LH    RW3,BLCTR                                                  67080021
       LH    RW3,SBLCTR                                                 67090021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67100021
       BC      UNCOND,BVLCI                     VLC                     67110021
       B     ERR040                   SHOULD NOT OCCUR -LOGIC ERR       67120021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67130021
       LH    RW3,BLLCTR                                                 67140021
       BC      UNCOND,BLITRF                    LIT                     67150021
       BC      UNCOND,BINIT3                    INIT3                   67160021
       BC      UNCOND,BCKPTR                    CKPT                    67170021
       BC      UNCOND,BPGT                      PGT                     67180021
       BC      UNCOND,BTGT                      TGT                     67190021
       BC      UNCOND,BINIT2                    INIT2                   67200021
       BC      UNCOND,BSTART                    START                   67210021
       BC    UNCOND,BPN                         PN                      67220021
       BC    UNCOND,BVIRT                       VN                      67230021
       BC    UNCOND,BGN                         GN                      67240021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67250021
       BC    UNCOND,BVNLOC                      VNLOC                   67260021
       BC    UNCOND,BVNIL                       VNI                     67270021
       LH    RW3,SUBCTR                                                 67280021
       BC    UNCOND,TSADCN                      TEMP-STORAGE            67290021
       B     EXTADC               TYPE=68,EXTERNAL ADCON                67300021
SUBTBL DS    0H                                                         67310021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67320021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67330021
       SH    RW2,DECBCT                                                 67340021
       SH    RW2,ONCTR                                                  67350021
       SH    RW2,XSWCTR                                                 67360021
       SH    RW2,PFMCTR                                                 67370021
         BC    UNCOND,ERR040       ASYNC. PROC. ELEMENT *OUT*           67380021
       SH    RW2,BLCTR                                                  67390021
       SH    RW2,VLCCTR                                                 67400021
       SH    RW2,SBLCTR                                                 67410021
       EJECT                                                            67420021
*=1                 MNEMONIC TABLE                                      67430021
*      THIS TABLE MUST BE REFERRED TO BY USE OF AN ADCON                67440021
       DS    0F                                                         67450021
C6TBL  EQU   *                                                          67460021
       DC    CL4'    '                  00                              67470021
       DC    CL4'    '                  01                              67480021
       DC    CL4'    '                  02                              67490021
       DC    CL4'    '                  03                              67500021
       DC    CL4'SPM '                  04                              67510021
       DC    CL4'BALR'                  05                              67520021
       DC    CL4'BCTR'                  06                              67530021
       DC    CL4'BCR '                  07                              67540021
       DC    CL4'SSK '                  08                              67550021
       DC    CL4'ISK '                  09                              67560021
       DC    CL4'SVC '                  0A                              67570021
       DC    CL4'    '                  0B                              67580021
       DC    CL4'    '                  0C                              67590021
       DC    CL4'    '                  0D                              67600021
       DC    CL4'    '                  0E                              67610021
       DC    CL4'    '                  0F                              67620021
       DC    CL4'LPR '                  10                              67630021
       DC    CL4'LNR '                  11                              67640021
       DC    CL4'LTR '                  12                              67650021
       DC    CL4'LCR '                  13                              67660021
       DC    CL4'NR  '                  14                              67670021
       DC    CL4'CLR '                  15                              67680021
       DC    CL4'OR  '                  16                              67690021
       DC    CL4'XR  '                  17                              67700021
       DC    CL4'LR  '                  18                              67710021
       DC    CL4'CR  '                  19                              67720021
       DC    CL4'AR  '                  1A                              67730021
       DC    CL4'SR  '                  1B                              67740021
       DC    CL4'MR  '                  1C                              67750021
       DC    CL4'DR  '                  1D                              67760021
       DC    CL4'ALR '                  1E                              67770021
       DC    CL4'SLR '                  1F                              67780021
       DC    CL4'LDPR'                  20                              67790021
       DC    CL4'LNDR'                  21                              67800021
       DC    CL4'LTDR'                  22                              67810021
       DC    CL4'LCDR'                  23                              67820021
       DC    CL4'HDR '                  24                              67830021
       DC    CL4'    '                  25                              67840021
       DC    CL4'    '                  26                              67850021
       DC    CL4'    '                  27                              67860021
       DC    CL4'LDR '                  28                              67870021
       DC    CL4'CDR '                  29                              67880021
       DC    CL4'ADR '                  2A                              67890021
       DC    CL4'SDR '                  2B                              67900021
       DC    CL4'MDR '                  2C                              67910021
       DC    CL4'DDR '                  2D                              67920021
       DC    CL4'AWR '                  2E                              67930021
       DC    CL4'SWR '                  2F                              67940021
       DC    CL4'LPER'                  30                              67950021
       DC    CL4'LNER'                  31                              67960021
       DC    CL4'LTER'                  32                              67970021
       DC    CL4'LCER'                  33                              67980021
       DC    CL4'HER '                  34                              67990021
       DC    CL4'    '                  35                              68000021
       DC    CL4'    '                  36                              68010021
       DC    CL4'    '                  37                              68020021
       DC    CL4'LER '                  38                              68030021
       DC    CL4'CER '                  39                              68040021
       DC    CL4'AER '                  3A                              68050021
       DC    CL4'SER '                  3B                              68060021
       DC    CL4'MER '                  3C                              68070021
       DC    CL4'DER '                  3D                              68080021
       DC    CL4'AUR '                  3E                              68090021
       DC    CL4'SUR '                  3F                              68100021
       DC    CL4'STH '                  40                              68110021
       DC    CL4'LA  '                  41                              68120021
       DC    CL4'STC '                  42                              68130021
       DC    CL4'IC  '                  43                              68140021
       DC    CL4'EX  '                  44                              68150021
       DC    CL4'BAL '                  45                              68160021
       DC    CL4'BCT '                  46                              68170021
       DC    CL4'BC  '                  47                              68180021
       DC    CL4'LH  '                  48                              68190021
       DC    CL4'CH  '                  49                              68200021
       DC    CL4'AH  '                  4A                              68210021
       DC    CL4'SH  '                  4B                              68220021
       DC    CL4'MH  '                  4C                              68230021
       DC    CL4'    '                  4D                              68240021
       DC    CL4'CVD '                  4E                              68250021
       DC    CL4'CVB '                  4F                              68260021
       DC    CL4'ST  '                  50                              68270021
       DC    CL4'    '                  51                              68280021
       DC    CL4'    '                  52                              68290021
       DC    CL4'    '                  53                              68300021
       DC    CL4'N   '                  54                              68310021
       DC    CL4'CL  '                  55                              68320021
       DC    CL4'O   '                  56                              68330021
       DC    CL4'X   '                  57                              68340021
       DC    CL4'L   '                  58                              68350021
       DC    CL4'C   '                  59                              68360021
       DC    CL4'A   '                  5A                              68370021
       DC    CL4'S   '                  5B                              68380021
       DC    CL4'M   '                  5C                              68390021
       DC    CL4'D   '                  5D                              68400021
       DC    CL4'AL  '                  5E                              68410021
       DC    CL4'SL  '                  5F                              68420021
       DC    CL4'STD '                  60                              68430021
       DC    CL4'    '                  61                              68440021
       DC    CL4'    '                  62                              68450021
       DC    CL4'    '                  63                              68460021
       DC    CL4'    '                  64                              68470021
       DC    CL4'    '                  65                              68480021
       DC    CL4'    '                  66                              68490021
       DC    CL4'    '                  67                              68500021
       DC    CL4'LD  '                  68                              68510021
       DC    CL4'CD  '                  69                              68520021
       DC    CL4'AD  '                  6A                              68530021
       DC    CL4'SD  '                  6B                              68540021
       DC    CL4'MD  '                  6C                              68550021
       DC    CL4'DD  '                  6D                              68560021
       DC    CL4'AW  '                  6E                              68570021
       DC    CL4'SW  '                  6F                              68580021
       DC    CL4'STE '                  70                              68590021
       DC    CL4'    '                  71                              68600021
       DC    CL4'    '                  72                              68610021
       DC    CL4'    '                  73                              68620021
       DC    CL4'    '                  74                              68630021
       DC    CL4'    '                  75                              68640021
       DC    CL4'    '                  76                              68650021
       DC    CL4'    '                  77                              68660021
       DC    CL4'LE  '                  78                              68670021
       DC    CL4'CE  '                  79                              68680021
       DC    CL4'AE  '                  7A                              68690021
       DC    CL4'SE  '                  7B                              68700021
       DC    CL4'ME  '                  7C                              68710021
       DC    CL4'DE  '                  7D                              68720021
       DC    CL4'AU  '                  7E                              68730021
       DC    CL4'SU  '                  7F                              68740021
       DC    CL4'SSM '                  80                              68750021
       DC    CL4'    '                  81                              68760021
       DC    CL4'LPSW'                  82                              68770021
       DC    CL4'    '                  83                              68780021
       DC    CL4'WRD '                  84                              68790021
       DC    CL4'RDD '                  85                              68800021
       DC    CL4'BXH '                  86                              68810021
       DC    CL4'BXLE'                  87                              68820021
       DC    CL4'SRL '                  88                              68830021
       DC    CL4'SLL '                  89                              68840021
       DC    CL4'SRA '                  8A                              68850021
       DC    CL4'SLA '                  8B                              68860021
       DC    CL4'SRDL'                  8C                              68870021
       DC    CL4'SLDL'                  8D                              68880021
       DC    CL4'SRDA'                  8E                              68890021
       DC    CL4'SLDA'                  8F                              68900021
       DC    CL4'STM '                  90                              68910021
       DC    CL4'TM  '                  91                              68920021
       DC    CL4'MVI '                  92                              68930021
       DC    CL4'TS  '                  93                              68940021
       DC    CL4'NI  '                  94                              68950021
       DC    CL4'CLI '                  95                              68960021
       DC    CL4'OI  '                  96                              68970021
       DC    CL4'XI  '                  97                              68980021
       DC    CL4'LM  '                  98                              68990021
       DC    CL4'    '                  99                              69000021
       DC    CL4'    '                  9A                              69010021
       DC    CL4'    '                  9B                              69020021
       DC    CL4'SIO '                  9C                              69030021
       DC    CL4'TIO '                  9D                              69040021
       DC    CL4'HIO '                  9E                              69050021
*                                                                       69060021
       DC    CL4'TCH '                  9F                              69070021
       DC    CL4'    '                  D0                              69080021
       DC    CL4'MVN '                  D1                              69090021
       DC    CL4'MVC '                  D2                              69100021
       DC    CL4'MVZ '                  D3                              69110021
       DC    CL4'NC  '                  D4                              69120021
       DC    CL4'CLC '                  D5                              69130021
       DC    CL4'OC  '                  D6                              69140021
       DC    CL4'XC  '                  D7                              69150021
       DC    CL4'    '                  D8                              69160021
       DC    CL4'    '                  D9                              69170021
       DC    CL4'    '                  DA                              69180021
       DC    CL4'    '                  DB                              69190021
       DC    CL4'TR  '                  DC                              69200021
       DC    CL4'TRT '                  DD                              69210021
       DC    CL4'ED  '                  DE                              69220021
       DC    CL4'EDMK'                  DF                              69230021
       DC    CL4'    '                  F0                              69240021
       DC    CL4'MVO '                  F1                              69250021
       DC    CL4'PACK'                  F2                              69260021
       DC    CL4'UNPK'                  F3                              69270021
       DC    CL4'    '                  F4                              69280021
       DC    CL4'    '                  F5                              69290021
       DC    CL4'    '                  F6                              69300021
       DC    CL4'    '                  F7                              69310021
       DC    CL4'ZAP '                  F8                              69320021
       DC    CL4'CP  '                  F9                              69330021
       DC    CL4'AP  '                  FA                              69340021
       DC    CL4'SP  '                  FB                              69350021
       DC    CL4'MP  '                  FC                              69360021
       DC    CL4'DP  '                  FD                              69370021
       DC    CL4'    '                  FE                              69380021
       DC    CL4'    '                  FF                              69390021
       EJECT                                                            69400021
IKF607   CSECT                                                          69410021
*=1            PROCESS A-TEXT ELEMENTS -- SUBROUTINES                   69420021
*                                                                       69430021
*      SUBROUTINES   LINK BY L  15,ADCON FOR BASE                       69440021
*                            BALR   14,15                               69450021
*                                                                       69460021
*                                                                       69470021
*                                                                       69480021
*=1          CONVERT HEXADECIMAL WORD TO DECIMAL CHARACTERS             69490021
*            WORD FOR CONVERSION IS IN C6WRK0 BEFORE LINK               69500021
*            DECIMAL CHARACTERS IN C6WRK1-8 WHEN RETURN                 69510021
         DS    0H                                                       69520021
       USING *,R15                                                      69530021
S6010  STM   R0,R15,SVREG                                               69540021
*                                                                       69550021
         UNPK  C6WRK1(LX9),C6WRK0(LX5)                                  69560021
         LA    RW2,DX8                   INIT CTR                       69570021
       SR    RW1,RW1                    CLEAR REGISTER                  69580021
S6020    IC    RW1,C6WRK1-NX1(RW2)  CURRENT CHAR                        69590021
       CL    RW1,C69                    IS A-F                          69600021
       BC    HI,S6040                     YES                           69610021
S6030  BCT   RW2,S6020                  GET NEXT CHARACTER              69620021
       LM    R0,R15,SVREG                                               69630021
         BCR   UNCOND,RS1          EXIT                                 69640021
*                                                                       69650021
S6040  N     RW1,C6M1                   CLEAR ALL BUT LOW-ORD 3 BIT     69660021
       IC    RW1,S6060(RW1)        LOAD APPROPRIATE CHAR                69670021
         STC   RW1,C6WRK1-NX1(RW2)  CONVERTED CHAR TO STORAGE           69680021
       BC    UNCOND,S6030          GO GET NEXT CHARACTER                69690021
S6060  DC    CL8'00ABCDEF'                                              69700021
       DROP  R15                                                        69710021
*                                                                       69720021
*=1          CONVERT MAX 255 BINARY TO DECIMAL,COUNT SIGNIFICANT CH     69730021
*            VALUE IS IN RW1 BEFORE LINK                                69740021
*            SIGNIFICANT CHARACTERS IN C6WRK6-8 WHEN RETURN             69750021
*            NUMBER-1 OF SIGNIFICANT CHARS IN RW2 WHEN RETURN           69760021
*            OU6OPD+RW2 IN RW3 WHEN RETURN                              69770021
       USING *,R15                                                      69780021
S6200  N     RW1,C6M3                   CLEAR ALL BUT LOW-ORD 8 BIT     69790021
S6210  N     RW1,C6M7              CLEAR FIRST 2 BYTES                  69800021
       BC    UNCOND,S6240          DO COMMON CODE FOR CONVERT           69810021
S6260    SRL   RW1,DX4              RIGHT-JUSTIFY                       69820021
S6250  N     RW1,C6M2              USE 4 BITS                           69830021
S6240  STM   R0,R15,V6210                                               69840021
       CVD   RW1,C6WRK1                 CONVERT TO DEC VALUE            69850021
       L     RW1,C6WRK5            XXXXX+                               69860021
         SRL   RW1,DX4                   DROP SIGN BITS                 69870021
       ST    RW1,C6WRK0                 DEC VALUE FOR CHAR CONVERSI     69880021
       L     R15,AS6010        CONVERT                                  69890021
       BALR  RS1,R15               CONVERT                              69900021
       L     R15,AS6200                                                 69910021
         LA    RW2,DX4              INIT RW2 COUNT                      69920021
S6230    CLI   C6WRK4,MF0          SIGNIFICANT CHARACTERS               69930021
       BC    NOTEQ,S6220                  YES                           69940021
         MVC   C6WRK4(LX4),C6WRK5   NO, DROP IT                         69950021
       BCT   RW2,S6230             MODIFY COUNT AND TEST                69960021
S6220  EQU   *                                                          69970021
       ST    RW2,C6RW2                                                  69980021
       LM    R0,R15,V6210                                               69990021
       L     RW2,C6RW2                                                  70000021
         EX    RW2,DX0(RS1)     EXECUTE MVC INSTR FOR FIELD             70010021
       AR    RW3,RW2                    TO STEP OPERAND ADDR            70020021
         LA    RS1,DX6(RS1)      EXIT                                   70030021
         BCR   UNCOND,RS1          EXIT                                 70040021
V6210 DS    16F                  SAVE AREA FOR SUBRTN S6200             70050021
       DROP  R15                                                        70060021
*                                                                       70070021
       EJECT                                                            70080021
*                                                                       70090021
*=1          PRINT LINE USING HEXADECIMAL INSTRUCTION ASSEMBLED IN      70100021
*=             C6OP,C6RS,C6B1S,C6D1S,C6B2S,C6D2S                        70110021
       USING *,R15                                                      70120021
S6800  STM   R0,R15,V6800                                               70130021
         CLI   C6OP,NOPOPCD                                             70140021
       BCR   EQ,RS1            NO INSTRUCTION                           70150021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             70160021
       TM    PHZSW,NOLIST                                               70170021
       BC    ZERO,S6931            NOLIST, DON'T PRINT                  70180021
       LA    RW3,OU6OPD                INIT OPERAND ADDR-S6200 STEP     70190021
         MVC   C6WRK0(LX3),C6OP     LAST OP, REGISTERS, B1              70200021
       L     R15,AS6010                                                 70210021
       BALR  RS1,R15            CONVERT HEX TO DEC                      70220021
       L     R15,AS6800                                                 70230021
         MVC   OU6OP(LX2),C6WRK1    OP TO PRINT                         70240021
         MVC   OU6R1(LX2),C6WRK3    REGS TO PRINT                       70250021
         CLI   C6OP,XX40                 IS INSTR RR                    70260021
       BC    LO,S6808                     YES                           70270021
         MVC   OU6B1(LX1),C6WRK6    B1 TO PRINT                         70280021
         MVC   C6WRK0(LX3),C6D1S    WORD FOR CONVERSION                 70290021
       L     R15,AS6010                                                 70300021
       BALR  RS1,R15            CONVERT HEX TO DEC                      70310021
       L     R15,AS6800                                                 70320021
         MVC   OU6D1(LX3),C6WRK2    PRINT D1                            70330021
         CLI   C6OP,XXC0                 IS INSTR SS                    70340021
       BC    LO,S6820                     NO                            70350021
         MVC   OU6B2(LX1),C6WRK6    PRINT B2                            70360021
         MVC   C6WRK0(LX2),C6D2S    WORD FOR CONVERSION                 70370021
       L     R15,AS6010                                                 70380021
       BALR  RS1,R15            CONVERT HEX TO DEC                      70390021
       L     R15,AS6800                                                 70400021
         MVC   OU6D2(LX3),C6WRK2    PRINT D2                            70410021
       BC    UNCOND,S6870               TO PROCESS SS                   70420021
S6808  IC    RW1,C6RS                   R1                              70430021
         CLI   C6OP,XX0A                 IS SVC                         70440021
       BC    NOTEQ,S6810                  NO                            70450021
       L     R15,AS6200                                                 70460021
       BALR  RS1,R15            CONVERT I TO DEC VALUE                  70470021
         MVC   DX0(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70480021
       L     R15,AS6800                                                 70490021
       BC    UNCOND,S6920          CONVERT TO BCD                       70500021
S6810  L     R15,AS6200        CONVERT R1 TO DEC VALUE                  70510021
       USING S6200,R15                                                  70520021
       BAL   RS1,S6260             CONVERT                              70530021
         MVC   DX0(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70540021
       L     R15,AS6800                                                 70550021
       USING S6800,R15                                                  70560021
         CLI   C6OP,XX04                 IS SPM                         70570021
       BC    EQ,S6920                     YES                           70580021
         MVI   DX1(RW3),COMMA                                           70590021
       IC    RW1,C6RS                   R2                              70600021
       L     R15,AS6200                                                 70610021
       USING S6200,R15                                                  70620021
       BAL   RS1,S6250         CONVERT R2 TO DEC VALUE                  70630021
         MVC   DX2(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70640021
       L     R15,AS6800                                                 70650021
       USING S6800,R15                                                  70660021
       BC    UNCOND,S6920          CONVERT TO BCD                       70670021
S6820    CLI   C6OP,M7F            IS INSTR  RX                         70680021
       BC    HI,S6830                   NO                              70690021
       IC    RW1,C6RS                   R1                              70700021
       L     R15,AS6200                                                 70710021
       USING S6200,R15                                                  70720021
       BAL   RS1,S6260         CONVERT R1 TO DEC VALUE                  70730021
         MVC   DX0(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70740021
       L     R15,AS6800                                                 70750021
       USING S6800,R15                                                  70760021
         MVI   DX1(RW3),COMMA       ,                                   70770021
         MVC   DX2(LX3,RW3),OU6D1    D2                                 70780021
         MVI   DX5(RW3),LFTPAREN    (                                   70790021
       IC    RW1,C6RS                   X2                              70800021
       L     R15,AS6200                                                 70810021
       USING S6200,R15                                                  70820021
       BAL   RS1,S6250         X2 TO DEC VALUE                          70830021
         MVC   DX6(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70840021
       L     R15,AS6800                                                 70850021
       USING S6800,R15                                                  70860021
         MVI   DX7(RW3),COMMA       ,                                   70870021
       IC    RW1,C6B1S                  B2                              70880021
       L     R15,AS6200        CONVERT B2 TO DEC VALUE                  70890021
       USING S6200,R15                                                  70900021
       BAL   RS1,S6250             CONVERT                              70910021
         MVC   DX8(LX1,RW3),C6WRK4   EXECUTED BY S6200                  70920021
       L     R15,AS6800                                                 70930021
       USING S6800,R15                                                  70940021
         MVI   DX9(RW3),RTPAREN     )                                   70950021
       BC    UNCOND,S6920          CONVERT TO BCD                       70960021
*                                                                       70970021
S6830    CLI   C6OP,XX86                 IS INSTR RS OR SI              70980021
       BC    LO,S6860                     SI                            70990021
         CLI   C6OP,XX91                 RS OR SI                       71000021
       BC    LO,S6840                   RS                              71010021
         CLI   C6OP,XX98                 RS OR SI                       71020021
       BC    NOTEQ,S6860                  SI                            71030021
S6840  IC    RW1,C6RS                   R1                              71040021
       USING S6200,R15                                                  71050021
       L     R15,AS6200        CONVERT R1 TO DEC VALUE                  71060021
       BAL   RS1,S6260             CONVERT                              71070021
         MVC   DX0(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71080021
       L     R15,AS6800                                                 71090021
       USING S6800,R15                                                  71100021
         MVI   DX1(RW3),COMMA       ,                                   71110021
         CLI   C6OP,XX88                 IS BXH,BXLE,LM,STM             71120021
       BC    LO,S6850                     YES                           71130021
         CLI   C6OP,XX90                                                71140021
       BC    EQ,S6850                     YES                           71150021
         CLI   C6OP,XX98                                                71160021
       BC    EQ,S6850                     YES                           71170021
         MVC   DX2(LX3,RW3),OU6D1    D2                                 71180021
         MVI   DX5(RW3),LFTPAREN    (                                   71190021
       IC    RW1,C6B1S                  B2                              71200021
       L     R15,AS6200        CONVERT B2 TO DEC                        71210021
       USING S6200,R15                                                  71220021
       BAL   RS1,S6250             CONVERT                              71230021
         MVC   DX6(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71240021
       L     R15,AS6800                                                 71250021
       USING S6800,R15                                                  71260021
         MVI   DX7(RW3),RTPAREN     )                                   71270021
       BC    UNCOND,S6920          CONVERT TO BCD                       71280021
S6850  IC    RW1,C6RS                   R3                              71290021
       L     R15,AS6200        CONVERT TO DEC                           71300021
       USING S6200,R15                                                  71310021
       BAL   RS1,S6250             CONVERT                              71320021
         MVC   DX2(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71330021
       L     R15,AS6800                                                 71340021
       USING S6800,R15                                                  71350021
         MVI   DX3(RW3),COMMA       ,                                   71360021
         MVC   DX4(LX3,RW3),OU6D1 D                                     71370021
         MVI   DX7(RW3),LFTPAREN    (                                   71380021
       IC    RW1,C6B1S                  B2                              71390021
       L     R15,AS6200        CONVERT TO DEC                           71400021
       USING S6200,R15                                                  71410021
       BAL   RS1,S6250             CONVERT                              71420021
         MVC   DX8(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71430021
       L     R15,AS6800                                                 71440021
       USING S6800,R15                                                  71450021
         MVI   DX9(RW3),RTPAREN     )                                   71460021
       BC    UNCOND,S6920          CONVERT TO BCD                       71470021
S6860    MVC   OU6OPD(LX3),OU6D1    SI INSTR-D1                         71480021
         MVI   OU6OPD+NX3,LFTPAREN  (                                   71490021
       IC    RW1,C6B1S                  B1                              71500021
       L     R15,AS6200        CONVERT TO DEC                           71510021
       USING S6200,R15                                                  71520021
       BAL   RS1,S6250             CONVERT                              71530021
         MVC   DX4(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71540021
       L     R15,AS6800                                                 71550021
       USING S6800,R15                                                  71560021
         MVI   DX5(RW3),RTPAREN     )                                   71570021
         CLI   C6OP,XX84                 IMMEDIATE FIELD                71580021
       BC    LO,S6920                     NO                            71590021
         CLI   C6OP,XX97                                                71600021
       BC    HI,S6920                     NO                            71610021
         CLI   C6OP,XX93                                                71620021
       BC    EQ,S6920         NO                                        71630021
         MVI   DX6(RW3),COMMA       ,                                   71640021
         MVI   DX7(RW3),ECKS        X                                   71650021
         MVI   DX8(RW3),QUOTES1     "                                   71660021
         MVC   DX9(LX2,RW3),OU6R1 I2                                    71670021
         MVI   DX11(RW3),QUOTES1    "                                   71680021
       BC    UNCOND,S6920          CONVERT TO BCD                       71690021
S6870    MVC   OU6OPD(LX3),OU6D1 SS INSTR-D1                            71700021
         MVI   OU6OPD+NX3,LFTPAREN  (                                   71710021
       SR    RW1,RW1                    CLEAR REG                       71720021
       IC    RW1,C6RS                   L                               71730021
         CLI   C6OP,MF0             D OR F INSTR                        71740021
       BC    LO,S6880                     D                             71750021
         SRL   RW1,DX4                     F,DELETE L2                  71760021
S6880  AH    RW1,C61                    ADD 1 TO VALUE                  71770021
       L     R15,AS6200                                                 71780021
*                                                                       71790021
       USING S6200,R15                                                  71800021
       BAL   RS1,S6210    CONVERT L TO DECIMAL VALUE                    71810021
         MVC   DX4(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71820021
       L     R15,AS6800                                                 71830021
       USING S6800,R15                                                  71840021
         MVI   DX5(RW3),COMMA       ,                                   71850021
       IC    RW1,C6B1S                  B1                              71860021
       L     R15,AS6200                                                 71870021
       USING S6200,R15                                                  71880021
       BAL   RS1,S6250         CONVERT B1 TO DEC VALUE                  71890021
         MVC   DX6(LX1,RW3),C6WRK4   EXECUTED BY S6200                  71900021
       L     R15,AS6800                                                 71910021
       USING S6800,R15                                                  71920021
         MVI   DX7(RW3),RTPAREN     )                                   71930021
         MVI   DX8(RW3),COMMA       ,                                   71940021
         MVC   DX9(LX3,RW3),OU6D2 D2                                    71950021
         MVI   DX12(RW3),LFTPAREN   (                                   71960021
         CLI   C6OP,XXDF                 D OR F INSTR                   71970021
       BC    HI,S6910                     F                             71980021
       IC    RW1,C6B2S                  B2                              71990021
       L     R15,AS6200                                                 72000021
       USING S6200,R15                                                  72010021
       BAL   RS1,S6250         CONVERT B2 TO DEC VALUE                  72020021
         MVC   DX13(LX1,RW3),C6WRK4  EXECUTED BY S6200                  72030021
       L     R15,AS6800                                                 72040021
       USING S6800,R15                                                  72050021
         MVI   DX14(RW3),RTPAREN    )                                   72060021
       BC    UNCOND,S6920          CONVERT TO BCD                       72070021
S6910  IC    RW1,C6RS                   L                               72080021
       N     RW1,C6M2                   CLEAR ALL BUT L2                72090021
       AH    RW1,C61                    ADD 1 TO VALUE                  72100021
       L     R15,AS6200        CONVERT L  TO DEC VALUE                  72110021
       BALR  RS1,R15               CONVERT                              72120021
         MVC   DX13(LX1,RW3),C6WRK4  EXECUTED BY S6200                  72130021
       L     R15,AS6800                                                 72140021
         MVI   DX14(RW3),COMMA      ,                                   72150021
       IC    RW1,C6B2S                  B2                              72160021
       L     R15,AS6200                                                 72170021
       USING S6200,R15                                                  72180021
       BAL   RS1,S6250         CONVERT B1 TO DEC VALUE                  72190021
         MVC   DX15(LX1,RW3),C6WRK4  EXECUTED BY S6200                  72200021
       L     R15,AS6800                                                 72210021
       USING S6800,R15                                                  72220021
         MVI   DX16(RW3),RTPAREN    )                                   72230021
S6920    MVC   C6WRK0(LX4),LOCCTR   LOC CTR                             72240021
       L     R15,AS6010        CONVERT HEX TO BCD                       72250021
       BALR  RS1,R15               CONVERT                              72260021
       L     R15,AS6800                                                 72270021
         MVC   OU6LC(LX6),C6WRK3    TO PRINT                            72280021
       SR    RW1,RW1                    CLEAR REGISTER                  72290021
       IC    RW1,C6OP                   OP VALUE                        72300021
         CLI   C6OP,XXCF                IS OP D OR F                    72310021
       BC    NOTHI,S6930                  NO                            72320021
       SH    RW1,C630                   REDUCE 3                        72330021
         CLI   C6OP,XXEF                 IS F                           72340021
       BC    NOTHI,S6930                  NO                            72350021
       SH    RW1,C610                     YES,REDUCE 1                  72360021
S6930  MH    RW1,C64                    COMPUTE REL POS IN MNEMONIC     72370021
       A     RW1,AMNEUT       ADD S      ADD START OF MNEMONIC TABL     72380021
         MVC   OU6OPN(LX4),DX0(RW1)  MNEMONIC CODE TO LISTING           72390021
*                                                                       72400021
*      PROCESS SYMBOLIC OPERANDS                                        72410021
         CLI   SB1D1C,BLANK                                             72420021
       BC    EQ,NOSYM1   NO SYMBOLIC OPERAND                            72430021
*      SYMBOLIC OPERAND FOR BASE1-DISP1                                 72440021
         MVC   OU6SO1(LX4),SB1D1C                                       72450021
         LA    RW3,OU6SO1+NX4                                           72460021
       L       RW1,SB1D1N                                               72470021
         CLC   SB1D1C(LX3),XDNCS   TEST IF SOURCE DATA NAME             72480021
       BC      EQ,DNSYM1           YES DATA NAME                        72490021
*                                                                       72500021
       CLC   SB1D1C,XSAV2                                               72510021
       BC    EQ,CKPLU1             THIS IS SAV2 ELT                     72520021
       CLC   SB1D1C,XSAV3                                               72530021
       BC    EQ,CKPLU1             THIS IS SAV3 ELT                     72540021
       USING S6200,R15                                                  72550021
       L     R15,AS6200                                                 72560021
       BAL   RS1,S6210             CONVERT                              72570021
         MVC   DX0(LX0,RW3),C6WRK4   EXECUTED BY S6200                  72580021
       USING S6800,R15                                                  72590021
       L     R15,AS6800                                                 72600021
CKPLU1   CLC   SB1D1P(LX4),C6F0                                         72610021
       BC      EQ,NOPLU1           DON'T NEED PLUS                      72620021
         MVI   DX1(RW3),PLUSSIGN    PLUS                                72630021
       L       RW1,SB1D1P                                               72640021
       LTR   RW1,RW1        TEST IF NEGATIVE                            72650021
       BC    NOTNEG,NONEG1         NO IT ISN'T NEG                      72660021
       LCR   RW1,RW1          RECOMPLEMENT                              72670021
         MVI   DX1(RW3),MINUSIGN    NOTE THAT IT WAS MINUS              72680021
NONEG1 DS    0H                                                         72690021
       L     R15,AS6200                                                 72700021
       USING S6200,R15                                                  72710021
       BAL   RS1,S6210             CONVERT                              72720021
         MVC   DX2(LX0,RW3),C6WRK4   EXECUTED BY S6200                  72730021
       USING S6800,R15                                                  72740021
       L     R15,AS6800                                                 72750021
NOPLU1 DS      0H                                                       72760021
NOSYM1 DS      0H                                                       72770021
         CLI   SB2D2C,BLANK                                             72780021
       BC    EQ,NOSYM2   NO SYMBOLIC OPERAND                            72790021
*      SYMBOLIC OPERAND FOR  BASE2-DISP2                                72800021
         LA    RW3,OU6SO2+NX4                                           72810021
       L       RW1,SB2D2N                                               72820021
         MVC   OU6SO2(LX4),SB2D2C                                       72830021
         CLC   SB2D2C(LX3),XDNCS   TEST IF SOURCE DATA NAME             72840021
       BC      EQ,DNSYM2           YES                                  72850021
       CLC   SB2D2C,XSAV2                                               72860021
       BC    EQ,CKPLU2             YES SAV2                             72870021
       CLC   SB2D2C,XSAV3                                               72880021
       BC    EQ,CKPLU2             YES SAV3                             72890021
       L     R15,AS6200                                                 72900021
       USING S6200,R15                                                  72910021
       BAL   RS1,S6210             CONVERT                              72920021
         MVC   DX0(LX0,RW3),C6WRK4   EXECUTED BY S6200                  72930021
       USING S6800,R15                                                  72940021
       L     R15,AS6800                                                 72950021
CKPLU2   CLC   SB2D2P(LX4),C6F0                                         72960021
       BC      EQ,NOPLU2           DON'T NEED PLUS                      72970021
         MVI   DX1(RW3),PLUSSIGN    PLUS                                72980021
       L       RW1,SB2D2P                                               72990021
       LTR   RW1,RW1          TEST IF NEGATIVE AND ACT ON IT AS ABO     73000021
       BC    NOTNEG,NONEG2         IT ISN'T NEG                         73010021
       LCR   RW1,RW1                                                    73020021
         MVI   DX1(RW3),MINUSIGN    MINUS                               73030021
NONEG2 DS    0H                                                         73040021
       L     R15,AS6200                                                 73050021
       USING S6200,R15                                                  73060021
       BAL   RS1,S6210             CONVERT                              73070021
         MVC   DX2(LX0,RW3),C6WRK4   EXECUTED BY S6200                  73080021
       USING S6800,R15                                                  73090021
       L     R15,AS6800                                                 73100021
NOPLU2 DS      0H                                                       73110021
NOSYM2 DS      0H                                                       73120021
         MVC   SB1D1C(LX24),SBDINI   REINITIALIZE  SYMBOLIC OPS         73130021
       L     R15,APUT          PRINT                                    73140021
       BALR  RS1,R15               PRINT A LINE                         73150021
       L     R15,AS6800                                                 73160021
*                                                                       73170021
*                                                                       73180021
*                                                                       73190021
*  CONTINUE HERE WHEN NOLIST MODE                                       73200021
*                                                                       73210021
*                                                                       73220021
*=L                                                                     73230021
S6931  DS    0H                                                         73240021
         CLI   C6OP,XX05      KILL REG STATUS ON ANY BALR               73250021
       BC    NOTEQ,S69315          NOT 'BALR'                           73260021
         TM    C6RS,REG15                                               73270021
       BC    ZERO,S69315           NOT R15                              73280021
         XC    CELL14(LX2),CELL14   SET 14 DESTROYED                    73290021
       XC    CELL15,CELL15                                              73300021
S69315 EQU   *                                                          73310021
       LA    R1,TXTFLD                                                  73320021
         LA    R0,TWOBYTE                                               73330021
         MVC   TXTFLD(LX2),C6OP OP AND REGS                             73340021
         CLI   C6OP,XX40                                                73350021
       BC    LO,S6932       RR TYPE                                     73360021
         LA    R0,FOURBYTE                                              73370021
         MVC   TXTFLD2(LX2),C6D1S  DISP TO PUNCH FIELD                  73380021
       SR    RW1,RW1                                                    73390021
       IC    RW1,C6B1S                                                  73400021
         SLL   RW1,DX4                                                  73410021
       EX    RW1,OIEX1      BASE TO HIGH 4 BITS                         73420021
         CLI   C6OP,XXC0                                                73430021
       BC    LO,S6932       RX,RS,SI                                    73440021
         LA    R0,SIXBYTES         SS                                   73450021
         MVC   TXTFLD3(LX2),C6D2S                                       73460021
       SR    RW1,RW1                                                    73470021
       IC    RW1,C6B2S                                                  73480021
         SLL   RW1,DX4                                                  73490021
       EX    RW1,OIEX2                                                  73500021
S6932  EQU   *                                                          73510021
       L     R15,ATXPNH        PUNCH INSTR AND UP LOCCTR ACCORDINGL     73520021
       BALR  RS1,R15               PUNCH TEXT                           73530021
       L     R15,AS6800                                                 73540021
       BC    UNCOND,S6942          SKIP 'OR'ING                         73550021
OIEX1    OI    TXTFLD2,XX00                                             73560021
OIEX2    OI    TXTFLD3,XX00                                             73570021
S6942  EQU   *                                                          73580021
         MVI   C6OP,NOPOPCD        SET LISTING DONE FOR THIS LINE       73590021
       LM    R0,R15,V6800                                               73600021
         BCR   UNCOND,RS1          RETURN                               73610021
*=L    CODING FROM HERE TO NEXT *=L CARD OUT IF NOLIST MODE             73620021
*                       BITS 2          13           9                  73630021
*      FORMAT DICT PTR  // NOT-USED   SECT-NO   DISP-IN-SECT //         73640021
*      FORMAT OUTPUT    DNM=SECTNO-DISP                                 73650021
DNSYM1 DS      0H                                                       73660021
         SRL   RW1,DX9                                                  73670021
       N       RW1,C6M13    GET SECT-NO                                 73680021
       L     R15,AS6200                           ** NO REFS TO THI     73690021
       USING S6200,R15                            ** SUBROUTINE         73700021
       BAL   RS1,S6210     CONVERT AND MOVE       ** UNTIL RELOAD       73710021
         MVC   DX0(LX0,RW3),C6WRK4                  ** REG 15           73720021
         MVI   DX1(RW3),MINUSIGN   INSERT HYPHEN                        73730021
       L       RW1,SB1D1N                          **                   73740021
       N       RW1,C6M9     GET DISP               **                   73750021
       BAL   RS1,S6210     CONVERT AND  MOVE      **                    73760021
         MVC   DX2(LX0,RW3),C6WRK4                  **                  73770021
       USING S6800,R15                            **                    73780021
       L     R15,AS6800                         **                      73790021
         LA    RW3,DX2(RW3)                                             73800021
       BC    UNCOND,CKPLU1         GO CHECK IF NEED PLUS                73810021
*                                                                       73820021
*      SEE FORMAT ABOVE FOR OP2                                         73830021
*                                                                       73840021
DNSYM2 DS      0H                                                       73850021
         SRL   RW1,DX9       GET SECT-NO                                73860021
       N       RW1,C6M13                                                73870021
       L     R15,AS6200                                                 73880021
       USING S6200,R15                            ** NO REFS TO THI     73890021
       BAL   RS1,S6210     CONVERT AND MOVE       ** ROUTINE UNTIL      73900021
         MVC   DX0(LX0,RW3),C6WRK4                  ** REG 15 IS        73910021
         MVI   DX1(RW3),MINUSIGN   INSERT HYPHEN       **RELOADED       73920021
       L       RW1,SB2D2N                          **                   73930021
       N       RW1,C6M9           GET DISP        **                    73940021
       BAL   RS1,S6210     CONVERT AND MOVE       **                    73950021
         MVC   DX2(LX0,RW3),C6WRK4                  **                  73960021
       USING S6800,R15                            **                    73970021
       L     R15,AS6800                           **                    73980021
         LA    RW3,DX2(RW3)                                             73990021
       BC      UNCOND,CKPLU2       GO CHECK IF NEED PLUS                74000021
TXTFLD   DS    0CL6                                                     74010021
TXTFLD1  DC    2X'00'              DISPLACEMENT                         74020021
TXTFLD2  DC    2X'00'              +2   TO                              74030021
TXTFLD3  DC    2X'00'              +4   PUNCH                           74040021
*=L    (PREVIOUS CODING NEVER CALLED IF NOLIST)                         74050021
XDNCS  DC      C'DNM'                                                   74060021
XSAV2  DC    C'SAV2'                                                    74070021
XSAV3  DC    C'SAV3'                                                    74080021
V6800  DS    16F                                                        74090021
       DROP  R15                                                        74100021
       EJECT                                                            74110021
*                                                                       74120021
*=1      GET---DEBLOCKING ROUTINE                                       74130021
*=                        FOR PROCEDURE A-TEXT                          74140021
*                                                                       74150021
*                                                                       74160021
*                                                                       74170021
*        RETURN    EOF-TO ADDR IN EOFADR CELL                           74180021
*                  NORMAL-INPUTR CONTAINS ADDR OF LOGICAL RCD           74190021
*                                                                       74200021
*                                                                       74210021
       DS    0H                                                         74220021
       USING *,R15                                                      74230021
GET      EQU   *                                                        74240021
       STM   R0,R15,SVREG                                               74250021
       L     RW1,EOFADR                                                 74260021
         CLI   FGET,FGETNEW        NEED NEW BLOCK                       74270021
         BC    NOTEQ,GET010        DON'T NEED NEW BLOCK                 74280021
         MVI   FGET,FGETNOT        DON'T NEED NEW BLOCK                 74290021
GET020 LR    R1,RB2                                                     74300021
         TM    TESTSW,TSTDUM       ASSEMBLED INPUT                      74310021
       BC    ZERO,GET040             NO                                 74320021
       L     INPUTR,ADTEST                                              74330021
         BC    UNCOND,GET030       CONTINUE, INPUT NOT ASSEMBLED        74340021
GET040 EQU   *                                                          74350021
       BALR  R0,RB2                BR TO PH0                            74360021
       DC    X'01'                 READ PROC. A - TEXT                  74370021
*                                                                       74380021
*                                                                       74390021
       BCR   ZERO,RW1         CC=0 1F EOF                               74400021
       LR    INPUTR,R0                                                  74410021
         CLI   DX0(INPUTR),ALLON                                        74420021
       BCR   EQ,RW1        1F START OF BLOCK FF-SHOULD BE EOF           74430021
GET030 EQU   *                                                          74440021
       ST    INPUTR,GETRET                                              74450021
       SR    RW1,RW1                                                    74460021
*      GET ELEMENT TYPE TO TRANSLATE INTO WORKABLE CODES                74470021
*      AND PICK UP LENGTH OF ELT                                        74480021
         IC    RW1,DX0(INPUTR)                                          74490021
         SRL   RW1,DX2                                                  74500021
       STC   RW1,GOTCOD                                                 74510021
         IC    RW1,LTBL-NX11(RW1)                                       74520021
       STH   RW1,GETLEN                                                 74530021
         TR    GOTCOD(LX1),GETRAN-NX11                                  74540021
       LM    R0,R15,SVREG                                               74550021
       L     INPUTR,GETRET                                              74560021
         BCR   UNCOND,RS1          RETURN                               74570021
         EJECT                                                          74580021
GETRET   DC    A(0)                                                     74590021
*                                                                       74600021
*                                                                       74610021
*        GET NEXT LOGICAL RECORD                                        74620021
*                                                                       74630021
GET010 AH    INPUTR,GETLEN    ADD LENGTH OF PREVIOUS LOGICAL RCD        74640021
         TM    TESTSW,TSTDUM       ASSEMBLED INPUT                      74650021
       BC    ZERO,GET060            NO                                  74660021
         CLI   DX0(INPUTR),INITOFF                                      74670021
       BCR   EQ,RW1          END OF ASSEMBLED INPUT                     74680021
GET060 EQU   *                                                          74690021
         CLI   DX0(INPUTR),ALLON                                        74700021
       BC    EQ,GET070             END OF TEXT                          74710021
         BC    UNCOND,GET030       GET NEXT BLOCK CONTINUED             74720021
GET070   CLI   SEGLMT,NOTSEGTD     IS PROGRAM SEGMENTED                 74730021
         BC    EQ,GET020           BR, PROGRAM NOT SEGMENTED            74740021
       B     GET040                BR,PROGRAM IS SEGMENTED              74750021
LTBL   EQU   *                LENGTHS OF F3 ELEMENTS                    74760021
       DC    FL1'3'      2C   CRDNO                                     74770021
       DC    FL1'4'      30  PNDEF                                      74780021
       DC    FL1'3'      34   GNDEF                                     74790021
       DC    FL1'4'      38   VNDEF                                     74800021
       DC    FL1'1'      3C   PNBCD                                     74810021
       DC    FL1'3'      40   RPDEF                                     74820021
       DC    FL1'2'      44   MACRO                                     74830021
       DC    FL1'3'      48   OP                                        74840021
       DC    FL1'4'      4C   PNREF                                     74850021
       DC    FL1'3'      50   GNREF                                     74860021
       DC    FL1'4'      54   VNREF                                     74870021
       DC    FL1'3'      58   VIRREF                                    74880021
       DC    FL1'3'      5C   BLREF                                     74890021
       DC    FL1'3'      60   GTREF1                                    74900021
       DC    FL1'4'      64   GTREF2                                    74910021
         DC    FL1'3'        68  LTLREF                            LITS 74920021
       DC    FL1'2'      6C   DCDEF                                     74930021
       DC    FL1'3'      70   BDISP                                     74940021
       DC    FL1'3'      74   RPDREF                                    74950021
       DC    FL1'7'      78   ADR                                       74960021
       DC    FL1'2'      7C   BCDREF                                    74970021
       DC    FL1'4'      80   PLUS                                      74980021
       DC    FL1'5'      84   RELADR                                    74990021
       DC    FL1'2'      88   SPECIAL PHASE 6 ELT                       75000021
       DC    FL1'2'      8C      -      -   -  -                        75010021
       DC    FL1'4'      90                                             75020021
       DC    FL1'4'      94      -      -   -  -                        75030021
       DC    FL1'1'      98   RPDBCD                                    75040021
       DC    FL1'1'      9C   SPECIAL PHASE 6 ELT                       75050021
       DC    FL1'2'      A0   REGISTER NUMBER                           75060021
       DC    FL1'10'     A4   ADR FOLLOWED BY PLUS                      75070021
       DC    FL1'1'      A8   SPECIAL PHASE 6 ELT                       75080021
       DC    FL1'1'      AC   SPECIAL PHASE 6 ELT                       75090021
       DC    FL1'5'      B0   CALLING SEQ DISPL ELT                     75100021
       DC    FL1'4'      B4   CALLING SEQ DICT PTR                      75110021
       DC    FL1'4'                B8  F&LE -EF ELEMENT                 75120021
*                                                                       75130021
GETRAN EQU   *           INPUT CODE TRANSLATE TABLE                     75140021
*                         00-5C         OPERAND ELTS                    75150021
*                        E0-FC     ILLEGAL EXCEPT WHEN TESTED FOR       75160021
*                        60        OP CODE                              75170021
*                        64-88     ELTS NOT ASSOCIATED TO OPS           75180021
       DC    X'84'  2C                                                  75190021
       DC    X'64'  30                                                  75200021
       DC    X'68'  34                                                  75210021
       DC    X'6C'  38                                                  75220021
       DC    X'70'  3C                                                  75230021
       DC    X'7C'  40                                                  75240021
       DC    X'80'  44                                                  75250021
       DC    X'60'  48        OP-IN BETWEEN 2 GROUPS                    75260021
       DC    X'28'  4C                                                  75270021
       DC    X'2C'  50                                                  75280021
       DC    X'30'  54                                                  75290021
       DC    X'34'  58                                                  75300021
       DC    X'38'  5C                                                  75310021
       DC    X'3C'  60                                                  75320021
       DC    X'40'  64                                                  75330021
       DC    X'44'  68                                                  75340021
       DC    X'FC'  6C                                                  75350021
       DC    X'48'  70                                                  75360021
       DC    X'F0'  74                                                  75370021
       DC    X'4C'  78                                                  75380021
       DC    X'F4'  7C                                                  75390021
       DC    X'50'  80                                                  75400021
       DC    X'F8'  84                                                  75410021
       DC    X'58'  88                                                  75420021
       DC    X'24'  8C                                                  75430021
       DC    X'54'  90                                                  75440021
       DC    X'5C'  94                                                  75450021
       DC    X'78'  98                                                  75460021
       DC    X'88'  9C                                                  75470021
       DC    X'EC'  A0                                                  75480021
       DC    X'20'       A4   ADR FOLLOWED BY PLUS                      75490021
       DC    X'1C'       A8                                             75500021
       DC    X'18'       AC                                             75510021
       DC    X'E8'       B0   CALLING SEQ DISPL ELT                     75520021
       DC    X'E4'       B4   CALLING SEQ DICT PTR                      75530021
       DC    X'EC'                 B8  F&LE -EF ELEMENT                 75540021
*                                                                       75550021
       DROP  R15                                                        75560021
       EJECT                                                            75570021
*=1    SAVGET                 SAVE CONDITIONS OF GET ROUTINE            75580021
*=           CALLED BY    L    15,ASAVGE                                75590021
*=                        BALR 14,15                                    75600021
*                                                                       75610021
       DS    0H                                                         75620021
       USING *,R15                                                      75630021
SAVGET STM   R0,R15,SVREG                                               75640021
       ST    INPUTR,SVINPR    SAVE INPUTR, EOFADR, GETLEN,              75650021
       L     RS1,EOFADR           TESTSW, AND FGET                      75660021
       ST    RS1,SVEOFA                                                 75670021
       LH    RS1,GETLEN                                                 75680021
       STH   RS1,SVGETL                                                 75690021
       IC    RS1,TESTSW                                                 75700021
       STC   RS1,SVTESW                                                 75710021
       IC    RS1,FGET                                                   75720021
       STC   RS1,SVFGET                                                 75730021
         L     RS1,SVREG+NX56                                           75740021
         BCR   UNCOND,RS1          RETURN                               75750021
       DROP  R15                                                        75760021
*                                                                       75770021
*                                                                       75780021
*=1    RESGET                 RESTORE PREVIOUSLY SAVED                  75790021
*=                            CONDITIONS OF GET ROUTINE                 75800021
*=           CALLED BY    L    15,ARESGE                                75810021
*=                        BALR 14,15                                    75820021
*                                                                       75830021
       DS    0H                                                         75840021
       USING *,R15                                                      75850021
RESGET STM   R0,R15,SVREG                                               75860021
       L     RS1,SVEOFA        RESTORE INPUTR, EOFADR, GETLEN,          75870021
       ST    RS1,EOFADR           TESTSW, AND FGET                      75880021
       LH    RS1,SVGETL                                                 75890021
       STH   RS1,GETLEN                                                 75900021
       IC    RS1,SVTESW                                                 75910021
       STC   RS1,TESTSW                                                 75920021
       IC    RS1,SVFGET                                                 75930021
       STC   RS1,FGET                                                   75940021
       L     INPUTR,SVINPR                                              75950021
         L     RS1,SVREG+NX56                                           75960021
         BCR   UNCOND,RS1          RETURN                               75970021
       DROP  R15                                                        75980021
       EJECT                                                            75990021
*=2    GET RELATIVE GN= OR PN= FROM GIVEN GN= OR PN=                    76000021
*      CALLED BY   L     15,AGETPN                                      76010021
*                  BALR  14,15                                          76020021
*                                                                       76030021
*                  L     15,AGETPN                                      76040021
*                  USING GETPN,15                                       76050021
*                  BAL   14,GETGN                                       76060021
*                  DROP  15                                             76070021
*      INPUT       RW1 GN= OR PN=                                       76080021
*      OUTPUT      RW1 RELLOC IN PGT OF ITEM                            76090021
*                  RW3 REL GN= (PLUS HI PN=) OR REL PN=                 76100021
       DS    0H                                                         76110021
       USING *,R15                                                      76120021
GETPN  STM   RS1,R2,PNREGS                                              76130021
       L     R1,APNTBL                                                  76140021
GTP020 L     R15,ATABLE                                                 76150021
       BALR  RS1,R15               GET TABLE ADDR AND SIZE              76160021
       L     R15,AGETPN                                                 76170021
       BCTR  RW1,R0          ((PN=)-1)*2  POINTS TO PNTBL               76180021
         SLL   RW1,DX1                                                  76190021
         LH    RW1,DX0(RW1,R1)                                          76200021
       LTR   RW1,RW1                                                    76210021
       BC    ZERO,GTP040           PN/GN NUMBER IS ZERO                 76220021
       LR    RW3,RW1                                                    76230021
       BCTR  RW1,R0                SUBTRACT 1                           76240021
         SLL   RW1,DX2                                                  76250021
       AH    RW1,PNCTR                                                  76260021
GTP039   TM    GTP039,TSTDUM       SET CONDIT CODE NONZERO              76270021
GTP040 DS    0H                                                         76280021
       LM    RS1,R2,PNREGS                                              76290021
         BCR   UNCOND,RS1          RETURN                               76300021
GETGN  DS    0H                                                         76310021
       STM   RS1,R2,PNREGS                                              76320021
       L     R1,AGNTBL                                                  76330021
       BC    UNCOND,GTP020         DO PN COMMON CODE                    76340021
       DROP  R15                                                        76350021
PNREGS DS    5F                                                         76360021
       EJECT                                                            76370021
*=1        GETF4         PROCESS FILE F4                                76380021
*                                                                       76390021
*            CALLED BY  L   15,AGETF4 ... BALR  14,15                   76400021
*            NORMAL RETURN   BCR  15,14                                 76410021
*            EOF RETURN      BCR  15,RW2                                76420021
*            AT EXIT                                                    76430021
*              INPUTR  OR  F4REG (AS SPECIFIED) HAS LOCATION            76440021
*              OF DESIRED RECORD, G4LEN HAS RECORD LENGTH.              76450021
*            F4SW USED TO DETERMINE PROPER RECORD HANDLING              76460021
*                                                                       76470021
       USING GETF4,R15                                                  76480021
GETF4  DS    0H                                                         76490021
         TM    F4SW,F4EOF          EOF REACHED                          76500021
       BCR   NOTZER,RW2       EOF EXIT                                  76510021
         TM    F4SW,F4POS01        POSITION TO 01                       76520021
       BC    NOTZER,GT405     POSITION TO 01                            76530021
         TM    F4SW,F4LSTEND       PREMATURE END OF LISTING             76540021
       BCR   NOTZER,RW2       TAKE EOF UNTIL REQUEST                    76550021
GT405    NI    F4SW,F4OTR          NOT PREMATURE/TO POS TO 01           76560021
       STM   R0,R15,SGETF4                                              76570021
         TM    F4SW,F4NEWBLK       NEW BLOCK NEEDED                     76580021
       BC    NOTZER,GT4C      GET INITIAL BLOCK                         76590021
       LR    RW3,F4REG                                                  76600021
         TM    F4SW,F4INPUTR       USE INPUTR                           76610021
       BC    ZERO,GT4A             USE F4REG                            76620021
       LR    RW3,INPUTR       USE INPUTR                                76630021
GT4A   AH    RW3,G4LEN                                                  76640021
GT4B     CLI   DX0(RW3),ALLON                                           76650021
       BC    NOTEQ,GT4E       NO NEW BLOCK NEEDED                       76660021
GT4C   EQU   *                                                          76670021
GT4D   BALR  R0,RB2            READ F4                                  76680021
       DC    X'04'                                                      76690021
       BC    EOF,G4EOF             IF RETURN CODE IS EOF,RETURNEOF      76700021
       LR    RW3,R0                                                     76710021
         BC    UNCOND,GT4B         CHECK FOR FF                         76720021
GT4E   ST    RW3,G4FND                                                  76730021
         NI    F4SW,F4NONWBK       TURN OFF NEW BLOCK BIT               76740021
         TM    F4SW,F4LSTXT        IN LISTING TEXT                      76750021
       BC    ZERO,GT4I        NOT IN LISTING TEXT                       76760021
         IC    RW1,DX0(RW3)                                             76770021
       N     RW1,FW127        LAST 7 BITS FOR LENGTH                    76780021
       STH   RW1,G4LEN                                                  76790021
         CLI   DX0(RW3),XX01                                            76800021
       BC    LO,G4ER1              CODE IN LISTING TEXT ERROR           76810021
       BC    HI,GT4F               TEST IF IT'S A SKIP                  76820021
         TM    F4SW,F4POS01        END OF LISTING (POSITION TO 01       76830021
       BC    ZERO,G4ER2       NOT EXPECTED                              76840021
         BC    UNCOND,GT4G         CONTINUE WITH ERR RTN                76850021
GT4F     TM    F4SW,F4POS01        END OF LISTING (POSITION TO 01       76860021
       BC    NOTZER,GT4A      SKIP TO 01                                76870021
GT4G   LM    R0,R15,SGETF4                                              76880021
GT4G5  DS    0H                                                         76890021
         TM    F4SW,F4INPUTR       USE INPUTR                           76900021
       BC    ZERO,GT4H        USE F4REG                                 76910021
       L     INPUTR,G4FND                                               76920021
         BCR   UNCOND,RS1          RETURN                               76930021
GT4H   L     F4REG,G4FND                                                76940021
         BCR   UNCOND,RS1          RETURN                               76950021
*                                                                       76960021
GT4I     SR    RW1,RW1          CLEAR FOR FIRST CHAR                    76970021
         CLI   DX0(RW3),CKPTDF                                          76980021
       BC    HI,G4ER3         BAD CODE                                  76990021
         TM    DX0(RW3),XX03                                            77000021
       BC    NOTZER,G4ER3     BAD CODE                                  77010021
         IC    RW1,DX0(RW3)                                             77020021
         SRL   RW1,DX1                                                  77030021
       LH    RW1,LTLB2(RW1)   GET LENGTH FROM TABLE                     77040021
       STH   RW1,G4LEN                                                  77050021
         BC    UNCOND,GT4G         CONTINUE WITH ERR RTN                77060021
*                                                                       77070021
G4EOF    TM    F4SW,F4LSTXT        IN LISTING TEXT                      77080021
       BC    NOTZER,G4ER4     EOF WHILE DOING LISTING                   77090021
G4EOFX LM    R0,R15,SGETF4                                              77100021
       LR    RS1,RW2             LOAD RETURN REGISTER                   77110021
         BC    UNCOND,GT4G5        CONTINUE WITH ERR RTN                77120021
*                                                                       77130021
G4ER1    MVC   OU6REC+NX47(LX24),G4ER01                                 77140021
         MVI   SAVMNO,XC1                                               77150021
         BC    UNCOND,G4ERC        SET EOF RETURN                       77160021
G4ER2    OI    F4SW,F4LSTEND       EOF EXIT UNTIL POSITION REQ.         77170021
       XC    G4LEN,G4LEN                                                77180021
         MVC   OU6NAM(LX28),G4ER02                                      77190021
         MVI   SAVMNO,XC2                                               77200021
         BC    UNCOND,G4ERD        GO MOVE MSG                          77210021
G4ER3    MVC   OU6CDN(LX64),G4ER03   MOVE COMPLETE MESSAGE              77220021
         MVI   SAVMNO,XC3                SAVE MESSAGE NUMBER ANYWAY     77230021
         OI    F4SW,F4EOF          EOF BIT ON                           77240021
         MVI   P6ESW,ALLON         LOGIC ERROR IN PH6                   77250021
         L     R15,APUT            PRINT D-LEVEL MSG                    77260021
         BALR  RS1,R15             PRINT                                77270021
         L     R15,AGETF4          ESTAB ADDRESSABILITY                 77280021
         OI    SWITCH,NO6A              DON'T CALL 6A                   77290021
         TM    PHZSW1,MAPSP        MAP SUPPRESS?                        77300021
         BC    ZERO,G4ER3A      NO                                      77310021
         L     RB1,AFIRST           SET UP BASE FOR MSGMS CODING        77320021
         USING FIRST,RB1                                                77330021
         BC    UNCOND,MSGMS        PRINT MAP SUPPRESS MSG & STATS       77340021
G4ER3A DS 0H                                                            77350021
         L     R15,APRSTAT          PRINT STATISTICS                    77360021
         BALR  RS1,R15             PRINT                                77370021
         L     R15,AGETF4         ESTAB  ADDRESSABILITY                 77380021
         L     RB1,AFIRST           SET UP BASE FOR NOOPTST CODING      77390021
         USING FIRST,RB1                                                77400021
         BC    UNCOND,NOOPTST      RETURN TO PH0                        77410021
       DROP    RB1                                                      77420021
         USING RB1BAS,RB1                                               77430021
G4ER4    MVC   OU6NAM(LX42),G4ER04                                      77440021
         MVI   SAVMNO,XC4                                               77450021
G4ERC    OI    F4SW,F4EOF          EOF RETURN                           77460021
G4ERD    MVC   OU6CDN(LX45),G4ERE    MOVE FIRST PART OF MSG             77470021
         MVC   OU6REC+NX7(LX1),SAVMNO                                   77480021
       L     R15,APUT                                                   77490021
       BALR  RS1,R15               PRINT A LINE                         77500021
       L     R15,AGETF4                                                 77510021
         BC    UNCOND,G4EOFX        RETURN                              77520021
*                                                                       77530021
SAVMNO   DS    C                                                        77540021
SGETF4 DS    16F                                                        77550021
G4FND  DS    F                                                          77560021
*                                                                       77570021
G4ERE    DC    C'IKF6000I-C    E'                                       77580021
         DC    C'RROR '                                                 77590021
       DC      C'FOUND PROCESSING'                                      77600021
       DC      C' F4 TEXT.'                                             77610021
G4ER01 DC    C'00 CODE IN LISTI'                                        77620021
       DC      C'NG  TEXT.'                                             77630021
G4ER02 DC    C'END OF LISTING T'                                        77640021
       DC      C'EXT REACHED.'                                          77650021
G4ER03   DC    C'IKF6003I-D    CO'                                      77660021
         DC    C'MPILER ERROR. CO'                                      77670021
         DC    C'MPILATION WILL N'                                      77680021
         DC    C'OT BE COMPLETE. '                                      77690021
G4ER04 DC    C'EOF REACHED WHIL'                                        77700021
       DC    C'E PROCESSING LIS'                                        77710021
       DC      C'TING TEXT.'                                            77720021
*                                                                       77730021
*  TABLE OF LENGTHS BY RECORD TYPE                                      77740021
*                                                                       77750021
*            LENGTH    CODE   RECORD                                    77760021
*                                                                       77770021
LTLB2  DC    H'8'        0    MESSAGE   VARIABLE IF PARAM               77780021
       DC    H'5'        4    DCBADEF                                   77790021
       DC    H'9'        8    DECBADEF                                  77800021
       DC    H'9'        C    BLKADEF                                   77810021
       DC    H'0'        10                                             77820021
       DC    H'0'        14                                             77830021
       DC    H'0'        18                                             77840021
       DC    H'0'        1C                                             77850021
       DC    H'9'        20   SAADEF                                    77860021
       DC    H'8'        24   WSADEF                                    77870021
       DC    H'7'        28   CONDEF    PLUS VF SIZE                    77880021
       DC    H'8'        2C   ACONDEF                                   77890021
       DC    H'8'        30   INDADEF                                   77900021
       DC    H'3'        34   QDEF                                      77910021
       DC    H'3'        38   CKPTDEF                                   77920021
       DROP  R15                                                        77930021
         EJECT                                                          77940021
*                                                                       77950021
*        DN DEF ELEMENT                                                 77960021
*                                                                       77970021
*        //48 NNNN DDDDDD LL BCD NAME//                                 77980021
*        NNNN=CARD NUMBER                                               77990021
*        DDDDDD=DICT POINTER                                            78000021
*        LL=LENGTH OF NAME THAT FOLLOWS                                 78010021
*                                                                       78020021
D6DNDEF  DS    0H                                                       78030021
         USING *,RW2                                                    78040021
         SR    R3,R3                                                    78050021
         IC    R3,A6DNLN           GET LENGTH OF NAME                   78060021
         LA    R3,DX7(R3)           COMPUTE LENGTH OF DN DEF ELM        78070021
         LR    R2,INPUTR           ADDR OF DN DEF ELM                   78080021
         BALR  R0,RB2              BR TO PH0                            78090021
       DC    X'11'                 WRITE ON UT1                         78100021
         DROP RW2                                                       78110021
         STH   R3,G4LEN            SAVE LENGTH OF THIS ELMT             78120021
         B     PDT020              CONT WITH COMMON CODING              78130021
         SPACE 3                                                        78140021
*                                                                       78150021
*        PN DEF ELEMENT                                                 78160021
*                                                                       78170021
*        //4C PPPP NNNN LL BCD NAME//                                   78180021
*        PPPP=PN NUMBER                                                 78190021
*        NNNN=CARD NUMBER                                               78200021
*        LL=LENGTH OF NAME THAT FOLLOWS                                 78210021
*                                                                       78220021
D6PNDEF  DS    0H                                                       78230021
         USING *,RW2                                                    78240021
         SR    R3,R3                                                    78250021
         IC    R3,A6PNLN           GET LENGTH OF NAME                   78260021
         LA    R3,DX6(R3)           GET LNGTH OF ENTIRE PN DEF          78270021
         LR    R2,INPUTR                                                78280021
         BALR  R0,RB2              BR TO PH0                            78290021
       DC    X'11'                 WRITE ON UT1                         78300021
         DROP RW2                                                       78310021
         STH   R3,G4LEN            SAVE LENGTH OF THIS ELMT             78320021
         B     PDT020              CONT WITH COMMON CODING              78330021
       EJECT                                                            78340021
*=1  PUT ROUTINE                                                        78350021
*                                                                       78360021
*      ENTRY POINTS      PUT--WRITE LINE IF LIST MODE                   78370021
*                        PUTM-WRITE LINE REGARDLESS OF LIST MODE        78380021
       DS    0H                                                         78390021
       USING *,R15                                                      78400021
PUT    EQU   *                                                          78410021
       TM    PHZSW,NOLIST                                               78420021
       BCR   ZERO,RS1          EXIT IF NOLIST MODE                      78430021
PUTM   DS    0H                                                         78440021
       STM   R0,R15,SVREG                                               78450021
       LA    R2,OU6REC                                                  78460021
         LA    R3,DX120                                                 78470021
       BALR  R0,RB2                BR TO PH0                            78480021
       DC    X'16'                 WRITE SYSPRINT                       78490021
       BALR  R0,RB2                BR TO PH0                            78500021
       DC    X'86'               WOUT SYSPRINT (PAD TO RIGHT-BLNKS)     78510021
         MVI   OU6REC,BLANK        CLEAR OUTPUT AREA                    78520021
         MVC   OU6CDN(LX119),OU6REC                                     78530021
       LM    R0,R15,SVREG                                               78540021
         MVC   OUCREC,OU6REC       BLANK CLIST WORK AREA                78550021
PCEXIT   DS    0H                                                       78560021
         BCR   UNCOND,RS1         RETURN                                78570021
         SPACE 2                                                        78580021
PUTC     DS    0H                 *TO PRINT FOR CONDENSED LIST*         78590021
         CLI   CLIST3+NX1,XX00                                          78600021
         BC    NOTEQ,PUTC10        NOT IN FIRST SECTION                 78610021
         MVC   OUCREC1,PUTCWK      MOVE INTO 1ST PART OF PRINT AREA     78620021
         BC    UNCOND,PUTC20       GO FINISH PROCESSING                 78630021
PUTC10   DS    0H                                                       78640021
         CLI   CLIST3+NX1,XX01                                          78650021
         BC    NOTEQ,PUTC30        MUST BE IN THIRD SECTION             78660021
         MVC   OUCREC2,PUTCWK      MOVE INTO 2D PART OF PRINT AREA      78670021
PUTC20   DS    0H                                                       78680021
         MVI   PUTCWK,BLANK        CLEAR WORK AREA                      78690021
         MVC   PUTCWK+NX1(LX24),PUTCWK                                  78700021
         LH    RW1,CLIST3          INCREMENT CTR                        78710021
         LA    RW1,DX1(RW1)         POINTING TO                         78720021
         STH   RW1,CLIST3          PROPER SECTION OF PRINT AREA         78730021
         BCR   UNCOND,RS1          RETURN                               78740021
PUTC30   DS    0H                                                       78750021
         MVI   CLIST3+NX1,XX00      INITIALIZE CTR                      78760021
         MVC   OU6REC,OUCREC       MOVE CLIST AREA TO O/P AREA          78770021
         BC    UNCOND,PUTM         PRINT A LINE                         78780021
PUTCEND  DS    0H                  FINISH CLIST                         78790021
         CLI   CLIST3+NX1,XX00                                          78800021
         BC    EQ,PCEXIT           LAST LINE IS ALREADY GONE            78810021
         MVC   OU6REC(LX91),OUCREC  GET RID OF LINE                     78820021
         MVI   OU6REC+NX91,BLANK                                        78830021
         MVC   OU6REC+NX92(LX27),OU6REC+NX91                            78840021
         BC    UNCOND,PUTM         GO PRINT                             78850021
       DROP  R15                                                        78860021
       EJECT                                                            78870021
*=1   TXPNCH                                                            78880021
*= ROUTINE TO BUILD TEXT CARDS                                          78890021
*=  AND PUT THEM ON PUNCH FILE                                          78900021
* ENTERED WITH DESIRED LOCATION IN LOCCTR                               78910021
*  LOCATION OF DATA IN REG 1                                            78920021
*  NUMBER OF BYTES IN REG 0                                             78930021
*     IF REG 0 = ZERO  FORCE OUT LAST CARD                              78940021
*                                                                       78950021
         DS    0H                                                       78960021
       USING *,R15                                                      78970021
TXPNCH STM   R0,R15,SVREG                                               78980021
       ST    R0,TXCOUN                                                  78990021
       ST    R1,TXDADR                                                  79000021
       XC    MOVCNT,MOVCNT                                              79010021
       LTR   R0,R0                                                      79020021
       BC    ZERO,FORCE            FORCE OUT LAST CARD                  79030021
       CLC   CURCOL,LASCOL    NEW CARD                                  79040021
       BC    NOTHI,TXCOMP     NO                                        79050021
TXLOCT LA    RW1,LOCARD                                                 79060021
         LA    RW1,DX16(RW1)                                            79070021
       ST    RW1,CURCOL       COLUMN 17                                 79080021
         LA    RW1,DX55(RW1)                                            79090021
       ST    RW1,LASCOL       COLUMN 72                                 79100021
       LA    RW1,LOCARD                                                 79110021
         MVI   CONSTLOC,BLANK      BLANK COLUMN 1                       79120021
         MVC   CONSTLO2(LX79),CONSTLOC  BLANK CARD                      79130021
         MVC   CONSTLOC(LX4),COL1T4  CONSTANT FIRST FOR COLUMNS         79140021
         MVC   TXTESDID(LX2),C61   ESDID OF SD CONTAINING THE TXT       79150021
*  WE MAY ALSO WANT TO PUNCH ID INFO IN COLS 73-80                      79160021
         MVC   TXTLOCRD(LX3),LOCCTR+NX1 LOCCTR(LOW 24 BITS)COL6-8       79170021
       L     RW2,LOCCTR                                                 79180021
       ST    RW2,CURLOC       SET CURLOC = LOCCTR                       79190021
TXROOM L     RW2,CURCOL       PRESENT COLUMN                            79200021
       A     RW2,TXCOUN       ADD COUNT                                 79210021
       L     RW3,LASCOL                                                 79220021
         LA    RW3,DX1(RW3)    LAST COLUMN+1                            79230021
       CLR   RW2,RW3          FIT ON CURRENT CARD                       79240021
       BC    HI,TXGTR         NO                                        79250021
       L     RW2,TXCOUN       YES,SET COUNT                             79260021
       STH   RW2,MOVCNT                                                 79270021
       SR    RW2,RW2                                                    79280021
       ST    RW2,TXCOUN       ZERO COUNT                                79290021
TXFILL LH    RW2,MOVCNT       COUNT FOR NEXT MOVE                       79300021
       BCTR  RW2,R0          DECR FOR MVC INSTR                         79310021
TXLONG LR    RW1,RW2                                                    79320021
       L     RW2,CURCOL       TO ADDR                                   79330021
       L     RW3,TXDADR       FROM ADDR                                 79340021
       EX    RW1,TXMOVE       MOVE TO CARD AREA                         79350021
       AH    RW2,MOVCNT                                                 79360021
       ST    RW2,CURCOL       INCREMENT CURRENT COLUMN                  79370021
       L     RW2,LOCCTR                                                 79380021
       AH    RW2,MOVCNT                                                 79390021
       ST    RW2,LOCCTR       INCREMENT LOCATION COUNTER                79400021
       ST    RW2,CURLOC       AND CURLOC                                79410021
       L     RW2,CURCOL                                                 79420021
       LA    R0,LOCARD                                                  79430021
       SR    RW2,R0            NUMBER OF COLS                           79440021
       SH    RW2,TXH16        OF TEXT = CURCOL                          79450021
       STH   RW2,COLUMS       - LOCARD -16                              79460021
         MVC   TXTNUMB(LX2),COLUMS STORE IN COL 11-12                   79470021
       L     RW2,LASCOL                                                 79480021
         LA    RW2,DX1(RW2)                                             79490021
       CL    RW2,CURCOL       FULL CARD                                 79500021
       BC    NOTEQ,TXEXIT     NO                                        79510021
TXCLPN DS    0H                                                         79520021
*  GENERATE CARD NUMBER                                                 79530021
         AP    CRDNUM(LX3),DECONE(LX1) UP CARD NUMBER                   79540021
         UNPK  TXTCRDNO(LX4),CRDNUM(LX3)                                79550021
         OI    TXTZONE,MF0         CHANGE ZONE                          79560021
         MVC   TXTPRGID(LX4),PROGID                                     79570021
*                                                                       79580021
TXT010 LR    R1,RB2                      CALL PUTN TO FILL              79590021
*                                         PUNCH BUFFER                  79600021
       LA    R2,LOCARD                                                  79610021
         LA    R3,EIGHTY                                                79620021
       BALR  R0,R1                 BR TO PH0                            79630021
       DC      X'17'               PUNCH ON SYSPUNCH                    79640021
TXT020 DS    0H                                                         79650021
       XC    COLUMS,COLUMS         VF SIZE NOW = 0                      79660021
TXGET  DS    0H                                                         79670021
       SR    RW2,RW2                                                    79680021
       CL    RW2,TXCOUN       MORE DATA                                 79690021
       BC    ZERO,TXEXIT      NO                                        79700021
       L     RW2,TXDADR                                                 79710021
       AH    RW2,MOVCNT       INCREMENT                                 79720021
       ST    RW2,TXDADR       INPUT ADDRESS                             79730021
       BC    UNCOND,TXLOCT    YES, GET NEW CARD AREA                    79740021
TXGTR  L     RW2,LASCOL                                                 79750021
       S     RW2,CURCOL       MOVE COUNT = LASCOL                       79760021
         LA    RW2,DX1(RW2)    - CURCOL +1                              79770021
       STH   RW2,MOVCNT                                                 79780021
       L     RW2,TXCOUN                                                 79790021
       SH    RW2,MOVCNT       SUBTRACT MOVCNT                           79800021
       ST    RW2,TXCOUN       FROM TXCOUN                               79810021
       BC    UNCOND,TXFILL    GO TO MOVE                                79820021
TXCOMP L     RW2,LOCCTR                                                 79830021
       CL    RW2,CURLOC       CAN OLD CARD BE USED                      79840021
       BC    EQ,TXROOM        YES                                       79850021
       BC    UNCOND,TXCLPN    NO, PUNCH OLD                             79860021
FORCE  XC    TXCOUN,TXCOUN                                              79870021
       XC    LASCOL,LASCOL                                              79880021
       XC    CURCOL,CURCOL                                              79890021
         OI    CURCOL+NX3,XX01                                          79900021
         CLI   COLUMS+NX1,XX00      IF VF SIZE = 0, DO NOT FORCE CAR    79910021
       BC    NOTEQ,TXCLPN          GO GENERATE CARD NUMBER              79920021
TXEXIT LM    R0,R15,SVREG                                               79930021
         BCR   UNCOND,RS1          RETURN                               79940021
*                                                                       79950021
* CONSTANTS AND STORAGE                                                 79960021
*                                                                       79970021
MOVCNT DS    H                TEMPORARY STORAGE                         79980021
COLUMS DS    H                     COLUMNS                              79990021
TXCOUN DS    F                                                          80000021
TXDADR DS    F                     ADDR TXT                             80010021
LOCARD   DS    0CL80               COLUMS                               80020021
CONSTLOC DS    C                    1     CONSTANT                      80030021
CONSTLO2 DS    3C                   2-4                                 80040021
         DS    C                    5                                   80050021
TXTLOCRD DS    3C                   6-8   ADDR                          80060021
         DS    2C                   9-10                                80070021
TXTNUMB  DS    2C                  11-12  NUM BYTES TEXT                80080021
         DS    2C                  13-14                                80090021
TXTESDID DS    2C                  15-16  ESDID                         80100021
         DS    56C                 17-72                                80110021
TXTPRGID DS    4C                  73-76  PROGRAM NAME                  80120021
TXTCRDNO DS    3C                  77-79  CARD NUMBER                   80130021
TXTZONE   DS    C                  80     ZONE                          80140021
CURLOC DS    F                                                          80150021
CURCOL DC    F'1'             SET TO INSURE INITIAL CALL STARTS         80160021
LASCOL DC    F'0'             A NEW CARD. INITIALIZED AT START OF P     80170021
TXH16  DC    H'16'                                                      80180021
COL1T4 DC    X'02E3E7E3'      CONSTANT IN CARD COLS 1-4                 80190021
TXMOVE   MVC   DX0(LX1,RW2),DX0(RW3)                                    80200021
       DROP  R15                                                        80210021
       EJECT                                                            80220021
IKF608   CSECT                                                          80230021
*=1    PUNCH ESD CARD                                                   80240021
*            (0)-TYPE                                                   80250021
*            (1)-ADDR NAME                                              80260021
*                                                                       80270021
*      LAYOUT OF ESD CARD                                               80280021
*                                                                       80290021
*      COL          CONTENT                                             80300021
*      1            12-9-2  PUNCH  (X'02')                              80310021
*      2-4          ESD                                                 80320021
*      5-10         BLANK                                               80330021
*      11-12        NO BYTES INFO                                       80340021
*      13-14        BLANK                                               80350021
*      15-16        ESDID OF FIRST SD,LR,ER ON CARD OR BLANK            80360021
*      17-72        VARIABLE FIELD                                      80370021
*      73-80        NOT USED                                            80380021
*                                                                       80390021
*      VARIABLE FIELD  (INTEGRAL NO/CARD)                               80400021
*                                                                       80410021
*      NAME FIELD        8 OR FEWER CHARS                               80420021
*            TYPE        SD   0                                         80430021
*                        LD   1                                         80440021
*                        ER   2                                         80450021
*                        PC   4                                         80460021
*      ORIGIN            24-BIT REL ADDR IF SD, LD OR PC                80470021
*                        ZERO IF ER                                     80480021
*      BLANK             1 COL                                          80490021
*      LENGTH/ID         LENGTH IF SD OR PC EXCEPT IF ON                80500021
*                         END CARD - THEN ZERO                          80510021
*                        ID OF SD CONTAINING THIS LD                    80520021
*                        BLANK IF ER                                    80530021
*                                                                       80540021
*      THIS ROUTINE WILL BE MODIFIED TO PACK LD AND ER ENTRIES          80550021
*      BUT NOW ONLY THE SD ENTRY WILL BE PROCESSED FOR BPS              80560021
*                                                                       80570021
*                                                                       80580021
         DS    0H                                                       80590021
       USING *,R15                                                      80600021
ESDCRD STM   R0,R15,SVREG                                               80610021
*                                                                       80620021
         MVI   PUNFLD,BLANK                                             80630021
         MVC   PUNESD(LX79),PUNFLD                                      80640021
*                                                                       80650021
         TM    SEGSW,SEGNSRT       INSERT CARD TO BE PUNCHED            80660021
         BC    ONES,ESD80          YES, BRANCH                          80670021
         TM    SEGSW,SEGOVLY       IS OVERLAY CARD TO BE PUNCHED        80680021
         BC    ONES,ESD90          YES, BRANCH                          80690021
         TM    SEGSW,SEGENTRY      IS ENTRY CARD TO BE PUNCHED          80700021
         BC    ONES,ESD100         YES, BRANCH                          80710021
       MVC   PUNFLD(L'C6ESD),C6ESD DEFINE ESD CARD                      80720021
       CH    R0,C61                                                     80730021
       BC    NOTEQ,ESD010          NOT ADDR NAME, GO TEST TYPE          80740021
         MVC   PUNORIGN(LX3),LOCCTR+NX1 LOCATION COUNTER                80750021
         MVC   PUNLENID(LX3),ESD020     ID OF SD CONTAINING TEXT        80760021
ESD030   MVC   PUNNAME(LX8),DX0(R1)          NAME                       80770021
         STC   R0,PUNTYPE          TYPE                                 80780021
         MVC   PUNNUMB(LX2),C610        NO BYTES DATA (16) ON CRD       80790021
*  GENERATE CARD NUMBER                                                 80800021
         AP    CRDNUM(LX3),DECONE(LX1) UP CARD NUMBER                   80810021
         UNPK  PUNCRDNO(LX4),CRDNUM(LX3)                                80820021
         OI    PUNZONE,MF0         CHANGE ZONE                          80830021
         MVC   PUNPRGID(LX4),PROGID                                     80840021
*                                                                       80850021
ESD69  EQU   *                                                          80860021
       LR    R1,RB2                                                     80870021
       LA    R2,PUNFLD                                                  80880021
         LA    R3,EIGHTY                                                80890021
       BALR  R0,R1                 BR TO PH0                            80900021
       DC    X'17'                 SYSPUNCH                             80910021
*                                                                       80920021
ESD070 DS    0H                                                         80930021
       LM    R0,R15,SVREG                                               80940021
         BCR   UNCOND,RS1          RETURN                               80950021
*                                                                       80960021
*                                                                       80970021
*                                                                       80980021
*                                                                       80990021
ESD010   MVC   PUNESDID(LX2),ESDID                                      81000021
         MVC   PUNORIGN(LX3),ESD040     ZEROS TO LOCCTR FIELD           81010021
         LA    RW1,ESDTYP4                                              81020021
       LTR   R0,R0                                                      81030021
       BC    ZERO,ESD015           SD TYPE                              81040021
       CLR   RW1,R0                                                     81050021
       BC    NOTEQ,ESD030          LD OR ER                             81060021
ESD015 DS    0H                    SD OR PC                             81070021
       BC    NOTZER,ESD030         PC TYPE                              81080021
*                                                                       81090021
*                                                                       81100021
         MVC   PUNLENID(LX3),ESD040                                     81110021
         BC    UNCOND,ESD030       PUNCH SD TYPE ESD CARD               81120021
*                                                                       81130021
         MVC   PUNLENID(LX3),ESD045     LENGTH OF SD                    81140021
         MVC   PUNORIGN(LX3),DUMMYS+NX1 LOCCTR FIELD                    81150021
*                                  HERE-WILL BE ON END CARD             81160021
*                                                                       81170021
       BC    UNCOND,ESD030         THIS AND PREVIOUS 2 INST UNUSED      81180021
ESD80    MVC   PUNESD(LX6),INSCON       DEFINE INSERT CARD              81190021
         MVC   PUNCSECT(LX8),PROGID     GET CSECT NAME                  81200021
         NI    SEGSW,SEGNONST      RESET INSERT CARD BIT                81210021
       B     ESD69                 GO CHECK IF SHOULD PUNCH             81220021
ESD90    MVC   PUNESD(LX9),OVERLY       DEFINE OVERLAY CARD             81230021
         NI    SEGSW,SEGNOVLY      RESET OVERLAY CARD BIT               81240021
       B     ESD69                 GO CHECK IF SHOULD PUNCH             81250021
ESD100   MVC   PUNESD(LX5),ENTCON       DEFINE ENTRY CARD               81260021
         MVC   PUNPRGNM(LX8),DCPRID     GET PROGRAM NAME                81270021
       B     ESD69                 PUNCH ENTRY CARD                     81280021
C6ESD  DC    X'02C5E2C4'           12-9-2 PUNCH FOLLOWED BY ESD         81290021
INSCON DC    C'INSERT'                                                  81300021
ENTCON DC    C'ENTRY'                                                   81310021
OVERLY DC    C'OVERLAY A'                                               81320021
ESD020 DC    X'000001'                                                  81330021
ESD040 DC    XL3'0'                                                     81340021
ESD045 DC    X'00FFFF'                  ***** ZERO OR MAX PROG LENG     81350021
PUNFLD   DS    0CL80               COLUMNS                              81360021
PUN0TWO  DS    C                    1        ZERO-TWO PUNCH             81370021
PUNESD   DS    3C                   2-4      'ESD'                      81380021
         DS    3C                   5-7                                 81390021
PUNPRGNM DS    C                    8        PROGRAM NAME               81400021
PUNCSECT DS    2C                   9-10     CSECT NAME                 81410021
PUNNUMB  DS    2C                  11-12     NUMBER OF BYTES DATA       81420021
         DS    2C                  13-14                                81430021
PUNESDID DS    2C                  15-16     ESDID                      81440021
PUNNAME  DS    8C                  17-24     PROGRAM NAME               81450021
PUNTYPE  DS    C                   25        TYPE ESD                   81460021
PUNORIGN DS    3C                  26-28     LOCCTR (24BITS)            81470021
         DS    C                   29                                   81480021
PUNLENID DS    43C                 30-72     LENGTH OR ID               81490021
PUNPRGID DS    4C                  73-76     PROGID                     81500021
PUNCRDNO DS    3C                  77-79     CARD NUMBER                81510021
PUNZONE  DS    C                   80        ZONE PUNCH                 81520021
       DROP  R15                                                        81530021
       EJECT                                                            81540021
*=1   RLDCRD                                                            81550021
*=          ROUTINE TO PUNCH AN RLD CARD                                81560021
* CALLED WITH LOCATION OF ADCON IN R1,                                  81570021
*            FLAG BYTE IN R0       BITS 0-2  ZEROES                     81580021
*                                  BIT 3    0 NON-BRANCH TYPE           81590021
*                                           1 BRANCH TYPE               81600021
*                                  BITS 4-5   LENGTH OF ADCON MINUS     81610021
*                                  BIT 6    0 POSITIVE REFERENCE        81620021
*                                           1 COMPLEMENTED REFERENC     81630021
*                                  BIT 7     ZERO                       81640021
*            IF R0 IS ALL ZEROES, FORCE OUT CARD                        81650021
*                                                                       81660021
         DS    0H                                                       81670021
       USING *,R15                                                      81680021
RLDCRD STM   R0,R15,SRLD                                                81690021
       LTR   R0,R0              FORCE OUT LAST CARD                     81700021
       IC    RW2,RLDIF        NOP OR                                    81710021
       LA    RS1,RLDFRC                                                 81720021
       EX    RW2,RLDBC1       BC ZERO,RLDFRC                            81730021
       BC    ZERO,RLDXIT BRANCH IF NEVER ANY RLDS CREATED               81740021
         OI    RLDIF,RLDIS         SET TO PUNCH LAST CARD IF ANY        81750021
       LA    RW1,RLDLOC                                                 81760021
       IC    RW2,RLDONE       NOP OR                                    81770021
       LA    RS1,RLDLN1                                                 81780021
       EX    RW2,RLDBC2       BC UNCOND,RLDLN1                          81790021
         OI    RLDONE,RLDNOFST     SET NOT FIRST TIME                   81800021
RLDNEW   XC    RLDVFC(LX2),RLDVFC   ZERO VF COUNT                       81810021
       LA    RW1,RLDLOC            LOC OF CARD AREA                     81820021
         MVC   DX0(LX5,RW1),COL1T5   CONSTANT COLS 1-5                  81830021
         MVC   DX5(LX75,RW1),DX4(RW1) BLANK REST OF CARD                81840021
* ID IN COLS 73-80 WILL BE                                              81850021
* INSERTED HERE IF EVER NEEDED.                                         81860021
       BC    UNCOND,RLDSET         BEGIN VF                             81870021
RLDLN1   CLI   RLDVFC+NX1,XX34                                          81880021
       BC    NOTHI,RLDLN2          YES                                  81890021
*                                  NO, PUNCH CARD                       81900021
RLDPUN STM   R0,R1,RLDREG            SAVE PARAMETERS                    81910021
       SR    R0,R0                                                      81920021
       L     R15,ATXPNH             FORCE OUT TEXT CARD                 81930021
       BALR  RS1,R15               GO TO PUNCH RTN                      81940021
       L     R15,ARLD                                                   81950021
*  GENERATE CARD NUMBER                                                 81960021
         AP    CRDNUM(LX3),DECONE(LX1) UP CARD NUMBER                   81970021
         UNPK  RLDLOC+NX76(LX4),CRDNUM(LX3)                             81980021
         OI    RLDLOC+NX79,MF0     CHANGE ZONE                          81990021
         MVC   RLDLOC+NX72(LX4),PROGID                                  82000021
       LR    R1,RB2                                                     82010021
       LA    R2,RLDLOC                                                  82020021
         LA    R3,EIGHTY                                                82030021
       BALR  R0,R1                 BR TO PH0                            82040021
       DC      X'17'        BUFFER TO FILL PUNCH BUFFER                 82050021
RLD110 DS    0H                                                         82060021
       LM    R0,R1,RLDREG            RESTORE REGISTERS                  82070021
       IC    RW2,RLDFSW       NOP OR                                    82080021
       LA    RS1,RLDXIT                                                 82090021
       EX    RW2,RLDBC3       BC UNCOND,RLDXIT                          82100021
       BC    UNCOND,RLDNEW         SET UP NEW CARD                      82110021
RLDLN2   CLI   RLDVFC+NX1,XX30                                          82120021
       BC    NOTHI,RLDESD          YES                                  82130021
         CLC   ESDID(LX2),CURESD    NO, DO WE NEED 8 COLS               82140021
       BC    NOTEQ,RLDPUN          YES, PUNCH OLD CARD                  82150021
*                                  NO, CONTINUE OLD CARD                82160021
RLDCTN LH    RW2,RLDVF2                                                 82170021
       AR    RW2,RW1               PUT CONTINUE BIT IN                  82180021
         OI    DX16(RW2),XX01                                           82190021
       AH    RW1,RLDVFC            NEXT FLAG BYTE                       82200021
       BC    UNCOND,RLDFLG         SKIP ESD NUMBERS                     82210021
RLDESD   CLC   ESDID(LX2),CURESD    NEED NEW ESD NUMBERS                82220021
       BC    EQ,RLDCTN             NO                                   82230021
RLDSET AH    RW1,RLDVFC                                                 82240021
         MVC   DX16(LX2,RW1),ESDID   ESD REF NUM TO CARD                82250021
         MVC   DX18(LX2,RW1),ESDONE  CURRENT ESD (1) TO CARD            82260021
         MVC   CURESD(LX2),ESDID    NEW ESDID ON RLD CARD               82270021
       LH    RW2,RLDVFC                                                 82280021
         LA    RW2,DX4(RW2)         UP VF COUNT                         82290021
       STH   RW2,RLDVFC                                                 82300021
         LA    RW1,DX4(RW1)         UP COLUMN POINTER                   82310021
RLDFLG DS    0H                                                         82320021
RLDFL2 DS    0H                                                         82330021
RLDPLS ST    R1,RLDADD              TEXT ADDRESS                        82340021
       STC   R0,RLDADD              FLAG BYTE                           82350021
         MVC   DX16(LX4,RW1),RLDADD  MOVE TO CARD AREA                  82360021
       LH    RW2,RLDVFC                                                 82370021
       STH   RW2,RLDVF2            SAVE FOR CONTINUATION                82380021
         LA    RW2,DX4(RW2)         UP VF COUNT                         82390021
       STH   RW2,RLDVFC                                                 82400021
       LA    RW1,RLDLOC            CARD LOCATION                        82410021
         MVC   DX10(LX2,RW1),RLDVFC  MOVE NEW COUNT TO CARD             82420021
RLDXIT DS    0H                                                         82430021
       LM    R0,R15,SRLD                                                82440021
       BCR   UNCOND,RS1            RETURN                               82450021
RLDFRC   OI    RLDFSW,RLDFORCE     SET FORCED BIT                       82460021
       BC    UNCOND,RLDPUN         GO FORCE OUT LAST CARD               82470021
*                                                                       82480021
* CONSTANTS AND STORAGE                                                 82490021
*                                                                       82500021
ESDONE DC    H'1'                                                       82510021
HWTWO  DC    H'2'                                                       82520021
COL1T5 DC    X'02D9D3C440'         CONSTANT FOR CARD COLS 1-5           82530021
*                                                                       82540021
RLDVFC DS    H           CURRENT VARIABLE FIELD SIZE                    82550021
RLDVF2 DS    H           VF SIZE AT POINT OF PREVIOUS FLAG BYTE         82560021
RLDLOC DS    80C         CARD AREA                                      82570021
RLDADD DS    F           TEMP STORAGE FOR FLAGS AND ADDRESS             82580021
RLDREG DS    2F               TEMP STORAGE FOR PARAMETER REGISTERS      82590021
U13    DS    F                                                          82600021
SRLD   DS    16F                                                        82610021
       DROP  R15                                                        82620021
       EJECT                                                            82630021
*=1          MAPLOC                                                     82640021
*      THIS ROUTINE MAKES UP AND PRINTS                                 82650021
*       ONE LINE OF THE MEMORY MAP.                                     82660021
*      ON ENTRY                                                         82670021
*            RW1 HAS DISPLACEMENT                                       82680021
*            GTLOC HAS GLOBAL TABLE LOCATION                            82690021
*            MAPTXT HAS TEXT LOCATION                                   82700021
*                                                                       82710021
*     MAPTXT WILL BE INCREMENTED TO POINT TO NEXT TEXT LOC.             82720021
*                                                                       82730021
       USING MAPLOC,R15                                                 82740021
MAPLOC DS    0H                                                         82750021
       TM    PHZSW,NOLIST          EXIT IF NOLIST MODE                  82760021
       BCR   ZERO,RS1              RETURN IF NOLIST                     82770021
       STM   R0,R15,VMAPL                                               82780021
       SR    RW2,RW2                                                    82790021
       L     RW3,MAPTXT                                                 82800021
         IC    RW2,DX0(RW3)    LENGTH FOR MVC                           82810021
       EX    RW2,MOVTXT       MOVE TEXT                                 82820021
       AR    RW3,RW2                                                    82830021
         LA    RW3,DX2(RW3)                                             82840021
       ST    RW3,MAPTXT                                                 82850021
       A     RW1,GTLOC                                                  82860021
       ST    RW1,C6WRK0       LOCATION                                  82870021
       L     R15,AS6010                                                 82880021
       BALR  RS1,R15            CONVERT FOR LIST                        82890021
       L     R15,AMAPLC                                                 82900021
         MVC   OU6REC+NX44(LX5),C6WRK4                                  82910021
       L     R15,APUT                                                   82920021
       BALR  RS1,R15            LIST                                    82930021
       L     R15,AMAPLC                                                 82940021
       LM    R0,R15,VMAPL                                               82950021
         BCR   UNCOND,RS1          RETURN                               82960021
MOVTXT   MVC   OU6REC+NX15(LX1),DX1(RW3)                                82970021
VMAPL  DS    16F                                                        82980021
       DROP  R15                                                        82990021
       EJECT                                                            83000021
*                                                                       83010021
*                                                                       83020021
*      GENLD  GENERATE LOAD TO REG SPECIFIED IN C6RS                    83030021
*             BASE LOCATOR TO BE LOADED SPECIFIED  BY I ELT IN GOTC     83040021
*                                                      K ELT IN RW1     83050021
*                                                      IN FORM 0I       83060021
*                                                                       83070021
*                                                                       83080021
*                                                                       83090021
*                                                                       83100021
       DS    0H                                                         83110021
       USING *,R15                                                      83120021
GENLD  DS    0H                                                         83130021
       STM   R0,R15,GLD010                                              83140021
       BCTR  RW1,R0                SUBTRACT 1                           83150021
         SLL   RW1,DX2         LENGTH OF BL                             83160021
*      DETERMINE TYPE OF BL, GOTCOD CONTAINS I ADDRESSING ELT           83170021
*      DETERMINE BASE AND DISP FROM SAME CRITERIA AS BLELT              83180021
         MVI   C6B1S,XX0D      R13 TO B1 HEX SAVE                       83190021
         CLI   GOTCOD,XX00                                              83200021
       BC    EQ,GLD020        BL-I                                      83210021
         CLI   GOTCOD,XX01                                              83220021
       BC    EQ,GLD040        BLL                                       83230021
         CLI   GOTCOD,XX04                                              83240021
       BC    EQ,GLD060        SBL-I                                     83250021
         CLI   GOTCOD,XX06                                              83260021
       BC    EQ,GLD080        SBS                                       83270021
       BC    UNCOND,ERR250         ERROR- BAD INPUT                     83280021
GLD020 DS    0H                                                         83290021
       LA    RW2,XBLIC-XSYMC                                            83300021
       AH    RW1,BLCTR                                                  83310021
       BC    UNCOND,GLD090         GO CREATE SYMBOLIC OPERANDS          83320021
GLD040 DS    0H                                                         83330021
       LA    RW2,XBLLC-XSYMC                                            83340021
       AH    RW1,BLLCTR                                                 83350021
       BC    UNCOND,GLD090         GO CREATE SYMBOLIC OPERANDS          83360021
GLD060 DS    0H                                                         83370021
       LA    RW2,XSBLC-XSYMC                                            83380021
       AH    RW1,SBLCTR                                                 83390021
       BC    UNCOND,GLD090         GO CREATE SYMBOLIC OPERANDS          83400021
GLD080 DS    0H                                                         83410021
       LA    RW2,XSBSC-XSYMC                                            83420021
       AH    RW1,SBSCTR                                                 83430021
GLD090 DS    0H                                                         83440021
*=L    CREATE SYMBOLIC OPERANDS                                         83450021
       A     RW2,AXSYMC                                                 83460021
       MVC   SB1D1N(4),GLD010+RW1*4                                     83470021
         MVC   SB1D1C(LX4),DX0(RW2)                                     83480021
GLD094 DS    0H                                                         83490021
*=L                                                                     83500021
       STH   RW1,C6D1S                                                  83510021
       CH    RW1,H4096                                                  83520021
       BC    LO,GLD096             NO OVERFLOW CELL                     83530021
       OI    GTOVFL,TSGTR                                               83540021
         MVC   C6INS2(LX10),C6INSV  SAVE SAVE AREAS                     83550021
         MVC   SBDSV2(LX24),SBDSAV                                      83560021
         NI    BDNUM,BDNUM1        PROCESSING B1, D1                    83570021
       L     R15,AGLDOV            GENERATE LOAD OF OVERFLOW CELL       83580021
       BALR  RS1,R15               GO GEN LOAD                          83590021
       L     R15,AGENLD                                                 83600021
         MVC   C6INSV(LX10),C6INS2  RESTORE SAVE AREAS                  83610021
         MVC   SBDSAV(LX24),SBDSV2                                      83620021
GLD096 EQU   *                                                          83630021
       L     R15,AS6800                                                 83640021
       USING S6800,R15                                                  83650021
       BALR  RS1,R15               FORMAT & PRINT LINE                  83660021
       L     R15,AGENLD                                                 83670021
       USING GENLD,R15                                                  83680021
       LM    R0,R15,GLD010                                              83690021
         BCR   UNCOND,RS1          RETURN                               83700021
GLD010 DS    16F                                                        83710021
       DROP  R15                                                        83720021
       EJECT                                                            83730021
*=1    GLDOV           GENERATE LOAD OF GLOBAL TABLE OVERFLOW CELL      83740021
       USING GLDOV,R15                                                  83750021
GLDOV  DS    0H                                                         83760021
       STM   R0,R15,SGLDOV                                              83770021
         MVC   C6INSV(LX10),C6OP    SAVE INSTRUCTION                    83780021
         MVC   SBDSAV(LX24),SB1D1C   AND SYMBOLICS                      83790021
         MVC   SB1D1C(LX24),SBDINI  INITIALIZE SYMBOLICS                83800021
         MVI   C6OP,XX58            OP = L                              83810021
       LH    RW1,C6D1S                                                  83820021
         TM    BDNUM,BDNUM2        ARE WE DOING B2 D2                   83830021
       BC    ZERO,R6605            USING B1 D1                          83840021
       LH    RW1,C6D2S                                                  83850021
         MVC   C6B1S(LX1),C6B2S                                         83860021
R6605  SR    RW2,RW2                                                    83870021
         N     RW1,HWFS                MASK OUT HI ORDER 16 BITS  53557 83880021
       LH    R1,H4096          PGT TYPE                                 83890021
       TM    GTOVFL,PGTR                                                83900021
       BC    NOTZER,R6610          PGT REFERENCE                        83910021
         LA    R1,DX256(R1)      TGT/SGT TYPE                           83920021
       LH    RW2,MAXOV                                                  83930021
R6610  SH    RW1,H4096                                                  83940021
         LA    R1,DX1(R1)                                               83950021
       CH    RW1,H4096                                                  83960021
       BC    LO,R6615              NO OVERFLOW CELL                     83970021
         LA    RW2,DX4(RW2)                                             83980021
         BC    UNCOND,R6610        LOOP TO GET LESS THAN 4096           83990021
R6615  STH   RW2,C6D1S             DISP OF OVERFLOW CELL                84000021
       STH   R1,BLELT          FOR 'SRCHR' SUBROUTINE                   84010021
       L     R15,ASRCHR                                                 84020021
       BALR  RS1,R15                 GET REHISTER                       84030021
       L     R15,AGLDOV                                                 84040021
         CLI   LOADSW,INITOFF      DON'T NEED TO GEN LOAD               84050021
       BC    EQ,R6645         ALREADY LOADED                            84060021
         NI    LOADSW,INITOFF      DO NOT GEN LOAD                      84070021
       STC   RW3,C6RS                                                   84080021
*  CREATE SYMBOLIC OPERANDS                                             84090021
*  END SYMBOLICS                                                        84100021
       L     R15,AS6800                                                 84110021
       BALR  RS1,R15                 GENERATE INSTRUCTION               84120021
       L     R15,AGLDOV                                                 84130021
* RESTORE OLD INSTRUCTION WITH NEW BASE + DISPLACEMENT                  84140021
R6645    MVC   C6OP(LX10),C6INSV                                        84150021
         MVC   C6OP(LX10),C6INSV                                        84160021
         MVC   SB1D1C(LX24),SBDSAV                                      84170021
         TM    BDNUM,BDNUM2        ARE WE DOING B2 D2                   84180021
       BC    ONES,R6655            USING B2 D2                          84190021
       STH   RW1,C6D1S                                                  84200021
         SRL   RW3,DX4                                                  84210021
       STC   RW3,C6B1S                                                  84220021
         BC    UNCOND,R6660        SKIP B2,D2 CODE                      84230021
R6655  STH   RW1,C6D2S                                                  84240021
         SRL   RW3,DX4                                                  84250021
       STC   RW3,C6B2S                                                  84260021
R6660  LM    R0,R15,SGLDOV                                              84270021
         BCR   UNCOND,RS1          RETURN                               84280021
*                                                                       84290021
SGLDOV DS    16F                                                        84300021
       DROP  R15                                                        84310021
       EJECT                                                            84320021
*                                                                       84330021
*      SRCHR  SEARCH FOR A REGISTER ALREADY LOADED WITH A DESIRED       84340021
*             BASE LOCATOR (I,K THEREOF IN BLELT, BLELT+1)              84350021
*             OTHERWISE FIND AN AVAILABLE ONE                           84360021
*    I = X'10' FOR PGT OVERFLOW CELL                                    84370021
*    I = X'11' FOR TGT/SGT OVERFLOW CELL                                84380021
*             EXIT WITH LOW BYTE OF RW3 =  R0                           84390021
*             OR = ZERO IF ONLY SEARCH SPECIFIED AND NONE FOUND         84400021
*                                                                 01041 84410021
*         LOADSW = FF      NEED TO GENERATE LOAD OF REG           01041 84420021
*               = 00      NO SUCH NEED                            01041 84430021
*         NOLOAD = 00  NORMAL ENTRY - FIND MATCH OR AVAILABLE REGISTER  84440021
*              = FF     ENTER TO SEARCH ONLY FOR MATCH            01041 84450021
*                                                                 01041 84460021
       DS    0H                                                         84470021
       USING *,R15                                                      84480021
SRCHR  DS    0H                                                         84490021
       STM   RW3,RW3M1,SRC010                                           84500021
       L     RW3,FAVAIL                                                 84510021
SRC040   CLC   DX2(LX2,RW3),BLELT                                       84520021
       BC    EQ,SRC020             SET TO DESIRED ONE                   84530021
         TM    DX0(RW3),LAVAIL                                          84540021
       BC    ONES,SRC030           NO PERMANENT SET                     84550021
         LA    RW3,DX4(RW3)         TRY ANOTHER                         84560021
       BC    UNCOND,SRC040         LOOP TO CHECK                        84570021
SRC020 S     RW3,FAVAIL                                                 84580021
         SRL   RW3,DX2                                                  84590021
         LA    RW3,DX6(RW3)         GET REG NUM                         84600021
SRCXIT   SLL   RW3,DX4              POSITION TO PROPER HEX DIGIT        84610021
         NI    NOLOAD,INITOFF      NOT ONLY SEARCH                      84620021
         LM    RW3P1,RW3M1,SRC010+NX4                                   84630021
         BCR   UNCOND,RS1          RETURN                               84640021
SRC030   CLC   CELL14(LX2),BLELT    SEE IF A NON-PERM REG SET UP        84650021
       BC    EQ,SRC050             YES-USE IT                           84660021
         CLC   CELL15(LX2),BLELT                                        84670021
       BC    EQ,SRC065             YES-USE IT                           84680021
*      IF ENTERED ON SEARCH ONLY, DO NOT SET LOAD SWITCH,               84690021
*      EXIT IF NOT FOUND                                                84700021
         CLI   NOLOAD,INITOFF      SEARCH ONLY                          84710021
       BC    EQ,SRC090             NOT JUST SEARCH                      84720021
         NI    NOLOAD,INITOFF           SEARCH ONLY               01041 84730021
         NI    LOADSW,INITOFF      DON'T NEED TO GEN LOAD INSTR         84740021
       SR    RW3,RW3                                                    84750021
       BC    UNCOND,SRCXIT         GO TO RETURN                         84760021
SRC090 DS    0H                                                         84770021
       TM    STAT14,AVL56     NO-IS ONE AVAILABLE                       84780021
         BZ    SRC070         YES-USE 14-IT NEEDS TO BE LOADED    01041 84790021
SRC092 DS    0H                                                         84800021
SRC094 DS    0H                                                         84810021
       NI    STAT15,PGTOFF                                              84820021
         OI    STAT15,AVAIL6  USE 15 BUT IT NEEDS TO BE LOADED    01041 84830021
         OI    LOADSW,GENLOAD      NEED TO GENERATE LOAD INSTR          84840021
SRC060   DS    0H                                                 01041 84850021
         CLI   BLELT,XX06                                         01041 84860021
         BNE   SRC061                  NOT SBS                    01041 84870021
         XC    CELL15(LX2),CELL15      CLEAR CELL15               01041 84880021
         B     SRC065                                             01041 84890021
SRC061   DS    0H                                                 01041 84900021
         MVC   CELL15(LX2),BLELT        SET UP TO USE 15          01041 84910021
SRC065   DS    0H                                                 01041 84920021
         LA    RW3,DX15                                           01041 84930021
         OI    STAT15,AVAIL6                                      01041 84940021
         B     SRCXIT                   GO TO EXIT                01041 84950021
SRC070 DS    0H                                                         84960021
       TM    STAT14,PGTOVF                                              84970021
       BC    ONES,SRC100           YES, PGT OVFL                        84980021
SRC072 DS    0H                                                         84990021
       NI    STAT14,PGTOFF                                              85000021
       OI    STAT14,AVAIL6                                              85010021
*        CHECK FOR SUBSCRIPT CELL                                 01041 85020021
         CLI   BLELT,XX06                                         01041 85030021
         BNE   SRC075                   NOT SBS                   01041 85040021
         XC    CELL14(LX2),CELL14      CLEAR CELL14               01041 85050021
         B     SRC080                  GO TO TURN ON LOADSW       01041 85060021
SRC075   DS    0H                                                 01041 85070021
         MVC   CELL14(LX2),BLELT                                        85080021
SRC080   DS    0H                                                 01041 85090021
         OI    LOADSW,GENLOAD      NEED TO GENERATE LOAD INSTR          85100021
SRC050 DS    0H                                                         85110021
         LA    RW3,REG14                                                85120021
       OI    STAT14,AVAIL6                                              85130021
       BC    UNCOND,SRCXIT         GO TO RETURN                         85140021
*DEL                                                                    85150021
*DEL                                                                    85160021
*DEL                                                                    85170021
*DEL                                                                    85180021
*DEL                                                                    85190021
SRC100 DS    0H                                                         85200021
       TM    STAT15,AVL56                                               85210021
       BC    ONES,SRC072           YES AVAILABLE                        85220021
       TM    STAT15,PGTOVF                                              85230021
       BC    ONES,SRC072           YES PGT OVERFLOW                     85240021
       BC    UNCOND,SRC094         NO, GO USE IT                        85250021
SRCHG    OI    NOLOAD,SRCHNOLD     ONLY DO SEARCH, DON'T LOAD           85260021
       BC    UNCOND,SRCHR          GO DO SEARCH ONLY                    85270021
SRC010 DS    16F                                                        85280021
       DROP  R15                                                        85290021
       EJECT                                                            85300021
*      INITR  GENERATE LOADS OF ALL PERMANENTLY ASSIGNED REGISTERS      85310021
       USING INITR,R15                                                  85320021
INITR  DS    0H                                                         85330021
       STM   R0,R15,INR010                                              85340021
         TM    NOBLS,NOBLSON       ARE THERE ANY BL'S                   85350021
       BC    ZERO,INRXIT           THERE ARE NO BLS                     85360021
       L     RW3,FAVAIL                                                 85370021
INR020 LR    RW2,RW3                                                    85380021
*      CALCULATE REGISTER TO BE LOADED                                  85390021
       S     RW3,FAVAIL                                                 85400021
         SRL   RW3,DX2                                                  85410021
         LA    RW3,DX6(RW3)                                             85420021
         SLL   RW3,DX4                                                  85430021
       STC   RW3,C6RS                                                   85440021
         MVI   C6OP,XX58                                                85450021
         MVC   GOTCOD(LX1),DX2(RW2) SET UP LOAD RTNE PARAMETERS FROM    85460021
*                                  REG ASSIGNMENT MATRIX                85470021
         CLC   DX2(LX2,RW2),C6F0                                        85480021
       BC    EQ,INR040             YES                                  85490021
       SR    RW1,RW1                                                    85500021
         IC    RW1,DX3(RW2)                                             85510021
       L     R15,AGENLD             GENERATE LOAD                       85520021
       BALR  RS1,R15               GO GEN LOAD                          85530021
       L     R15,AINITR                                                 85540021
INR040 DS    0H                                                         85550021
         TM    DX0(RW2),LASIGN                                          85560021
       BC    ONES,INRXIT           YES, GO RETURN                       85570021
         TM    DX0(RW2),LAVAIL      LAST TO BE DONE                     85580021
       BC    ONES,INRXIT           YES                                  85590021
       LR    RW3,RW2                                                    85600021
         LA    RW3,DX4(RW3)                                             85610021
       BC    UNCOND,INR020         GO CALC REG TO BE LOADED             85620021
INRXIT DS    0H                                                         85630021
       LM    R0,R15,INR010                                              85640021
         BCR   UNCOND,RS1          RETURN                               85650021
INR010 DS    16F                                                        85660021
       DROP  R15                                                        85670021
       EJECT                                                            85680021
*      USING  SET UP REGISTER ASSIGNMENTS FOR SECTION OF                85690021
*             PROGRAM STORED IN RPDNUM                                  85700021
*                                                                       85710021
       USING USING,R15                                                  85720021
USING  STM   R0,R15,USI010                                              85730021
       XC    REGMTX,REGMTX    CLEAR REGISTER ASSIGNMENT MATRIX          85740021
         MVI   NOBLS,NOBLSOFF      THERE ARE NO BL'S                    85750021
       SPACE 2                                                          85760021
*      PRIORITY FOR INLINE CODING                                       85770021
*      BL= FOR WORKING-STORAGE                                          85780021
*      OTHER BL=                                                        85790021
*      BLS=                                                             85800021
*   REGS 6-11 ARE FOR PERMANENT ASSIGNMENT                         STAN 85810021
USI017 OI    STAT11,LAVAIL    SET R11 AS LAST PERM ASSIGN IF NO RPD     85820021
         MVC   NUMAVL(LX2),C6H6                                         85830021
USI018 LA    RW1,STAT06      SET R6 AS FIRST (AND NEXT) REG AVAILPD     85840021
       ST    RW1,FAVAIL                                                 85850021
       ST    RW1,NXTAVL                                                 85860021
       SPACE 2                                                          85870021
       MVI   BLELT,IBLELT          SET UP I,K FOR REG ASSIGNMENT OF     85880021
         MVC   BLELT+NX1(LX1),FRSBLW+NX1 BL= TYPE                       85890021
       LH    RW1,NUMBLW                                                 85900021
       LTR   RW1,RW1                                                    85910021
       BC    ZERO,USI300      NO BL FOR W-S                             85920021
         LA    RW1,DX1             ASSIGN 1 REG TO WS                   85930021
       CH    RW1,NUMAVL                                                 85940021
       BC    NOTLO,USI100          GO ASSIGN LAST REMAINING REG         85950021
       BAL   RS1,ASSIGN       ASSIGN W-S BL'S                           85960021
       SPACE 2                                                          85970021
         LH    RW1,DECBCT                                               85980021
       SH    RW1,BLCTR                                                  85990021
         SRL   RW1,DX2         NUMBER OF BL= INLINE                     86000021
       STH   RW1,NUMBLT                                                 86010021
       BCT   RW1,USI019           ONLY 1 BL IT IS FOR WS                86020021
       BC    UNCOND,USIXIT         GO RETURN                            86030021
USI019 DS    0H                                                         86040021
       SPACE 2                                                          86050021
       LH    RW2,NUMBLW                                                 86060021
         CLI   FRSBLW+NX1,XX01                                          86070021
       BC    EQ,USI020        BL= FOR W-S IS FIRST BL=                  86080021
       SPACE 2                                                          86090021
*      THERE ARE BL='S WHICH PRECEDE BL='S FOR W-S                      86100021
       LH    RW1,FRSBLW                                                 86110021
       BCTR  RW1,R0                SUBTRACT 1                           86120021
       AR    RW2,RW1                                                    86130021
         MVI   BLELT+NX1,XX01                                           86140021
       CH    RW1,NUMAVL                                                 86150021
       BC    NOTLO,USI100          GO ASSIGN LAST AVAIL REG             86160021
       BAL   RS1,ASSIGN       ASSIGN OTHER BL='S PRECEDING THOSE        86170021
*                             FOR W-S                                   86180021
       SPACE 2                                                          86190021
*      SEE IF ANY BL AFTER FIRST BL FOR WS                              86200021
       LH    RW2,FRSBLW                                                 86210021
       CH    RW2,NUMBLT                                                 86220021
       BC    EQ,USIXIT             GO RETURN                            86230021
       SPACE 2                                                          86240021
USI020 DS    0H                                                         86250021
       LH    RW2,FRSBLW                                                 86260021
         LA    RW2,DX1(RW2)                                             86270021
         STC   RW2,BLELT+NX1   K OF FIRST BL= FOLLOWING W-S BL='S       86280021
       BCTR  RW2,R0                SUBTRACT 1                           86290021
       LH    RW1,NUMBLT                                                 86300021
       SR    RW1,RW2                                                    86310021
       BC    ZERO,USIXIT           GO RETURN                            86320021
USI320 DS    0H                                                         86330021
       CH    RW1,NUMAVL                                                 86340021
       BC    NOTLO,USI100          GO ASSIGN LAST AVAIL REG             86350021
       BAL   RS1,ASSIGN       ASSIGN BL='S FOLLOWING THOSE FOR W-S      86360021
         BC    UNCOND,USIXIT       GO SET UP ASSIGNMENT INDICATION      86370021
       SPACE 2                                                          86380021
*      ASSIGN LAST REMAINING REGISTERS                                  86390021
USI100 DS    0H                                                         86400021
       LH    RW1,NUMAVL                                                 86410021
USI120 BAL   RS1,ASSIGN            GO TO ASSIGN RTN                     86420021
USIXIT DS    0H                                                         86430021
       L     RW1,NXTAVL                                                 86440021
         LA    RW2,DX4                                                  86450021
       SR    RW1,RW2                                                    86460021
         OI    DX0(RW1),LASIGN SET UP INDICATION OF LAST ASSIGNED       86470021
       SPACE 2                                                          86480021
USIZIT DS    0H                                                         86490021
       LM    R0,R15,USI010                                              86500021
         BCR   UNCOND,RS1          RETURN                               86510021
USI300 DS    0H                                                         86520021
         MVI   BLELT+NX1,XX01                                           86530021
         LH    RW1,DECBCT                                               86540021
         SH    RW1,BLCTR                                                86550021
         SRL   RW1,DX2                                                  86560021
         STH   RW1,NUMBLT          CALC TOTAL NUM BASE LOCATORS         86570021
       LTR   RW1,RW1                                                    86580021
       BC    ZERO,USIZIT           GO RETURN                            86590021
         BC    UNCOND,USI320       GO COMPARE                           86600021
         EJECT                                                          86610021
*                                                                       86620021
*      ASSIGN SUBROUTINE                                                86630021
*             BAL   RS1,ASSIGN                                          86640021
*             RW1 CONTAINS NUMBER REGS TO BE ASSIGNED                   86650021
*                                                                       86660021
ASSIGN DS    0H                                                         86670021
         MVI   NOBLS,NOBLSON       THERE ARE BL'S                       86680021
       STM   RW1,RW1M1,ASG010                                           86690021
ASG020 ST    RW1,ASG010                                                 86700021
       L     RW1,NXTAVL                                                 86710021
ASG025   LH    RW3,DX2(RW1)    CELL OF NEXT AVAILREG                    86720021
       LTR   RW3,RW3                                                    86730021
       BC    NOTZER,ASG030         THERE IS A REG                       86740021
         TM    DX0(RW1),AVL56                                           86750021
       BC    NOTZER,ASG030         RW1 HAS A REG AVAIL                  86760021
         MVC   DX2(LX2,RW1),BLELT    SET UP I,K OF AVAILABLE REG        86770021
         TM    DX0(RW1),LAVAIL                                          86780021
         LA    RW1,DX4(RW1)                                             86790021
       ST    RW1,NXTAVL                                                 86800021
       BC    ONES,ASG040           LAST REG AVAIL                       86810021
       SPACE 2                                                          86820021
       LH    RW2,NUMAVL                                                 86830021
       BCT   RW2,ASG050            DECR NUM AVAIL REGS                  86840021
ASG040 DS    0H                                                         86850021
ASG045 SR    RW1,RW1                                                    86860021
       STH   RW1,NUMAVL                                                 86870021
       BC    UNCOND,USIXIT         GO EXIT                              86880021
ASG050 STH   RW2,NUMAVL                                                 86890021
       SR    RW2,RW2                                                    86900021
         IC    RW2,BLELT+NX1        K OF BL JUST ASSIGNED               86910021
         LA    RW2,DX1(RW2)                                             86920021
         STC   RW2,BLELT+NX1                                            86930021
       L     RW1,ASG010                                                 86940021
       BCT   RW1,ASG020            BR TO ASG020                         86950021
       LM    RW1,RW1M1,ASG010                                           86960021
         BCR   UNCOND,RS1          RETURN                               86970021
ASG030   TM    DX0(RW1),LAVAIL                                          86980021
         LA    RW1,DX4(RW1)                                             86990021
       LH    RW2,NUMAVL                                                 87000021
       BCTR  RW2,R0                SUBTRACT 1                           87010021
       STH   RW2,NUMAVL                                                 87020021
       BC    NOTONE,ASG025         NUMAVAIL-1 NOT 1                     87030021
       BC    UNCOND,ASG045         OTHERWISE LOOP                       87040021
ASG010   DS    16F                 SAVE AREA                            87050021
USI010 DS    16F                                                        87060021
       DROP  R15                                                        87070021
       EJECT                                                            87080021
*      CODLUP                                                           87090021
*           -GENERATE CODING IN CODATX AS MANY TIMES AS NECESSARY,      87100021
*            ALLOWING A LENGTH FIELD OF 256 BYTES MAX                   87110021
*           -RW3 CONTAINS TOTAL NUMBER OF BYTES TO BE ACTED UPON        87120021
*           -RS1 CONTAINS RETURN ADDR                                   87130021
*           -RW2 POINTS TO A-TEXT                                       87140021
       DS    0H                                                         87150021
       USING *,R15                                                      87160021
CODLUP DS    0H                                                         87170021
       STM   R0,R15,CDL010                                              87180021
       SR    RW2,RW2                                                    87190021
CDL020 STH   RW3,SAVLNG                                                 87200021
       ST    RW2,P6PLUS                                                 87210021
         LA    RW1,DX256                                                87220021
       CR    RW3,RW1                                                    87230021
       BC    NOTHI,CDL040          SAVLNG LT OR EQ 256                  87240021
       LR    RW3,RW1                                                    87250021
CDL040 L     RW2,CDL010+4*RW2                                           87260021
       BCTR  RW3,R0                SUBTRACT 1                           87270021
       STH   RW3,P6LNG                                                  87280021
       BAL   RW1,SU6010            COMMON ASSEM CODING                  87290021
       L     R15,ACODLU                                                 87300021
       LH    RW3,SAVLNG                                                 87310021
         LA    RW2,DX256                                                87320021
       CR    RW3,RW2                                                    87330021
       BC    NOTHI,CDLXIT          GO EXIT                              87340021
       SR    RW3,RW2                                                    87350021
       A     RW2,P6PLUS                                                 87360021
         CLI   VNOVFL,ALLON         IS INIT3 BEING PROCESSED            87370021
         BC    NOTEQ,CDL50         NO, DON'T ALTER VNATX                87380021
         MVC   C6WRK0(LX2),VNATX+NX6 YES,GET VN NO. FROM VNATX       21 87390021
         LA    R0,DX64              64 IS NO. OF VNS IN 256 BYTES   217 87400021
       AH    R0,C6WRK0             BUMP VN NO.                     2179 87410021
       STH   R0,C6WRK0             SAVE                            2179 87420021
         MVC   VNATX+NX6(LX2),C6WRK0                                217 87430021
         MVC   VNATX+NX10(LX2),C6WRK0                               217 87440021
         MVC   INITVN(LX2),C6WRK0    INCREMENT COUNT OF VN'S            87450021
CDL50  EQU   *                                                     2179 87460021
       BC    UNCOND,CDL020         LOOP                                 87470021
CDLXIT LM    R0,R15,CDL010                                              87480021
         BCR   UNCOND,RS1          RETURN                               87490021
CDL010 DS    16F                                                        87500021
       DROP  R15                                                        87510021
       EJECT                                                            87520021
*        ROUTINE TO PRINT STATISTICS FOR THE SYSTEM                     87530021
         DS    0H                                                       87540021
         USING *,R15                                                    87550021
PRSTAT   EQU   *                                                        87560021
         ST    RS1,STATSAV         SAVE RETURN REGISTER                 87570021
         MVI   OU6REC,BLANK        CLEAR PRINT AREA                     87580021
         MVC   OU6CDN(LX119),OU6REC                                     87590021
         MVC   PMSG1,SMSG1         *STATISTICS*                         87600021
         MVC   PMSG2,SMSG2         SOURCE RCDS                          87610021
         MVC   PMSG4,SMSG4         DATA                                 87620021
         MVC   PMSG6,SMSG6         DIV STATE.                           87630021
         MVC   PMSG5,SMSG5         PROC DIV STATE.                      87640021
         MVC   PMSG2N,EDWD1                                             87650021
         ED    PMSG2N,DATE+NX9      NO. SOURCE STATEMENTS               87660021
         MVC   PMSG4N,EDWD1                                             87670021
         ED    PMSG4N,DATE+NX1      NO. DATA DIV. STATEMENTS            87680021
         MVC   PMSG5N,EDWD1                                             87690021
         ED    PMSG5N,DATE+NX5      NO. PROC. DIV. STATEMENTS           87700021
         L     R15,APUT                                                 87710021
         USING PUT,R15                                                  87720021
         BAL   RS1,PUTM            WRITE LINE 1                         87730021
         USING PRSTAT,R15                                               87740021
         L     R15,APRSTAT                                              87750021
*                                                                       87760021
         TM    SWITCH,SPILL        WAS THERE DICTIONARY SPILL           87770021
         BC    ZERO,STAT101        NO                                   87780021
         MVC   PMSG1,SMSG1         YES - PRINT MESSAGE SAYING SO        87790021
         MVC   PMSG7,SMSG7                                              87800021
         L     R15,APUT                                                 87810021
         USING PUT,R15                                                  87820021
         BAL   RS1,PUTM            WRITE LINE 1A                        87830021
         USING PRSTAT,R15                                               87840021
         L     R15,APRSTAT                                              87850021
*                                                                       87860021
STAT101  DS    0H                                                       87870021
         MVC   PMSG3,SMSG3         *OPTIONS IN EFFECT*                  87880021
         MVC   PMSG8,SMSG8         SIZE                                 87890021
         MVC   PMSG10,SMSG10       BUF                                  87900021
         MVC   PMSG9,SMSG9         LINECNT                              87910021
         MVC   PMSG11,SMSG11       SPACE                                87920021
         MVC   PMSG12,SMSG12       FLAG, SEQ, SOURCE                    87930021
         MVC   PMSG8N,EDWD1                                             87940021
         ED    PMSG8N,CORESIZE     CORE SIZE = NO.                      87950021
         MVC   PMSG1N,EDWD1                                             87960021
         ED    PMSG1N,BUFSIZE      BUF SIZE = NO.                       87970021
         MVC   PMSGSP,SPACING      SPACE 1 2  OR 3                      87980021
         OI    CNTLINE+NX1,MF0     STRIP ZONE                           87990021
         MVC   PMSG9N,CNTLINE      LINECOUNT = NO.                      88000021
         TM    PHZSW,FLAGW                                              88010021
         BC    ONES,STAT25         FLAGW                                88020021
         MVI   PMSGFL,EE           FLAGE                                88030021
STAT25   DS    0H             MOVE IN 'NO' WHERE APPROPRIATE            88040021
         TM    PHZSW,SEQ           SEQ                                  88050021
         BC    ONES,STAT26         YES                                  88060021
         MVC   NOSQ,SMSGNO         NO                                   88070021
STAT26   DS    0H                                                       88080021
         TM    SWITCH+NX1,DSOU       SOURCE                           F 88090021
         BC    ONES,STAT27         YES                                  88100021
         MVC   NOSOU,SMSGNO        NO                                   88110021
STAT27   DS    0H                                                       88120021
         L     R15,APUT                                                 88130021
         USING PUT,R15                                                  88140021
         BAL   RS1,PUTM            PRINT LINE 2                         88150021
         USING PRSTAT,R15                                               88160021
         L     R15,APRSTAT                                              88170021
*                                                                       88180021
         MVC   PMSG3A,SMSG3        *OPTIONS IN EFFECT*                  88190021
         MVC   PMSG13,SMSG13       MOVE ALL OPTIONS TO PRINT            88200021
*                        ALL THE OPTIONS - PLUG IN 'NO' LATER           88210021
         TM    PHZSW1,SYM          DMAP                                 88220021
         BC    ONES,STAT30         YES                                  88230021
       MVC   NODMP,SMSGNO    NO                                         88240021
STAT30   DS    0H                                                       88250021
         TM    PHZSW,LISTX         PMAP                                 88260021
         BC    ONES,STAT31         YES                                  88270021
       MVC   NOPMP,SMSGNO    NO                                         88280021
STAT31   DS    0H                                                       88290021
         TM    PHZSW1,CLIST        CLIST                                88300021
         BC    ONES,STAT32         YES                                  88310021
       MVC   NOCLST,SMSGNO    NO                                        88320021
STAT32   DS    0H                                                       88330021
         TM    PHZSW1,MAPSP        SUPMAP                               88340021
         BC    ONES,STAT33         YES                                  88350021
       MVC   NOSUPMAP,SMSGNO  NO                                        88360021
STAT33   DS    0H                                                       88370021
         TM    PHZSW1,XREF         XREF                                 88380021
         BC    ONES,STAT34         YES                                  88390021
       MVC   NOXREF,SMSGNO    NO                                        88400021
STAT34   DS    0H                                                       88410021
         TM    PHZSW,LINK          LOAD                                 88420021
         BC    ONES,STAT35         YES                                  88430021
         MVC   NOLD,SMSGNO         NO                                   88440021
STAT35   DS    0H                                                       88450021
         TM    PHZSW,DECK         DECK                                  88460021
         BC    ONES,STAT36         YES                                  88470021
         MVC   NODK,SMSGNO         NO                                   88480021
STAT36   DS    0H                                                       88490021
         TM    PHZSW1,APOST                                             88500021
         BC    ONES,STAT37         APOST                                88510021
       MVC   NOAPOST,QUOTE     QUOTE                                    88520021
STAT37   DS    0H                                                       88530021
         TM    PHZSW1,TRUNC        TRUNC                                88540021
         BC    ONES,STAT38         YES                                  88550021
         MVC   NOTRUNC,SMSGNO      NO                                   88560021
STAT38   DS    0H                                                       88570021
         TM    PHZSW,LIBR          LIB                                  88580021
         BC    ONES,STAT39         YES                                  88590021
         MVC   NOLIB,SMSGNO        NO                                   88600021
STAT39   DS    0H                                                       88610021
         TM    PHZSW3,VERBR        VERB                                 88620021
         BC    ONES,STAT40         YES                                  88630021
         MVC   NOVERB,SMSGNO       NO                                   88640021
STAT40   DS    0H                                                       88650021
         L     R15,APUT                                                 88660021
         USING PUT,R15                                                  88670021
         BAL   RS1,PUTM            PRINT LINE 3                         88680021
         USING PRSTAT,R15                                               88690021
         L     R15,APRSTAT                                              88700021
         MVC   PMSG3B,SMSG3        *OPTIONS IN EFFECT*                  88710021
         MVC   PMSG14,SMSG14       MOVE ALL OPTIONS TO PRINT            88720021
*                        ALL THE OPTIONS - PLUG IN 'NO' LATER           88730021
         TM    PHZSW,ZWB           ZWB                                  88740021
         BC    ONES,STAT41         YES                                  88750021
         MVC   NOZWB,SMSGNO        NO                                   88760021
STAT41   DS    0H                                                       88770021
         TM    PHZSW1,PDT          PDT                                  88780021
         BC    UNCOND,STAT42       YES     CHANGE WHEN IMPLEMENT        88790021
         MVC   NOPDT,SMSGNO        NO                                   88800021
STAT42   DS    0H                                                       88810021
         L     R15,APUT                                                 88820021
         USING PUT,R15                                                  88830021
         BAL   RS1,PUTM            PRINT LINE 4                         88840021
         L     RS1,STATSAV         RESTORE RETURN REGISTER              88850021
         BCR   UNCOND,RS1          RETURN                               88860021
       EJECT                                                            88870021
*=1    SRCRLD       SEARCH RLDTBL FOR PARTICULAR ADCON                  88880021
*                   INPUT - RW1 HAS TARGET ADDRESS TO SEARCH FOR        88890021
*                   OUTPUT - RW1 HAS RELLOC FOUND OR                    88900021
*                            ALL F'S IF NOT FOUND                       88910021
*                   C6WRK1-4 USED AS WORK AREA                          88920021
       USING SRCRLD,R15                                                 88930021
SRCRLD DS    0H                                                         88940021
       STM   R0,R15,SVREG                                               88950021
         TM    SWRLDFUL,RLDOVFL    IF TABLE OVERFLOWED GO TO            88960021
         BC    ONES,SRCRB          RETURN ALL F'S IN RW1                88970021
         L     R1,ARLDTB                                                88980021
         L     R2,RLDINDEX                                              88990021
       L     R15,ASRCRL                                                 89000021
       LR    RW3,R1                                                     89010021
         LA    RW2,DX0(R1,R2)                                           89020021
         NI    C6WRK1,INITOFF                                           89030021
SRCRA  CR    RW3,RW2                                                    89040021
       BC    NOTLO,SRCRB      NOT FOUND                                 89050021
         MVC   C6WRK2(LX3),DX1(RW3)                                     89060021
       C     RW1,C6WRK1       COMPARE TARGETS                           89070021
       BC    EQ,SRCRC         MATCH                                     89080021
         LA    RW3,DX8(RW3)                                             89090021
         BC    UNCOND,SRCRA        TRY NEXT                             89100021
SRCRB  SR    RW1,RW1                                                    89110021
       BCTR  RW1,R0                SUBTRACT 1                           89120021
       ST    RW1,C6WRK1       FFFFFFFF                                  89130021
         BC    UNCOND,SRCRD        GO RETURN UNFOUND                    89140021
SRCRC  DS    0H                                                    STAN 89150021
         MVC   C6WRK2(LX3),RELC(RW3) RELLOC                          ST 89160021
SRCRD  LM    R0,R15,SVREG                                               89170021
       L     RW1,C6WRK1                                                 89180021
         BCR   UNCOND,RS1          RETURN                               89190021
     EJECT                                                              89200021
TGTCON DS    0H                                                         89210021
       USING *,R15                                                      89220021
       ST    RS1,SVR1             SAVE RET ADDRESS                      89230021
         MVC   CKLOC(LX4),LOCCTR    SAVE LOC CTR                        89240021
       L     RW2,TGTLOC           GET ADDR OF TGT                       89250021
       LA    RW2,APGTVN(RW2)       COMPUTE TARGET ADDRESS FOR VNI T     89260021
       ST    RW2,LOCCTR           TARGET EXPECTED IN LOCCTR             89270021
       L     RW2,LOCPGT           GET PGT ADDR                          89280021
       AH    RW2,VNILOC           ADDR OF VN'S IN PGT                   89290021
       LH    RW3,INDVN            GET NO. OF VN'S FOR INDEP SEGM        89300021
         SLL   RW3,DX2             GET NO. OF BYTES                     89310021
       STH   RW3,INDVN            SAVE SIZE OF VNI TABLE                89320021
       LA    RW1,XYZ2              SPECIFY RET ADDR FOR IN-LINE RTN     89330021
XYZ1   LH    R0,VNCTR             GET SIZE OF ALL VN'S                  89340021
       SR    R0,RW3               GET SIZE OF VN'S THAT ARE NON-IND     89350021
       AR    RW2,R0               ADJUST RELATIVE ADDR                  89360021
       ST    RW2,D6REL                                                  89370021
         L     RB1,ARB1B           GET PARAM LIST ADDR                  89380021
       LR    RW2,R15               SAVE BASE REG                        89390021
         L     R15,ARLDRTE         GET INSERT RTE ADDRESS               89400021
       BALR  RS1,R15              GET ADDR OF AN ENTRY IN REG 2         89410021
       LR    R15,RW2               RESTORE BASE                         89420021
         MVI   TARG0(R2),XX04      SPECIFY LENGTH OF ADCON              89430021
         OI    TARG0(R2),ATYP      ADCON TYPE                           89440021
         MVC   TARG(LX3,R2),LOCCTR+NX1 MOVE TARGET ADDR TO RLDTBL       89450021
         MVC   RELC4(LX4,R2),D6REL PTY/REL ADDR                         89460021
       BR    RW1                   BR TO NEXT INSTR OR RETURN           89470021
* GENERATE VN-I TBL ADCON                                               89480021
XYZ2   L     RW2,TGTLOC           GET TGT ADDR                          89490021
       LA    RW2,ATGTVN(RW2)       COMPUTE TARGET ADDR                  89500021
       ST    RW2,LOCCTR           FOR VN-I TBL ADCON                    89510021
       L     RW2,TGTLOC           GET TGT ADDR                          89520021
       AH    RW2,VNLOC            GET ADDR OF VN'S IN TGT               89530021
       LH    RW3,INDVN            GET SIZE OF INDEP VN'S IN BYTES       89540021
       BAL   RW1,XYZ1              LOOP                                 89550021
* PUNCH TXT CARD-LENGTH OF VNI TBL FOR INDEP SEGMENTS                   89560021
       L     RW2,TGTLOC           GET TGT ADDR                          89570021
       LA    RW2,VNTBLN(RW2)       COMPUTE TARGET ADDRESS               89580021
       ST    RW2,LOCCTR                                                 89590021
       LA    R1,INDVN             SPECIFY ADDR OF CONSTANT              89600021
         LA    R0,TWOBYTE          SPECIFY SIZE OF CONSTANT             89610021
       L     R15,ATXPNH           GET PUNCH RTN ADDR                    89620021
       BALR  RS1,R15               GO PUNCH                             89630021
         MVC   LOCCTR(LX4),CKLOC    RESTORE LOC CTR                     89640021
       L     RS1,SVR1             RESTORE RET ADDRESS                   89650021
       BR    RS1                  RETURN                                89660021
       DROP R15                                                         89670021
         EJECT                                                          89680021
IKF609   CSECT                                                          89690021
*=1    XPRIME               ESTABLISH PRIME REQUEST SIZE AND            89700021
*                           GROW FACTOR.  THEN CALL PRIME.              89710021
*            MINIMUM PRIME REQUEST = SIZE OF 1RECORD                    89720021
*            MAXIMUM PRIME REQUEST = 32512                              89730021
*            GROW FACTOR = 1/8 PRIME REQUEST                            89740021
*             OR MINIMUM OF 1 RECORD LENGTH                             89750021
*            RECORD LENGTH ASSUMED 256 IF VARIABLE                      89760021
       USING XPRIME,R15                                                 89770021
XPRIME DS    0H                                                         89780021
       STM   R2,R3,C6WRK1                                               89790021
       SR    R3,R3                                                      89800021
       STH   R3,C6WRK0                                                  89810021
         IC    R3,DX0(R1)      RECORD SIZE                              89820021
       LTR   R3,R3                                                      89830021
       BC    NOTZER,XPRMA          NOT VARIABLE                         89840021
         LA    R3,DX256       VARIABLE                                  89850021
XPRMA    MVC   C6WRK0+NX2(LX2),DX4(R1)                                  89860021
       L     R2,C6WRK0                                                  89870021
       LTR   R2,R2                                                      89880021
       BC    NOTZER,XPRMAX         CONTINUE, CALL PRIME                 89890021
       LM    R2,R3,C6WRK1       DO NOT CALL PRIME IF ZERO               89900021
         BCR   UNCOND,RS1          RETURN                               89910021
XPRMAX EQU   *                                                          89920021
       CH    R2,MAXPRM                                                  89930021
       BC    NOTHI,XPRMB           R2 LT  7F00                          89940021
       LH    R2,MAXPRM                                                  89950021
         STH   R2,DX4(R1)                                               89960021
         BC    UNCOND,XPRMX        CONT. R27MAXPRM CODE                 89970021
XPRMB  CR    R2,R3                                                      89980021
       BC    NOTLO,XPRMX           DON'T DO SAVE                        89990021
         STH   R3,DX4(R1)                                               90000021
XPRMX    SRL   R2,DX3                                                   90010021
       CR    R2,R3                                                      90020021
       BC    NOTLO,XPRMC           NOT MINIMUM                          90030021
       LR    R2,R3            RECORD SIZE MINIMUM                       90040021
XPRMC    STH   R2,DX6(R1)                                               90050021
       LM    R2,R3,C6WRK1                                               90060021
       L     R15,APRIME            GET PRIME RTN ADDRESS                90070021
         BCR   UNCOND,R15          CALL PRIME                           90080021
*  PRIME WILL RETURN DIRECTLY TO CALLER OF XPRIME                       90090021
       DROP  R15                                                        90100021
         SPACE 2                                                        90110021
*=1    XSTATC       DO NOT CALL STATIC IF                               90120021
*                    PRIME WAS NOT CALLED.                              90130021
*      NO BASE REGISTER NEEDED                                          90140021
XSTATC DS    0H                                                         90150021
         LH    R15,DX4(R1)                                              90160021
       LTR   R15,R15                                                    90170021
       BCR   ZERO,RS1     RETURN                                        90180021
         L     R1,DX0(R1)                                               90190021
         TM    DX0(R1),PRMFLG     HAS TABLE BEEN PRIMED?          56154 90200021
         BCR   8,RS1              NO, RETURN                      56154 90210021
       L     R15,ADSTAT            GET STATIC RTN ADDRESS               90220021
         BCR   UNCOND,R15          GO TO STATIC                         90230021
*  STATIC WILL RETURN DIRECTLY TO CALLER OF XSTATC                      90240021
       SPACE 3                                                          90250021
*=1    XTABRL       DO NOT CALL TABREL IF                               90260021
*                    PRIME WAS NOT CALLED.                              90270021
*      NO BASE REGISTER NEEDED                                          90280021
XTABRL DS    0H                                                         90290021
         LH    R15,DX4(R1)                                              90300021
       LTR   R15,R15                                                    90310021
       BCR   ZERO,RS1     RETURN                                        90320021
         L     R1,DX0(R1)                                               90330021
       L     R15,RELADD            GET RELEASE RTN ADDRESS              90340021
         BCR   UNCOND,R15          GO RELEASE TABLE                     90350021
*  TABREL WILL RETURN DIRECTLY TO CALLER OF XTABRL                      90360021
       SPACE 2                                                          90370021
*=1    TABLES            FIND CURRENT START AND LENGTH OF A TABLE       90380021
*                        INPUT - R1 HAS TIB ADDRESS                     90390021
*                        OUTPUT - R1 HAS START                          90400021
*                               - R2 HAS LENGTH                         90410021
*      NO BASE REGISTER NEEDED                                          90420021
TABLES DS    0H                                                         90430021
         LA    R1,DX0(R1)        ELIMINATE HIGH BYTE                    90440021
       SR    R2,R2              ZERO LENGTH                             90450021
       C     R1,COSADR                                                  90460021
       BCR   NOTHI,RS1         NO TABLE                                 90470021
         L     R1,DX0(R1)                                               90480021
         LH    R2,DX4(R1)        LENGTH                                 90490021
         L     R1,DX0(R1)                                               90500021
         LA    R1,DX0(R1)        TABLE START                            90510021
         BCR   UNCOND,RS1          RETURN                               90520021
       EJECT                                                            90530021
*=1    LTDMP             DUMP LITERAL POOL                              90540021
*                   IF R1 = 0  FORMAT HEX TYPE, ELSE BCD                90550021
       USING LTDMP,R15                                                  90560021
LTDMP  DS    0H                                                         90570021
       STM   R0,R15,SLTDMP                                              90580021
       L     R15,APUT                                                   90590021
       BALR  RS1,R15       BLANK LINE                                   90600021
       L     R15,ALTDMP                                                 90610021
       LTR   R1,R1                                                      90620021
       BC    NOTZER,LTD10          HEADING IS BCD DUMP                  90630021
         MVC   OU6CDN(LX18),LTDHEX                                      90640021
         BC    UNCOND,LTD15        SKIP OTHER HEADING                   90650021
LTD10    MVC   OU6REC+NX6(LX22),LTDBCD                                  90660021
LTD15  L     R15,APUT                                                   90670021
       BALR  RS1,R15              HEADING                               90680021
       BALR  RS1,R15            BLANK LINE                              90690021
       L     R15,ALTDMP                                                 90700021
* CONVERT AND MOVE LOCATION                                             90710021
LTD20  L     RW1,LDMLOC                                                 90720021
       ST    RW1,C6WRK0                                                 90730021
       L     R15,AS6010                                                 90740021
       BALR  RS1,R15               CONVERT                              90750021
       L     R15,ALTDMP                                                 90760021
         MVC   OU6CDN(LX5),C6WRK4                                       90770021
         MVI   OU6REC+NX7,LFTPAREN  (                                   90780021
         MVC   OU6STR(LX4),XLITC                                        90790021
       L     RW1,LDMLOC                                                 90800021
       S     RW1,LOCPGT                                                 90810021
       SH    RW1,LTLCTR                                                 90820021
       L     R15,AS6200                                                 90830021
       USING S6200,R15                                                  90840021
         LA    RW3,OU6REC+NX12                                          90850021
       BAL   RS1,S6210             CONVERT                              90860021
         MVC   DX0(LX1,RW3),C6WRK4                                      90870021
       L     R15,ALTDMP                                                 90880021
       USING LTDMP,R15                                                  90890021
         MVI   DX1(RW3),RTPAREN                                         90900021
* INITIALIZE LINE POSITION                                              90910021
         LA    RW3,OU6REC+NX19                                          90920021
* FORMAT ONE LINE (HEX OR BCD)                                          90930021
       LTR   R1,R1                                                      90940021
       BC    ZERO,LHEXDM           FORMAT HEY LINE                      90950021
* BCD LINE                                                              90960021
         MVC   OU6LST(LX2),LTDTL                                        90970021
         MVI   OU6REC+NX18,QUOTES1                                      90980021
* MOVE MAXIMUM 56 CHARACTERS                                            90990021
       LH    RW1,LDMLEN                                                 91000021
         LA    RW2,DX56                                                 91010021
       CR    RW1,RW2                                                    91020021
       BC    LO,LTD30              GO USE  REMAINDER                    91030021
       SR    RW1,RW2                                                    91040021
         BC    UNCOND,LTD35        GO MOVE LDMLEN-56=LDMLEN             91050021
LTD30  LR    RW2,RW1          USE REMAINDER                             91060021
       SR    RW1,RW1                                                    91070021
LTD35  STH   RW1,LDMLEN                                                 91080021
       L     RW1,LDMVAL                                                 91090021
       BCTR  RW2,R0                SUBTRACT 1                           91100021
       EX    RW2,LTDMVC                                                 91110021
         LA    RW3,DX1(RW2,RW3)                                         91120021
         MVI   DX0(RW3),QUOTES1                                         91130021
       L     R15,APUT                                                   91140021
       BALR  RS1,R15               PRINT A LINE                         91150021
       L     R15,ALTDMP                                                 91160021
       LH    RW1,LDMLEN                                                 91170021
       LTR   RW1,RW1                                                    91180021
       BC    ZERO,LTD90       EXIT                                      91190021
       L     RW1,LDMLOC                                                 91200021
         LA    RW1,DX56(RW1)                                            91210021
       ST    RW1,LDMLOC                                                 91220021
       L     RW1,LDMVAL                                                 91230021
         LA    RW1,DX56(RW1)                                            91240021
       ST    RW1,LDMVAL                                                 91250021
         BC    UNCOND,LTD20        GO CONVERT & MOVE                    91260021
* HEX LINE                                                              91270021
LHEXDM LH    RW1,LDMLEN                                                 91280021
         LA    RW2,FOURBYTE                                             91290021
       CR    RW1,RW2          4 BYTES AT A TIME                         91300021
       BC    LO,LTD50              GO USE REMAINDER                     91310021
       SR    RW1,RW2                                                    91320021
         BC    UNCOND,LTD55        CONTINUE WITH NEW VALUE              91330021
LTD50  LR    RW2,RW1                                                    91340021
       SR    RW1,RW1                                                    91350021
LTD55  STH   RW1,LDMLEN                                                 91360021
       L     RW1,LDMVAL                                                 91370021
         MVC   C6WRK0(LX4),DX0(RW1)                                     91380021
         SLL   RW2,DX1                                                  91390021
       BCTR  RW2,R0                SUBTRACT 1                           91400021
       L     R15,AS6010                                                 91410021
       BALR  RS1,R15            CONVERT                                 91420021
       L     R15,ALTDMP                                                 91430021
       LA    RW1,C6WRK1                                                 91440021
       EX    RW2,LTDMVC       MOVE TO LIST LINE                         91450021
       LH    RW1,LDMLEN                                                 91460021
       LTR   RW1,RW1                                                    91470021
       BC    ZERO,LTD85        EXIT                                     91480021
         LA    RW3,DX10(RW3)                                            91490021
         LA    RW1,OU6REC+NX76                                          91500021
       L     RW2,LDMVAL                                                 91510021
         LA    RW2,DX4(RW2)                                             91520021
       ST    RW2,LDMVAL                                                 91530021
       CR    RW3,RW1                                                    91540021
       BC    LO,LHEXDM        NEXT 4 BYTES                              91550021
       L     R15,APUT                                                   91560021
       BALR  RS1,R15               PRINT A LINE                         91570021
       L     R15,ALTDMP                                                 91580021
* FORMAT NEXT LINE                                                      91590021
       L     RW1,LDMLOC                                                 91600021
         LA    RW1,DX24(RW1)                                            91610021
       ST    RW1,LDMLOC                                                 91620021
         BC    UNCOND,LTD20        GO CONVERT & MOVE                    91630021
* EXIT                                                                  91640021
LTD85  L     R15,APUT                                                   91650021
       BALR  RS1,R15               PRINT A LINE                         91660021
       L     R15,ALTDMP                                                 91670021
LTD90    DS     0H                                                 9361 91680021
         CLI   SEGLMT,NOTSEGTD   IS PROGRAM SEGMENTED              9361 91690021
         BC    EQ,LTD95          NO , DON'T NEED BLANK LINES       9361 91700021
         L     R15,APUT                                            9361 91710021
         BALR  RS1,R15            PRINT BLANK LINE                 9361 91720021
         BALR  RS1,R15            PRINT BLANK LINE                 9361 91730021
         L     R15,ALTDMP                                          9361 91740021
LTD95    LM    R0,R15,SLTDMP                                       9361 91750021
         BCR   UNCOND,RS1          RETURN                               91760021
*                                                                       91770021
SLTDMP DS    16F                                                        91780021
LTDMVC   MVC   DX0(LX1,RW3),DX0(RW1)                                    91790021
       DROP  R15                                                        91800021
       EJECT                                                            91810021
*      ALL TABLES FROM HERE SHOULD BE REFERRED TO THRU ADCONS           91820021
*                                                                       91830021
*=1    SYMBOLIC OPERAND TABLE                                           91840021
*                                                                       91850021
XSYMC  EQU     *                                                        91860021
XDNC   DC      C'DNM='      SOURCE DATA NAME                            91870021
*      THIS GROUP MUST BE IN ORDER                                      91880021
XSAVC  DC      C'SAV+'      SAVE AREA CELL                              91890021
       DC      C'SWT+'      SWITCH CELL                                 91900021
       DC      C'TLY+'      TALLY CELL                                  91910021
         DC    C'SSVE'             SORT SAVE CELL                       91920021
       DC      C'ECB+'      ECB CELL                                    91930021
       DC      C'RPE+'      RANDOM PROCESSING ECB CELL                  91940021
       DC      C'RPH+'      RANDOM PROCESSING HOLD CELL                 91950021
*      THIS GROUP MUST BE IN ORDER                                      91960021
XDCBC  EQU     *                                                        91970021
       DC      C'DCB='      DCB ADDR                                    91980021
         DC    C'VLC='                                                  91990021
       DC      C'ON=0'      ON COUNTER                                  92000021
       DC      C'PFM='      PERFORM COUNTER                             92010021
       DC      C'PSV='      PERFORM SAVE                                92020021
       DC      C'DEC='      DECB ADDR                                   92030021
       DC      C'XSA='      EXHIBIT SAVE AREA                           92040021
       DC      C'PRM='      PARAMETER                                   92050021
       DC    C'WC=0'     WORKING CELL                                   92060021
       DC    C'TS=0'     TEMPORARY STORAGE CELL                         92070021
       DC      C'XSW='      EXHIBIT SWITCH                              92080021
       DC    C'SBS='      SUBSCRIPT CELL (LATER ON ALSO)                92090021
       DC    C'TS2='     TEMPORARY STORAGE (NON-ARITH)                  92100021
         DC    C'RPI='     RANDOM PROCESSING INFO FOR SPECIFIED RPD     92110021
       DC    C'VLO='                                                    92120021
       DC    C'SAV2'                                                    92130021
       DC    C'SAV3'                                                    92140021
       DC    C'RSV='                                                    92150021
       DC    C'OVF='               MAXOV                                92160021
       DC    C'DEC='                                                    92170021
       DC    C'CKP='               CHECKPOINT COUNTER                   92180021
       DC    C'TS3='               TEMPORARY STORAGE-3                  92190021
       DC    C'TS4='               TEMPORARY STORAGE-4                  92200021
       DC    C'INX='               INDEX NAMES                          92210021
       DC    C'IOP='               IOPTR FOR APPLY WRITE ONLY           92220021
*      THIS GROUP MUST BE IN ORDER                                      92230021
XBLIC    DC    C'BL ='                                                  92240021
XBLLC  EQU     *                                                        92250021
       DC      C'BLL='      BL FOR LINKAGE SECTION                      92260021
XSBLC  EQU     *                                                        92270021
         DC    C'SBL='                                                  92280021
XSBSC  EQU     *                                                        92290021
       DC      C'SBS='      SUBSCRIPT CELL                              92300021
       EJECT                                                            92310021
*                                                                       92320021
*=1    A-TEXT FOR INIT1                                                 92330021
INIT1  EQU   *                                                          92340021
*=1    A-TEXT FOR INIT1                                                 92350021
*=     (THIS PART PERMANENT)                                            92360021
INITOS EQU   *                INIT1 FOR OS/360                          92370021
       DC    X'480700'             BCR  0,0                             92380021
       DC    X'4890EC70D00C'       STM  14,12,12(13)                    92390021
       DC    X'48185D'             LR   5,13                            92400021
       DC    X'4805F0'             BALR 15,0                            92410021
INITIX DC    X'48989F70F012'       LM   9,15,12(15)                     92420021
       DC    X'4807FF'             BCR  15,15                           92430021
       DC    X'489602701034'       OI   34(1),X'02'                     92440021
       DC    X'4807FE'             BCR  15,14                           92450021
       DC    X'4841F0700001'       LA   15,1                            92460021
       DC    X'4807FE'             BCR  15,14                           92470021
       DC    X'44188430040000'     DC   A(INIT3)                        92480021
SEGLAB DC    X'44188400040000'     DC  V(SEGM)                     STAN 92490021
       DC    X'44188400040000'     DC   A(INIT1)                        92500021
       DC    X'44188438040000'     DC   A(PGT)                          92510021
       DC    X'4418843C040000'     DC   A(TGT)                          92520021
INITIW DC    X'44188444040000'    DC   A(START)                         92530021
       DC    X'44188440040000'     DC   A(INIT2)                        92540021
       DC    X'00'                                                      92550021
* SAVE AREA OF 15 WORDS WILL BE GENERATED AFTER INIT1                   92560021
*                                                                       92570021
* DCB EXIT ROUTINE FOR BISAM CORE-INDEX OPTION                          92580021
*                                                                       92590021
INIT1A EQU *                                                            92600021
         DC    XL3'480700'         BCR  0,0                       41095 92610021
         DC    XL3'480530'              BALR  3,0                 41095 92620021
       DC    X'481821'             LR   2,1                             92630021
*DEL                                                                    92640021
*DEL                                                                    92650021
*DEL                                                                    92660021
*DEL                                                                    92670021
*DEL                                                                    92680021
*DEL                                                                    92690021
*DEL                                                                    92700021
         DC    X'48411070002C'         LA   1,42(0,0)             41095 92710021
         DC    X'481E13'               AR   1,3                   41095 92720021
         DC    X'484110701000'         LA   1,0(0,1)              41095 92730021
         DC    XL9'48D707703028703028'  XC 40(8,3),40(3)          41095 92740021
         DC    X'485010701000'         ST   1,0(0,1)              41095 92750021
         DC    XL9'48D20170302A702096'  MVC   42(2,3),150(2)      41095 92760021
         DC    X'48D50170302870302A'    CLC  40(2,3),42(3)        41095 92770021
         DC    X'48078E'                BCR  8,14                 41095 92780021
         DC    XL6'484510703032'        BAL 1,50(3)               41095 92790021
         DC    XL4'44246C04'            DC  A(LENGTH)             41095 92800021
         DC    XL4'00000000'            *                         41095 92810021
         DC    XL4'44246C04'            DC  A(FIELD)              41095 92820021
         DC    XL4'00000000'            *                         41095 92830021
         DC    XL4'44246C02'            DC  XL2'2000'             41095 92840021
         DC    XL2'2000'                *                         41095 92850021
         DC    XL3'480A04'              SVC  4                    41095 92860021
         DC    X'481812'               LR   1,2                   41095 92870021
         DC    XL3'4812FF'              LTR 15,15                 41095 92880021
         DC    XL3'48077E'              BCR  7,14                 41095 92890021
         DC    XL9'48D20170204470302A'  MVC  68(2,2),42(3)        41095 92900021
         DC    XL9'48D20270204970302D'  MVC  73(3,2),45(3)        41095 92910021
       DC    X'4807FE'             BCR  15,14                           92920021
       DC    X'00'                                                      92930021
       EJECT                                                            92940021
*                                                                       92950021
*=1      A-TEXT FOR INIT2                                               92960021
INIT2  DS    0C                                                         92970021
INOS2  EQU   *                INIT2 FOR OS/360                          92980021
       DC    X'4850D0705008'       ST   13,8(5)                         92990021
       DC    X'48505070D004'       ST   5,4(13)                         93000021
       DC    X'4850E070D054'        ST 14,WC                            93010021
        DC    X'4894EF600400'          NI SWITCH,X'EF'             9652 93020021
       DC    X'4858F0580001'       L    15,=V(ILBOSTP0)                 93030021
       DC    X'4805EF'             BALR 14,15                           93040021
         DC    X'48501070D1B8'    ST  1,1B,(D)  SAVE SUBCOM ADDR        93050021
       DC    X'481200'             LTR  0,0                             93060021
         DC    X'480789'      BCR 8,9                                   93070021
       DC    X'489610600400'       OI   SWITCH,X'10'                    93080021
       DC    X'00'                                                      93090021
*      ADDITIONAL ATEXT FOR INIT2 IF OS/360                             93100021
*      ***** THIS PORTION GENERATED ONCE/PROGRAM                        93110021
SECT0  EQU   *           PGT OVERFLOW INITIALIZATION                    93120021
       DC    X'48411070C000'            LA    1,0(12)                   93130021
       DC    X'48417058000180FFFFFF'    LA    7,VIR=1-1                 93140021
       DC    X'480550'                  BALR  5,0                       93150021
       DC    X'485840701000'            L     4,0(1)                    93160021
       DC    X'481E4B'                  AR    4,11                      93170021
       DC    X'485040701000'            ST    4,0(1)                    93180021
       DC    X'488716705000'            BXLE  1,6,0(5)                  93190021
       DC    X'00'                                                      93200021
SECT1  EQU   *      PGT INITIALIZATION                                  93210021
       DC    X'4841104C000001'      LA  1,PN=1                          93220021
       DC    X'48417068'                LA   7,LTL=1                    93230021
LITSEG   DC    X'0001'             LITERAL = 1                          93240021
       DC    X'480670'                  BCTR 7,0                        93250021
       DC    X'480550'             BALR 5,0                             93260021
       DC    X'48584070100000'    L    J,0(1) FOLLOWED BY END OF BL     93270021
SECT1A   DC    X'48917F701000'     TM  0(1),X'7F'                       93280021
       DC    X'484780705016'       BC  8,16(5)                          93290021
       DC    X'484180708000'       LA  8,0(8)                           93300021
       DC    X'481E4A'             ALR 4,10                        STAN 93310021
       DC    X'4847F0705018'       B   18(5)                            93320021
SECT1B DC    X'481E4B'            ALR  4,11                             93330021
       DC    X'485040701000'       ST   4,0(1)                          93340021
       DC    X'488716705000'                BXLE 1,6,0(5)               93350021
       DC    X'00'                                                      93360021
*                                                                       93370021
*      ***** THIS PORTION GENERATED ONCE/RPD/CYCLE + ONCE/PROGRAM       93380021
SECTX2 EQU   *           PGT OVERFLOW INITIALIZATION                    93390021
       DC    X'48418064480001'          LA    8,MAXOV                   93400021
       DC    X'4841706424000180FFFFFF'  LA    7,TS=1-1                  93410021
       DC    X'480510'                  BALR  1,0                       93420021
       DC    X'485800708000'            L     0,0(8)                    93430021
       DC    X'481E0B'                  AR    0,11                      93440021
       DC    X'485000708000'            ST    0,0(8)                    93450021
       DC    X'488786701000'            BXLE  8,6,0(1)                  93460021
       DC    X'00'                                                      93470021
       DC    X'480540'             BALR 4,0                             93480021
YQTXT  DC    X'4894FE60040100'      NI   SWITCH+1,254                   93490021
INIT3  EQU   *                                                          93500021
       DC    X'4805F0'             BALR 15,0                            93510021
       DC    X'489120600400'       TM   SWITCH,X'20'   PGM INITIALI     93520021
         DC    X'4847E070F016'   BC OFF,TRAN003  NO-INITIAL             93530021
         DC    X'48580070B038'    L 0,SAVEP2                      7338  93540021
         DC    X'48982D70B040'  LM  2,13,SAVEP2+8                 7338  93550021
         DC    X'4858E070D054'    L 14,84(13)                           93560021
       DC    X'4807FE'             BCR  15,14          RETURN           93570021
       DC    X'489620600400'       OI   SWITCH,X'20'   TRAN003-SET      93580021
       DC    X'484160700004'       LA   6,4                             93590021
       DC    X'00'                                                      93600021
INIT3B EQU   *                                                          93610021
         DC    X'4858E070D054'     L    14,84(13)                       93620021
         DC    X'4807FE'           BCR  15,14                           93630021
         DC    X'00'                                                    93640021
*                                                                       93650021
XQTXT  DC    X'489601600401'       OI   SWITCH+1,1                      93660021
       DC    X'00'                                                      93670021
*                                                                       93680021
*                                                                       93690021
       EJECT                                                            93700021
*                                                                       93710021
*=1      ADCON LISTING ELEMENTS                                         93720021
RLTBL  DC    C'(INIT1)'                                                 93730021
       DC    C'(TALLY)'                                                 93740021
       DC    C'(PRM=  '                                                 93750021
         DC    C'(BL =0 '                                               93760021
         DC    C'       '          ** NOT PRESENTLY USED***             93770021
         DC    C'(SBL=  '                                               93780021
         DC    C'       '          ** NOT PRESENTLY USED***             93790021
         DC    C'(VLC=  '                                               93800021
         DC    C'       '          ** NOT PRESENTLY USED***             93810021
         DC    C'       '          ** NOT PRESENTLY USED***             93820021
       DC    C'(BLL=  '                                                 93830021
       DC    C'(LTL+  '                                                 93840021
       DC    C'(INIT3)'                                                 93850021
         DC    C'       '          ** NOT PRESENTLY USED***             93860021
       DC    C'(PGT)  '                                                 93870021
       DC      C'(TGT)  '                                               93880021
       DC    C'(INIT2)'                                                 93890021
       DC    C'(START)'                                                 93900021
       DC    C'(PN=0  '                                                 93910021
       DC    C'(VIR=  '                                                 93920021
       DC    C'(GN=0  '                                                 93930021
         DC    C'       '          ** NOT PRESENTLY USED***             93940021
         DC    C'(VN''S) '                                              93950021
         DC    C'(VNI''S)'                                              93960021
       DC    C'(SBS=  '                                                 93970021
       DC    C'(TS=0  '                                                 93980021
       DC    C'(SEGMT)'                                                 93990021
         EJECT                                                          94000021
*                                                                       94010021
*=1    CNOP TABLE--NO OF BCR 0,0 INSTRUCTIONS TO BE                     94020021
*=                 GENERATED DEPENDING ON CNOP SPECIFICATIONS           94030021
*=                 AND LOCCTR                                           94040021
CNOPT  EQU   *                                                          94050021
       DC    X'0'                                                       94060021
       DC    X'1'                                                       94070021
       DC    X'0'                                                       94080021
       DC    X'1'                                                       94090021
       DC    X'1'                                                       94100021
       DC    X'0'                                                       94110021
       DC    X'1'                                                       94120021
       DC    X'0'                                                       94130021
       DC    X'0'                                                       94140021
       DC    X'3'                                                       94150021
       DC    X'2'                                                       94160021
       DC    X'1'                                                       94170021
       DC    X'1'                                                       94180021
       DC    X'0'                                                       94190021
       DC    X'3'                                                       94200021
       DC    X'2'                                                       94210021
       DC    X'2'                                                       94220021
       DC    X'1'                                                       94230021
       DC    X'0'                                                       94240021
       DC    X'3'                                                       94250021
       DC    X'3'                                                       94260021
       DC    X'2'                                                       94270021
       DC    X'1'                                                       94280021
       DC    X'0'                                                       94290021
       DS    500C                                                       94300021
       EJECT                                                            94310021
* DESCRIPTION OF PHASE 6 TABLES                                         94320021
*      FILTBL                                                           94330021
*      TIB=2                                                            94340021
*      PRIMING VALUE IS 256                                             94350021
*      ENTRY LENGTH IS 12 BYTES                                         94360021
*      GROW FACTOR IS VARIABLE                                          94370021
*      FORMAT  // VIRTUAL LOCCTR //                                     94380021
*            VIRTUAL IS AN 8-BYTE FIELD CONTAINING THE NAME OF A        94390021
*                   VIRTUAL ASSOCIATED WITH A DCB OR DTF                94400021
*            LOCCTR CONTAINS THE LOCATION TO BE ENTERED ON THE ESD      94410021
*                   CARD.  IT IS 4 BYTES LONG                           94420021
*                                                                       94430021
       SPACE 2                                                          94440021
*      CONTBL                                                           94450021
*      TIB= 9                                                           94460021
*      PRIMING VALUE IS VARIABLE                                        94470021
*      ENTRY LENGTH IS VARIABLE                                         94480021
*      GROW FACTOR IS VARIABLE                                          94490021
*      FORMAT  // LITERAL //                                            94500021
*            LITERAL IS A VARIABLE-LENGTH UNIQUE LITERAL                94510021
*             USED FOR SOMETHING OTHER THAN DISPLAY.                    94520021
*            CONTBL IS USED TO HOLD LITERALS WHILE THEY ARE             94530021
*            BEING OPTIMIZED.                                           94540021
       SPACE 2                                                          94550021
*      CONDIS                                                           94560021
*      TIB= 14                                                          94570021
*      PRIMING VALUE IS VARIABLE                                        94580021
*      ENTRY LENGTH IS VARIABLE                                         94590021
*      GROW FACTOR IS VARIABLE                                          94600021
*      FORMAT  // LITERAL //                                            94610021
*            LITERAL IS A VARIABLE-LENGTH UNIQUE LITERAL                94620021
*             USED FOR DISPLAY.                                         94630021
*            CONDIS IS USED TO HOLD LITERALS WHILE THEY ARE             94640021
*            BEING OPTIMIZED.                                           94650021
       SPACE 2                                                          94660021
*      LTLTBL                                                           94670021
*     TIB=4                                                             94680021
*      PRIMING VALUE IS VARIABLE                                        94690021
*      ENTRY LENGTH IS 2 BYTES                                          94700021
*      GROW FACTOR IS VARIABLE                                          94710021
*      FORMAT  // PTR//                                                 94720021
*            PTR IS A 2-BYTE DISPLACEMENT FROM THE START OF THE PGT     94730021
*            LTLTBL CONTAINS THE LOCATION OF EACH LITERAL               94740021
*            RELATIVE TO THE START OF THE PGT.                          94750021
       SPACE 2                                                          94760021
*      LVIRTB                                                           94770021
*      TIB= 11                                                          94780021
*      PRIMING VALUE IS VARIABLE                                        94790021
*      ENTRY LENGTH IS 8 BYTES                                          94800021
*      GROW FACTOR IS VARIABLE                                          94810021
*      FORMAT  // VIRTUAL //                                            94820021
*            VIRTUAL IS AN 8-CHARACTER VIRTUAL NAME USED FOR LINK.      94830021
*            LVIRTB CONTAINS UNIQUE LINK VIRTUAL NAMES.                 94840021
       SPACE 2                                                          94850021
*      CVIRTB                                                           94860021
*      TIB= 12                                                          94870021
*      PRIMING VALUE IS VARIABLE                                        94880021
*      ENTRY LENGTH IS 8 BYTES                                          94890021
*      GROW FACTOR IS VARIABLE                                          94900021
*      FORMAT  // VIRTUAL //                                            94910021
*            VIRTUAL IS AN 8-CHARACTER VIRTUAL NAME USED FOR CALL.      94920021
*            CVIRTB CONTAINS UNIQUE CALL VIRTUAL NAMES.                 94930021
       SPACE 2                                                          94940021
*      VIRPTR                                                           94950021
*      TIB= 13                                                          94960021
*      PRIMING VALUE IS VARIABLE                                        94970021
*      ENTRY LENGTH IS 2 BYTES                                          94980021
*      GROW FACTOR IS VARIABLE                                          94990021
*      FORMAT  // PTR //                                                95000021
*            PTR IS A 2-BYTE DISPLACEMENT FROM THE START OF THE PGT     95010021
*            VIRPTR CONTAINS THE LOCATION OF EACH VIRTUAL               95020021
*            RELATIVE TO THE START OF THE PGT.                          95030021
       SPACE 2                                                          95040021
*      RLDTBL                                                           95050021
*     USES TABLE SPACE GOTTEN FROM GETALL                               95060021
*     LENGTH IS VARIABLE                                                95070021
*      ENTRY LENGTH IS 8 BYTES                                          95080021
*      GROW FACTOR IS VARIABLE                                          95090021
*      FORMAT  // CC TARGET PTY RELLOC //                               95100021
*            CC IS A CODE BYTE INDICATING TYPE AND LENGTH OF ADCON.     95110021
*            TARGET IS THE 3-BYTE ADDRESS OF THE ADCON.                 95120021
*      PTY IS PTY OF A SEGM POINTED TO BY 3 BYTES THAT FOLLOW           95130021
*            RELLOC IS THE 3-BYTE VALUE OF THE ADCON.                   95140021
*            RLDTBL IS USED TO HOLD ADCONS NEEDED IN THE                95150021
*            GLOBAL TABLES.                                             95160021
       SPACE 2                                                          95170021
*      QTBL                                                             95180021
*      TIB= 3                                                           95190021
*      PRIMING VALUE IS VARIABLE                                        95200021
*      ENTRY LENGTH IS 2 BYTES                                          95210021
*      GROW FACTOR IS VARIABLE                                          95220021
*      FORMAT  // GGGG //                                               95230021
*            GGGG IS A GN NUMBER.                                       95240021
*            QTBL CONTAINS THE GN NUMBERS OF Q-RTNES.                   95250021
       SPACE 2                                                          95260021
*      PNTBL                                                            95270021
*      TIB= 7                                                           95280021
*      PRIMING VALUE IS VARIABLE                                        95290021
*      ENTRY LENGTH IS 2 BYTES                                          95300021
*      GROW FACTOR IS VARIABLE                                          95310021
*      FORMAT  // NNNN //                                               95320021
*            NNNN IS A NUMBER RELATIVE TO THE BEGINNING OF PN CELLS     95330021
*            PNTBL HAS AN ENTRY FOR EACH REFERENCED PN.                 95340021
       SPACE 2                                                          95350021
*      GNTBL                                                            95360021
*      TIB= 8                                                           95370021
*      PRIMING VALUE IS VARIABLE                                        95380021
*      ENTRY LENGTH IS 2 BYTES                                          95390021
*      GROW FACTOR IS VARIABLE                                          95400021
*      FORMAT  // NNNN //                                               95410021
*            NNNN IS A NUMBER RELATIVE TO THE BEGINNING OF PN CELLS     95420021
*            GNTBL HAS AN ENTRY FOR EACH GN.                            95430021
       SPACE 2                                                          95440021
*                                                                       95450021
         EJECT                                                          95460021
*=1            INPUT AREA -- A-TEXT ELEMENT DEFINITIONS                 95470021
*                                                                       95480021
A6TEXT DSECT                                                            95490021
       DS    0CL125                                                     95500021
A6OP   DS    CL1                        OP ELEMENT-48                   95510021
A6OPCD DS    CL1                          CODE                          95520021
A6ABSV DS    CL1                          VALUE                         95530021
       ORG   A6TEXT                                                     95540021
A6BDP  DS    CL1                        BDISP ELEMENT-70                95550021
A6BDPB DS    CL1                          BASE,FIRST 4 DISP             95560021
A6BDPD DS    CL1                          DISPLACEMENT,LAST 8           95570021
       ORG   A6TEXT                                                     95580021
A6ADR  DS    CL1                        ADR ELEMENT-78                  95590021
A6ADRI DS    CL1                          I,FIRST 4 DISP                95600021
A6ADRD DS    CL1                          DISPLACEMENT,LAST 8           95610021
A6ADRK DS    CL1                          K                             95620021
A6ADRP DS    CL3                          POINTER-DICTIONARY            95630021
A6ADIN DS    CL3                   INCR FOR PLUS ELT IF INCLUDED        95640021
       ORG   A6TEXT                                                     95650021
A6PN   DS    CL1             PN ELEMENT-4C                              95660021
A6PNPR DS    CL1             PRIORITY NUMBER                            95670021
A6PNNO DS    CL2             PN NUMBER                                  95680021
       ORG   A6TEXT                                                     95690021
A6GN   DS    CL1                        GN ELEMENT-50                   95700021
A6GNNO DS    CL2                          NUMBER                        95710021
       ORG   A6TEXT                                                     95720021
A6VN   DS    CL1             VN ELEMENT                                 95730021
A6VNPR DS    CL1             PRIORITY NUMBER                            95740021
A6VNNO DS    CL2             VN NUMBER                                  95750021
       ORG   A6TEXT                                                     95760021
A6MAC  DS    CL1         MACRO                                          95770021
A6MACD DS    CL1         CODE                                           95780021
A6MAPR DS    CL1              SEGM PTY IF CODE=4C                       95790021
       ORG   A6TEXT                                                     95800021
A6VIR  DS    CL1         VIRREF                                         95810021
A6VIRN DS    CL2         NUMBER                                         95820021
       ORG   A6TEXT                                                     95830021
A6BL   DS    CL1                        BL ELEMENT-54                   95840021
A6BLI  DS    CL1         II OF ADDR ATTRIBUTE                           95850021
A6BLK  DS    CL1         KK OF ADDR ATTRIBUTE                           95860021
       ORG   A6TEXT                                                     95870021
A6GT1  DS    CL1         STD GLOBAL TABLE REF                           95880021
A6GT1C DS    CL1         CODE FOR TYPE                                  95890021
A6GT1D DS    CL1         DISP IN BYTES FROM FIRST BYTE OF CELL          95900021
       ORG   A6TEXT                                                     95910021
A6PLUS DS    CL1                        PLUS ELEMENT-80                 95920021
A6PLIN DS    CL3                          INCREMENT                     95930021
       ORG   A6TEXT                                                     95940021
A6CON  DS    CL1                        CON ELEMENT-68                  95950021
A6CCOD DS    CL1                          CODE                          95960021
A6CNO  DS    CL2                          NUMBER                        95970021
A6CL   DS    CL1                          LENGTH                        95980021
A6CCON DS    CL1                          CONSTANT-L*8                  95990021
       ORG   A6TEXT                                                     96000021
A6GT2  DS    CL1         OTHER GLOBAL TABLE REF                         96010021
A6GT2C DS    CL1         CODE FOR TYPE OF CELL                          96020021
A6GT2N DS    CL2         NUMBER OF THE CELL                             96030021
       ORG   A6TEXT                                                     96040021
A6BCD  DS    CL1         BCD REFERENCE                                  96050021
A6BCDL DS    CL1         LENGTH OF BCD NAME                             96060021
A6BCDS DS    CL1         ACTUALLY IS L ABOVE IN LENGTH                  96070021
       ORG   A6TEXT                                                     96080021
A6CD   DS    CL1              CARD NUMBER                               96090021
A6CDNO DS    CL2                                                        96100021
       ORG   A6TEXT                                                     96110021
A6REGN DS    CL1         REGISTER NUMBER                                96120021
A6REGR DS    CL1         0N                                             96130021
       ORG   A6TEXT                                                     96140021
A6LTL  DS    CL1              LITERAL REFERENCE                         96150021
A6LTLR   DS    CL2           RELATIVE NO.                          LITS 96160021
       ORG   A6TEXT                                                     96170021
A6DC   DS    CL1              DC DEF                                    96180021
A6DCL  DS    CL1                                                        96190021
A6DCV  DS    CL1                                                        96200021
       ORG   A6TEXT                                                     96210021
A6REL  DS    CL1              REL ADDRESS                               96220021
A6RAT  DS    CL1              TYPE                                      96230021
A6RAS  DS    CL1              SIGN AND SIZE                             96240021
A6RAN  DS    CL2              NUMBER                                    96250021
       ORG   A6TEXT                                                     96260021
A6CSD  DS    CL1         CALLING SEQ DISPL ELT                          96270021
A6CST  DS    CL1         TYPE                                           96280021
A6CSB  DS    CL1         BASE CODE                                      96290021
*                                                                       96300021
A6CSN  DS    CL2         NUMBER                                         96310021
       ORG   A6TEXT                                                     96320021
A6CSP  DS    CL1         CALLING SEQ DICT PTR                           96330021
A6CSPT DS    CL3         DICTIONARY POINTER                             96340021
       ORG   A6TEXT                                                     96350021
A6DCBA DS    CL1         DCBADEF                                        96360021
A6DCBL DS    CL3         RELLOC                                         96370021
A6DCBN DS    CL1         DCB=                                           96380021
       ORG   A6TEXT                                                     96390021
A6DECB DS    CL1         DECBADEF                                       96400021
A6DECL DS    CL3         RELLOC                                         96410021
A6DECD DS    CL1         NUMBER                                         96420021
A6DECR DS    CL2         RPD=                                           96430021
A6DECS DS    CL2         SIZE OF DECB IN WORDS                          96440021
       ORG   A6TEXT                                                     96450021
A6BLKA DS    CL1         BLKADEF                                        96460021
A6BLKL DS    CL3         RELLOC                                         96470021
A6BLKK DS    CL1         K FACTOR  BL=                                  96480021
A6BLKR DS    CL2         RPD=                                           96490021
A6BLKS DS    CL2         SIZE IN WORDS                                  96500021
       ORG   A6TEXT                                                     96510021
A6WSA  DS    CL1         W-S AREA                                       96520021
A6WSL  DS    CL3         RELLOC                                         96530021
A6WSK  DS    CL1         BL=                                            96540021
A6WSS  DS    CL3         SIZE IN WORDS                                  96550021
       ORG   A6TEXT                                                     96560021
A6COND DS    CL1         CONDEF                                         96570021
A6CONL DS    CL3         RELLOC                                         96580021
A6CONT DS    CL1         TYPE                                           96590021
A6CONS DS    CL2         SIZE                                           96600021
A6CONLV  DS    CL1      LENGTH OF VALUE FOR ALL TYPE                    96610021
A6CONV DS    CL1         * VALUE                                        96620021
       ORG   A6TEXT                                                     96630021
A6ACON DS    CL1         ACONDEF                                        96640021
A6ACOL DS    CL3         RELLOC                                         96650021
A6ACOS DS    CL1         SIZE OF ACON                                   96660021
A6ACOA DS    CL3         RELADR                                         96670021
       ORG   A6TEXT                                                     96680021
A6QD   DS    CL1         QDEF                                           96690021
A6QGN  DS    CL2         GN= OF QRTNE                                   96700021
       ORG   A6TEXT                                                     96710021
A6PNCD DS    CL1         PN EQU CODE                                    96720021
A6PNCT DS    CL1                COUNT                                   96730021
A6PNL  DS    CL2                PN=                                     96740021
A6GNR  DS    CL2                GN=                                     96750021
       ORG   A6TEXT                                                     96760021
A6GNCD DS    CL1         GN EQU CODE                                    96770021
A6GNCT DS    CL1                COUNT                                   96780021
A6GNL  DS    CL2                GN=                                     96790021
A6GNRR DS    CL2                        GN=                             96800021
       ORG   A6TEXT                                                     96810021
A6CKPT DS    CL1         CKPTDEF                                        96820021
A6CKPD DS    CL2         DCB=                                           96830021
       ORG   A6TEXT                                                     96840021
A6MSGD DS    CL1         MSGDEF                                         96850021
A6MSGN DS    CL1         LENGTH OF ELT                                  96860021
A6MSGZ DS    CL1              ZERO                                      96870021
A6MSGM DS    CL2         MSG NUMBER                                     96880021
A6MSGC DS    CL2         REC NO OF SOURCE CARD                          96890021
A6MSGS DS    CL1         HIGH 4 BITS= SEVERITY                          96900021
       ORG   A6MSGS                                                     96910021
A6MSGP DS    CL1         LOW  4 BITS= PHASE NO                          96920021
       ORG   A6TEXT                                                     96930021
A6PARD DS    CL1         MSGPAR                                         96940021
A6PARN DS    CL1         LENGTH OF PARAM                                96950021
A6PAR  DS    CL1         * PARAM                                        96960021
       ORG   A6TEXT                                                     96970021
A6CODE DS    CL1                        HEX VALUE FOR ATEXT CODES       96980021
       DS    CL124                      FOR MAX ATEXT REC               96990021
         ORG   A6TEXT                                                   97000021
A6DNID   DS    CL1                 48-ID BYTE                           97010021
A6DNCRD  DS    CL2                 CARD NUMBER                          97020021
A6DNDICT DS    CL3                 DICT PTR                             97030021
A6DNLN   DS    CL1                 LENGTH OF NAME THAT FOLLOWS          97040021
         ORG  A6TEXT                                                    97050021
A6PNID   DS    CL1                 4C-ID BYTE                           97060021
A6PNNB   DS    CL2                 PN NUMBER                            97070021
A6PNCRD  DS    CL2                 CARD NUMBER                          97080021
A6PNLN   DS    CL1                 LENGTH OF NAME THAT FOLLOWS          97090021
         ORG   A6TEXT                                                   97100021
A6FLRF DS    CL1                   B8-FILE REF ID BYTE                  97110021
A6FLDP DS    CL3                   DICTIONARY POINTER                   97120021
         SPACE 5                                                        97130021
       DROP  RB1                                                        97140021
       DROP  RB2                                                        97150021
       DROP  RB3                                                        97160021
       DROP  INPUTR                                                     97170021
       USING ERR010,RB4                                                 97180021
IKF610   CSECT                                                          97190021
    END   PHASE6                                                        97200021
