*$MODULE       PHASE50                                                  00008021
*                                                                       00016021
*                                                                       00024021
*                                                                       00032021
*                                                                       00040021
*                                                                       00048021
*                                                                       00056021
*                                                                       00064021
*                                                                       00072021
*                                                                       00080021
*                                                                       00088021
*                                                                       00096021
*                                                                       00104021
*                                                                       00112021
*                                                                       00120021
*                                                                       00128021
*                                                                       00136021
*                                                                       00144021
*                                                                       00152021
*                                                                       00160021
*                                                                       00168021
*                                                                       00176021
*                                                                       00184021
*                                                                       00192021
*                                                                       00200021
IKF501 START 0                         PHASE50                          00208021
         ENTRY PHASE50                                                  00216021
       IHBCOB                                                           00224021
IKF501   CSECT                                                          00232021
COMON1 EQU   *                                                          00240021
*                                      THE FOLLOWING FIELDS ARE FOR     00248021
*                                      IDENTIFICATION PURPOSES ONLY     00256021
         DC    C'IKFCBL50'             X                                00264021
         DC    C'B'                    X                                00272021
         DC    AL1(40)             X                                    00280021
         TITLE 'PHASE 5 - A BRIEF DESCRIPTION'                          00288021
*=1       PH5 C O N T R O L .                                           00296021
*=3                                                                     00304021
*TITLE 'PH5     '                                                       00312021
*STATUS: CHANGE LEVEL 000                                               00320021
*FUNCTION/OPERATION: OBTAIN IC TEXT FROM 'PH4     ' AND CONVERT IT      00328021
*   A-TEXT ACCEPTABLE TO 'PH6     '.                                    00336021
*            ORGANIZATION OF PHASE...                                   00344021
*              PH5CTL PHASE 5 CONTROL. OBTAINS IC-TEXT AND PROCESSE     00352021
*                     ALL BUT VERB-STRINGS WHICH ARE ROUTED TO PROP     00360021
*                     VERB ANALYZERS.                                   00368021
*              A-TEXT GENERATOR. HAS ENTRY POINTS FOR MOST MACHINE      00376021
*                     INSTRUCTIONS AND BUILDS A-TEXT (PROCEDURE AND     00384021
*                     OPTIMIZATION) BASED UPON VARIOUS PARAMETERS       00392021
*                     PROVIDED IT BY THE CALLING ANALYZER OR SUBRTN     00400021
*                     SUPPLEMENTAL TO THIS PORTION IS                   00408021
*                     THE DIRECT-PROCEDURE-A-TEXT GENERATOR,            00416021
*                     A SUBROUTINE.                                     00424021
*              VERB-ANALYZERS. SEPERATE ANALYZERS OBTAIN STRINGS FO     00432021
*                     THEIR PARTICULAR VERBS AND GENERATES A-TEXT       00440021
*                     REPRESENTING OBJECT CODE FOR THE STATEMENT.       00448021
*              SUBROUTINES. NUMEROUS SERVICE SUBROUTINES SUPPORT        00456021
*                     ALL OTHER PARTS OF THE PHASE.                     00464021
*              SUBSCRIPTS AND SUBSCRIPT REGISTER ALLOCATION ARE HAN     00472021
*                     BY SEVERAL SUBROUTINES AND ANALYZERS.             00480021
*              TAMER TABLE AND COMMON ARE COMMUNICATION REGIONS IN      00488021
*                     MAIN-STORAGE THAT ARE USED FOR INTER-PHASE        00496021
*                     INFORMATION-PASSING, AND ARE NOT PART OF PHAS     00504021
         SPACE 3                                                        00512021
*ENTRY POINTS:                                                          00520021
*        'PH5     ' MAIN ENTRY POINT, CALLED BY 'PH0     '.             00528021
*INPUT:              IC-TEXT   SYSUT2                                   00536021
*                     COMMON    MAIN-STORAGE                            00544021
*OUTPUT:             PROCEDURE A-TEXT   SYSUT1                          00552021
*                     OPTIMIZATION A-TEXT SYSUT3                        00560021
*                     E-TEXT (ERR MESG'S) SYSUT4                        00568021
*                     COMMON              MAIN-STORAGE                  00576021
*                     TABLE: PNUTBL       MAIN-STORAGE (TAMER)          00584021
*EXTERNAL ROUTINES:                                                     00592021
*        'PH0     '   CALLS THIS PHASE AND PROVIDES I/O, COMMON + T     00600021
*                     SUPPORT.                                          00608021
*EXITS-NORMAL:  N/A                                                     00616021
*EXITS-ERROR:   N/A                                                     00624021
*TABLES/WORK AREAS:    ... THOSE ITEMS THAT ARE VARIABLE OR MIXED       00632021
*                          CONSTANT-VARIABLE ARE COLLECTED TOGETHER     00640021
*                          IN AN AREA UNDER BASE REG XRDATA.            00648021
*                      ... THOSE ITEMS THAT ARE NON-INSTRUCTIONS AN     00656021
*                          FULLY CONSTANTS ARE COLLECTED UNDER BASE     00664021
*                          REG XRCONS.                                  00672021
*                                                                       00680021
*ATTRIBUTES: NON-REUSABLE (DUE TO SOME NON-INITIALIZED SWITCHES).       00688021
*NOTES: N/A                                                             00696021
         TITLE 'PH5CTL - PHASE 5 CONTROL ROUTINE'                       00704021
       USING   COMON1,XRBAS1                                            00712021
       USING   COMON2,RB1                                               00720021
       USING   COMON3,GBRG1                                             00728021
       USING   COMON4,XRCONS                                            00736021
       USING   COMON5,XRDATA                                            00744021
       USING COS,XRBAS2                                                 00752021
*                             PH5CTL                                    00760021
*******************************************************************     00768021
* CHECKS THE INPUT OF PHASE 5 TO DETERMINE WHETHER IT IS A 'STRING'     00776021
* OR 'OTHER THAN A STRING'. PUTS 1ST 4 BYTES IN 'HEADER'.               00784021
* I. IF THE INPUT IS A 'STRING' -                                       00792021
*    A. THE STRING HEADER (A 3 BYTE FIELD) IS STORED IN 'HEADER'.       00800021
*       'HEADER+1' IS CALLED 'ANALNO' (ANALYZER NUMBER).                00808021
*       'HEADER+2' IS CALLED 'ELEMCT' (ELEMENT COUNT).                  00816021
*    B. THE ELEMENTS IN THE STRING ARE PUT IN 'ELEMTB' (ELEMENT TAB     00824021
*    C. AFTER ALL ELEMENTS IN A STRING HAVE BEEN STORED IN 'ELEMTB'     00832021
*       CONTROL PASSES TO A STRING ANALYZER.                            00840021
*    D. AFTER AN ANALYZER HAS PROCESSED THE ELEMENT TABLE CONTROL I     00848021
*          RETURNED TO PH5CTL                                           00856021
* II. IF THE INPUT IS 'OTHER THAN A STRING' -                           00864021
*    A. IF THE INPUT IS A SECTION OR PARAGRAPH NAME IT IS WRITTEN O     00872021
*       AND CONTROL IS RETURNED TO 'SEARCH'. (INPUT IS IN 'HEADER')     00880021
*    B. IF THE INPUT IS 'EOF' A DUMP IS TAKEN AND PROCESSING IS END     00888021
*    C. II(A) AND II(B) WILL BE SPECIFIED IN MORE DETAIL LATER.         00896021
*******************************************************************     00904021
*******************************************************************     00912021
*                                                                       00920021
*                                                                       00928021
*                                                                       00936021
*                                                                       00944021
         TITLE 'IKFCBL50: PH5CTL - PHASE 50 CONTROL ROUTINE'            00952021
PH5CTL   DS    0H                                                       00960021
         MVI   CDNOSW,XX00                                              00968021
       BAL   RETRG,GETNXT    *LOCATE NEXT ELEMENT TO BE PROCESSED       00976021
         MVC   ASRLAS(LX1),DX0(RW2)    FOR AUTOMATIC STOP RUN           00984021
         CLI   DX0(RW2),XX84   TEST IF ELEMENT IS STRING HEADER         00992021
         BNE   CTLCPY                  NO                               01000021
         MVC   HEADER(LX4),DX0(RW2) SAVE HEADER                         01008021
         XC    XSID1(LX20),XSID1                                   7898 01016021
         MVC   GANLNO(LX1),HEADER+NX1   SAVE ANALYZER NO                01024021
         CLI   GANLNO,XX39         IS IT SUBSCRIPTED ITEM         40317 01032021
         BNE   CTL501              NO,  BRANCH                    40317 01040021
         CLI   I3927,XX39          IS THIS THE FIRST SUBSCRIPTED  40317 01048021
         BE    CTL502          NO, IT IS SECOND TIME THEN BRANCH  40317 01056021
         MVI   I3927,XX39          YES, INDICATE SUBSCRIPTED ITEM 40317 01064021
         B     CTL503              YES  BRANCH                    40317 01072021
CTL501   DS    0H                                                 40317 01080021
         CLI   GANLNO,XX27         EXHIBIT ITEM                   40317 01088021
         BNE   CTL502              NO,  BRANCH                    40317 01096021
         MVI   I3927+NX1,XX27      YES,  INDICATE EXHIBIT ITEM    40317 01104021
         B     CTL503              THEN BRANCH                    40317 01112021
CTL502   DS    0H                                                 40317 01120021
         MVC   I3927(LX2),XC000    SET TO ZEROS ONLY IF NO 39 OR 27     01128021
CTL503   DS    0H                                                 40317 01136021
       LA    RW4,DOP1        *SET RW4 TO ADDRESS OF FIRST OPD AREA      01144021
       SR    RW5,RW5                                                    01152021
         CLI   DX1(RW2),XX70           SEGM VERB                        01160021
         BE    PH5CT0                  YES                              01168021
         IC    RW5,HEADER+NX2  GET COUNT OF OPDS TO RW1                 01176021
       LTR   RW5,RW5          TEST IF COUNT IS ZERO                     01184021
         BZ    PH5CT0                  YES, BYPASS LOOP                 01192021
*                               NO, LOOP TO GET OPDS TO OPD AREAS       01200021
CTLLP  BAL   RETRG,GETNXT    *GET TO NEXT OPD                           01208021
       BCTR  RW3,RW0            DECR LENGTH BY 1 FOR EX INSTR           01216021
       EX    RW3,CTLMVC       EX TO MOVE OPD FROM BUFFER TO OPD ARE     01224021
         CLC   I3927(LX2),XX3927   SUBSCRIPTED AND EXHIBIT ITEMS  40317 01232021
         BNE   CTL504              BOTH ITEMS ARE NOT FOUND       40317 01240021
         CLI   DX0(RW4),XX31       IS IS 31 ITEM - SUBSCRIPTED    40317 01248021
         BNE   CTL504            NO, IT IS NOT                    40317 01256021
         MVI   DX0(RW4),XX30       YES,   CHANGE TO DATA ITEM     40317 01264021
         MVI   I3927+NX1,XX00      RESET EXHIBIT INDICATOR        40317 01272021
CTL504   DS    0H                                                 40317 01280021
       BAL   XRSUB,XIS31                UPDATE SUBSCRIPTED ITEM.        01288021
       LA    RW4,OPSIZ(RW4)   STEP ADDR TO NEXT OPD AREA FOR NEXT E     01296021
       BCT   RW5,CTLLP        LOOP ON COUNT OF OPDS                     01304021
PH5CT0 IC    RW5,GANLNO     *PUT ANALYZER NUMBER IN REG                 01312021
         SLL   RW5,DX2         MULTIPLY BY 4 TO USE AS INDEX            01320021
       L     GVERB,ADCN00(RW5)     PICK UP ADCON                        01328021
         BR    GVERB                   GO TO ANALYZER                   01336021
CTLMVC   MVC   DX0(LX0,RW4),DX0(RW2)                                    01344021
       SPACE 5                                                          01352021
CTLCPY   CLI   DX0(RW2),PNDEF            IF NOT PN, GN, OR VN           01360021
         BE    GOPUT                   YES                              01368021
         CLI   DX0(RW2),GNDEF                                           01376021
         BE    GNPROC              IF GN DEF, WRITE A TEXT              01384021
         CLI   DX0(RW2),VNDEF                                           01392021
         BE    GNPROC                  YES                              01400021
         CLI   DX0(RW2),DUMMYPN        IS IT DUMMY PN...           2962 01408021
         BNE   PH5CTL                  NO                               01416021
GNPROC   EQU   *                                                        01424021
GOPUT    BAL   RETRG,KILSUB             KILL SUBS OPTIMIZATION TABL     01432021
         BAL   RW0,WRITE2              WRITE DEF                        01440021
         B     PH5CTL              GET NEXT P2 TEXT                     01448021
       EJECT                                                            01456021
* ROUTINE TO GET NEXT LOGICAL ELEMENT                                   01464021
GETNXT ST    RETRG,GETSAV     SAVE RETURN ADDR                          01472021
GET    L     RW2,PNTIN       *LOAD RW2 WITH ADDR OF CURRENT ELEMENT     01480021
       AH    RW2,BYTCNT       ADD LENGTH OF CURRENT ELEMENT             01488021
       ST    RW2,PNTIN        SAVE ADDR OF NEW ELEMENT                  01496021
       SR    RW3,RW3                                                    01504021
GET1     IC    RW3,DX1(RW2)   *GET COUNT IN CASE IT FOLLOWS CODE        01512021
         TM    DX0(RW2),XXC0   TEST IF COUNT IN CODE OF FOLLOWING CO    01520021
         BZ    GET2                    COUNT FOLLOWS CODE               01528021
         IC    RW3,DX0(RW2)    GET COUNT AS INDICATED IN CODE. THIS     01536021
         SRL   RW3,DX6           COUNT IS 1 LESS THAN COUNT FOR ENTI    01544021
       BCTR  RW3,RW0              ELEMENT. DECR BY 1 THEN ADD 2.        01552021
GET2     LA    RW3,DX2(RW3)    ADD 2 TO COUNT TO GET COUNT FOR ENTIR    01560021
       STH   RW3,BYTES          ELEMENT                                 01568021
       STH   RW3,BYTCNT       SAVE COUNT                                01576021
         TM    DX0(RW2),XXFF  *TEST IF ELEMENT IS END-OF-RCD MARKER     01584021
         BO    GET5                    YES                              01592021
         BZ    GET9                    ERR MSG ELEMENT                  01600021
         CLI   DX0(RW2),MATEXT     LISTING A-TEXT                       01608021
         BE    GET12               YES                                  01616021
         CLI   DX0(RW2),MCARD      IS ELEMENT A CARD NUMBER             01624021
         BE    GET7                    YES                              01632021
         CLI   DX0(RW2),XXC8       SPECIAL FILE REF ELEMENT             01640021
         BE    GET11               YES, COPY AS PROCEDURE A-TEXT        01648021
         CLI   DX0(RW2),XX42   TEST IF CRITICAL BREAK                   01656021
         BNE   GET8                    NO                               01664021
         CLI   DX1(RW2),XX0A                                            01672021
         BNE   GET10               NO                             7898  01680021
       BAL   RETRG,KILSUB          KILL SUB OPTIMIZATION TBL            01688021
       OI    QRTNSW,MSWON          FLAG THAT Q-RTN'S HAVE STARTED       01696021
GET10    DS    0H                                                  7898 01704021
         BAL   RW0,WRITE2              WRITE BREAK                      01712021
         B     GET                     GOBACK                           01720021
GET6   BAL   RETRG,PUTA      *PUT ELEMENT                               01728021
         B     GET                     GET NEXT P2 ELEMENT              01736021
GET11    DS    0H                                                       01744021
         MVC   FILEREF1(LX3),DX1(RW2)   MOVE DICT PTR FOR FILE          01752021
         LA    RW3,LX8             COUNT OF ENTIRE ELEMENT              01760021
         LA    RW2,FILEREF         ADDRESS OF TEXT                      01768021
         BAL   RW0,WRITP2          WRITE PROCEDURE A TEXT               01776021
         B     GET                 GET NEW ELEMENT                      01784021
GET8   L     RETRG,GETSAV    *EXIT                                      01792021
         BR    RETRG                   EXIT FROM PHASE 5                01800021
GET7     MVI   CDNOSW,XX01    *SET ON CARD NUMBER SWITCH                01808021
         MVI   DX0(RW2),XX2C   REPLACE CODE WITH ATEXT CODE             01816021
         MVC   CARDNO(LX2),DX1(RW2)                                     01824021
         B     GET6                    WRITE ATXT ELEMENT               01832021
GET9     EQU   *                                                        01840021
GET9A  BAL   RETRG,PUTMSG         PUT ERROR MESSAGE                     01848021
         B     GET                     GET NEXT P2 ELEMENT              01856021
GET5   BAL   RW0,READ1      *READ NEXT RECORD                           01864021
         BZ    EOFIN                   TEST FOR EOF                     01872021
       LR    RW2,RW0          PUT RCD ADDR IN RW2                       01880021
       ST    RW2,PNTIN        SAVE RCD ADDR                             01888021
       SR    RW3,RW3          ZERO RW3 (INDICATING NO BYTES PROCESS     01896021
       STH   RW3,BYTCNT         ZERO BYTCNT FOR SAME REASON             01904021
         B     GET1                    EXIT                             01912021
GET12    MVI   DX0(RW2),XX7C       REPLACE A-TEXT CODE FOR PHASE 6      01920021
         B     GET6                PUT ELEMENT                          01928021
       SPACE 5                                                          01936021
EOFIN    EQU   *                                                        01944021
EOFFF    EQU   *                                                        01952021
         CLC   SUBCTR,XC0255       MORE THAN 255 SUBSCRIPT CELLS        01960021
         BNH   EOFIN1                  NO                               01968021
         BAL   XRSUB,ERRPRO        YES - SEND ERROR MESSAGE 16          01976021
         DC    AL1(ERRN16)                                              01984021
         DC    AL1(4)                                                   01992021
EOFIN1 EQU   *                                                          02000021
       L     RW1,XAAVAL                                                 02008021
       L     XRVAR,XTABL                                                02016021
       BALR  RETRG,XRVAR           RELEASE AVAIL TBL LIST               02024021
       L     RW1,XAINTR                                                 02032021
       L     XRVAR,XTABL                                                02040021
       BALR  RETRG,XRVAR           RELEASE INT RES TBL LIST             02048021
       L     RW1,XASCRP                                                 02056021
       L     XRVAR,XTABL                                                02064021
       BALR  RETRG,XRVAR           RELEASE SUBSCRIPT TABLE              02072021
       L     RW1,XASNT                                                  02080021
       L     XRVAR,XTABL                                                02088021
       BALR  RETRG,XRVAR           RELEASE SUBS ID-TABLE                02096021
NORERUNI DS    0H                                                       02104021
       BALR  RW0,XRBAS2             RETURN TO PHASE0                    02112021
       DC    X'A0'                                                      02120021
         TITLE 'COMMON SUBROUTINES'                                     02128021
PUTVIR LH    RW1,VIRCTR       STEP VIRCTR                               02136021
         LA    RW1,DX1(RW1)                                             02144021
       STH   RW1,VIRCTR                                                 02152021
       BAL   RW0,WRITE2       PUT VIRDEF ELEMENT ON F2                  02160021
         BR    RETRG                   RETURN TO CALLER                 02168021
       SPACE 5                                                          02176021
PUTLTL LH    RW1,LTLCTR       STEP LTLCTR                               02184021
         LA    RW1,DX1(RW1)                                             02192021
       STH   RW1,LTLCTR                                                 02200021
         BALR  RW0,XRBAS2              WRITE OPT A TEXT                 02208021
         DC    X'13'                   FILE 3                           02216021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     02224021
       SPACE 5                                                          02232021
PUTMSG BAL   RW0,WRITE4            WRITE ERROR MESSAGE                  02240021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     02248021
       SPACE 5                                                          02256021
PUTA   STM   RETRG,RW3,PUTSAV                                           02264021
PUTA2    BAL   RW0,WRT2PA              WRITE PROC A TEXT ON FILE 2      02272021
       LM    RETRG,RW3,PUTSAV                                           02280021
       BCR   UNCOND,RETRG     EXIT                                      02288021
PH5AMV   STC   RW3,PH5ACD+NX1          STORE CT                         02296021
         BCTR  RW3,RW0                 SUBT 1 FROM CT FOR EX            02304021
         EX    RW3,MVTEXT              MOVE TEXT                        02312021
         LA    RW2,PH5ACD              ADDR OF TEXT                     02320021
         LA    RW3,DX3(RW3)            ADD 3 FOR TOTAL CT               02328021
         BR    RW1                     RETURN                           02336021
*                                                                       02344021
PH5ACD   DC    2X'00'                  CODE                             02352021
PH5ATX   DC    254X'00'                TEXT                             02360021
MVTEXT   MVC   PH5ATX(LX0),DX0(RW2)                                     02368021
       SPACE 5                                                          02376021
       SPACE 5                                                          02384021
READ1  ST    RW0,WRITES                                                 02392021
       BALR  RW0,XRBAS2            BRANCH TO READ ROUTINE               02400021
         DC    X'01'                   READ P2 TEXT FROM FILE 1         02408021
       L     RW1,WRITES                                                 02416021
         BCR   R15,RW1                  RETURN TO CALLER                02424021
*WRITE1 ST    RW0,WRITES                                                02432021
*       BALR  0,10                                                      02440021
*       DC    X'11'                                                     02448021
*       L     RW1,WRITES                                                02456021
*       BCR   15,RW1                                                    02464021
WRITE2 ST    RW0,WRITES                                                 02472021
         STM   RW2,RW3,PUTSAV                                           02480021
         BAL   RW1,PH5AMV              MOVE TEXT                        02488021
         MVI   PH5ACD,XX27             CODE FOR OPT ATEXT               02496021
         BALR  RW0,XRBAS2              WRITE                            02504021
         DC    X'12'                   FILE 2                           02512021
*DEL                                                                    02520021
         LM    RW2,RW3,PUTSAV                                           02528021
       L     RW1,WRITES                                                 02536021
         BCR   R15,RW1                  RETURN TO CALLER                02544021
WRITE4 ST    RW0,WRITES                                                 02552021
         STM   RW2,RW3,PUTSAV                                           02560021
         BAL   RW1,PH5AMV              MOVE TEXT                        02568021
         MVI   PH5ACD,XX29             CODE FOR ETEXT                   02576021
         BALR  RW0,XRBAS2              WRITE                            02584021
         DC    X'12'                   FILE 2                           02592021
         LM    RW2,RW3,PUTSAV                                           02600021
       L     RW1,WRITES                                                 02608021
         BCR   R15,RW1                 RETURN                           02616021
WRT2PA   ST    RW0,WRITES                                               02624021
         BAL   RW1,PH5AMV              MOVE TEXT                        02632021
         MVI   PH5ACD,XX28             MOVE CODE FOR PROC ATEXT         02640021
         BALR  RW0,XRBAS2              WRITE ON                         02648021
         DC    X'12'                            FILE 2                  02656021
         L     RW1,WRITES                                               02664021
         BR    RW1                     RETURN                           02672021
WRITP2   ST    RW0,WRITES                                               02680021
         BALR  RW0,XRBAS2              WRITE                            02688021
         DC    X'12'                         FILE 2                     02696021
         L     RW1,WRITES                                               02704021
         BR    RW1                     RETURN                           02712021
PH5BVB   SR    RW5,RW5                 CLEAR REG                        02720021
       IC    RW5,GANLNO                GET VERB NO                      02728021
       LA    RW1,BYTE5B                                                 02736021
       AR    RW5,RW1                   ADDR OF FLAG BYTE FOR VERB       02744021
         TM    DX0(RW5),XX80            GO TO DFREER                    02752021
         BZ    BVB1                     NO                              02760021
         BAL   RETRG,DFREER             YES                             02768021
BVB1     EQU   *                        WRITE                           02776021
         LA    RW2,HEADER                    HEADER                     02784021
         LA    RW3,DX3                  LENGTH                          02792021
       BAL   RW0,WRITP2                WRITE HEADER                     02800021
         CLI   HEADER+NX1,XX70          SEGINT                          02808021
       BE    PH5CTL                    YES                              02816021
         LA    RW2,DOP1                 GET ADDR OF DOP1                02824021
         SR    RW4,RW4                                                  02832021
         SR    RW3,RW3                                                  02840021
         IC    RW4,HEADER+NX2            GET CT OF DOPS                 02848021
       LTR   RW4,RW4                   NO DOPS                          02856021
       BZ    BVB16                     YES                              02864021
         B     BVB2A                    GO GET CT                       02872021
BVB2     LA    RW2,OPSIZ(RW2)                                           02880021
BVB2A    IC    RW3,DX1(RW2)              LENGTH OF DOP                  02888021
         TM    DX0(RW2),XXC0            IS COUNT IN NEXT BYTE           02896021
       BZ    BVB20                     YES                              02904021
         IC    RW3,DX0(RW2)             NO-GET COUNT FROM CODE          02912021
         SRL   RW3,DX6                                                  02920021
       BCTR  RW3,RW0                    SUBT 1                          02928021
BVB20    LA    RW3,DX2(RW3)             ADD 2 TO GET TOTAL COUNT        02936021
       BAL   RW0,WRITP2                WRITE DOP                        02944021
         BCT   RW4,BVB2                 BRANCH ON CT OF DOPS            02952021
BVB16    TM    DX0(RW5),XX20            GO TO XSPRO                     02960021
         BZ    BVB3                     NO                              02968021
         CLI   GANLNO,XX60         SET VERB                       42034 02976021
         BNE   BVB17               NO                             42034 02984021
         LA    RW3,DOP1                                           42034 02992021
         CLI   DOP1,XX30           DATANAME...                    42034 03000021
         BNE   BVB17               NO                             42034 03008021
         TM    DOP1+NX3,XX70       INDEX DATA-ITEM...             42034 03016021
         BNO   BVB6                YES                            42034 03024021
BVB17    DS    0H                                                 42034 03032021
         CLI   GANLNO,XX1D               MOVE VERB                      03040021
         BE    BVB4                     YES                             03048021
         CLI   GANLNO,XX1E               EXAMINE                        03056021
         BE    BVB5                     YES                             03064021
         CLI   GANLNO,XX1F               TRANSFORM                      03072021
         BE    BVB4                     YES                             03080021
         CLI   GANLNO,XX2A         RETURN...                            03088021
         BNE   PH5CTL              NO                                   03096021
         CLI   DOP1,MSFN           SORT FILE NAME                       03104021
         BE    BVB4                YES                                  03112021
       B     PH5CTL                     EXIT                            03120021
BVB3     TM    DX0(RW5),XX40            GO TO KILSUB                    03128021
         BZ    BVB7                     NO                              03136021
         BAL   RETRG,KILSUB             YES                             03144021
       B     PH5CTL                    NO                               03152021
BVB7     TM    DX0(RW5),XX08            KILSUB FOR SORT/OPEN/CLOSE      03160021
         BZ    BVB8                     NO                              03168021
         CLI   GANLNO,XX36               SORT                           03176021
         BE    BVB10                    YES                             03184021
         CLC   DOP1(LX2),CBFRST          IS IT FIRST                    03192021
       BNE   PH5CTL                    NO                               03200021
         TM    BVBSW,XX40                YES- IS IT ORIG FIRST          03208021
         BO    BVB9                     NO-IT IS DUPLICATE FIRST        03216021
         OI    BVBSW,XX40                YES-TURN SWON                  03224021
         BAL   RETRG,KILSUB             KILSUB                          03232021
       B     PH5CTL                    NO                               03240021
BVB9     NI    BVBSW,XXBF                TURN SW OFF                    03248021
       B     PH5CTL                    NO                               03256021
BVB10    CLC   DOP1(LX2),CBFRST          IS IT FIRST                    03264021
       BNE   PH5CTL                    NO                               03272021
         BAL   RETRG,KILSUB             KILL SUBSCRIPT TBL              03280021
       B     PH5CTL                    NO                               03288021
BVB4   LA    RW3,DOP2             ALPHA MOVE TRANSFER.                  03296021
BVB6   BAL   RETRG,XSPRO                CHECK QRTNS                     03304021
         B     BVB3                     CONTINUE                        03312021
BVB5   LA    RW3,DOP4                  EXAMINE                          03320021
         B     BVB6                     CONTINUE                        03328021
BVB8     TM    DX0(RW5),XX10            KILSUB FOR CALL/LINK/ENTRY      03336021
         BZ    BVB11                    NO                              03344021
         CLC   DX0(LX2,RW2),CBEND        END                            03352021
       BNE   PH5CTL                    NO                               03360021
         BAL   RETRG,KILSUB             KILL SUBSCRIPT TBL              03368021
BVB11    TM    DX0(RW5),XX04            KILSUB FOR READ-WRITE/REW       03376021
         BZ    PH5CTL                   EXIT                            03384021
         CLI   GANLNO,XX20              READ                            03392021
         BE    BVB15                    YES                             03400021
         CLC   DOP4(LX2),ONZERO          WRITE/REWRITE-IS MOVE COMING   03408021
         BNE   BVB12                    YES-BVB12                       03416021
BVB14    BAL   RETRG,KILSUB             NO                              03424021
         B     PH5CTL                   EXIT                            03432021
BVB12    TM    BVBSW,XX20                IS IT FIRST STRING             03440021
         BO    BVB13                    NO                              03448021
         OI    BVBSW,XX20                YES-TURN SW ON                 03456021
         B     PH5CTL                   EXIT                            03464021
BVB13    NI    BVBSW,XXDF                TURN SW OFF                    03472021
         B     BVB14                    GO TO KILSUB                    03480021
BVB15    CLC   DOP5(LX2),ONZERO          IS MOVE COMING IN READ         03488021
         BNE   BVB12                    YES                             03496021
         B     BVB14                    NO                              03504021
WRPH4G   STM   R14,RW3,XGGLO                                            03512021
         LA    RW3,DX3                  LENGTH                          03520021
       LA    RW2,PH4GN                  ADDRESS                         03528021
       BAL   RW0,WRITE2                 WRITE                           03536021
         LM    R14,RW3,XGGLO                                            03544021
       BR    RETRG                      RETURN                          03552021
XGGLO    DS    6F                       SAVE AREA                       03560021
R14      EQU   14                                                       03568021
PH4GN  DC    X'880000'                       PH4 GN DEF                 03576021
BVBSW    DC    X'00'                    SWITCH                          03584021
*        BIT 0 SW IS PUT ON, IF READ        HAS 2 STRINGS               03592021
*        BIT 1 SW IS PUT ON,FOR OPEN/CLOSE FIRST STRING OF FIRST GROUP  03600021
*        BIT 2 SW IS PUT ON,FOR 1ST STRING READ/WRITE/REWRITE           03608021
BYTE5B   EQU   *                                                        03616021
*        BIT 0 DFREE (BEFORE WRITE OF STRING)                           03624021
*            1 KILSUB                                                   03632021
*            2 XSSPRO (AFTER WRITE OF STRING)                           03640021
*            3 KILSUB AFTER END IN LAST STRING (CALL,LINK)              03648021
*            4 KILSUB AFTER 1ST STRING (SORT/OPEN/CLOSE-DOP1=FIRST)     03656021
*            5 KILSUB IF DOP 4 OR 5 = 0. IF #0, SET SW ON. TEST SW      03664021
*              IF ON,TURN OFF, KILSUB. (READ/WRITE/REWRITE)             03672021
*            6                                                          03680021
*            7                                                          03688021
         DC    12X'00'                  VERBS                           03696021
         DC    4X'80'                   PALFA,NALFA,PNUMRC,NNUMRC       03704021
         DC    X'40'                    STOP                            03712021
         DC    2X'80'                   GO,GODEP1                       03720021
         DC    3X'00'                   VERBS                           03728021
         DC    6X'80'                  PEQNNU,NEQNNU,PGTNNU,NGTNNU,     03736021
*                                      PLTNNU,NLTNNU                    03744021
         DC    X'00'                    VERBS                           03752021
         DC    3X'A0'                   MOVE,EXAMIN,TRANSFORM           03760021
       DC    X'84'                     READ                             03768021
         DC    X'88'                    OPEN                            03776021
       DC    X'88'                     CLOSE                            03784021
       DC    X'84'                     WRITE                            03792021
       DC    X'84'                     REWRITE                          03800021
         DC    X'C0'                    ACCEPT                          03808021
         DC    X'80'                    DISPLAY                         03816021
         DC    X'80'                    EXHIBIT                         03824021
         DC    2X'00'                   VERBS                           03832021
         DC    X'E0'               RETURN                               03840021
         DC    X'40'                    ON                              03848021
       DC    X'40'                     ENTRY                            03856021
       DC    X'90'                     CALL                             03864021
         DC    X'00'                    VERBS                           03872021
         DC    2X'40'                   PROCESS/HOLD                    03880021
         DC    5X'00'                   VERBS                           03888021
         DC    X'88'               SORT                                 03896021
         DC    X'40'                    RELEASE                         03904021
       DC    X'40'                     PERFORM                          03912021
       DC    X'00'                      VERBS                           03920021
         DC  X'90'                     LINK                             03928021
         DC    2X'00'                   VERBS                           03936021
         DC    X'80'                    TRACE                           03944021
         DC    17X'00'                  VERBS                           03952021
         DC    X'40'                    RPTCAL                          03960021
         DC    12X'00'                  VERBS                           03968021
         DC    X'80'                    RPTORG                          03976021
         DC    2X'00'                   VERBS                           03984021
         DC    X'00'                    VERBS                           03992021
         DC    X'C0'               SET1                           60613 04000021
       DC    X'C0'                     SET2UP                           04008021
         DC    X'00'                    FREE                            04016021
         DC    X'80'                    SEEK                            04024021
         DC    X'80'                    START                           04032021
       DC    X'A4'                     READFUPD                         04040021
         DC    6X'00'              INDEX COMPARES                 51894 04048021
         DC    X'00'                    VIRTDEF                         04056021
         DC    X'00'                    EQUSCHR                         04064021
       DC    X'C0'                     SET2DOWN                         04072021
         DC    X'80'                    SEGCAL                          04080021
         DC    7X'00'                   VERBS                           04088021
PALFA    EQU   PH5BVB                                                   04096021
NALFA    EQU   PH5BVB                                                   04104021
PNUMRC EQU   PH5BVB                                                     04112021
NNUMRC   EQU   PH5BVB                                                   04120021
STOP     EQU   PH5BVB                                                   04128021
GO       EQU   PH5BVB                                                   04136021
GODEP1   EQU   PH5BVB                                                   04144021
GODEPM EQU   PH5BVB                                                     04152021
GODEPL   EQU   PH5BVB                                                   04160021
PEQNNU   EQU   PH5BVB                                                   04168021
NEQNNU   EQU   PH5BVB                                                   04176021
PGTNNU   EQU   PH5BVB                                                   04184021
NGTNNU   EQU   PH5BVB                                                   04192021
PLTNNU   EQU   PH5BVB                                                   04200021
NLTNNU   EQU   PH5BVB                                                   04208021
MOVE4    EQU   PH5BVB                                                   04216021
EXAMIN   EQU   PH5BVB                                                   04224021
TRANSF   EQU   PH5BVB                                                   04232021
READ     EQU   PH5BVB                                                   04240021
OPEN     EQU   PH5BVB                                                   04248021
CLOSE    EQU   PH5BVB                                                   04256021
*DEL                                                                    04264021
*DEL                                                                    04272021
ACCEPT   EQU   PH5BVB                                                   04280021
DISPLA   EQU   PH5BVB                                                   04288021
EXHIBI   EQU   PH5BVB                                                   04296021
RESET    EQU   PH5BVB                                                   04304021
READY    EQU   PH5BVB                                                   04312021
RETURN   EQU   PH5BVB                                                   04320021
ON       EQU   PH5BVB                                                   04328021
ENTRY    EQU   PH5BVB                                                   04336021
CALL     EQU   PH5BVB                                                   04344021
ENTER    EQU   PH5BVB                                                   04352021
PROCES   EQU   PH5BVB                                                   04360021
HOLDD    EQU   PH5BVB                                                   04368021
USE      EQU   PH5BVB                                                   04376021
EXIT     EQU   PH5BVB                                                   04384021
RPTNOP   EQU   PH5BVB                                                   04392021
SORT     EQU   PH5BVB                                                   04400021
RELEES   EQU   PH5BVB                                                   04408021
PERFOR   EQU   PH5BVB                                                   04416021
LINKK    EQU   PH5BVB                                                   04424021
ADEBUG   EQU   PH5BVB                                                   04432021
TRACE    EQU   PH5BVB                                                   04440021
EQUATE   EQU   PH5BVB                                                   04448021
QINITV   EQU   PH5BVB                                                   04456021
QINCRA   EQU   PH5BVB                                                   04464021
QSTEPV EQU   PH5BVB                                                     04472021
QUPDAT   EQU   PH5BVB                                                   04480021
USE5     EQU   PH5BVB                                                   04488021
ENDUS5   EQU   PH5BVB                                                   04496021
USE1     EQU   PH5BVB                                                   04504021
ENDUS1   EQU   PH5BVB                                                   04512021
USE3     EQU   PH5BVB                                                   04520021
ENDUS4   EQU   PH5BVB                                                   04528021
QCALLV EQU   PH5BVB                                                     04536021
QRET2V   EQU   PH5BVB                                                   04544021
QRETUV   EQU   PH5BVB                                                   04552021
RPTCAL   EQU   PH5BVB                                                   04560021
RPTSV    EQU   PH5BVB                                                   04568021
RPTRET EQU   PH5BVB                                                     04576021
RPTORG   EQU   PH5BVB                                                   04584021
SEGINT   EQU   PH5BVB                                                   04592021
RPTRRG   EQU   PH5BVB                                                   04600021
SET1     EQU   PH5BVB                                                   04608021
SET2UP   EQU   PH5BVB                                                   04616021
FREE     EQU   PH5BVB                                                   04624021
SEEK     EQU   PH5BVB                                                   04632021
START    EQU   PH5BVB                                                   04640021
READFUPD EQU   PH5BVB                                                   04648021
VIRTDEF EQU  PH5BVB                                                     04656021
SET2DOWN EQU   PH5BVB                                                   04664021
SEGCAL   EQU   PH5BVB                                                   04672021
READCHCK EQU   PH5BVB                                                   04680021
GOBACK   EQU   PH5BVB                                                   04688021
EXITPGM  EQU   PH5BVB                                                   04696021
CHCKPNT  EQU   PH5BVB                                                   04704021
*DEL                                                               5189 04712021
WRITCHCK EQU   PH5BVB                                                   04720021
BEGRPD EQU   PH5BVB                                                     04728021
POVFLO EQU   PH5BVB                                                     04736021
*DEL                                                               5189 04744021
*DEL                                                               5189 04752021
*DEL                                                               5189 04760021
*DEL                                                               5189 04768021
*DEL                                                               5189 04776021
*DEL                                                               5189 04784021
         EJECT                                                    51894 04792021
* THIS ROUTINE WILL INITIALIZE THE GENERAL REGISTER TABLES              04800021
*     ENTRY POINTS - 1) XINITM - WILL INITIALIZE REGARDLESS             04808021
*                               OF ANYTHING                             04816021
*                    2) XINITN - WILL INITIALIZE IF NOT USED            04824021
*                               FOR SUBSCRIPT COMPUTATIONS              04832021
       SPACE 2                                                          04840021
XINITM   DS    0H                                                       04848021
         MVI   XXXYY,XX00      SET XXXYY = 0                            04856021
       B     XINIT1           BEGIN                                     04864021
       SPACE 1                                                          04872021
XINITN EQU   *                                                          04880021
         MVI   XXXYY,XX01      SET XXXYY = 1                            04888021
XINIT1 EQU   *                                                          04896021
       STM   XR0,XR15,XGSAV4                                            04904021
       LA    XR6,XRAUR2       XR6 HAS @FIRST GEN REG TBL R3             04912021
       LA    XR5,XRAU14       XR5 HAS @LAST GEN REG TBL R0              04920021
XINIT2 EQU   *                                                          04928021
         CLI   XXXYY,XX00      INIT REGARDLESS OF SUBSCRIPTS            04936021
       BE    XINIT4           YES                                       04944021
         TM    DX2(XR6),XRSUBS NO, IS REG USED FOR SUBSCRIPTS           04952021
       BO    XINIT3           YES, DO NOT INIT                          04960021
XINIT4 EQU   *                                                          04968021
         MVC   DX0(LX3,XR6),XC000      SET IRN = FLAG BYTE = 0          04976021
XINIT3 EQU   *                                                          04984021
       LA    XR6,XRNEXI(XR6)  INCREMENT TO NEXT TBL                     04992021
       CR    XR6,XR5          ARE ALL TBLS INIT                         05000021
       BNH   XINIT2           NO                                        05008021
       LM    XR0,XR15,XGSAV4  YES,                                      05016021
       BR    XRSUB            RETURN                                    05024021
       SPACE 5                                                          05032021
* THIS ROUTINE WILL INITIALIZE THE FLOATING POINT REGISTER TABLES       05040021
*     ENTRY POINT - XINITF                                              05048021
       SPACE 2                                                          05056021
XINITF EQU   *                                                          05064021
       STM   XR0,XR15,XGSAV4                                            05072021
       LA    XR6,FPRTB2       XR6 HAS @FIRST FL PT REG TBL R2           05080021
       LA    XR2,FPRTBD       XR2 HAS @END OF FL PT REG TBLS            05088021
XINITG EQU   *                                                          05096021
         NC    DX0(LX3,XR6),XREMK6     IRN = 0 FLAGBYTE = FLPTREG       05104021
       LA    XR6,XRNEXI(XR6)  INCREMENT TO NEXT TBL                     05112021
       CR    XR6,XR2          ARE ALL TBLS INIT                         05120021
       BNH   XINITG           NO                                        05128021
       LM    XR0,XR15,XGSAV4  YES,                                      05136021
       BR    XRSUB            RETURN                                    05144021
       EJECT                                                            05152021
* THIS ROUTINE WILL CALCULATE THE NUMBER OF DIGITS AND LENGTH OF        05160021
*     THE OPERAND IN XR5 BOTH IN BINARY AND INTERNAL DECIMAL            05168021
*     ENTRY POINT - XIDSZ                                               05176021
       SPACE 2                                                          05184021
XIDSZ  EQU   *                                                          05192021
       STM   XR0,XR15,XGSAV6                                            05200021
         MVC   XIDBY(LX6),XC000   SET XIDBY = XBDBY = XIDDN = 0         05208021
       SR    XR4,XR4                                                    05216021
*                                                                       05224021
**************************** CAUTION ****************************       05232021
********************* THIS IS A REVERSE TRT *********************       05240021
******** XITAB IS THE ARGUMENT. 0(XR5) IS THE FUNCTION. *********       05248021
*                                                                       05256021
         TRT   XITAB(LX16),DX0(XR5)  SEARCH FO FIRST NONZERO BYTE       05264021
*                                                                       05272021
         IC    XR4,DX0(XR1)              XR4 HAS RELATIVE ADDRESS       05280021
       LCR   XR4,XR4                    OF FIRST NON ZERO BYTE          05288021
       AH    XR4,XC016           XIDBY = # BYTES NEEDED TO              05296021
       STH   XR4,XIDBY                  CONTAIN NUMBER IF ID            05304021
       SPACE 1                                                          05312021
         SLA   XR4,DX1            CALCULATE XIDDN                       05320021
       BCTR  XR4,RW0             XIDDN = XIDBY * 2 - 1                  05328021
*                                                                       05336021
       N     XR2,XIMK1   DOES 1ST NON-ZERO BYTE HAVE LEADING ZERO       05344021
       BNZ   XID02            NO                                        05352021
       BCTR  XR4,RW0             YES, XIDDN = XIDDN - 1                 05360021
XID02  EQU   *                                                          05368021
       STH   XR4,XIDDN           XIDDN = # OF DIGITS NUMBER HAS         05376021
       SPACE 1                                                          05384021
* CALCULATE BINARY SIZE - WHETHER A HALFWORD, FULLWORD, OR              05392021
*                        DOUBLEWORD IS NEEDED.                          05400021
       SPACE 1                                                          05408021
         IC    XR1,DX15(XR5)      SAVE SIGN                             05416021
         OI    DX15(XR5),XX0F     MAKE SURE SIGN IS POSITIVE            05424021
       SPACE 1                                                          05432021
         MVI   XBDBY+NX1,XX02     XBDBY = HALFWORD                      05440021
         CP    DX0(LX16,XR5),XIHAF(LX3) IS NO GE 32767...               05448021
       BNH   XIDXIT              YES, RETURN                            05456021
       SPACE 1                                                          05464021
         MVI   XBDBY+NX1,XX04     XBDBY = FULLWORD                      05472021
         CP    DX0(LX16,XR5),XI1WO(LX6) IS NO LE2,147,483,647...        05480021
       BNH   XIDXIT              YES, RETURN                            05488021
       SPACE 1                                                          05496021
         MVI   XBDBY+NX1,XX08     XBDBY = DOUBLEWORD                    05504021
         CP    DX0(LX16,XR5),XI2WO(LX10) IS NO LE9223372036854775807    05512021
       BNH   XIDXIT              YES, RETURN                            05520021
       SPACE 1                                                          05528021
       MVI   XBDBY+NX1,XXFF        NO, NUMBER TOO LARGE                 05536021
       SPACE 2                                                          05544021
XIDXIT EQU   *                                                          05552021
         STC   XR1,DX15(XR5)      RESET SIGN                            05560021
       LM    XR0,XR15,XGSAV6                                            05568021
       BR    XRSUB            RETURN                                    05576021
       EJECT                                                            05584021
*      XT000   -DECIDE IF INTEGER OR DECIMAL PLACES HAVE TO BE          05592021
*              -TRUNCATED.                                              05600021
*              -    INPUT  NUMBER OF INTEGER OF RESULT IN XTINI         05608021
*                             -    - DECIMAL  -   -    -  XTDEC.        05616021
*              -    OUTPUT'                                             05624021
*                          NUMBER OF INTEGER TO BE TRUNCATED IN XTI     05632021
*                             -    - DECIMAL  -  -    -       - XTD     05640021
*                                                                       05648021
*              -    XRDMX CONTAINS DMAX MAXIMUM OF DECIMAL PLACES O     05656021
*                   SOURCE FIELD FOR THAT STATEMENT.                    05664021
       SPACE 5                                                          05672021
XT000    STM   XR0,XR15,XGSAV6                                          05680021
         MVC   XTDDD(LX4),XC000          RESET OUTPUT CELLS TO 0.       05688021
       LH    XR4,XTDEC                                                  05696021
       CH    XR4,XRDMX                                                  05704021
       BC    XTWO,XT001            DEC IN RESULT > DMAX                 05712021
       AH    XR4,XTINI                  DEC LESS THAN DMAX.             05720021
*            TRUNCATE DEC + I - 30 INTEGERS.                            05728021
XT004  SH    XR4,XC030                  AND 0 DEC.                      05736021
       STH   XR4,XTIII                  X                               05744021
       SPACE 2                                                          05752021
XTXIT    LM    XR0,XR15,XGSAV6     EXIT                                 05760021
       BCR   UNCON,XRSUB           RETURN                               05768021
       SPACE 2                                                          05776021
XT001  LH    XR5,XTINI                  DEC GREATER THAN DMAX.          05784021
       AH    XR5,XRDMX                                                  05792021
       CH    XR5,XC030                                                  05800021
       BC    XTWO,XT003            DMAX+1 > 30                          05808021
       AH    XR4,XTINI                  DMAX +I LESS THAN 30.           05816021
       SH    XR4,XC030                  TRUNCATE  I+DMAX-30 DECIMAL     05824021
       STH   XR4,XTDDD                  AND 0 INTEGER.                  05832021
       BC    UNCON,XTXIT                X                               05840021
       SPACE 2                                                          05848021
XT003  SH    XR4,XRDMX                  DMAX+1 GREATER THAN 30          05856021
       STH   XR4,XTDDD                    TRUNCATE  DMAX-DEC DECIMA     05864021
       LH    XR4,XTINI                    AND  I+DMAX-30 INTEGERS.      05872021
       AH    XR4,XRDMX                  X                               05880021
       BC    UNCON,XT004           SET XTIII                            05888021
       EJECT                                                            05896021
       SPACE 5                                                          05904021
XADJCT LH    XR1,Y1ALP(XR3)             UPDATE XR3 OPERAND DUE TO O     05912021
       SR    XR1,XR2                    =FLOW IN SCALING XR5 RESULT     05920021
       STH   XR1,Y1ALP(XR3)             IN THE DROPPING OF DECIMAL      05928021
       LH    XR1,Y1DBS(XR3)             PLACES.                         05936021
       SR    XR1,XR2                    X                               05944021
       STH   XR1,Y1DAS(XR3)             X                               05952021
       LH    XR1,Y1FBS(XR3)             X                               05960021
       SR    XR1,XR2                    X                               05968021
       BC    XONE,XADJC1           DIGITS CANNOT BE < 0                 05976021
XADJC2 EQU   *                                                          05984021
       STH   XR1,Y1FAS(XR3)             X                               05992021
         SRA   XR1,DX1                   X                              06000021
         LA    XR1,DX1(XR1)              X                              06008021
       STH   XR1,Y1LAS(XR3)             X                               06016021
       BCR   UNCON,XRSUB                RETURN                          06024021
XADJC1 SR    XR1,XR1                                                    06032021
       BC    UNCON,XADJC2          SET NUMBER OF DIGITS                 06040021
       SPACE 5                                                          06048021
*      XSCAL   -MULTIPLICATION BY SCALING POWER OF TEN  AT COMPILE      06056021
*              -TIME ARITHMETIC                                         06064021
       SPACE 5                                                          06072021
XSCAL    STM   XR0,XR15,XGSAV4                                          06080021
       SPACE 2                                                          06088021
       LH    XR1,Y1ALP(XR5)             COMPUTE MAX.NUMBER OF DIGIT     06096021
       LTR   XR1,XR1                                                    06104021
       BC    XONE,XSCALN                SCALING FACTOR IS  MINUS .      06112021
       BC    XZERO,XSC02           SCALING FACTOR IS ZERO               06120021
       AH    XR1,Y1FBS(XR5)             THE PRODUCT.                    06128021
       CH    XR1,XC030                  X                               06136021
       BC    XTWO,XSC00                 MORE THAN 30 - OVERFLOW.        06144021
       LH    XR2,Y1ALP(XR5)                                             06152021
XSC01    MP    DX0(LX16,XR5),XIDCNQ(LX1)                                06160021
         AP    DX0(LX16,XR5),DX0(LX16,XR5)                              06168021
       BCT   XR2,XSC01                  WHEN FALL THRU COMPILE          06176021
*                                       TIME SCALING IS FINISHED.       06184021
       SPACE 2                                                          06192021
XSC02  BAL   XRSUB,XIDSZ                COMPUTE SIZES OF SCALED OPE     06200021
         MVC   Y1LAS(LX6,XR5),XIDBY      X                              06208021
       SPACE 2                                                          06216021
XSCEXT   LM    XR0,XR15,XGSAV4     EXIT                                 06224021
       BCR   UNCON,XRSUB                X                               06232021
       SPACE 2                                                          06240021
XSC00    OI    Y1IRX+NX1(XR5),XGOVFL     OVERFLOW - SET SWITCH .        06248021
         XC    XTINI(LX2),XTINI                                         06256021
       SH    XR1,Y1DAS(XR5)             SET NUMBER OF INTEGER OF OV     06264021
       BC    XONE,XSCEXT           IF NEGATIVE, RETURN                  06272021
       STH   XR1,XTINI                  FLOWED RESULT FOR TRUNCATIO     06280021
*                                       ROUTINE.                        06288021
       BC    UNCON,XSCEXT          RETURN                               06296021
XSCALN LPR   XR1,XR1                                                    06304021
         TM    Y1ALP+NX1(XR5),XX01       NUMBER OF DIGIT TO BE DROPP    06312021
       BC    XTHRE,XSC03                IS ODD                          06320021
         MVO   DX0(LX16,XR5),DX0(LX15,XR5) IF IT IS EVEN DO AN EXTRA MV 06328021
       BCTR  XR1,RW0                      TO DROP ONE DIGIT.            06336021
XSC03    LA    XR1,DX1(XR1)              X                              06344021
         SRA   XR1,DX1                   X                              06352021
       LNR   XR1,XR1                    X   DROP DIGIT WITH AN MVO.     06360021
       AH    XR1,XC016                  X                               06368021
       BCTR  XR1,RW0               SUBTRACT 1 FOR EXECUTE STATEMENT     06376021
       EX    XR1,XSCMVO                 X                               06384021
       BC    UNCON,XSC02                X                               06392021
       DS    0H                         X                               06400021
XSCMVO   MVO   DX0(LX16,XR5),DX0(LX0,XR5) X                             06408021
       EJECT                                                            06416021
*      XZLOGB  - SET  A-TEXT BUFFER  FOR A LOGICAL OPERATION WITH T     06424021
*                BINARY OPERANDS.                                       06432021
*                                                                       06440021
*      XZLOGD  - SET A-TEXT BUFFER FOR A LOGICAL OPERATION WITH TWO     06448021
*                ID OPERANDS.                                           06456021
*                                                                       06464021
*      XZBINB  - SET A-TEXT BUFFER FOR A BINARY OPERATION BEFORE SC     06472021
*                OF OPERANDS.                                           06480021
*                                                                       06488021
*      XZBINA  - IDENTICAL TO XZBINB FOR SCALED OPERANDS.               06496021
*                                                                       06504021
*                                                                       06512021
*      XZSIDB  - IDENTICAL TO XZBINB FOR ID OPERATION.                  06520021
*                                                                       06528021
*      XZSIDA  - IDENTICAL TO XZBINB FOR ID OPERATION.                  06536021
*                                                                       06544021
*      XZNLB   - SET A-TEXT BUFFER FOR BI.OPERATION WITH LENGHT OF      06552021
*                OPERAND GIVEN IN XZLENG.                               06560021
*                                                                       06568021
*                FOR ALL THE PRECEEDING ROUTINES INFORMATION BUFFER     06576021
*                ADDRESSES ARE IN XR3 AND XR5.                          06584021
*                AND IF                                                 06592021
*                       XR5=-1    2ND OPER. = CONSTANT IN XCON(16)      06600021
*                                                                       06608021
*                       XR5=-3    2ND OPER. =CONSTANT IN IR  OR TEM     06616021
*                                                                       06624021
*                       XR5=-2    1ST OPER  =CONSTANT IN IR .           06632021
*                                                                       06640021
*                       XR5=-4    1ST OPER  =CONSTANT IN XCON(16).      06648021
*                                                                       06656021
*                       XR5=-5    1ST OPER  =CONSTANT IN TEMP.          06664021
*                                                                       06672021
*                       IF THE CONSTANT IS IN IR OR TEMP, XREGI OR      06680021
*                       IS SUPPOSED TO BE SET BEFORE THE CALL.          06688021
*                       XZNLB CAN BE USED ONLY WITH XR5 SET TO ONE      06696021
*                       THOSE MINUS VALUE.                              06704021
       SPACE 5                                                          06712021
FPSETA   MVI   XZSWT,XX04                FLOATING POINT OPERANDS.       06720021
       BC    UNCON,XZDB0           BRANCH TO XSSBG2                     06728021
       SPACE 2                                                          06736021
XZLOGB   MVI   XZSWT,XX0B                SET ENTRY POINTS.              06744021
       BC    UNCON,XZDB0                X                               06752021
       SPACE 2                                                          06760021
XZLOGD   MVI   XZSWT,XX0A                X                              06768021
       BC    UNCON,XZDB0                X                               06776021
       SPACE 2                                                          06784021
XZBINB   MVI   XZSWT,XX01                X                              06792021
       BC    UNCON,XZDB0                X                               06800021
       SPACE 2                                                          06808021
XZBINA   MVI   XZSWT,XX09                X                              06816021
       BC    UNCON,XZDB0                X                               06824021
       SPACE 2                                                          06832021
XZSIDB   MVI   XZSWT,XX00                X                              06840021
       BC    UNCON,XZDB0                X                               06848021
       SPACE 2                                                          06856021
XZSIDA   MVI   XZSWT,XX08                X                              06864021
       BC    UNCON,XZDB0                X                               06872021
       SPACE 2                                                          06880021
XZNLB    MVI   XZSWT,XX11                X                              06888021
       SPACE 2                                                          06896021
       BC    UNCON,XZDB0           BRANCH TO XSSBG2                     06904021
XZNIII   MVI   XZSWT,XX10                                               06912021
       SPACE 2                                                          06920021
XZDB0    STM   XR0,XR15,XESAV                                           06928021
       L     XRVAR,XSSDB2                                               06936021
       BCR   UNCON,XRVAR           BRANCH TO XSSBG2                     06944021
       SPACE 10                                                         06952021
XZX3X5 XR    XR5,XR3                    EXCHANGE XR3 AND XR5            06960021
       XR    XR3,XR5                                                    06968021
       XR    XR5,XR3                                                    06976021
       BCR   UNCON,XRSUB           RETURN                               06984021
       SPACE 10                                                         06992021
XZX4X6 XR    XR4,XR6                                                    07000021
       XR    XR6,XR4                                                    07008021
       XR    XR4,XR6                                                    07016021
       BCR   UNCON,XRSUB           RETURN                               07024021
       SPACE 5                                                          07032021
XINTL1 XC    XBSW1(XLSW1),XBSW1                                         07040021
         NI    XGSWT,XX0F                                               07048021
         MVI   XOPMOD,XX00                                              07056021
       BCR   UNCON,XRSUB           RETURN                               07064021
       SPACE 10                                                         07072021
*      XTAMPO   - ASSIGN TEMPORARY STORAGE THE LENGHT OF WHICH IS G     07080021
*               - IN XELEN  (EITHER 8 OR 16 BYTES).                     07088021
*               - INXELEN  (EITHER 8 OR 16 BYTES).                      07096021
*      XE16D    - ASSIGN  16 BYTES IN TS.                               07104021
*      XE8DB    - ASSIGN   8 BYTES IN TS.                               07112021
*               - OUTPUT = DISPLACT.+8(IN BYTES)IN XEREL1- ENTRY (O     07120021
*               - BYTES)NUMBER IN TS.GIVEN IN  XEREL - LENGHT IN XY     07128021
       SPACE 5                                                          07136021
XTAMPO   CLI   XELEN+NX1,XX08                                           07144021
       BC    XNOGT,XE8DB           LENGTH SET TO 8 BYTES                07152021
       SPACE 2                                                          07160021
XE16D    MVI   XYTEL+NX1,XX10                                           07168021
       BC    UNCON,XEBGN           LENGTH SET TO 16 BYTES               07176021
       SPACE 2                                                          07184021
XE8DB    MVI   XYTEL+NX1,XX08                                           07192021
XEBGN  STM   XR0,XR15,XESAV                                             07200021
         MVI   XYTEL,XX00                                               07208021
       L     XR1,XAAVAL                                                 07216021
       BAL   XRSUB,XTBDEB               XR2 WILL HAVE FIRST ENTRY I     07224021
*                                       AVAILABILITY TABLE.             07232021
*                                       XR3=DISPLT.IN THE SAME TABL     07240021
*                                       XR1=TAMN OF THIS TABLE.         07248021
       CH    XR3,XC000                  NO ENTRIES IN AVABT. TABLE.     07256021
       BC    XZERO,XE008                YES,-                           07264021
         CLI   XYTEL+NX1,XX08            NO,ARE 16 BYTES ASKED.         07272021
       BC    XTWO,XE009                 YES                             07280021
       SH    XR3,XC002                  DECREASE  DISPT. IN AVABT.      07288021
         STH   XR3,DX4(XR1)              AND SET TAMN.                  07296021
         LH    XR4,DX0(XR3,XR2)          XR4 HAS REL. POINTER IN TS.    07304021
       BC    UNCON,XE011           SET OUTPUT                           07312021
       SPACE 2                                                          07320021
XE009  SR    XR6,XR6                    XR6 WILL HAVE THE DISPLT.DU     07328021
         LH    XR4,DX0(XR6,XR2)          SCANING OF AVABT TABLE - XR    07336021
*                                       WILL HAVE CONTENT OF ENTRY      07344021
*                                       G SCANNED                       07352021
       BC    UNCON,XE014           BEGIN SCAN                           07360021
XE012    LH    XR5,DX0(XR6,XR2)          XR5 HAS NEXT ENTRY             07368021
         LA    XR4,DX1(XR4)              IS          REL.POINTER+1 =    07376021
       CR    XR4,XR5                    NEXT REL. POINTER.              07384021
       BC    XZERO,XE013                YES- WE HAVE 16 CONSECUTIVE     07392021
       LR    XR4,XR5                    NO,SAVE THIS ENTRY IN XR5.      07400021
XE014    LA    XR6,DX2(XR6)              WAS IT  THE LAST ENTRY IN A    07408021
       CR    XR6,XR3                    TABLE.                          07416021
       BC    XONE,XE012                 X                               07424021
       BC    UNCON,XE008                NO,TRY WITH NEXT ONE.           07432021
*                                       YES. ASSIGN NEW 16 BYTES.       07440021
       SPACE 2                                                          07448021
XE013  LR    XR5,XR6                                                    07456021
       SH    XR5,XC004                                                  07464021
XE015    LA    XR6,DX2(XR6)              TAKE NEXT ENTRY                07472021
       CR    XR6,XR3                    IS IT THE LAST ONE.             07480021
       BC    XZERO,XE0144               YES-                            07488021
         LA    XR5,DX2(XR5)              NO, STORE IT TWO ENTRIES BE    07496021
         LH    XR0,DX0(XR6,XR2)          X                              07504021
         STH   XR0,DX0(XR5,XR2)          X                              07512021
       BC    UNCON,XE015                X                               07520021
       SPACE 2                                                          07528021
XE0144 BCTR  XR4,RW0               SET XR4 TO 1ST OF TWO ENTRIES        07536021
       SH    XR3,XC004                  UPDATE  DISPLACT. IN AVAB.T     07544021
         STH   XR3,DX4(XR1)              X                              07552021
       BC    UNCON,XE011           SET OUTPUT                           07560021
       SPACE 2                                                          07568021
XE008    LH    XR4,TSMAX           GET COUNTER VALUE                    07576021
         LA    XR4,DX1(XR4)                                             07584021
       LR    XR5,XR4                                                    07592021
         CLI   XYTEL+NX1,XX08            8 BYTES NEEDED                 07600021
       BC    XNOGT,XE016                NO                              07608021
         LA    XR5,DX1(XR5)              16 BYTES  INCREAS( BY 2.       07616021
XE016    STH   XR5,TSMAX                                                07624021
XE011  STH   XR4,XEREL                                                  07632021
         SLA   XR4,DX3                                                  07640021
       STH   XR4,XEREL1                                                 07648021
       SPACE 2                                                          07656021
XEXIT  LM    XR0,XR15,XESAV             RETURN.                         07664021
       BCR   UNCON,XRSUB                X                               07672021
       SPACE 5                                                          07680021
*      XERELS   -RELEASE 8 OR 16 BYTES OF TS. AND ENTER CORRESPONDI     07688021
*               -RELATIVE  POINTER(S)IN THE AVAILABILITY TABLE.         07696021
*               - INPUT = XEREL WITH VALUE OF  REL. POINTER.            07704021
       SPACE 5                                                          07712021
XERELS EQU   *                                                          07720021
         STM   XR0,XR15,XESAV                                           07728021
         MVC   XEEMN(LX2),XEREL          SAVE REL. POINTER              07736021
XE030  L     RW1,XAAVAL                   ASK A NEW ENTRY IN AVA. T     07744021
       L     XRVAR,XINST                   X                            07752021
       BALR  RETRG,XRVAR           BRANCH TO INSERT ROUTINE             07760021
       LR    XR5,XR2                    XR5 HAS POINTER TO THIS NEW     07768021
       SPACE 2                                                          07776021
       L     XR1,XAAVAL                                                 07784021
       BAL   XRSUB,XTBDEB          GET INFO ON XAVAL                    07792021
       SPACE 2                                                          07800021
       SR    XR6,XR6                                                    07808021
       LR    XR1,XR3                                                    07816021
       SH    XR1,XC002                  XR1 HAS DISPL. OF NEW ENTRY     07824021
XE033  CR    XR6,XR1                    END OF TABLE                    07832021
       BC    XZERO,XE034                YES-                            07840021
         LH    XR4,DX0(XR6,XR2)          XR4 HAS CURRENT ENTRY.         07848021
       CH    XR4,XEEMN                                                  07856021
       BC    XZERO,XE037                THIS TS IS ALREADY RELEASED     07864021
       BC    XTWO,XE032                 INSERT NEW ENTRY HERE.          07872021
         LA    XR6,DX2(XR6)              TRY NEXT ENTRY.                07880021
       BC    UNCON,XE033                X                               07888021
       SPACE 2                                                          07896021
XE034    MVC   DX0(LX2,XR5),XEEMN        MOVE REL.POINTER IN NEW ENT    07904021
       BC    UNCON,XE036                AT THE END OF TABLE.            07912021
       SPACE 2                                                          07920021
XE032  AR    XR1,XR2                    XR1 HAS ABSOLUTE ADDRESS OF     07928021
       AR    XR6,XR2                                                    07936021
*                                       EMPTY ENTRY.                    07944021
XE035  SH    XR1,XC002                                                  07952021
         MVC   DX2(LX2,XR1),DX0(XR1)     PUSH BACK TABLE.               07960021
       CR    XR1,XR6                                                    07968021
       BC    XTWO,XE035            ENTRY DOES NOT BELONG HERE           07976021
*         XR6 HAS ABSOLUTE ADDRESS WHERE                                07984021
         MVC   DX0(LX2,XR6),XEEMN        SHOULD NEW ENTRY BE INSERTE    07992021
XE036    CLI   XYTEL+NX1,XX08            WAS IT A 16 BYTES RELEASE.     08000021
       BC    XNOGT,XEXIT                NO-                             08008021
         CLC   XEREL(LX2),XEEMN                                         08016021
       BC    XNOEQ,XEXIT           2ND 8 BYTES HAVE BEEN RELEASED       08024021
       LH    XR4,XEREL                  YES                             08032021
       AH    XR4,XC001                  RELEASE NEXT 8 BYTES.           08040021
       STH   XR4,XEEMN                  X                               08048021
       BC    UNCON,XE030                X                               08056021
       SPACE 2                                                          08064021
XE037  L     XR1,XAAVAL                                                 08072021
       BAL   XRSUB,XTBDEB          GET INFO ON XAVAL                    08080021
       SH    XR3,XC002                                                  08088021
         STH   XR3,DX4(XR1)                                             08096021
       BC    UNCON,XE036           CHECK FOR 16 BYTE RELEASE            08104021
       EJECT                                                            08112021
XOTSEM   OI    XGNSW,XX01                                               08120021
       BC    UNCON,XOTS00          ENTERED FROM MOVE VERB ANALYZER      08128021
XOTSEL   NI    XGNSW,XXFE                                               08136021
XOTS00 STM   XR6,XR2,XGSAV2                                             08144021
       BAL   XRSUB,XRSVAL          GET BUFFER ADDRESSES                 08152021
*                                                                       08160021
       BAL   XRSUB,XINTL1               RESET SWITCHES AND BUFFERS      08168021
         TM    XGNSW,XX01                                               08176021
       BC    XTHRE,XOTS02    SET ARITH. SWUTCH IF ENTERED               08184021
       OI    XGSWT,XAROPE    BY XOTSEL                                  08192021
XOTS02 EQU   *                                                          08200021
       L     XRVAR,XASETV                                               08208021
       BALR  XRSUB,XRVAR           GET OPERAND INFO INTO BUFFERS        08216021
         TM    XGNSW,XX01                                               08224021
       BC    XTHRE,XOTS01          CALLED BY MOVE ANALYZER              08232021
       BAL   XRSUB,XPACK                PACK EXT. DEC. IF ANY.          08240021
         CLI   HEADER+NX1,XX05                                          08248021
       BNE   XOTS01                IS NOT STORE, EXIT                   08256021
       CLI   DOP2,TEMRES          STORE INTO TEMP. RESULT....           08264021
       BNE   XOTS01               NO                                    08272021
       CLI   X1IRX,XGEXFP        IS OPERAND EXT FL PT                   08280021
       BNE   XOTS06              NO                                     08288021
       BAL   XRSUB,FPCVBG        YES, CONVERT IT TO INT FL PT           08296021
XOTS06 EQU   *                                                          08304021
* STORE OF OPERAND OR INTERMEDIATE RESULT INTO TEMPORARY RESULT-        08312021
*  SAVE CHARACTERISTICS IN XRVAL BUFFER AND STORE                       08320021
* OPERAND OR REGISTER IN TEMPORARY STORAGE IF NECESSARY                 08328021
         CLI   XRTEL+NX1,XX00      IF TEMP STORAGE HAS BEEN USED        08336021
       BE    XOTS03               BY A FORMER TEMP RESULT,              08344021
         MVC   XYTEL(LX4),XRTEL    RELEASE IT.                          08352021
       BAL   XRSUB,XERELS          GO TO RELEASE ROUTINE                08360021
XOTS03   TM    X1IRX+NX1,XINREG    IS OP IN A REGISTER...               08368021
       BZ    XOTS04               NO                                    08376021
*                                 YES,GENERATE...                       08384021
       BAL   XRSUB,XZWHIR            STORE REG,TEMPSTORAGE              08392021
       L     XR4,XLIRP                                                  08400021
       BAL   XRSUB,XRSTOR          SAVE TEMP RESULT                     08408021
XOTS05 MVC   XRVAL(XLEVAL),X1VAL                                        08416021
       B     PH5CTL                RETURN TO CONTROL                    08424021
XOTS04   CLI   X1TEL+NX1,XX00      IS OP IN TEMP STORAGE...             08432021
       BNE   XOTS05               YES                                   08440021
         TM    X1IRX+NX1,XZGNLT    IS OP A LITERAL....                  08448021
       BC    NOTZER,XOTS05        YES                                   08456021
         MVC   XELEN(LX2),XOPLGH+NX2   NO                               08464021
       BAL   XRSUB,XTAMPO         ASK TEMPORARY STORAGE                 08472021
         MVC   XL1(LX2),XYTEL                                           08480021
         MVC   XWC1(LX2),XEREL1                                         08488021
         MVC   XWC2(LX2),XEREL1                                         08496021
       BAL   XRSUB,EXORLG         GEN..XC TEMP,TEMP                     08504021
         MVC   X1TEL(LX4),XYTEL                                         08512021
       LH    XR6,XYTEL                                                  08520021
         SH    XR6,XOPLGH+NX2                                           08528021
         TM    X1IRX+NX1,XFTPT    IS OPERAND INT FL PT                  08536021
       BZ    XOTS07              NO                                     08544021
         TM    X1IRX+NX1,XGDPFP   YES, IS IT DP                         08552021
       BO    XOTS07              YES                                    08560021
         SH    XR6,XOPLGH+NX2     NO, PLACE OPERAND LEFT ADJUSTED       08568021
XOTS07 EQU   *                                                          08576021
         MVC   XL1(LX2),XOPLGH+NX2                                      08584021
       AH    XR6,XEREL1                                                 08592021
       STH   XR6,XWC1             GENERATE A MOVE OF OPERAND INTO       08600021
         MVC   XOP1(LX4),X1INPT    TEMP STORAGE-RIGHT ADJUSTED          08608021
       BAL   XRSUB,MVC             GENERATE MVC                         08616021
       B     XOTS05                SET TEMP RESULT BUFFER               08624021
XOTS01 EQU   *                                                          08632021
       LM    XR6,XR2,XGSAV2                                             08640021
       BCR   UNCON,XRSUB           RETURN                               08648021
       SPACE 10                                                         08656021
XSTLHN   ST    XR4,XGSAV6          GET THE NEXT USABLE GN               08664021
       LH    XR4,FIVEGN                 X                               08672021
         LA    XR4,DX1(XR4)              X                              08680021
       STH   XR4,FIVEGN                 X                               08688021
       STH   XR4,XGNTMP                 X                               08696021
       STH   XR4,XGN1                   X                               08704021
         L     XR4,XGSAV6                                               08712021
       BCR   UNCON,XRSUB                X                               08720021
*                                                                       08728021
       SPACE 5                                                          08736021
*      ERRPRO- ERROR PROCESSOR ROUTINE                                  08744021
*      CALLING SEQUENCE IS-     BAL  BRSUB,ERRPRO                       08752021
*                               DC   XL1         MESSAGE NUMBER         08760021
*                               DC   XL1         SEVERITY.              08768021
*      IF SEVERITY IS 8,FILES WILL BE CLOSED AND CONTROL WILL BE        08776021
*      RETURNED TO PHASE0.                                              08784021
*                                                                       08792021
       SPACE 5                                                          08800021
ERRPRO EQU   *                                                          08808021
       STM   XR0,XR15,XGSAV8                                            08816021
         CLI   DX0(XRSUB),ERRN11                                        08824021
       BC    XNOEQ,ERRPR1               MESSAGE 11 SHOULD NOT BE        08832021
         TM    XGNSW,XX20                PRINTED MORE THAN ONCE PER     08840021
         BC    XTHRE,DX2(XRSUB)          COMPUTE STATEMENT.             08848021
         OI    XGNSW,XX20                                               08856021
ERRPR1   MVC   XMSGDF+NX4(LX1),DX0(XRSUB)                               08864021
         MVC   XMSGDF+NX5(LX2),CARDNO    SET BUFFER TO BE OUTPUTED      08872021
         MVO   XMSGDF+NX7(LX1),DX1(LX1,XRSUB) ON FILE 4.                08880021
       LA    RW2,XMSGDF                                                 08888021
         LA    RW3,DX8                                                  08896021
       BAL   XR0,WRITE4            WRITE MESSAGE                        08904021
         TM    XMSGDF+NX7,XX80     SEVERITY 8...                        08912021
       BZ    ERRPRX               NO,  CONTINUE PROCESSING              08920021
         BC    UNCON,EOFIN        YES,  GO TO EOFIN RTN                 08928021
ERRPRX LM    XR0,XR15,XGSAV8                                            08936021
         BC    UNCOND,DX2(XRSUB)  RETURN TO CALLER                      08944021
       EJECT                                                            08952021
*      XBISCL  -  BINARY  OBJECT  TIME  SCALING. CONVERT EVENTUALY      08960021
*              -  ID TO BINARY .                                        08968021
XBISCD OI    XOPMOD,XDIVOR                                              08976021
XBISCL EQU   *                                                          08984021
         STM   XR0,XR15,XGSAV1                                          08992021
       LA    XR3,XVAL1                  TAKE FIRST OPERAND.             09000021
XBIS03 TM    Y1IRX(XR3),XGBINR                                          09008021
       BC    XTHRE,XBIS01               CONVERT ANY ID OPERAND TO       09016021
         TM    Y1IRX+NX1(XR3),XZGNLT     BINARY.                        09024021
       BC    XNOEQ,XBISCP          OPERAND IS A LITERAL                 09032021
       BAL   XRSUB,XIDBIB          CONVERT OPERAND TO BINARY            09040021
XBIS01 BAL   XRSUB,XZSCL                YES- SCALE                      09048021
XBIS05 EQU   *                                                          09056021
       BAL   XRSUB,XSTOMV          IS THIS A STORE OR MOVE              09064021
       BC    UNCON,XBISEX          YES                                  09072021
       C     XR3,XAVAL1                 WAS IT THE  2ND OPERAND.        09080021
       BC    XZERO,XBIS02               NO-                             09088021
XBISEX   LM    XR0,XR15,XGSAV1     YES, EXIT                            09096021
       BCR   UNCON,XRSUB                X                               09104021
       SPACE 2                                                          09112021
XBIS02 LA    XR3,XVAL2                  PROCESS 2ND OPERAND             09120021
         NI    XOPMOD,XXEF               RESET XDIVOR SWITCH.           09128021
*                                                                       09136021
*                                                                       09144021
       BC    UNCON,XBIS03               ROUTINE.                        09152021
XBISCP   OI    Y1IRX+NX1(XR3),XGNCON                                    09160021
         MVN   Y1IRX(LX1,XR3),XITAB+NX11                                09168021
       BC    UNCON,XBIS05          CHECK IF BOTH OPERANDS THRU          09176021
       SPACE 2                                                          09184021
       EJECT                                                            09192021
       SPACE 5                                                          09200021
*      XFINAL   - SAVE  RESULT IN INTERMEDIATE RESULT TABLE RELEASE     09208021
*                 IR OR TEMP USED BY OPERANDS AND NOT USED BY RESUL     09216021
       SPACE 5                                                          09224021
XFINAL EQU   *                                                          09232021
       SR    XR0,XR0                                                    09240021
*                                                                       09248021
         MVC   XFIRN(LX2),DOP3+NX1                                      09256021
XFI02    CLI   Y1TEL+NX1(XR3),XX00       IS OP IN TEMP.                 09264021
       BC    XZERO,XFI00                NO-                             09272021
         CLC   Y1TEM(LX2,XR3),XFTEM      YES,IS IT THE SAME TEMP AS     09280021
       BC    XZERO,XFI01                RESULT.YES                      09288021
         CLC   Y1TEM(LX2,XR3),XRTEM IS IT SAME TEMP AS TEMP RESULT      09296021
       BE    XFI01                 YES                                  09304021
*            NO,RELEASE THIS TEMPORARI STORAGE                          09312021
         MVC   XYTEL(LX4),Y1TEL(XR3)                                    09320021
       BAL   XRSUB,XERELS               X                               09328021
XFI00    TM    Y1IRX+NX1(XR3),XINREG     IF OP IS IN REG- RESET FLAG    09336021
       BC    XZERO,XFI01                IN IR INFO. TABLE.              09344021
       BAL   XRSUB,XZWHIR               X                               09352021
       L     XR4,XLIRP                  X                               09360021
         TM    DX2(XR4),XRDPRE           X                              09368021
       BC    XZERO,XFI03                X                               09376021
         L     XR6,DX4(XR4)              X                              09384021
         NC    DX0(LX3,XR6),XREMK6                                      09392021
XFI03    NC    DX0(LX3,XR4),XREMK6                                      09400021
       SPACE 2                                                          09408021
XFI01  LTR   XR0,XR0                    IS IT THE 2ND OP.               09416021
       BC    XNOEQ,XFI04                YES                             09424021
         LA    XR0,DX1                   NO - PROCESS 2ND OP.           09432021
       LR    XR3,XR5                    X                               09440021
       BC    UNCON,XFI02           CHECK SECOND OPERAND                 09448021
       SPACE 2                                                          09456021
XFI04    TM    XFIRX+NX1,XINREG          IF RESULT IS IN REG  UPDATE    09464021
       BC    XZERO,XFI05                FLAG IN IR INFO.TABLE.          09472021
       LA    XR3,XFVAL                                                  09480021
       BAL   XRSUB,XZWHIR               X                               09488021
       L     XR4,XLIRP                  X                               09496021
         MVC   DX0(LX2,XR4),XFIRN         SET INT.RES.NUMBER            09504021
         OI    DX2(XR4),XX14             XRIRNT+XRFREE                  09512021
*                                                                       09520021
         TM    XFIRX+NX1,XG2IRX          X                              09528021
       BC    XZERO,XFI05                X                               09536021
         OI    DX2(XR4),XRDPRE           X                              09544021
         L     XR6,DX4(XR4)              X                              09552021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    09560021
       SPACE 2                                                          09568021
XFI05  EQU   *                                                          09576021
         NI    XFIRX+NX1,XXFD                                           09584021
         TM    XGNSW,DIVREM        IS THIS A DIVIDE REMAINDER      7884 09592021
       BZ    XFI06               NO                                     09600021
       XC    XRVAL(XLEVAL),XRVAL CLEAR TEMP RESULT BUFFER               09608021
         TM    XFIRX+NX1,XINREG   IS QUOTIENT IN A REGISTER             09616021
       BZ    XFI12               NO                                     09624021
       BAL   XRSUB,XE8DB         YES, ASSIGN TEMP STORAGE               09632021
         LH    XR1,XEREL1          GENERATE CODE TO SAVE QUOTIENT  7884 09640021
       AH    XR1,XC004              RIGHT ALIGNED IN TEMP STOR          09648021
       STH   XR1,XWC1                                                   09656021
         MVI   XWC1+NX2,XX04        ST QUOT,TEMP                        09664021
         UNPK  XREG1(LX1),XFIRX(LX1)                                    09672021
       NI    XREG1,HIBITS                                               09680021
         BAL   XRSUB,ST           GENERATE ST INST                      09688021
       MVI   XRIRX,XGBINR        TEMP RESULT IS BINARY                  09696021
         B     XFI17              GENERATE STM INST.                    09704021
XFI12  EQU   *                                                          09712021
         TM    XFIRX+NX1,XZGNLT   IS QUOT A LITERAL                     09720021
       BC    XNOEQ,XFI18         YES                                    09728021
         MVC   XELEN(LX2),XFTEL   NO, ASSIGN TEMP STORAGE EQUAL         09736021
       BAL   XRSUB,XTAMPO           TO THAT USED BY QUOTIENT            09744021
         MVC   XL1(LX2),XYTEL     GENERATE CODE TO SAVE QUOT            09752021
         MVC   XWC1(LX2),XEREL1                                         09760021
         MVC   XL2(LX2),XFTEL       ZAP TEMP,QUOT                       09768021
       LH    XR1,XFTEM                                                  09776021
         SLA   XR1,DX3                                                  09784021
       STH   XR1,XWC2                                                   09792021
         BAL   XRSUB,ZAP          GENERATE ZAP                          09800021
XFI18  EQU   *                                                          09808021
       MVI   XRIRX,XGINDC        TEMP RESULT IS INT DEC                 09816021
XFI17  EQU   *                                                          09824021
       LH    XR1,XGDRE           GET # OF DEC PLACES IN RESULT          09832021
       TM    XGNSW,ADDONE        WAS ONE PLACE ADDED FOR ROUNDING       09840021
       BZ    XFI16               NO                                     09848021
       XI    XGNSW,ADDONE        YES, TURN OFF SWITCH AND               09856021
         BCTR  XR1,R0             SUBTRACT ONE FROM # OF DEC            09864021
XFI16  EQU   *                                                          09872021
       STH   XR1,XRDBS           PLACE # IN TEMP RES BUFF               09880021
       LH    XR2,XFDAS           DETERMINE SCALING FACTOR OF            09888021
       SR    XR2,XR1                      TEMP RESULT                   09896021
       LNR   XR2,XR2              SO THAT REMAINDER WILL BE CALC        09904021
       STH   XR2,XRALP            USING TRUNCATED QUOTIENT              09912021
         TM    XFIRX+NX1,XZGNLT   IS QUOT A LITERAL                     09920021
       BC    XNOEQ,XFI19         YES                                    09928021
         MVC   XRTEL(LX4),XYTEL   NO, SET TEMP STORAGE INFO             09936021
XFI19  EQU   *                                                          09944021
         MVC   XRVAL(LX16),XFVAL  PLACE TEMP RESULT INFO INTO           09952021
         MVC   XRLBS(LX6),XFLAS           BUFFER                        09960021
         MVC   XRIRX+NX1(LX1),XFIRX+NX1                                 09968021
         NI    XRIRX+NX1,XIN2RX                                         09976021
XFI06  EQU   *                                                          09984021
       L     XR1,XAINTR                                                 09992021
       BAL   XRSUB,XTBDEB          GET XINTR INFO                       10000021
       AR    XR3,XR2                                                    10008021
XFI09  CR    XR2,XR3                                                    10016021
       BC    XGTEQ,XFI10           ENTER INTR RESULT INTO TABLE         10024021
         CLC   DX30(LX2,XR2),XMINON                                     10032021
       BC    XZERO,XFI08           SLOT IS AVAILABLE                    10040021
         AH    XR2,XC032                                                10048021
       BC    UNCON,XFI09           CHECK NEXT SLOT                      10056021
XFI10  EQU   *                                                          10064021
       L     RW1,XAINTR                   ENTER INTERMED. RESULT IN     10072021
       L     XRVAR,XINST                   TAMER TABLE.                 10080021
       BALR  RETRG,XRVAR           ASK FOR A NEW SLOT                   10088021
XFI08  EQU   *                                                          10096021
         MVC   DX0(XIRNLG,XR2),XFVAL     X                              10104021
       SPACE 2                                                          10112021
       BC    UNCON,PH5CTL          RETURN TO CONTROL                    10120021
       EJECT                                                            10128021
*      XALSUB   -  DECIDE TO CALL SUB OR ADD CODE GENERATOR             10136021
*               -  ACCORDING THE STATUS OF THE FLAG XXSUB               10144021
       SPACE 5                                                          10152021
XADSUB LR    XRSUB,XR1                                                  10160021
       TM    XOPMOD,XXSUB                                               10168021
       BC    XTHRE,SUB             GENERATE A SUBTRACT INSTRUCTION      10176021
       BC    UNCON,ADD             GENERATE AN ADD INSTRUCTION          10184021
       SPACE 5                                                          10192021
*      XYOAF    - ROUTINE  WHICH GENERATE   ZAP  TEMP,OPI USING THE     10200021
*               - LENGTH OF THIS OPERAND AFTER SCALING. - THE ADDRE     10208021
*               - OF THE OPERAND IS IN XR3 - THE LENGTH WANTED IN T     10216021
*               - IS IN XYLEN.                                          10224021
*               - THIS ROUTINE WILL RETURN THE CHARACTERISTICS OF T     10232021
*               - TEMPORARY STORAGE IN                                  10240021
*                                     -   XYTEL  LENGTH.                10248021
*                                     -   XEREL  ENTRY NUMBER IN TE     10256021
*                                     -   XEREL1 DISPLACEMENT OF EN     10264021
*      XYOBF    - PERFORMS THE SAME THING AS XYOAF USING THE LENGTH     10272021
*               - OF OPERAND BEFORE SCALING.                            10280021
*               - FOR BOTH ROUTINES IF OPI IS ALREADY IN TEMP WITH      10288021
*               - CORRECT LENGTH THE THREE OUTPUT CELLS WILL BE SET     10296021
*               - WITH THIS TEMPORARY STORAGE.AND IF THE LENGTH OF      10304021
*               - TEMPORARY STORAGE IS TOO SMALL A  ZAP TEMP,TEMP W     10312021
*               - BE GENERATED AND THE FIRST TEMP RELEASED.             10320021
*               - IN ANY CASES THE BUFFER CONTAINING THE CHARACTERI     10328021
*               - OF OPI WILL BE UPDATED WITH NEW POINTERS TO TEMP      10336021
*               -NECESSARY.                                             10344021
       SPACE 5                                                          10352021
XYOAF    MVC   XZLENG(LX2),Y1LAS(XR3)                                   10360021
       BC    UNCON,XYOBFO          BEGIN ROUTINE                        10368021
XYOBF    MVC   XZLENG(LX2),Y1LBS(XR3)                                   10376021
XYOBFO STM   XR0,XR15,XGSAV3                                            10384021
         CLI   Y1TEL+NX1(XR3),XX00                                      10392021
*                                       IS OPI ALREADY IN TEMP.         10400021
       BC    XZERO,XY0DB                NO,                             10408021
*                                       YES,UPDATE OUTPUT CELL IN C     10416021
       BAL   XRSUB,XEWCL                STORAGE IS CORRECT.             10424021
       SPACE 2                                                          10432021
         CLC   Y1TEL+NX1(LX1,XR3),XYLEN   IS LENGTH LARGE ENOUGH        10440021
       BC    XGTEQ,XYEXIT               YES,                            10448021
XY0DB  EQU   *                                                          10456021
         LH    XR5,XMINFV                                               10464021
       BAL   XRSUB,XZNIII               SET A-TEXT.                     10472021
         MVC   XELEN+NX1(LX1),XYLEN        ASK CORRECT TEMPORARY        10480021
       BAL   XRSUB,XTAMPO               STORAGE.                        10488021
         MVC   XWC1(LX2),XEREL1          SET FIRST OPERAND.             10496021
         MVC   XL1+NX1(LX1),XYTEL+NX1     X                             10504021
         BAL   XRSUB,ZAP                NO..* ZAP  TEMP,OPE.            10512021
       BAL   XRSUB,XUPDT           UPDATE OPERAND BUFFER                10520021
XYEXIT LM    XR0,XR15,XGSAV3            X                               10528021
       BCR   UNCON,XRSUB                X                               10536021
       SPACE 2                                                          10544021
       SPACE 5                                                          10552021
*      XUPDT    - ROUTINE  WHICH ENTER THE POINTER TO THE TEMPORARY     10560021
*               - STORAGE IN THE BUFFER CONTAINING  OPERANDS            10568021
*               - INFORMATION.                                          10576021
*               -  INPUT    TO THIS ROUTINE  IS '                       10584021
*                              XYTEL   LENGTH                           10592021
*                              XEREL   ENTRY NUMBER IN TEMP.            10600021
*                              XEREL1  DISPLACEMENT OF THIS ENTRY.      10608021
*                         ADDRESS OF OPERAND IN XR3                     10616021
       SPACE 5                                                          10624021
XUPDT  STM   XR0,XR15,XGSAV4                                            10632021
*            SAVE OLD POINTERS AND ENTER NEW ONE.                       10640021
         MVC   XUTEL(LX4),Y1TEL(XR3)                                    10648021
*                                                                       10656021
         MVC   Y1TEL(LX4,XR3),XYTEL                                     10664021
         CLI   XUTEL+NX1,XX00            IF OPERAND WAS NOT IN TEMP     10672021
       BCR   XZERO,XRSUB           RETURN                               10680021
*            IF IT WAS RELEASE OLD TEMP.                                10688021
         MVC   XYTEL(LX4),XUTEL                                         10696021
       BAL   XRSUB,XERELS          BRANCH TO RELEASE ROUTINE            10704021
       SPACE 2                                                          10712021
         MVC   XYTEL(LX4),Y1TEL(XR3)                                    10720021
         LM    XR0,XR15,XGSAV4                                          10728021
       BCR   UNCON,XRSUB           RETURN                               10736021
       SPACE 5                                                          10744021
XRSVAL LA    XR3,X1VAL                                                  10752021
       LA    XR5,X2VAL                                                  10760021
       BCR   UNCON,XRSUB           RETURN                               10768021
       SPACE 10                                                         10776021
       SPACE 5                                                          10784021
XODDRG BAL   XRSUB,XZWHIR          GET REGISTER INFO                    10792021
       L     XR4,XLIRP                                                  10800021
         L     XR4,DX4(XR4)                                             10808021
       BCR   UNCON,XR1             RETURN                               10816021
       SPACE 5                                                          10824021
*      XWLDZ    -SET LENGTH OF A PRODUCT WITH A LEADING ZERO.           10832021
*               -CORRECT LENGTH OF PRODUCT FIELD IS RETURNED IN XMP     10840021
*               -NUMBER OF DIGIT OF PRODUCT IS FOUND IN   Y1FAS(XR3     10848021
       SPACE 5                                                          10856021
XWLDZ  STM   XR0,XR15,XGSAV5                                            10864021
         SLA   XR1,DX1                   XR1 = SIZE  OF  MULTIPLIER.    10872021
       AR    XR1,XR2                                                    10880021
         SRA   XR1,DX1                                                  10888021
         LA    XR1,DX1(XR1)                                             10896021
       STH   XR1,XMPLEN                                                 10904021
       LM    XR0,XR15,XGSAV5                                            10912021
       BCR   UNCON,XRSUB           RETURN                               10920021
       EJECT                                                            10928021
*      XXMPL    - GENERATES  MP.                                        10936021
*               - INPUT=  ADDRESSES OF OPERANDS CHARACTERISTIC IN       10944021
*               - XR3 AND XR5.                                          10952021
*               -         LENGHT OF PRODUCT IN XMPLEN.                  10960021
*               -        IF XR5 IS SET TO MINUS  THE CORRESPONDING      10968021
*                 OPERAND IS A GENERATED CONSTANT FOUND IN XCON WIT     10976021
*                 LENGHT IN XCONL.                                      10984021
*               - OUTPUT= IF AT LEAST ONE THE OPERANDS IS A DATA NA     10992021
*                 OBJECT TIME CODING WILL BE GENERATED AND THE RESU     11000021
*                 FIELD INFORMATION BUFFER WILL BE UPDATED WITH LOC     11008021
*                 ON OF PRODUCT IN TEMP.                                11016021
*               - IF NO OPERAND IS A DATA NAME NO OBJECT TIME CODIN     11024021
*                 WILL BE  GENERATED.THE PRODUCT WILLBE DONE AT         11032021
*                 COMPILE TIME AND STORED IN TEMP.                      11040021
       SPACE 5                                                          11048021
XXMPL  STM   XR0,XR15,XGSAV2                                            11056021
       L     XRVAR,XSSDB2                                               11064021
       USING XSSBG2,XRVAR                                               11072021
       BC    UNCON,XX000           GENERATE MULTIPLY INSTRUCTION        11080021
       DROP  XRVAR                                                      11088021
       SPACE 5                                                          11096021
*      XEWCL   - SET WC VALUE  FROM RELATIVE POINTER LOCATER IN THE     11104021
*              - OPERAND INFORMATION BUFFER  THE ADDRESS OF WHICH I     11112021
*              - IN XR3                                                 11120021
XEWCL    ST    XR5,XGSAV6                                               11128021
       LH    XR5,Y1TEM(XR3)                                             11136021
       STH   XR5,XEREL                                                  11144021
       MH    XR5,XC008                                                  11152021
       STH   XR5,XEREL1                                                 11160021
         MVC   XYTEL(LX2),Y1TEL(XR3)                                    11168021
         L     XR5,XGSAV6                                               11176021
       BCR   UNCON,XRSUB           RETURN                               11184021
       SPACE 5                                                          11192021
*      XW000    -SALES ID OPERANDS GIVEN IN XR3 AND XR5.                11200021
*               -TRUNCATE INTEGERS OR DELETE DECIMAL BEFORE SCALING     11208021
*               -NECESSARY TO AVOID OVERFLOW.                           11216021
       SPACE 5                                                          11224021
XW000  STM   XR0,XR15,XGSAV1            SAVE .                          11232021
       L     XRVAR,XSSDB2                                               11240021
       USING XSSBG2,XRVAR                                               11248021
       BC    UNCON,XWW00           GO TO SCALING ROUTINE                11256021
       DROP  XRVAR                                                      11264021
       SPACE 5                                                          11272021
*      KILSUB   - KILL SUBSCRIPTS OPTIMIZATION TABLE.                   11280021
*                                                                       11288021
*                                                                       11296021
KILSUB STM   XR0,XR15,XGSAV8                                            11304021
       L     XR1,XASNT                                                  11312021
       BAL   XRSUB,XTBDEB          GET XSSNT INFO                       11320021
         XC    DX4(LX2,XR1),DX4(XR1)                                    11328021
       L     XR1,XASCRP                                                 11336021
       BAL   XRSUB,XTBDEB          GET XSCRPT INFO                      11344021
         XC    DX4(LX2,XR1),DX4(XR1)                                    11352021
         XC    XCSCEL(LX2),XCSCEL                                       11360021
       BAL   XRSUB,XINITM          INITIALIZE GEN REG TABLES            11368021
       LM    XR0,XR15,XGSAV8                                            11376021
       BCR   UNCON,XRSUB           RETURN                               11384021
       SPACE 10                                                         11392021
*      XTBDEB   - ROUTINE WHICH FINDS BEGINING OF A TAMER TABLE AND     11400021
*               - DISPLACEMENT OF THIS TABLE.                           11408021
*               - INPUT  = TIB ADDRESS IN XR1.                          11416021
*               - OUTPUT = BEGINING OF TABLE IN XR2.                    11424021
*                          DISPLACT.     -   IN XR3.                    11432021
       SPACE 5                                                          11440021
XTBDEB   L     XR1,DX0(XR1)              XR1 HAS TAM ADDRESS            11448021
         L     XR2,DX0(XR1)              XR2 HAS BEG.OF TABLE           11456021
       N     XR2,XEMK1                  X                               11464021
         LH    XR3,DX4(XR1)              XR3 HAS NUMBER OF BYTES        11472021
       BCR   UNCON,XRSUB                OCCUPIED  SO FAR.               11480021
       SPACE 10                                                         11488021
IKF502 CSECT                                                            11496021
COMON2 EQU     *                                                        11504021
*      XINSCN- SEARCH AN INTERMEDIATE RESULT IN XINTR TABLE             11512021
*              THE NUMBER OF THE INTER. RESULT IS IN XR6.               11520021
*              ADDRESS OF INTER. RESULT RETURNED IN XR6.                11528021
*                                                                       11536021
*                                                                       11544021
       SPACE 5                                                          11552021
XINSCN LR    RW5,RETRG                                                  11560021
       L     XR1,XAINTR                                                 11568021
       BAL   XRSUB,XTBDEB          GET XINTR INFO                       11576021
       AR    XR3,XR2                                                    11584021
XINSC1 CR    XR3,XR2                                                    11592021
       BC    XLOEQ,XGLOG                ABNORMAL END OF TABLE XINTR     11600021
         CH    XR6,DX30(XR2)                                            11608021
       BC    XZERO,XG0P2           RIGHT ENTRY FOUND                    11616021
         LA    XR2,DX32(XR2)                                            11624021
       BC    UNCON,XINSC1          CHECK NEXT ENTRY                     11632021
XG0P2  EQU   *                                                          11640021
       LR    XR6,XR2                    XR6 HAS ADDRECS OF INTER RE     11648021
       BCR   UNCON,RW5             RETURN                               11656021
*                                                                       11664021
*                                                                       11672021
*      ERROR NUMBER 12.                                                 11680021
*                                                                       11688021
XGLOG  BAL   XRSUB,ERRPRO          PROCESS ERROR                        11696021
       DC    AL1(ERRN12)                                                11704021
       DC    AL1(8)                                                     11712021
*                                                                       11720021
*                                                                       11728021
       SPACE 5                                                          11736021
*      XLENGH   -GET LENGHT OF A DATA-NAME                              11744021
*               -INPUT - INPUT STRING GIVEN BY PH5 CONTROL.             11752021
*               -OUTPUT   FIXED LENGHT IN XOPLGH                        11760021
*                         VARIABLE  -   IN XOPVLC                       11768021
*                     IN ADDITION FOR A NUMERIC ELEMENTARY ITEM=        11776021
*                              XIDBY = LENGHT OF ITEM IN ID MODE.       11784021
*                              XBDBY = LENGHT -   -   -  BI   - .       11792021
*                              XIDDN = NUMBER OF DIGIT                  11800021
       SPACE 5                                                          11808021
XLENGH STM   XR0,XR15,XGSAV3                                            11816021
       L     XRVAR,XSSDB2                                               11824021
       USING XSSBG2,XRVAR                                               11832021
       BC    UNCON,XSUDB2          GO TO BRANCH ROUTINE                 11840021
       DROP  XRVAR                                                      11848021
       SPACE 10                                                         11856021
*      XIS31    -UPDATE ANY SUBSCRIPTED  DATA-NAME WITH NEW I,D,K F     11864021
*                IN INPUT STRING                                        11872021
       SPACE 5                                                          11880021
XIS31  STM   XR0,XR15,XGSAV1                                            11888021
       L     XRVAR,XSSDB2                                               11896021
       USING XSSBG2,XRVAR                                               11904021
       BC    UNCON,XSUDB3          GO TO UPDATE ROUTINE                 11912021
       DROP  XRVAR                                                      11920021
       SPACE 10                                                         11928021
XPACK  STM   XR0,XR15,XGSAV6                                            11936021
       L     XRVAR,FPALOD                                               11944021
       USING FPLLOD,XRVAR                                               11952021
       BC    UNCON,XPPACK          GO TO PACK ROUTINE                   11960021
       DROP  XRVAR                                                      11968021
       SPACE 10                                                         11976021
*      XRSASG   - ASSIGNS A SINGLE REGISTER - RETURNS THE REGISTER      11984021
*               - NUMBER IN XREGNO. THE REGISTERS ARE ASSIGNED WITH     11992021
*               - THE FOLLOWING PRIORITY ORDER -                        12000021
*                                 1) FREE REGISTER AVAILABLE            12008021
*                                        A)NOT BELONGING TO AN ODD-     12016021
*                                          PAIR                         12024021
*                                        B)ODD REGISTER OF A PAIR       12032021
*                                        C)EVEN REGISTER OF A PAIR      12040021
*                                 2)NO FREE REGISTER AVAILABLE          12048021
*                                        A)NOT BELONGING TO A PAIR      12056021
*                                          NOT OCCUPIED BY AN OPERA     12064021
*                                          OF THE ACTUAL OPERATION.     12072021
*                                        B)NOT OCCUPIED BY AN OPERA     12080021
*                                          OF THE ACTUAL OPERATION      12088021
*                                          THE ODD REGISTER PREFERE     12096021
*                                          THE EVEN                     12104021
       SPACE 5                                                          12112021
XRSASF STM   XR0,XR15,XGSAV4                                            12120021
       LA    XR1,FPRTB2                                                 12128021
       LA    XR2,FPRTBD                                                 12136021
       BC    UNCON,XRA09           ASSIGN A FL PT REG                   12144021
       SPACE 2                                                          12152021
XRSUAS STM   XR0,XR15,XGSAV4                                            12160021
       LA    XR1,XRAUR4                                                 12168021
       LA    XR2,XRAUR2                                                 12176021
         LH    XR3,XC008                                                12184021
       LCR   XR3,XR3                                                    12192021
       BC    UNCON,XRA08           ASSIGN A GEN REG                     12200021
XRSASG STM   XR0,XR15,XGSAV4                                            12208021
       LA    XR1,XRAUR2                                                 12216021
       LA    XR2,XRAU14                                                 12224021
XRA09  EQU   *                                                          12232021
         LH    XR3,XC008                                                12240021
XRA08  LR    XR4,XR1                                                    12248021
       LA    XR5,XRA02                  TABLE FOR REGISTER              12256021
       LA    XR6,XRA01                                                  12264021
XRA02    TM    DX2(XR4),XRFREE           IS THIS REGISTER FREE.         12272021
       BC    XZERO,XRAEXI               YES SET RG NUMBER AND EXIT      12280021
*                                                                       12288021
*                                                                       12296021
       SPACE 2                                                          12304021
XRA00  CR    XR4,XR2                                                    12312021
       BCR   XZERO,XR6                  YES-TAKE NEXT STEP.             12320021
       AR    XR4,XR3                                                    12328021
       BCR   UNCON,XR5             TEST NEXT REG                        12336021
       SPACE 2                                                          12344021
XRA01  LR    XR4,XR1                                                    12352021
       LA    XR5,XRA03                  SET UP TRANSFER REGISTERS.      12360021
       LA    XR6,XRA05                                                  12368021
XRA03    TM    DX2(XR4),XRVADS           IS IT USED IN A PAIR OR BY     12376021
       BC    XNOEQ,XRA00                OPERAND OF THE OPERATION.       12384021
*                                       NO,SET REG.NUMBER.              12392021
*                                       SAVE CONTENT OF REG. IN TEM     12400021
       BC    UNCON,XRAETX          SAVE REG                             12408021
       SPACE 2                                                          12416021
XRA05  LR    XR4,XR1                                                    12424021
       LA    XR5,XRA07                                                  12432021
       LA    XR6,XRAEXI                                                 12440021
XRA07    TM    DX2(XR4),XSVA12           IS IT OCCUPIED BY AN OPER.     12448021
       BC    XNOEQ,XRA00                THE STRING.                     12456021
*                                       NO,SET REG NUMBER.              12464021
XRAETX BAL   XRSUB,XRSTOR               SAVE REG.                       12472021
*                                       RETURN.                         12480021
XRAEXI   MVC   XREGNO(LX1),DX3(XR4)                                     12488021
       ST    XR4,XLIRP                                                  12496021
       LM    XR0,XR15,XGSAV4                                            12504021
       BCR   UNCON,XRSUB           RETURN                               12512021
       EJECT                                                            12520021
*      XRSTOR  - SAVE CONTENTS OF A NEWLY ASSIGNED REGISTER IN A        12528021
*              - TEMPORARY STORAGE                                      12536021
*                                             NEEDS ADDRESS OF INFO     12544021
*              - TABLE OF THIS REGISTER IN XR4.                         12552021
*              - GENERATES  ST OR STM INSTRUCTIONS NEEDED AT OBJECT     12560021
*              - TIME.                                                  12568021
       SPACE 5                                                          12576021
XRSTOR STM   XR0,XR15,XGSAV5                                            12584021
       L     XRVAR,XSSDB2                                               12592021
       USING XSSBG2,XRVAR                                               12600021
       BC    UNCON,XSUDB4          GO TO SAVE REG ROUTINE               12608021
       DROP  XRVAR                                                      12616021
         EJECT                                                          12624021
*      XSLODB   - LOAD AN OPERAND IN A DOUBLE  REGISTER.                12632021
*               - INPUT.                                                12640021
*                         ADDRESS OF OPERAND IN XR3.                    12648021
*               - OUTPUT                                                12656021
*                        A) IF OPERAND IS TWO WORDS,GENERATES           12664021
*                                                                       12672021
*                                                       LM  R1,R2,O     12680021
*                        B) IF OPERAND IS ONE WORD ,GENERATES           12688021
*                                                       L   R0,OP       12696021
*                                                     SRDA  R0,32       12704021
*                        C) IF OPERAND IS IN IR AND AN EVEN-ODD PAI     12712021
*                           IS FREE            LR   R0,RI               12720021
*                                              SRDA R0,32               12728021
*                        D) IF OPERAND IS A SINGLE WORD IN              12736021
*                           THE EVEN OF A PAIR OF IR .                  12744021
*                                       (IF NECESSARY) ST  R1, TEMP     12752021
*                                                     SRDA R0,32        12760021
*                             OR IN THE ODD IR OF A PAIR                12768021
*                                       (IF NECESSARY) ST  R0,TEMP      12776021
*                                                      LR  R0,R1        12784021
*                                                    SRDA  R0,32        12792021
*                                                                       12800021
*                             OR IN IR NOT BELONGING TO A PAIR          12808021
*                                       (IF NECESSARY)STM  R0,R1,TE     12816021
*                                                     LR   R0,RK        12824021
*                                                     SRDA R0,32        12832021
*                                                                       12840021
*      XSLOAS  -  LOADS AN OPERAND IN A REGISTER USING THE LENGHT       12848021
*              -  AFTER SCALING.                                        12856021
*              -  INPUT. ADDRESS OF OPERAND IN XR3.                     12864021
*              -  OUTPUT.                                               12872021
*                             L  R,OP                                   12880021
*                                                                       12888021
*               -  THE 2 PRECEDING ROUTINES ASSIGN REGISTERS- SAVE      12896021
*              -  REGISTER TO BE USED IF NECESSARY -AND SET CORRECT     12904021
*                 INFORMATION IN INFORMATION BUFFER THE ADDRESS OF      12912021
*                 WHICH IS IN XR3.                                      12920021
*                                                                       12928021
*      XSLGVX  -  LOAD  OPERAND IN A GIVEN IR THE NUMBER OF WHICH I     12936021
*                 IN XREGNO,AND WORKS LIKE XSLOAS                       12944021
*                                                                       12952021
*       XSLGVB  -  LOAD OPERAND IN A GIVEN PAIR OF IR, THE NUMBER OF    12960021
*                 WHICH IS IN XREGNP                                    12968021
       SPACE 5                                                          12976021
XSLGVB MVI   XSLSW,XL2RSX                                               12984021
         MVC   XREGNO(LX1),XREGNP                                       12992021
         B     XSLSX               SET LENGTH                           13000021
       SPACE 2                                                          13008021
XSLODB MVI   XSLSW,XL2REG               LOAD IN A DOUBLE IR.            13016021
         B     XSLSX               SET LENGTH                           13024021
       SPACE 2                                                          13032021
XSLGVX MVI   XSLSW,XLASRX               LOAD IN A GIVEN IR AFTER SC     13040021
         B     XSLSX               SET LENGTH                           13048021
       SPACE 2                                                          13056021
XSLOAS   MVI   XSLSW,XX00                LOAD IN AN IR AFTER SCALING    13064021
XSLSX    MVC   XZLENG(LX2),Y1BBS(XR3)    SET LENGHT FOR A-TEXT SET U    13072021
       SPACE 2                                                          13080021
         STM   XR0,XR15,XGSAV3          SAVE                            13088021
       L     XRVAR,FPALOD                                               13096021
       USING FPLLOD,XRVAR                                               13104021
       BC    UNCON,LOADEB          GO TO LOAD ROUTINE                   13112021
       DROP  XRVAR                                                      13120021
       SPACE 10                                                         13128021
*                                                                       13136021
*      FPLOAD   - LOAD A FLOATING POINT OPERAND IN A REGISTER  IN       13144021
*                 LONG FORM  IF OPERAND IS A DP FLOATING POINT OPER     13152021
*                 OR IN SHORT FORM OTHERWISE.                           13160021
*                                                                       13168021
*      FPLDS    - LOAD A FLOATING POINT OPERAND IN A REGISTER-SHORT     13176021
*                 FORM                                                  13184021
*                                                                       13192021
*      FPLDL    - LOAD A FLOATING POINT OPERAND IN A REGISTER-LONG      13200021
*                 FORM                                                  13208021
*                                                                       13216021
*      FPLD0    - LOAD A FLOATING POINT OPERAND IN REGISTER 0 -LONG     13224021
*                 FORM                                                  13232021
       SPACE 2                                                          13240021
*               - XR3 WILL POINT TO X(I)VAL  I =1 OR 2                  13248021
       SPACE 5                                                          13256021
FPLOAD   TM    Y1IRX+NX1(XR3),XGDPFP                                    13264021
       BC    XTHRE,FPLDL           OPERAND IS DP                        13272021
       SPACE 2                                                          13280021
FPLDS    MVI   XSLSW,XX01                LOAD IN SHORT FORM.            13288021
       BC    UNCON,FPL01           SAVE REGS                            13296021
       SPACE 2                                                          13304021
FPLDL    MVI   XSLSW,XX02                LOAD IN LONG FORM.             13312021
       BC    UNCON,FPL01           SAVE REGS                            13320021
       SPACE 2                                                          13328021
FPLD0    MVI   XSLSW,XX00                LOAD IN 0 - LONG FORM.         13336021
FPL01  STM   XR0,XR15,XGSAV3                                            13344021
       L     XRVAR,FPALOD                                               13352021
       USING FPLLOD,XRVAR                                               13360021
       BC    UNCON,FPLLLB          GO TO FL PT LOAD ROUTINE             13368021
       DROP  XRVAR                                                      13376021
       SPACE 5                                                          13384021
*      XRDBIR  - ASSIGNS A EVEN-ODD PAIR OF REGISTERS. EVEN IR NUMB     13392021
*              - IS RETURNED IN XREGNP - IR INFORMATION TABLE ADDRE     13400021
*              - OF THE EVEN REG.IS RETURNED IN XLIRP.                  13408021
*                                                                       13416021
       SPACE 5                                                          13424021
XRDBIR EQU   *                                                          13432021
         STM   XR0,XR15,XGSAV4          SAVE                            13440021
       LA    XR6,XRAU14                 LOAD XR6 WITH ADDRESS OF LA     13448021
*                                       IR.                             13456021
       LA    XR4,XRAU22                 XR4 HAS ADDRESS OF FIRST EV     13464021
*                                       REG.                            13472021
         L     XR3,DX4(XR4)              XR3 HAS CORRESPONDING ODD.     13480021
XRB02    TM    DX2(XR4),XRFREE                                          13488021
       BC    XTHRE,XRB03                THIS PAIR NOT FREE.             13496021
         TM    DX2(XR3),XRFREE                                          13504021
       BC    XTHRE,XRB03           ODD REG NOT FREE                     13512021
       SPACE 2                                                          13520021
XRBEXI ST    XR4,XLIRP                  SET OUTPUT INFORMATION FOR      13528021
         MVC   XREGNP(LX1),DX3(XR4)       ASSIGNED PAIR.                13536021
       SPACE 2                                                          13544021
         LM    XR0,XR15,XGSAV4          EXIT                            13552021
       BCR   UNCON,XRSUB           RETURN                               13560021
       SPACE 2                                                          13568021
XRB03  CR    XR4,XR6                                                    13576021
       BC    XONE,XRB04            NOT AT END OF TABLE                  13584021
*                                                                       13592021
         LA    XR4,XRAU22          ASSIGN FIRST PAIR NOT OCCUPIED       13600021
         L     XR3,DX4(XR4)              BY AN OPERAND OF THE SAME      13608021
XRB09    TM    DX2(XR4),XRVA12           STRING.                        13616021
       BC    XNOEQ,XRB06               OCCUPIED BY PERAND OF THE        13624021
*                                       STRING.                         13632021
         TM    DX2(XR3),XRVA12           SAME TEST FOR 2ND REG.OF TH    13640021
       BC    XNOEQ,XRB06                PAIR.                           13648021
       LA    XRSUB,XRBEXI               IF REGISTER USED IN DP MODE     13656021
         TM    DX2(XR4),XRDPRE           GENERATE STM                   13664021
       BC    XTHRE,XRSTOR               X                               13672021
*                                                                       13680021
       SPACE 2                                                          13688021
         TM    DX2(XR4),XRFREE         IF NOT, SAVE REGISTERS           13696021
       BC    XZERO,XRB08                SEPARATELY IF NEEDED.           13704021
       BAL   XRSUB,XRSTOR               X                               13712021
XRB08    TM    DX2(XR3),XRFREE           X                              13720021
       BC    XZERO,XRBEXI               X                               13728021
       LR    XR4,XR3                    X                               13736021
       BAL   XRSUB,XRSTOR               X                               13744021
         L     XR4,DX4(XR4)              X                              13752021
       BC    UNCON,XRBEXI               X                               13760021
XRB06  CR    XR4,XR6                                                    13768021
       BC    XZERO,XRLOG                THRE PAIRS OCCUPIED BY THE      13776021
       LA    XR4,XRNEXI(XR4)            STRING - LOG.ERROR.             13784021
         L     XR3,DX4(XR4)              NOT ALL PAIR EXAMINED,TRY N    13792021
       BC    UNCON,XRB09                ONE.                            13800021
*                                                                       13808021
*      LOGIC ERROR NUMBER 1                                             13816021
*                                                                       13824021
XRLOG  BAL   XRSUB,ERRPRO          GO TO ERROR PROCESSOR                13832021
       DC    AL1(ERRN01)                                                13840021
       DC    AL1(8)                                                     13848021
*                                                                       13856021
XRB04  LA    XR4,XRNEXI(XR4)                                            13864021
         L     XR3,DX4(XR4)                                             13872021
       BC    UNCON,XRB02           CHECK NEXT PAIR                      13880021
       EJECT                                                            13888021
*      XZWHIR  - IF OPERAND,OF WHICH THE ADDRESS OF TABLE INFO.IS I     13896021
*                XR3,IS IN REG ,XLIRP WILL BE SET WITH ADDRESS OF T     13904021
*                INFO FOR THAT REGISTER - IF NOT OPERAND WILL BE        13912021
*                SUPPOSED TO BE LOADED IN IR INFO TABLE OF WHICH IS     13920021
*                XR4. OP.TABLE AND IR TABLE WILL BE UPDATED ACCORDI     13928021
*                THAT FACT.                                             13936021
       SPACE 5                                                          13944021
XZWHIR   STM   XR0,XR15,XGSAV4                                          13952021
         TM    Y1IRX+NX1(XR3),XINREG     IS OP IN REG                   13960021
       BC    XTHRE,XZWH04               YES                             13968021
         MVO   Y1IRX(LX1,XR3),DX3(LX1,XR4)                              13976021
         OI    Y1IRX+NX1(XR3),XINREG     X    AND SET FLAG IN IR  AL    13984021
         NC    DX0(LX3,XR4),XREMK6                                      13992021
         OI    DX2(XR4),XRFREE           X                              14000021
       C     XR3,XAVAL1                 X                               14008021
       BC    XZERO,XZWH01               X                               14016021
         OI    DX2(XR4),XRVAL2           X                              14024021
       BC    UNCON,XZWH03               X                               14032021
XZWH01   OI    DX2(XR4),XRVAL1           X                              14040021
XZWH03   CLI   Y1TEL+NX1(XR3),XX00                                      14048021
       BC    XZERO,XZWH04               RELEASE TEMP IF NECESSARY       14056021
       CLI   DOP1,TEMRES           IF OP IS A TEMPORARY RESULT          14064021
       BE    XZWH06                DO NOT RELEASE TEMP STORAGE          14072021
         MVC   XYTEL(LX4),Y1TEL(XR3)                                    14080021
       BAL   XRSUB,XERELS              X                                14088021
XZWH06   MVC   Y1TEL(LX4,XR3),XC000                                     14096021
       SPACE 2                                                          14104021
XZWH04   UNPK  XREGNO(LX1),Y1IRX(LX1,XR3) MOVE ZONE TO NUMBERIC         14112021
         NI    XREGNO,XX0F                                              14120021
       LA    XRSUB,XZWH05                                               14128021
         TM    Y1IRX+NX1(XR3),XFTPT                                     14136021
       BC    XTHRE,XFWHIR          REG IS A FL PT REG                   14144021
       BC    UNCON,XLWHIR          REG IS A GEN REG                     14152021
XZWH05 EQU   *                                                          14160021
         LM    XR0,XR15,XGSAV4                                          14168021
       BCR   UNCON,XRSUB                X                               14176021
         EJECT                                                          14184021
*      XLWHIR   -  SET XLIRP WITH  BUFFER ADDRESS OF INFORMATION        14192021
*               -  TABLE  OF A GIVEN REGISTER  OF WHICH THE NUMBER      14200021
*               -  IN XREGNO                                            14208021
       SPACE 5                                                          14216021
XFWHIR STM   XR0,XR15,XGSAV5            SCAN FP.REG TABLE.              14224021
       LA    XR2,FPRTB2                                                 14232021
       BC    UNCON,XLW00           BEGIN                                14240021
XLWHIR STM   XR0,XR15,XGSAV5                                            14248021
       LA    XR2,XRAUR2                 XR2 HAS ADDRESS IF FIRST IR     14256021
XLW00    CLC   XREGNO(LX1),DX3(XR2)                                     14264021
       BC    XZERO,XLW01           THIS IS CORRECT REG TBL              14272021
       LA    XR2,XRNEXI(XR2)            GET NEXT IR TABLE               14280021
       BC    UNCON,XLW00           NEXT TBL                             14288021
       SPACE 2                                                          14296021
XLW01  ST    XR2,XLIRP                  SET XLIRP                       14304021
       LM    XR0,XR15,XGSAV5            RETURN                          14312021
       BCR   UNCON,XRSUB           RETURN                               14320021
       EJECT                                                            14328021
*      XZSCL    -GENERATE CODING FOR SCALING IN BINARY. OPERAND BUF     14336021
*                ADDRESS IN XR3.                                        14344021
*                                                                       14352021
*      XZBMP    -GENERATE CODES FOR BINARY MULTIPLICATION-OPERAND       14360021
*                BUFFERS ADDRESSES IN XR3 AND XR5.                      14368021
*                                                                       14376021
********                  -GENERATED CODES-                    ****     14384021
       SPACE 5                                                          14392021
XZSCL    MVI   XZCSW,XX01                SCALING.                       14400021
       BC    UNCON,XZSC1           GO TO MULTIPLY ROUTINE               14408021
XZBMP    MVI   XZCSW,XX00                MULTIPLY                       14416021
XZSC1  STM   XR0,XR15,XGSAV2                                            14424021
       L     XRVAR,FPALOD                                               14432021
       USING FPLLOD,XRVAR                                               14440021
       BC    UNCON,XZBEG           GO TO MULTIPLY ROUTINE               14448021
       DROP  XRVAR                                                      14456021
       SPACE 5                                                          14464021
*      XSCBOA  CHECK IF SCALING IS POSSIBLE IN BINARY THROUGH A SIN     14472021
*              MULTIPLY OR A DIVIDE.                                    14480021
*              IF YES RETURN AT 4(XRSUB)                                14488021
*              IF NO RETURN AT  0(XRSUB)                                14496021
       SPACE 2                                                          14504021
XSCBOA   CLI   Y1BAS+NX1(XR3),XX08                                      14512021
       BCR   XTWO,XRSUB                 BI SCALING IMPOSSIBLE.          14520021
       LH    XR2,Y1ALP(XR3)                                             14528021
       LPR   XR0,XR2                                                    14536021
       CH    XR0,XC009                  IS DIVISOR OR MULTIPLIER GT     14544021
       BCR   XTWO,XRSUB                 ONE WORD - YES  NO BI SCALI     14552021
       LTR   XR2,XR2                                                    14560021
       BC    XONE,XSCBO1           THIS IS A NEG SCALE                  14568021
         CLI   Y1BBS+NX1(XR3),XX04       IS OPERAND GT ONE WORD         14576021
XSCBO2 BCR   XTWO,XRSUB                 YES - NO BI SCALING.            14584021
         BC    UNCON,DX4(XRSUB)          BINARY SCALING FEASIBLE.       14592021
XSCBO1   CLI   Y1BAS+NX1(XR3),XX04       IS QUOTIENT  GT  ONE WORD      14600021
       BC    UNCON,XSCBO2          RETURN                               14608021
         EJECT                                                          14616021
*      XBIIDB  - CONVERT OPERAND FROM BINARY TO ID                      14624021
*              - XR3 POINTS TO XIVAL BUFFER   I = 1,2                   14632021
       SPACE 5                                                          14640021
XBIIDB STM   XR0,XR15,XGSAV8                                            14648021
         L     XRVAR,FPALOD                                             14656021
       USING FPLLOD,XRVAR                                               14664021
       BC    UNCON,XBIIDU          GO TO CONVERT ROUTINE                14672021
       DROP  XRVAR                                                      14680021
       SPACE 10                                                         14688021
*      XIDBIB   - CONVERT  FROM  ID  TO BI  BEFORE SCALING.             14696021
*                                                                       14704021
*      XIDBIA   - CONVERT FROM  ID TO  BI  AFTER SCALING.               14712021
*                                                                       14720021
*               - FOR BOTH ROUTINES  XR3 POINTS  TO  XIVAL BUFFER.      14728021
       SPACE 5                                                          14736021
XIDBIB   MVC   XZLENG(LX2),Y1LBS(XR3)                                   14744021
         MVC   XGTEM2+NX8(LX2),Y1BBS(XR3)                               14752021
       LH    XR6,Y1FBS(XR3)                                             14760021
       BC    UNCON,XIDBI1          GO TO CONVERT ROUTINE                14768021
       SPACE 2                                                          14776021
XIDBIA   MVC   XZLENG(LX2),Y1LAS(XR3)                                   14784021
         MVC   XGTEM2+NX8(LX2),Y1BAS(XR3)                               14792021
       LH    XR6,Y1FAS(XR3)                                             14800021
XIDBI1 STM   XR0,XR15,XGSAV8                                            14808021
       L     XRVAR,FPALOD                                               14816021
       USING FPLLOD,XRVAR                                               14824021
       BC    UNCON,XIDBIU          GO TO CONVERT ROUTINE                14832021
       DROP  XRVAR                                                      14840021
       SPACE 5                                                          14848021
*                                                                       14856021
*              CONVERT ROUTINE TO GO TO FLOATING POINT OR TO GO         14864021
*              FROM FLOATING POINT TO ID ,BI OR EFP.                    14872021
*                                                                       14880021
*                                                                       14888021
       SPACE 5                                                          14896021
BIIFP  STM   XR0,XR15,XGSAV8            BINARY TO IFP.                  14904021
       L     XRVAR,FPALOD                                               14912021
       USING FPLLOD,XRVAR                                               14920021
       BC    UNCON,BIIFPD          GO TO CONVERT ROUTINE                14928021
       DROP  XRVAR                                                      14936021
       SPACE 2                                                          14944021
IDIFP  STM   XR0,XR15,XGSAV8            INT.DEC. TO IFP.                14952021
       L     XRVAR,FPALOD                                               14960021
       USING FPLLOD,XRVAR                                               14968021
       BC    UNCON,IDIFPD          GO TO CONVERT ROUTINE                14976021
       DROP  XRVAR                                                      14984021
       SPACE 2                                                          14992021
EFPIFP STM   XR0,XR15,XGSAV8            EFP TO IFP.                     15000021
       L     XRVAR,FPALOD                                               15008021
       USING FPLLOD,XRVAR                                               15016021
       BC    UNCON,EFPIFD          GO TO CONVERT ROUTINE                15024021
       DROP  XRVAR                                                      15032021
       SPACE 2                                                          15040021
IFPBI  STM   XR0,XR15,XGSAV8            IFP TO BI.                      15048021
       L     XRVAR,FPALOD                                               15056021
       USING FPLLOD,XRVAR                                               15064021
       BC    UNCON,IFPBID          GO TO CONVERT ROUTINE                15072021
       DROP  XRVAR                                                      15080021
       SPACE 2                                                          15088021
IFPID  STM   XR0,XR15,XGSAV8            IFP TO ID.                      15096021
       L     XRVAR,FPALOD                                               15104021
       USING FPLLOD,XRVAR                                               15112021
       BC    UNCON,IFPIDB          GO TO CONVERT ROUTINE                15120021
       DROP  XRVAR                                                      15128021
       SPACE 2                                                          15136021
IFPEFP STM   XR0,XR15,XGSAV8                                            15144021
       L     XRVAR,FPALOD                                               15152021
       USING FPLLOD,XRVAR                                               15160021
       BC    UNCON,IFPEFD          GO TO CONVERT ROUTINE                15168021
       DROP  XRVAR                                                      15176021
       SPACE 5                                                          15184021
*      FPCVBG  -  CONVERT BOTH OPERANDS OF AN ARITHMETIC OPERATION      15192021
*                 IFP, AND MAKE SURE THAT THEY ARE BOTH LONG FORM O     15200021
*                 BOTH SHORT FORM  -                                    15208021
*                 XR3 POINTS TO X1VAL , XR5 POINTS TO X2VAL.            15216021
       SPACE 5                                                          15224021
FPCVBG STM   XR0,XR15,XGSAV7                                            15232021
       L     XRVAR,FPALOD                                               15240021
       USING FPLLOD,XRVAR                                               15248021
       BC    UNCON,FPCVBH          GO TO CONVERT ROUTINE                15256021
       DROP  XRVAR                                                      15264021
       SPACE 5                                                          15272021
*      FPLDAN  - LOAD ONE OPERAND OF A FLOATING POINT OPERATION INT     15280021
*              - A REGISTER IF  NEITHER OF THEM IS LOADED.              15288021
       SPACE 5                                                          15296021
FPLDAN   TM    Y1IRX+NX1(XR3),XINREG                                    15304021
       BCR   XTHRE,XRSUB           RETURN                               15312021
       ST    XRSUB,XVARS1                                               15320021
         TM    Y1IRX+NX1(XR5),XINREG                                    15328021
       BC    XZERO,FPLDA0          NEITHER IS IN A REG                  15336021
       BAL   XRSUB,XZX3X5          2ND OPERAND WAS IN A REG             15344021
FPLDA1 L     XRSUB,XVARS1                                               15352021
       BCR   UNCON,XRSUB           RETURN                               15360021
FPLDA0 BAL   XRSUB,FPLOAD          GO TO LOAD ROUTINE                   15368021
       BC    UNCON,FPLDA1          RETURN                               15376021
       SPACE 5                                                          15384021
*      FPRESF   - SET FLAG IN RESULT BUFFER FOR FP.OPERATION.           15392021
       SPACE 2                                                          15400021
FPRESF   NI    Y1IRX+NX1(XR3),XX2F       RESET LITERAL FLAGS.           15408021
         MVC   XFTEL(LX6),Y1TEL(XR3)                                    15416021
       BCR   UNCON,XRSUB           RETURN                               15424021
       SPACE 2                                                          15432021
*      XFREER  -  FREE A REGISTER THE NUMBER OF WHICH IS IN XREGNO.     15440021
*      XFREEP  -   -   - PAIR OF REG  THE EVEN NUMBER  -  -   -   .     15448021
*              -  OUTPUT' XR4 WILL HAVE RX ADDRESS TABLE.               15456021
       SPACE 5                                                          15464021
XFREER STM   XR5,XR3,XGSAV3                                             15472021
       SR    XR0,XR0                    XR0 = SWITCH.                   15480021
       BC    UNCON,XFR000          BEGIN                                15488021
       SPACE 2                                                          15496021
XFREEP STM   XR5,XR3,XGSAV3                                             15504021
       LH    XR0,XMINON                                                 15512021
XFR000 L     XRVAR,FPALOD                                               15520021
       USING FPLLOD,XRVAR                                               15528021
       BC    UNCON,XFREEU          GO TO FREE ROUTINE                   15536021
       DROP  XRVAR                                                      15544021
       SPACE 5                                                          15552021
XSETVM STM   XR0,XR15,XGSAV1                                            15560021
       L     XRVAR,XASETV                                               15568021
       USING XSETVL,XRVAR                                               15576021
       BC    UNCON,XSETVU          GET OPERAND INFO INTO BUFFER         15584021
       DROP  XRVAR                                                      15592021
XSETVN STM   XR0,XR15,XGSAV1                                            15600021
       L     XRVAR,XASETV                                               15608021
       USING XSETVL,XRVAR                                               15616021
       LA    XR4,X1VAL                                                  15624021
       OI    XSESWT,XS2OP                                               15632021
       B     XG050                 GO TO XG050 IN XSETVL                15640021
       DROP  XRVAR                                                      15648021
XSETVQ   DS    0H                                                 51894 15656021
         STM   XR0,XR15,XGSAV1                                    51894 15664021
         L     XRVAR,XASETV                                       51894 15672021
         USING XSETVL,XRVAR                                       51894 15680021
         B     XSETVP              GET INFO OF DOP IN XR3         51894 15688021
         DROP  XRVAR                                              51894 15696021
       SPACE 5                                                          15704021
*   TEST IF THE STRING IS A MOVE OR A STORE - IF YES RETURN IS 0(XR     15712021
*   IF NO RETURN IS 4(XRSUB).                                           15720021
*                                                                       15728021
       SPACE 5                                                          15736021
XSTOMV   CLI   HEADER+NX1,XX1D                                          15744021
       BCR   XZERO,XRSUB           RETURN                               15752021
         CLI   HEADER+NX1,XX05                                          15760021
       BCR   XZERO,XRSUB           RETURN                               15768021
         CLI   HEADER+NX1,XX6D     EQUATE IN SEARCH ALL...              15776021
       BCR   XZERO,XRSUB          YES                                   15784021
         BC    UNCON,DX4(XRSUB)   NO, RETURNS-4(XRSUB)                  15792021
       SPACE 5                                                          15800021
*      LTLTST  TEST IF BOTH OPERANDS OF AN ARITHMETIC OP ARE LITERA     15808021
*                            IF YES RETURN  4(XRSUB)                    15816021
*                            IF NO, RETURN 0(XRSUB)                     15824021
       SPACE 5                                                          15832021
LTLTST   TM    X1IRX+NX1,XZGNLT                                         15840021
       BCR   XZERO,XRSUB                NO ANSWER.                      15848021
         TM    X2IRX+NX1,XZGNLT                                         15856021
       BCR   XZERO,XRSUB                NO ANSWER                       15864021
         BC    UNCON,DX4(XRSUB)          YES ANSWER.                    15872021
       SPACE 5                                                          15880021
*                                                                       15888021
*   SET  BUFFER FOR A ONE DIGIT LITERAL.                                15896021
*                                                                       15904021
XONDGT MVI   Y1IRX(XR4),XGINDC                                          15912021
         OI    Y1IRX+NX1(XR4),XGCOLT                                    15920021
         MVI   Y1BBS+NX1(XR4),XX02                                      15928021
         MVI   Y1LBS+NX1(XR4),XX01                                      15936021
         MVI   Y1FBS+NX1(XR4),XX01                                      15944021
       BCR   UNCON,XRSUB           RETURN                               15952021
       SPACE 5                                                          15960021
*            GENERATE   DC   AL4(TEMPORARY-STORAGE)                     15968021
*                                                                       15976021
       SPACE 2                                                          15984021
SUBST1   MVI   GMADCN+NX1,XX01           SET BASE CODE WANTED           15992021
         MVI   GMADCN,XX64                                              16000021
       LH    XR6,XEREL1                                                 16008021
       SH    XR6,XC007                                                  16016021
         STH   XR6,GMADCN+NX2                                           16024021
       MVI   GMCTYP,MADCON                                              16032021
SUBST3 BAL   XRSUB,MACRO           GENERATE MACRO                       16040021
       BCR   UNCON,XR2             RETURN                               16048021
       SPACE 2                                                          16056021
*            GENERATE   DC   XL2'BYTES OF INFO'                         16064021
       SPACE 2                                                          16072021
SUBST2   MVC   XCON1+NX1(LX2),DX8(XR3)                                  16080021
         MVI   XCON1,XX02                                               16088021
SUBST4 MVI   XIMM,MDC                                                   16096021
       BC    UNCON,SUBST3          GENERATE MACRO                       16104021
       SPACE 3                                                          16112021
*      XSETLT - SET INTERMEDIATE RESULT AS GENERATED CONSTANT.          16120021
       SPACE 5                                                          16128021
XSETLT   OI    XFIRX+NX1,XGNCON          SET GENERATED CONSTANT FLAG    16136021
       MVI   XFIRX,XGINDC               SET ID MODE.                    16144021
         CP    XFVAL(LX16),XINDCZ(LX1)                                  16152021
       BCR   XNOEQ,XRSUB           RETURN                               16160021
         OI    XFIRX+NX1,XLITZR          SET ZERO VALUE FLAF.           16168021
       BCR   UNCON,XRSUB           RETURN                               16176021
       SPACE 5                                                          16184021
*            CONVERT ID. LITERAL TO BINARY-- LITERAL IS IN 6(XR3)       16192021
*                                                                       16200021
       SPACE 3                                                          16208021
XCONLV   CLI   XZLENG+NX1,XX04                                          16216021
       BC    XTWO,XCONV1           LENGTH GREATER THAN 4                16224021
         CVB   XR0,DX8(XR3)                                             16232021
         SRDA  XR0,DX32                                                 16240021
       BC    UNCON,XCONV2          RETURN                               16248021
XCONV1   LA    XR1,DX6(XR3)                                             16256021
         NI    DX6(XR3),XX0F                                            16264021
       BAL   XRSUB,GJOHN           CONVERT TO BINARY                    16272021
XCONV2   STM   XR0,XR1,XCON+NX8                                         16280021
       BCR   UNCON,XR2             RETURN                               16288021
       SPACE 5                                                          16296021
*      XLTRGN  LOAD AN DATA NAME IN A REG. AND SET THE CONDITION        16304021
*              CODE BY GENERATING A LTR XRN,XRN  .                      16312021
       SPACE 2                                                          16320021
XLTRGN   BAL   XRSUB,XSLOAS        LOAD OPERAND INTO A REG              16328021
       BAL   XRSUB,XZWHIR          GET REG TBL OF REG USED              16336021
       L     XR4,XLIRP                                                  16344021
         MVC   XREG1(LX1),DX3(XR4)                                      16352021
         MVC   XREG2(LX1),DX3(XR4)                                      16360021
       BAL   XRSUB,LTRBI           GENERATE A LTR                       16368021
       BCR   UNCON,XR1             RETURN                               16376021
       SPACE 5                                                          16384021
*   SET RESULT OR OPERAND BUFFER TO MAX. VALUES IN CASE OF              16392021
*  AN OVERFLOW ( MORE THAN 30 DIGITS ).---  XR5 POINTS TO THE BUFFE     16400021
       SPACE 2                                                          16408021
XSETOR   MVC   DX0(LX16,XR5),XC9999                                     16416021
XSETOP   MVI   Y1LAS+NX1(XR5),XX10                                      16424021
         MVI   Y1FAS+NX1(XR5),XX1E                                      16432021
         MVI   Y1BAS+NX1(XR5),XXFF                                      16440021
         OI    Y1IRX+NX1(XR5),XGOVFL                                    16448021
       BCR   UNCON,XRSUB           RETURN                               16456021
       SPACE 5                                                          16464021
*      XZRDVV  ASSIGN A SIZE ERROR TRANSFER IF NOT DONE YET AND SAV     16472021
*              IT IN XZTRA.                                             16480021
       SPACE 3                                                          16488021
XZRDVV TM    XGNSW,XZRDIV                                               16496021
       BCR   XTHRE,XR2             RETURN                               16504021
       BAL   XRSUB,XSTLHN          GET SIZE ERROR TRANSFER              16512021
       OI    XGNSW,XZRDIV                                               16520021
         XC    XGN1(LX2),XGN1                                           16528021
         MVC   XZRTRA(LX2),XGNTMP                                       16536021
       BCR   UNCON,XR2             RETURN                               16544021
       SPACE 3                                                          16552021
XSPRO  STM   XR0,XR15,XGSAV1                                            16560021
       L     XRVAR,FPALOD                                               16568021
       USING FPLLOD,XRVAR                                               16576021
       BC    UNCON,XSSPRO          GO TO SUBSCRIPT ROUTINE              16584021
       DROP  XRVAR                                                      16592021
LSPRO  STM   XR0,XR15,XGSAV1                                            16600021
       LR    XR3,RW2                                                    16608021
       L     XRVAR,FPALOD                                               16616021
       USING FPLLOD,XRVAR                                               16624021
       BC    UNCON,LSSPRO          GO TO SUBSCRIPT ROUTINE              16632021
       DROP   XRVAR                                                     16640021
       SPACE 5                                                          16648021
*  XRESTG    RELEASE REGISTERS AND TEMPORARY STORAGE USED BY AN IF      16656021
*            OR BY A COMPUTE STATEMENT.                                 16664021
       SPACE 5                                                          16672021
XRESTG EQU   *                                                          16680021
       BAL   XRSUB,XINITN          INIT GEN REG TBLS                    16688021
       BAL   XRSUB,XINITF          INIT FL PT REG TBLS                  16696021
         CLI   X1TEL+NX1,XX00                                           16704021
       BC    XZERO,XRA0A           1ST OPERAND NOT IN TEMP STORAGE      16712021
         MVC   XYTEL(LX4),X1TEL                                         16720021
       BAL   XRSUB,XERELS          RELEASE TEMP STOR USED BY 1ST OP     16728021
XRA0A    CLI   X2TEL+NX1,XX00                                           16736021
       BC    XZERO,XRA0B           2ND OPERAND NOT IN TEMP STORAGE      16744021
         MVC   XYTEL(LX4),X2TEL                                         16752021
       BAL   XRSUB,XERELS          RELEASE TEMP STOR USED BY 2ND OP     16760021
XRA0B  BC    UNCON,PH5CTL          RETURN TO CONTROL                    16768021
*                                                                       16776021
       SPACE 5                                                          16784021
*          WKZAP  -  ZAP AN OPERAND FROM WORKA(10,13) TO TEMPORARY      16792021
*                    STORAGE                                            16800021
*                                                                       16808021
*                                                                       16816021
       SPACE 2                                                          16824021
WKZAP1   MVI   XL2+NX1,XX10                                             16832021
       BC    UNCON,WKZAP2          GENERATE ZAP                         16840021
WKZAP    MVI   XL2+NX1,XX0A                                             16848021
WKZAP2 ST    XRSUB,XVARS5                                               16856021
       BAL   XRSUB,XE16D           GET 16 BYTES OF TEMP STOR            16864021
         MVC   XWC1(LX2),XEREL1                                         16872021
         MVI   XL1+NX1,XX10                                             16880021
         MVI   BDISP2,XXD0                                              16888021
         MVI   BDISP2+NX1,WORKA                                         16896021
       BAL   XRSUB,ZAP             GENERATE ZAP                         16904021
         MVC   Y1TEL(LX4,XR3),XYTEL                                     16912021
       L     XRSUB,XVARS5                                               16920021
       BCR   UNCON,XRSUB           RETURN                               16928021
       SPACE 5                                                          16936021
XMONDV EQU   *                          FIND OUT IF THIS DIVIDE IS      16944021
         MVI   XMONDD,XX00               ALL BY ITSELF IN WHICH CASE    16952021
*                                       SET DMAX = DRESULT.             16960021
         CLI   DOP4+NX2,XX05       IS NEXT OPERATION A STORE            16968021
       BCR   XNOEQ,XRSUB                NO                              16976021
         OI    XMONDD,XX02               YES, SET SWITCH.               16984021
         CLI   DOP5,TEMRES         IF STORE IS INTO A TEMP RESULT,      16992021
       BCR   XZERO,XRSUB           RETURN                               17000021
*                                       YES CHECK IF BOTH OPERAND A     17008021
         CLI   DOP1,XGIRI          DATA NAME OR LITERAL                 17016021
       BCR   XZERO,XRSUB           RETURN                               17024021
         CLI   DOP2,XGIRI                                               17032021
       BCR   XZERO,XRSUB           RETURN                               17040021
         OI    XMONDD,XX01               SET SWITCH DIVIDE ALONE.       17048021
         MVC   XRDMX(LX2),XGDRE                                         17056021
         BR    XRSUB                    RETURN                          17064021
*                                                                       17072021
       SPACE 5                                                          17080021
XHSMD1 STM   XR0,XR15,XGSAV1            SET MODE ROUTINE                17088021
       L     XRVAR,XSSDB2                                               17096021
       USING XSSBG2,XRVAR                                               17104021
       BC    UNCON,XHSMD           GO TO SET MODE ROUTINE               17112021
       DROP  XRVAR                                                      17120021
       SPACE 5                                                          17128021
XDPZAP STM   XR0,XR15,XGSAV1                                            17136021
         MVI   BDISP1,XXD0                                              17144021
         MVI   XL1+NX1,XX10                                             17152021
       LH    XR5,XMINFV                                                 17160021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           17168021
       BAL   XRSUB,ZAP             GENERATE ZAP                         17176021
       LM    XR0,XR15,XGSAV1                                            17184021
       BCR   UNCON,XRSUB           RETURN                               17192021
       SPACE 5                                                          17200021
       SPACE 2                                                          17208021
XBDSET   MVI   XL1+NX1,XX10                                             17216021
         MVI   BDISP1,XXD0                                              17224021
         MVI   BDISP2,XXD0                                              17232021
         MVI   BDISP1+NX1,WORKF                                         17240021
         MVI   BDISP2+NX1,WORKF                                         17248021
       BCR   UNCON,XRSUB           RETURN                               17256021
       SPACE 5                                                          17264021
XZPDPR EQU   *                                                          17272021
       BAL   XRSUB,XE16D           GET 16 BYTES OF TEMP STOR            17280021
         MVC   XWC1(LX2),XEREL1                                         17288021
         MVI   XL1+NX1,XX10                                             17296021
         MVI   XL2+NX1,XX10                                             17304021
         MVI   XPLUS2+NX2,XX10                                          17312021
         STC   XR1,BDISP2+NX1                                           17320021
         MVI   BDISP2,XXD0                                              17328021
       BAL   XRSUB,ZAP             GENERATE ZAP                         17336021
         MVC   XFTEL(LX4),XYTEL                                         17344021
       MVI   XFIRX,XGINDC                                               17352021
*                                                                       17360021
       BCR   UNCON,XR2             RETURN                               17368021
*                                                                       17376021
*                                                                       17384021
         SPACE 5                                                        17392021
*  CHECK  IF ALIGNEMENT IS NEEDED . THIS ONLY FOR RX USED WITH A DA     17400021
*  NAME                                                                 17408021
*                                                                       17416021
*                                                                       17424021
AXT017   EQU   *                                                        17432021
         SR    RW2,RW2                                                  17440021
         IC    RW2,OPCOD                CHECK  OPCOD  FOR AN  RX        17448021
         SRDL  RW2,DX4                   INSTRUCTION.                   17456021
         SRL   RW3,DX28                                                 17464021
         CH    RW3,XC000                                                17472021
         BNE   AXT020              IF NOT STORE TYPE BRANCH       4771  17480021
         OI    GBIT2,AXSTORE            IT IS A STORE TYPE INSTRUCT     17488021
         OI    GBIT1,SFPXXX                                             17496021
         CLI   OPCOD,XX60                STD.                           17504021
         BNE   AXT019                   NO-                             17512021
         OI    GBIT1,DFPXXX             YES,                            17520021
AXT019   CLI   OPCOD,XX40                    STH.                       17528021
         BNE   AXT010              NO                                   17536021
         OI    GBIT2,XX01                  YES-                         17544021
AXT010   EQU   *                                                        17552021
         TM    GBIT1,HFWORD+DFPXXX+SFPXXX                               17560021
         BNZ   AXT000              IF 1,4,OR5 BIT ON, SKIP NXT          17568021
         TM    GBIT2,XX02+AXSTORE                                       17576021
         BZ    AXT001                   NO ALIGNT. WANTED.              17584021
AXT000   EQU   *                                                        17592021
         CH    RW2,XC004                RR INSTRUCTION -NO ALIGNT.      17600021
         BL    AXT001              NO ALLIGNMNT,BR TO ATXT GEN          17608021
         CH    RW2,XC009                                                17616021
         BE    AXT012                   IT IS STM OR LM.                17624021
         BH    AXT001                   SS INSTRUCTION -NO ALIGNT.      17632021
AXT018   DS    0H                                                 46186 17640021
         LTR   OPD1,OPD1           VALID POINTER...               46186 17648021
         BZ    AXT001              NO, LEAVE ROUTINE              46186 17656021
         CLI   DX0(OPD1),XGDTN                                          17664021
         BNE   AXT001                   IS IT A BDISP.                  17672021
         TM    DX7(OPD1),SYNCHRO                                        17680021
         BO    AXT001                   THIS DATA-NAME IS SYNCHRONI     17688021
*                                                                       17696021
*                                                                       17704021
         TM    GBIT2,AXSTORE                                            17712021
         BO    AXT002                   STORE TYPE INSTRUCTION.         17720021
*                                                                       17728021
AXT009   MVI   OPCOD,XXD2                                               17736021
*                                                                       17744021
*   FOR A NON STORE TYPE INSTRUCTION GENERATE :                         17752021
*                                                                       17760021
*                        MVC  TEMP(L),DN     INSTEAD OF THE ORIGINA     17768021
*                        OP   R,TEMP                OP R,DN             17776021
*                                                                       17784021
*  FOR  A STORE TYPE  GENERATE :                                        17792021
*                                                                       17800021
*                        ST R,TEMP           INSTEAD OF                 17808021
*                        MVC DN,TEMP                ST R,DN.            17816021
*                                                                       17824021
         TM    GBIT2,AXSTMLM                                            17832021
         BZ    AXT016                   FOR  STM OR LM PICK UP PRES     17840021
         MVC   GABS(LX1),XL2+NX1          LENGTH FROM XL2.              17848021
         B     AXT006              FOR STM OR LM SKIP NXT CODE          17856021
AXT016   MVI   GABS,XX01                                                17864021
         TM    GBIT2,XX01                                               17872021
         BO    AXT005              HALFWORD BOUNDARY WANTED             17880021
         MVI   GABS,XX03                                                17888021
         TM    GBIT1,DFPXXX                                             17896021
         BZ    AXT005              NOT DOUBLE FLOATING PT INSTRUCT      17904021
         MVI   GABS,XX07                                                17912021
*                                                                       17920021
AXT005   CLC   TS3MAX(LX2),XC008                                        17928021
         BH    AXT006              IF SIZE OF TEMP AREA LRGE SKIP       17936021
         MVC   TS3MAX(LX2),XC008                                        17944021
AXT006   LA    RW2,GADPAR                                               17952021
         TM    GBIT2,AXSTORE            STORE TYPE.                     17960021
         BO    AXT007                   YES-                            17968021
         LA    RW2,DX4(RW2)                                             17976021
*                                                                       17984021
AXT007   LH    RW3,COUNT                                                17992021
         SH    RW3,XC005                                                18000021
         BCTR  RW3,RW0             SUBTRACT 1 FROM REG 3                18008021
       EX    RW3,AXTI00                MOVE                             18016021
         TM    GBIT2,AXSTORE                                            18024021
         BO    AXT008              MOVES TEMP STOR ATEXT FOR ST TYP     18032021
         MVC   GADPAR(LX4),AXTC00        SET UP TEMPORARY STORAGE OP    18040021
*                                                                       18048021
*                                                                       18056021
*                                                                       18064021
AXT011   LA    RW2,OPCOD-NX1                                            18072021
         LA    RW3,DX8(RW3)                                             18080021
         TM    GBIT2,AXSTORE                                            18088021
         BO    GNOPT6              MAKE BOUNDARY ALLIGNMENT             18096021
         BAL   XRSUB,PUTA          WRITE A-TEXT                         18104021
         MVC   OPCOD(LX2),OTPT+NX3        GENERATE INITIAL OPERATION.   18112021
AXT002   MVC   GADPAR(LX4),AXTC00                                       18120021
         LA    RW2,OPCOD-NX1                                            18128021
         LA    RW3,DX7                                                  18136021
         TM    GBIT2,AXSTORE                                            18144021
         BZ    GNOPT6              MAKE BOUNDARY ALLIGNMENT             18152021
         BAL   XRSUB,PUTA          WRITE A-TEXT                         18160021
         B     AXT009              MAKE ALLIGNMENT                      18168021
*                                                                       18176021
*                                                                       18184021
AXT008   LA    RW2,DX1(RW3,RW2)                                         18192021
         MVC   DX0(LX4,RW2),AXTC00                                      18200021
         B     AXT011              WRITE BOUNDARY ALLIGNMENT A-TXT      18208021
*    FOR  STM   AND  LM  COMPUTE  LENGTH OF TS2  NEEDED.                18216021
*                                                                       18224021
*                                                                       18232021
AXT012   OI    GBIT2,AXSTMLM                                            18240021
         IC    RW2,GABS              GET  REGISTERS NUMBER  IN RW2      18248021
         SRDL  RW2,DX4                RW3                               18256021
         SRL   RW3,DX28                                                 18264021
         CR    RW3,RW2                                                  18272021
         BL    AXT013              IF REG 2 GREATER THAN 1 BRANCH       18280021
         SR    RW3,RW2                                                  18288021
         LA    RW3,DX1(RW3)                                             18296021
AXT015   MH    RW3,XC004                                                18304021
         CH    RW3,TS3MAX                                               18312021
         BNH   AXT014              R3 NOT HIGH, DONT NEED MORE TS       18320021
         STH   RW3,TS3MAX                                               18328021
AXT014   BCTR  RW3,RW0             SUBTRACT 1 FROM REG 3                18336021
         STH   RW3,XL2                                                  18344021
         B     AXT018              PROCESS FOR BOUNDARY ALLIGNMENT      18352021
*                                                                       18360021
AXT013   LH    RW0,XC015             IN CASE R2 IS GREATER  THAN R1     18368021
         SR    RW0,RW2                                                  18376021
         AH    RW0,XC002                                                18384021
         AR    RW3,RW0                                                  18392021
         B     AXT015              SEE IF MORE TS3 NEEDED               18400021
AXT020   DS    0H                                                 4771  18408021
         CH    RW2,XC004               IS IT RX                   4771  18416021
         BNE   AXT010              NO NOT RX TYPE                 4771  18424021
         CH    RW3,XC008           AH, CH, LH, MH, AND SH         4771  18432021
         BL    AXT010              INSTRUCTIONS                   4771  18440021
         CH    RW3,XC012           SHOULD ALL HAVE ONLY           4771  18448021
         BH    AXT010              A LENGTH OF 2 GENERATED FOR MVC4771  18456021
         OI    GBIT2,XX01          SO SET GBIT2 IF IT IS A        4771  18464021
         B     AXT010              HALF-WORD INSTRUCTION          4771  18472021
       EJECT                                                            18480021
*      FIXED SUBROUTINES ENTRY POINTS                                   18488021
*=1  FIXED ENTRY POINT SUBROUTINE FOR NON ARITHMETIC VERB (BILL)        18496021
DICNOP EQU     *                                                        18504021
       ST    XRVAR,SVWJH7           DICNOP                              18512021
       L       HCOMSR,ADCON7                                            18520021
       BCR     UNCOND,HCOMSR       GENERATE CNOP                        18528021
VBALR0 EQU   *                     VBALR0 USES DIBALQ, RW3 SET          18536021
       ST    XRVAR,SVWJH8           DIBALR                              18544021
       L       HCOMSR,ADCON8                                            18552021
       BCR     UNCOND,HCOMSR       GENERATE BALR A-TEXT                 18560021
VBALRE EQU   *                     VBALRE LOOKS LIKE DIBALR             18568021
         MVI   XREG1,XX0E             EXCEP USES 14 RATHER THAN 1       18576021
       BC    UNCOND,VBALR0         TO COMMON CODING                     18584021
VBADCE   MVI   XREG1,XX0E                                               18592021
       BC    UNCOND,VBADC0         GEN BAL USING REG 14                 18600021
VDADC1   MVI   XREG1,XX01                                               18608021
VBADC0 ST    RW3,SVWJHL                                                 18616021
         ST    RETRG,SVWJHL+NX4                                         18624021
       LR    RW3,RETRG                                                  18632021
       BAL   RETRG,VBALR0          BRANCH TO GENERATE BALR              18640021
       L     RW3,SVWJHL                                                 18648021
         L     RETRG,SVWJHL+NX4                                         18656021
         BC    UNCON,DX4(XRSUB)   RETURN TO CALLER                      18664021
*      DIRECT A-TEXT GENERATION S.R. GATXTV FOR STRINGS PERMITTING      18672021
*            CHANGES BY ANALYZERS, GATXTC FOR OTHERS. SEE WRITE-UP      18680021
*            AND CALLING SEQ'S WITH CONSTANTS AT LOC... ATXTBV          18688021
GATXTC STM   RETRG,RW3,SVGATX                                           18696021
       LA    RW2,ATXTBC                                                 18704021
       BC    UNCOND,GATX01         BRANCH AROUND ENTRY POINT            18712021
GATXTV STM   RETRG,RW3,SVGATX                                           18720021
       LA    RW2,ATXTBV                                                 18728021
GATX01   AH    RW2,DX0(RETRG)                                           18736021
         LH    RW3,DX2(RETRG)                                           18744021
       BAL   RETRG,GOPT3C          PUTS A-TEXT ON FILE                  18752021
       LM    RETRG,RW3,SVGATX                                           18760021
         BC    UNCOND,DX4(RETRG)    *** LEAVE GENTRY ***                18768021
*                                                                       18776021
*                     THIS ROUTINE CAUSES ANY SUBSCRIPT CALCULATION     18784021
*                                  THAT RESIDE IN OBJECT REGISTERS      18792021
*                                  BE STORED INTO AN OBJECT-TIME TA     18800021
DFREER STM   RETRG,RW4,SVWJHP      PRESERVE REG'S OVER XFREER           18808021
         LA    RW1,DX5                                                  18816021
DFREE1 STC   RW1,XREGNO            LOOP THRU TO RELEASE XR'S 1 THRU     18824021
       BAL   XRSUB,XFREER          FREE REGISTERS INDICATED             18832021
       BCT   RW1,DFREE1            GO THROUGH LOOP AGAIN                18840021
       LM    RETRG,RW4,SVWJHP      PRESERVE REG'S OVER XFREER           18848021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     18856021
* ROUTINES TO RESERVE, FREE AND DESTROY REGS                            18864021
GFRRES   MVI   A48CH2,MRESRV                                            18872021
GFRRE    MVI   A48CH1,XX0E                                              18880021
GFRR     ST    RETRG,SVWJHT                                             18888021
         BAL   RETRG,REGMAC        GENERATE MACRO CODING                18896021
         L     RETRG,SVWJHT                                             18904021
         BCR   UNCOND,RETRG        RETURN TO CALLER                     18912021
GFREE    MVI   A48CH2,MFREE                                             18920021
         BC    UNCOND,GFRRE        GO TO START MACRO CODING             18928021
GDES14   MVI   A48CH2,MDESTR                                            18936021
         BC    UNCOND,GFRRE        GO TO START MACRO CODING             18944021
GDES15   MVI   A48CH2,MDESTR                                            18952021
         MVI   A48CH1,XX0F                                              18960021
         BC    UNCOND,GFRR         GENERATE MACRO CODING                18968021
REGMAC ST    RETRG,SVWJHU                                               18976021
       BAL   RETRG,GATXTV          FREE,                                18984021
       DC    AL2(ATXT48-ATXTBV)        RESERVE,                         18992021
       DC    AL2(ZTXT48-ATXT48)            DESTROY MACRO                19000021
       L     RETRG,SVWJHU                                               19008021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     19016021
WRKLRX ST    RETRG,SVWJHQ         KILL 14,15 BUT NOT SUB                19024021
       BC    UNCOND,WRKLR1         AVOID KILLING SS TBL                 19032021
WRKLRG EQU   *           KILL SS TBL + DESTROY REG 14, 15.              19040021
       ST    RETRG,SVWJHQ                                               19048021
       BAL    RETRG,KILSUB         KILL SUBSCRIPT OPT TBL               19056021
WRKLR1 EQU   *                                                          19064021
         BAL   RETRG,GDES14        DESTROY 14                           19072021
         BAL   RETRG,GDES15        DESTROY 15                           19080021
       L     RETRG,SVWJHQ                                               19088021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     19096021
         TITLE '                  A-TEXT GENERATOR'                     19104021
IKF503 CSECT                                                            19112021
COMON3 EQU     *                                                        19120021
*                                                                       19128021
*=1      A TEXT GENERATOR                                               19136021
*******************************************************************     19144021
*                                                                       19152021
*        A TEXT GENERATOR                                               19160021
*                                                                       19168021
*******************************************************************     19176021
*        THE A TEXT GENERATOR IS USED BY THE DIFFERENT ANALYZERS        19184021
*                                                                       19192021
*        THERE ARE VARIOUS ENTRY POINTS TO THE A TEXT GENERATOR         19200021
*                                                                       19208021
*        THE ENTRY POINT TO BE USED IS DETERMINED BY THE                19216021
*        OBJECT INSTRUCTION DESIRED                                     19224021
*                                                                       19232021
*        THE LINKAGE TO THE A TEXT GENERATOR IS                         19240021
*           BAL  RETRG,THE PARTICULAR ENTRY POINT                       19248021
*                                                                       19256021
*   THE FOLLOWING WILL DESCRIBE HOW THE WORK AREAS ARE TO BE USED       19264021
*                                                                       19272021
*        XL1 AND XL2 ARE NEEDED FOR SS TYPE INSTRUCTIONS                19280021
*             IF THERE IS ONLY ONE LENGTH PUT IN XL1                    19288021
*                                                                       19296021
*        XWC1 AND XWC2 ARE EACH TWO BYTES LONG                          19304021
*   IF WE ARE IN A BINARY MODE THE LENGTH IS PUT IN A THIRD BYTE        19312021
*                                                                       19320021
*        THE FOLLOWING ELEMENTS EACH HAVE TWO DATA AREAS                19328021
*        XWC,BDISP,TALLY,XGN,XPN,XCON                                   19336021
*             DATA AREA 1 IS USED IF IT IS THE FIRST ADDRESS OPERAN     19344021
*             DATA AREA 2 IS USED IF IT IS THE SECND ADDRESS OPERAN     19352021
*                                                                       19360021
*          FOR DATA NAMES,ALL LITERALS,FIG CONS  POINTERS ARE USED      19368021
*             THE POINTERS ARE PUT IN OP1,OP2 AS THEY ARE NEEDED        19376021
*                                                                       19384021
*******************************************************************     19392021
*******************************************************************     19400021
LOAD     MVI   OPCOD,XX18     LR OP CODE =18   CHANGED IF L OR LH OR    19408021
GHIBYT STM   GR1,GR15,GSVRG                                             19416021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS   3 WITH GADPAR     19424021
         CLC   XL2(LX2),GZERO                                           19432021
       BC    NOTEQ,GDOSSD    BRANCH IF DECIMAL SS CODE                  19440021
       CLC   XWC1(GCNLN2),GZERO                                         19448021
       BC    NOTEQ,GSETRX    BRANCH IF RX TYPE INSTRUCTION              19456021
       C     OPD1,GZERO                                                 19464021
       BC    EQ,SETRR        BRANCH IF RR TYPE INSTRUCTION              19472021
GSETRX   MVI   GBIT1,XXA0     SET BIT FOR HALFWORD WANTED + CONV NUM    19480021
         CLI   XXREG,XX00                                               19488021
       BC    NOTEQ,GFKRG           IF INDEX BR TO MOVE REGNO            19496021
       BC    UNCOND,SETRX          GEN RX TYPE OF INSTRUCTION           19504021
SUB      MVI   OPCOD,XX1B     SR OP CODE=1B  CHANGED IF S OR SH OR S    19512021
       BC    UNCOND,GHIBYT         GENERATE FORMATTED ATXT              19520021
LPRBI    MVI   OPCOD,XX10     LPR=10   ST OR STH WILL CHANGE HI ORDE    19528021
STORE  EQU   LPRBI                                                      19536021
       BC    UNCOND,GHIBYT         GENERATE FORMATTED ATXT              19544021
SETRR1 STM   GR1,GR15,GSVRG                                             19552021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND POINTERS   3 WITH GA     19560021
SETRR    MVC   GABS(LX1),XREG2 GET LO 4 BITS OF OPERAND2 INTO LO 4BIT   19568021
         MVO   GABS(LX1),XREG1(LX1) LO FOUR BITS INTO HIGH FOUR BITS AB 19576021
       BC    UNCOND,GNOPT2   GENERATE OUTPUT                            19584021
SETRX2   XI    OPCOD,XX40     PUT 5 IN OPCOD (1 ALREADY THERE)          19592021
       BC    UNCOND,SETRX1         HALFWORD NOT WANTED                  19600021
SETRX0 STM   GR1,GR15,GSVRG                                             19608021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND POINTERS   3 WITH GA     19616021
         MVC   GABS(LX1),XXREG                                          19624021
SETRX1   MVI   GBIT1,XX00     HALFWORD NOT WANTED  2 ADDRESSES NOT W    19632021
SETRX    MVO   GABS(LX1),XREG1(LX1) LO 4 BITS INTO HI 4 BITS            19640021
GCHKOP C     OPD2,GZERO                                                 19648021
       BC    NOTEQ,GCKOP2    BRANCH IF OPD2 NOT 0  MUST BE TWO POIN     19656021
GCKOP3   CLC   XWC1(LX2),GZERO                                          19664021
       BC    NOTEQ,GWC       BRANCH IF WC     TEMPORARY STORAGE         19672021
         CLC   BDISP1(LX2),GZERO                                        19680021
       BC    NOTEQ,GBDISP    BRANCH IF BDISP                            19688021
         CLC   XGN1(LX2),GZERO                                          19696021
       BC    NOTEQ,GGN       BRANCH IF GENERATED NAME                   19704021
         CLC   XPN1(LX4),GZERO                                          19712021
       BC    NOTEQ,GPN       BRANCH IF PROCEDURE NAME                   19720021
         CLC   XVN1(LX4),GZERO                                          19728021
       BC    NOTEQ,GVN       BRANCH IF VARIED NAME                      19736021
         CLC   GDEBG1(LX2),GZERO                                        19744021
       BC    NOTEQ,GDEBUG    BRANCH IF GTREF1                           19752021
         CLI   XCON1+NX16,XX00                                          19760021
       BC    NOTEQ,GCON      BRANCH IF CONSTANT(OTHER THAN LITERALS     19768021
*                                 OR FIG CON,SPECIAL FOR ANALYZERS)     19776021
         CLI   XCON1,XX00                                               19784021
       BC    NOTEQ,GDCDEF    BRANCH IF DECDEF                           19792021
         CLC   XCNTR1(LX3),GZERO                                        19800021
       BC    NOTEQ,GCNTR     BRANCH IF GTREF2                           19808021
         CLC   BLREF1(LX2),GZERO                                        19816021
       BC    NOTEQ,GBLREF    BRANCH IF BLREF                            19824021
         CLC   VIRTC1+NX2(LX2),GZERO                                    19832021
       BC    NOTEQ,GVIRT     BRANCH IF VIRTUAL                          19840021
         CLI   GVIRT1,XX00    BCDREF USED GVIRT1+2 NOT VIRTC1+2         19848021
       BC    NOTEQ,GBCDRF    BRANCH IF BCDREF                           19856021
         CLI   TALLY1,XX00                                              19864021
       BC    NOTEQ,GTALLY    BRANCH IF TALLY                            19872021
         CLC   RELAD1(LX4),GZERO                                        19880021
       BC    NOTEQ,GRLADR    BRANCH IF REL ADR    POINTER IF LITERA     19888021
GCKOP2   CLI   DX0(OPD1),XX30                                           19896021
       BC    EQ,GDN          BRANCH IF DATA NAME                        19904021
         CLI   DX0(OPD1),XX36            INDEX-NAME                     19912021
         BE    ATXSET1                  YES                             19920021
         CLI   DX0(OPD1),XX34                                           19928021
       BC    EQ,GALLIT       BRANCH IF ALPHA LITERAL                    19936021
         CLI   DX0(OPD1),XX32                                           19944021
       BC    EQ,GNUMLT       BRANCH IF NUMERIC LITERAL                  19952021
         CLI   DX0(OPD1),XX33                                           19960021
       BC    EQ,GFLTLT       BRANCH IF FLOATING POINT LITERAL           19968021
         CLI   DX0(OPD1),XX75                                           19976021
       BC    EQ,GFGCON       BRANCH IF FIGURATIVE CONSTANT              19984021
         CLI   DX0(OPD1),XXFA                                           19992021
       BC    EQ,GGTRF2       BRANCH IF GTREF2                           20000021
         CLI   DX0(OPD1),XXF9                                           20008021
       BC    EQ,GGTRF1       BRANCH IF GTREF1                           20016021
         CLI   DX0(OPD1),XSTDTN                                         20024021
         BE    GTALLY              BRANCH IF A TALLY POINTER            20032021
         B     GBDISP              SET UP BDISP FOR ATEXT               20040021
COMPLG   MVI   OPCOD,XX15     CLR OP CODE IS 15  CHANGED IF CL,OR CL    20048021
GHIBT1 STM   GR1,GR15,GSVRG                                             20056021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS   3 WITH GADPAR     20064021
         CLC   XL1(LX2),GZERO                                           20072021
       BC    NOTEQ,SETLSS    BRANCH IF LOGICAL SS TYPE INSTRUCTION      20080021
       CLC   XWC1(GCNLN2),GZERO                                         20088021
       BC    NOTEQ,GSTRX2    BRANCH IF RX TYPE INSTRUCTION              20096021
       C     OPD1,GZERO                                                 20104021
       BC    EQ,SETRR        BRANCH IF RR TYPE INSTRUCTION              20112021
GSTRX2   CLI   XXREG,XX00                                               20120021
       BC    NOTEQ,GFKRG2          GENERATE RX TYPE INSTRUCTION         20128021
       BC    UNCOND,SETRX2         GENERATE RX REG TYPE INSTRUC         20136021
MVC      MVI   OPCOD,XX12     MVC LO ORDER OF OP FIELD IS 2             20144021
GFXLSS STM   GR1,GR15,GSVRG                                             20152021
       LM    OPD1,OPD3,OP1   LD REG WITH OPND PTRS   3 WITH GADPAR      20160021
SETLSS   MVI   GBIT1,XX40     SET BIT FOR SS TYPE   2 ADDRESSES WANT    20168021
         XI    OPCOD,XXC0     PUT D IN HI ORDER  (1 ALREADY THERE)      20176021
       LH    GXRA,XL1                                                   20184021
       BCTR  GXRA,RW0          SUBTRACT 1 FROM LENGTH                   20192021
       STC   GXRA,GABS                                                  20200021
       STC   GXRA,XL1                                                   20208021
       BC    UNCOND,GCHKOP         GENERATE SS INSTR CODE               20216021
ATXSET1  MVI   DX0(OPD3),XX64                                           20224021
         MVI   DX1(OPD3),INCODE                                         20232021
         MVC   DX2(LX2,OPD3),DX3(OPD1)                                  20240021
         LA    OPD3,DX4(OPD3)                                           20248021
         MVI   DX0(OPD3),XXB4    MOVE XREF FOR INDX-NM            38953 20256021
         MVC   DX1(LX3,OPD3),DX7(OPD1)    ELT TO OUTPUT           38953 20264021
         LA    OPD3,DX4(OPD3)    AND INCR AREA PTR                38953 20272021
       TM    GBIT1,HFWORD                                               20280021
       BZ    GADNUM                IF ADD1 COMPLT BR FOR 2ND SS ADD     20288021
         XI    OPCOD,XX40         PUT 5 IN HI ORDER,1ALREADY THERE      20296021
         B     GADNUM              COMPLETE ATXT                        20304021
GDN      CLC   DX4(LX3,OPD1),XTALLV+NX4                                 20312021
       BC    EQ,GTALLY                  BRANCH IF TALLY                 20320021
       TM    XDIDK(OPD1),SPREG    IS THIS DN A 'SPECIAL REG'...         20328021
       BO    SPREG1               YES, CHANGE TO BDISP ELEMENT          20336021
         CLC   DX4(LX3,OPD1),XC000                                      20344021
         BNE   MOVE16              IF IDK FIELD NOT ZERO BRANCH         20352021
         MVC   AXTC01+NX2(LX2),XC001                                    20360021
         MVC   DX0(LX4,OPD3),AXTC01       IN CASE OF A FAKE ALPHN.DN    20368021
         LA    OPD3,DX4(OPD3)            FROM THE MOVE VERB -REPLACE    20376021
         XR    OPD1,OPD1                DN  BY  TS2 .                   20384021
         B     GADNUM              GET ADDRESS FOR ATXT                 20392021
MOVE16   EQU   *                                                        20400021
       TM    GBIT1,HFWORD                                               20408021
*                                                                       20416021
         BZ    AXT100              SET UP DNM FOR ATXT                  20424021
         TM    GBIT2,XX01                                               20432021
       BC    ONES,GHALF            BRANCH IF HALFWORD ENTRY POINT       20440021
         CLI   DX9(OPD1),XX04                                           20448021
       BC    NOTHI,GHALF     BRANCH IF HALFWORD INSTRUCTION             20456021
         XI    OPCOD,XX40    PUT 5 IN HIGH ORDER (1 ALREADY THERE)      20464021
         B     AXT100              IF NOT HALFWD INSTRUC SKIP NXT       20472021
GHALF    XI    OPCOD,XX50    PUT 4 IN HIGH ORDER (1 ALREADY THERE)      20480021
AXT100   CLI   HEADER+NX1,XX6D                                          20488021
         BNE   GNOLGN              IF EQU IN SEARCHALL SKIP NXT         20496021
         C     OPD1,XAOPE2                                              20504021
         BNE   GNOLGN              IF NOT 2ND OPD SKIP NXT              20512021
         MVC   AXTC01+NX3(LX1),AXTLENG+NX1 SET TS2 PARAMETER            20520021
         CLI   OPCOD,XX40                                               20528021
         BNE   AXT106              IF NOT STH, BRANCH                   20536021
         OI    GBIT2,XX01                                               20544021
AXT108   OI    GBIT1,HFWORD                                             20552021
         B     AXT107              READY TO CONTINUE PROCESSING         20560021
AXT106   CLI   OPCOD,XX50                                               20568021
         BE    AXT108              IF ST BRANCH TO GEN PROPER ATXT      20576021
AXT107   EQU   *                                                        20584021
         TM    GBIT1,HFWORD             ALIGNT  NEEDED                  20592021
         BO    AXT101                   YES                             20600021
         TM    GBIT2,XX02                                               20608021
         BO    AXT101                   YES                             20616021
         MVC   DX0(LX4,OPD3),AXTC01       NO ,SUBSTITUTE TS2 TO ORIGI   20624021
*                                       DATA-NAME.                      20632021
         LA    OPD3,DX4(OPD3)                                           20640021
         XR    OPD1,OPD1                                                20648021
         B     GADNUM              COMPLETES ATXT UP TO 2ND DNM         20656021
AXT101   OI    GBIT2,XX04                                               20664021
         BAL   XRSUB,XE8DB              ASK FOR A TEMP.STOR.IN A DO     20672021
       LH    XR0,XEREL1                                                 20680021
       SH    XR0,GSEVEN                                                 20688021
         STH   XR0,AXTC02+NX2                                           20696021
         BAL   XRSUB,XERELS        INSERT POINTER TO TBL SPACE          20704021
         MVC   DX0(LX4,OPD3),AXTC02                                     20712021
         LA    OPD3,DX4(OPD3)                                           20720021
         B     GNOTPT              COMPLETE AND WRITE ATXT IF 1 ADD     20728021
*                                                                       20736021
*                                                                       20744021
         OI    GBIT2,XX01                                               20752021
GNOLGN   MVI   DX0(OPD3),XX78                                           20760021
         MVC   DX1(LX3,OPD3),DX4(OPD1) MOVE ADDRESS PARAMS TO BYTE AFTE 20768021
       SR      GXRA,GXRA                                                20776021
         IC    GXRA,DX1(OPD1) GET                                       20784021
       BCTR  GXRA,RW0              DATA NAME                            20792021
         LA    GXRA,DX0(GXRA,OPD1)   INTERNAL                           20800021
         MVC   DX4(LX3,OPD3),DX0(GXRA)   IDENTIFIER                     20808021
         LA    OPD3,DX7(OPD3)                                           20816021
GADNUM TM    GBIT1,GAD1DN      ADDRESS1 DONE                            20824021
       BC    ONES,GPLUS2       BRANCH IF YES.                           20832021
         CLC   PLUS1(LX3),GZERO IS  THERE A PLUS ELEMENT                20840021
       BC    NOTEQ,GPLUS1      BRANCH IF PLUS                           20848021
GDOAGN TM    GBIT1,TWOADR   ARE THERE 2 ADDRESSES (SS INSTRUCTION)      20856021
       BC     ZERO,GNOTPT   BRANCH IF THERE ARE NOT 2 ADDRESSES         20864021
       OI    GBIT1,GAD1DN     1'ST  ADR IS NOW COMPLETED                20872021
       C     OPD2,GZERO                                                 20880021
       BC    NOTEQ,GCNGAD    BRANCH IF THERE WERE 2 ADDRESS PTRS        20888021
       MVC   XWC1(GCNLN2),XWC2  CHANGE ALL ADDRESS TWOS TO ADR ONES     20896021
       BC    UNCOND,GCKOP3         GENERATE ATXT FOR 2ND ADDRESS        20904021
* SPECIAL REGISTER PROCESSING                                           20912021
SPREG1 EQU   *                    PROCESS SPECIAL REGISTERA             20920021
         CLI   DX6(OPD1),XGBINR    TEST FOR VALID USE                   20928021
       BL    SPRERR               INVALID. PUT ERROR MSG                20936021
       BE    SPREG2               SORT-RETURN IS HALF WORD              20944021
         CLI   DX6(OPD1),XX10      TEST FOR VALID USE                   20952021
         BH    SPRERR                  INVALID                          20960021
       BE    SPREG2               RETURN-CODE IS HALF WORD              20968021
SPREG3 EQU   *                                                          20976021
       SR    RW1,RW1                                                    20984021
         IC    RW1,DX6(OPD1)       PICK UP UNIQUE SPEC REG IDENTIF      20992021
       SH    RW1,XC011                                                  21000021
         SLL   RW1,DX1             USE AS INDEX TO BASE AND DISPL       21008021
       LA    RW2,SPREGC                                   TABLE         21016021
       AR    RW2,RW1                                                    21024021
         MVC   BDISP1(LX2),DX0(RW2) CHANGE REFERENCE TO BDISP           21032021
       B     GBDISP               PROCESS AS BDISP                      21040021
SPREG2   TM    OPCOD,XXC0           SS INSTRUCTION...                   21048021
       BO    SPREG3               YES                                   21056021
       OI    GBIT1,HFWORD         INDICATE  HALFWORD INSTR NEEDED       21064021
         OI    GBIT2,XX01                                               21072021
       B     SPREG3                PICK UP BASE DISP FOR ATXT           21080021
SPRERR BAL   RETRG,ERRPRO         PUT MSG-INVALID USE OF SPEC REG       21088021
       DC    AL1(ERRN15)                                                21096021
       DC    AL1(2)               E-LEVEL                               21104021
       LA    RETRG,PH5CTL         SET RETURN REG TO PH5 CONTROL SO      21112021
       ST    RETRG,GSVRG+NX56      THIS STATEMENT WILL BE IGNORED       21120021
       B     AXT102               REINITIAL. ATXT GEN FOR NEXT USE      21128021
GCNGAD LR    OPD1,OPD2                                                  21136021
       BC    UNCOND,GCKOP2         GENERATE ATXT FOR SPEC REG           21144021
GPLUS2   CLC   PLUS2(LX3),GZERO                                         21152021
       BC    EQ,GNOTPT       BRANCH IF PLUS2 IS ZERO                    21160021
       C     OPD1,GZERO            DOES ADRPLUS APPLY...                21168021
       BC    EQ,GPLUSA              NO                                  21176021
       CLC   XWC2(ADRPLX),GZERO                                         21184021
       BC    NOTEQ,GPLUSA          NO                                   21192021
       CLC   XVN2(ADRPLY),GZERO                                         21200021
       BC    NOTEQ,GPLUSA          NO                                   21208021
         CLI   DX0(OPD1),MDN                                            21216021
       BC    NOTEQ,GPLUSA           NO                                  21224021
         MVC   GTEMP(LX1),DX4(OPD1)                                     21232021
         NI    GTEMP,XX70           ELIM SUBSCRIPT AND TALLY            21240021
         CLI   GTEMP,XX60                                               21248021
       BC    EQ,GPLUSA              NO                                  21256021
         CLI   GTEMP,XX30                                               21264021
       BC    NOTEQ,GPLUSB           YES                                 21272021
GPLUSA EQU   *                                                          21280021
         MVI   DX0(OPD3),XX80 SET UP PLUS ELEMENT                       21288021
         MVC   DX1(LX3,OPD3),PLUS2   FOR A TEXT OUTPUT                  21296021
         LA    OPD3,DX4(OPD3) INCREMENT POINTER                         21304021
         BC  UNCOND,GNOTPT         COMPLT AND WRITE ATXT IF 1 ADD       21312021
GPLUS1 C     OPD1,GZERO            DOES ADRPLUS APPLY...                21320021
       BC    EQ,GPLUSC              NO                                  21328021
       CLC   XWC1(ADRPLX),GZERO                                         21336021
       BC    NOTEQ,GPLUSC          NO, OPD1 IS FOR ADDR2                21344021
       CLC   XVN1(ADRPLY),GZERO                                         21352021
       BC    NOTEQ,GPLUSC          NO                                   21360021
         CLI   DX0(OPD1),MDN                                            21368021
       BC    NOTEQ,GPLUSC          NO                                   21376021
         MVC   GTEMP(LX1),DX4(OPD1)                                     21384021
         NI    GTEMP,XX70                                               21392021
         CLI   GTEMP,XX60                                               21400021
       BC    EQ,GPLUSC              NO                                  21408021
         CLI   GTEMP,XX30                                               21416021
       BC    NOTEQ,GPLUSD           YES                                 21424021
GPLUSC   MVI   DX0(OPD3),XX80       SET UP PLUS A-TEXT HEADER           21432021
         MVC   DX1(LX3,OPD3),PLUS1   ELEMENT FOR A TEXT OUTPUT          21440021
         LA    OPD3,DX4(OPD3) INCREMENT POINTER                         21448021
         BC  UNCOND,GDOAGN         GET NXT DNM AND GENERATE ATXT        21456021
GPLUSB LA    RETRG,PLUS2           SET UP PLUS 2 POINTERS               21464021
       LA    XRVAR,GNOTPT                                               21472021
       BC    UNCOND,GPLUSZ         SKIP NXT TO PT TO PLUS2 POINTER      21480021
GPLUSD LA    RETRG,PLUS1           SET UP PLUS 1 POINTERS               21488021
       LA    XRVAR,GDOAGN                                               21496021
GPLUSZ SH    OPD3,XC007            CONVERT ADR ELEMENT TO ADRPLUS E     21504021
         MVI   DX0(OPD3),XXA4       ADRPLUS HEADER                      21512021
         MVC   DX7(LX3,OPD3),DX0(RETRG) MOVE IN PLUS VALUE              21520021
         MVC   GTEMP+NX1(LX3),DX0(RETRG)                                21528021
         MVI   GTEMP,XX00                                               21536021
       STM   RW0,RW2,SVWJHQ                                             21544021
       L     RW1,GTEMP               PLUS  VALUE                        21552021
         MVC   GTEMP(LX2),DX4(OPD1)                                     21560021
         NI    GTEMP,XX0F                                               21568021
       AH    RW1,GTEMP               DDD + PLUS                         21576021
       SR    RW2,RW2                                                    21584021
         IC    RW2,DX6(OPD1)          KK    (BL NUMBER)                 21592021
       SR    RW0,RW0                                                    21600021
       D     RW0,FW4096              (DDDD+PLUS) / 4096 = Q + R         21608021
       AR    RW2,RW1                   UP BL BY Q                       21616021
         STC   RW2,DX3(OPD3)          KK                                21624021
       STH   RW0,GTEMP               R  REPLACES DDD                    21632021
         NI    DX1(OPD3),XXF0                                           21640021
         OC    DX1(LX1,OPD3),GTEMP                                      21648021
         MVC   DX2(LX1,OPD3),GTEMP+NX1                                  21656021
         LA    OPD3,DX10(OPD3)                                          21664021
       LM    RW0,RW2,SVWJHQ                                             21672021
       BCR   UNCOND,XRVAR          BRANCHES TO COMPLETE ATXT            21680021
GDCDEF   MVI   DX0(OPD3),XX6C                                           21688021
       SR      GXRA,GXRA                                                21696021
       IC    GXRA,XCON1                                                 21704021
       EX    GXRA,GDC1                 MOVE                             21712021
         LA    OPD3,DX2(GXRA,OPD3)                                      21720021
       BC    UNCOND,GNOTPT         COMPLT ATXT FOR 1 ADDRESS            21728021
GCNTR    MVI   DX0(OPD3),XX64 SET UP GTREF2                             21736021
         MVC   DX1(LX3,OPD3),XCNTR1                                     21744021
       TM    GBIT1,HFWORD                                               21752021
       BC    ZERO,GADD4            INCREM PTR AND GEN ATXT FOR DNM      21760021
         CLI   XCNTR1,XX04    VLC                                       21768021
       BC    EQ,GCNTR2             GEN ST INSTRUC FOR VLC               21776021
         CLI   XCNTR1,XX34          VLC-OUT-OF-LINE                     21784021
       BC    NOTEQ,GCNTR1          GEN STH FOR DNM                      21792021
         MVI   DX1(OPD3),XX38                                           21800021
       BC    EQ,GCNTR2             IF VLC-OUT-OF-LINE GEN ST INSTR      21808021
GCNTR1   XI    OPCOD,XX40                                               21816021
       BC    UNCOND,GADD4          INCREM PTR AND GEN ATXT FOR DNM      21824021
GCNTR2   XI    OPCOD,XX50                                               21832021
       BC    UNCOND,GADD4          INCREM PTR AND GEN ATXT FOR DNM      21840021
* VIRTUALS                                                              21848021
GVIRT  LA    RW2,VIRTC1                                                 21856021
         LA    RW3,DX12                                                 21864021
       BAL   RETRG,PUTVIR          DEFINE NEW VIRTUAL                   21872021
         MVI   DX0(OPD3),XX58 VIR REF                                   21880021
         MVC   DX1(LX2,OPD3),VIRTC1+NX2                                 21888021
       TM    GBIT1,HFWORD                                               21896021
       BC    ZERO,GADD3            GENERATE ATXT FOR DNM                21904021
         XI    OPCOD,XX40     FULL WORD INSTRUCTION                     21912021
       BC    UNCOND,GADD3          GENERATE ATXT FOR DNM                21920021
GBLREF   MVI   DX0(OPD3),XX5C SET UP                                    21928021
         MVC   DX1(LX2,OPD3),BLREF1 BLREF                               21936021
       BC    UNCOND,GGN1          ELEMENT FOR A TEXT OUTPUT             21944021
GBCDRF   MVI   DX0(OPD3),XX7C SET UP                                    21952021
         MVI   DX1(OPD3),XX08    BCDREF                                 21960021
         MVC   DX2(LX8,OPD3),GVIRT1  ELEMENT                            21968021
         LA    OPD3,DX10(OPD3)          INCREMENT POINTER               21976021
       BC    UNCOND,GADNUM         GENERATE ATXT FOR DNM                21984021
GRLADR   CLI   RELAD1,XX2C                                              21992021
       BC    NOTEQ,GFNRAD    BRANCH IF NOT LITERAL REL ADR              22000021
         OI    GBIT2,XX80     HAVE REL ADR                              22008021
       BC    UNCOND,GCKOP2         LOOK FOR DUPS AND GENERATE ATXT      22016021
GRELIT   MVC   RELAD1+NX2(LX2),LTLCTR SET LITERAL ID NUMB               22024021
GFNRAD   TM    RELAD1+NX1,XXFE     TEST ALL BITS EXCEPT BIT1            22032021
         BC    NOTEQ,GFNRA        NO, BRANCH                            22040021
         MVI   DX0(OPD3),XXB0            SETUP CALLING SEQ.DISP.ELEM    22048021
         BC    UNCOND,GFNRA+NX12  SKIP NEXT TWO INST.                   22056021
GFNRA    CLI   RELAD1+NX1,XX02     TEST IF SS=2 MEANS DICT PTR ELEME    22064021
         BC    EQ,CSDIPT          BRANCH IF SS=2                        22072021
         MVI   DX0(OPD3),XX84                                           22080021
         MVC   DX1(LX4,OPD3),RELAD1                                     22088021
         LA    OPD3,DX5(OPD3)      INCREMENT POINTER                    22096021
       BC    UNCOND,GADNUM         GENERATE ATXT FOR DNM                22104021
CSDIPT   CLI   RELAD1,XX80         XREF ELE...                          22112021
       BNE   CDIPT1               NO                                    22120021
         MVI   DX0(OPD3),FREF      SET XREF CODE                        22128021
       B     CDIPT2                MOVE DICTRY POINTER INTO ELEM        22136021
CDIPT1   MVI   DX0(OPD3),XXB4                                           22144021
CDIPT2   MVC   DX1(LX3,OPD3),RELAD1+NX2 MOVE DICT PTR INTO ELEMENT      22152021
         BC    UNCOND,GADD4        INCREM PTR AND GEN ATXT FOR DNM      22160021
GWC      TM  GBIT1,HFWORD                                               22168021
         BC  ZERO,GNOLN2     BRANCH IF HALFWORD TEST NOT WANTED         22176021
         CLI   XWC1+NX2,XX02                                            22184021
         BC  NOTHI,GHALF2    BRANCH IF HALFWORD                         22192021
         XI    OPCOD,XX40     PUT 5 IN HI ORDER (1 THERE ALREADY)       22200021
       BC    UNCOND,GNOLN2         SET UP TS ELEM FOR ATXT OUTPUT       22208021
GHALF2   XI    OPCOD,XX50     PUT 4 IN HI ORDER  (1 THERE ALREADY)      22216021
GNOLN2   MVI   DX0(OPD3),XX64 SET UP WC ELEMENT FOR A TEXT OUTPUT       22224021
         MVI   DX1(OPD3),XX24 TEMPORARY STORAGE                         22232021
       LH    GXRA,XWC1                                                  22240021
       SH    GXRA,GSEVEN                                                22248021
       STH   GXRA,XWC1                                                  22256021
         MVC   DX2(LX2,OPD3),XWC1                                       22264021
GADD4    LA    OPD3,DX4(OPD3) INCREMENT POINTER                         22272021
       BC    UNCOND,GADNUM         GENERATE ATXT FOR DNM                22280021
* CONSTANTS                                                             22288021
GCON     TM    GBIT2,XX40                                               22296021
       BC    ONES,GDCDEF           PUT OUT DC DEF IN ATXT               22304021
         CLI   XCON1+NX16,XX02                                          22312021
       BC    HI,GCON3              TEST FURTHER FOR TYPE OF CONST       22320021
       BC    EQ,GCON4              TEST FURTHER FOR TYPE DNM ATXT       22328021
GCON5    MVI   DX1(OPD3),XX01 HEX  NO BOUNDARY REQ                      22336021
GCON6  SR    RETRG,RETRG                                                22344021
         IC    RETRG,XCON1+NX16                                         22352021
       SH    RETRG,GSXTEN                                               22360021
       LCR   RETRG,RETRG                                                22368021
         IC    GXRA,XCON1+NX16                                          22376021
       LA    RETRG,XCON1(RETRG)                                         22384021
       EX    GXRA,GCONMV               MOVE                             22392021
       BC    UNCOND,GFNCON         GENERATE LITERAL ELEMT ATXT          22400021
GCON3    CLI   XCON1+NX16,XX04                                          22408021
       BC    HI,GCON7              TEST FURTHER FOR TYPE DNM ATXT       22416021
       BC    EQ,GCON8              TEST FURTHER FOR TYPE DNM ATXT       22424021
       BC    UNCOND,GCON5          GEN LIT ELEM ATXT HEX,NO ALLIGN      22432021
GCON4  TM    GBIT1,HFWORD                                               22440021
       BC    ZERO,GCON44           NO,TEST FOR BINARY INSTRUCTION       22448021
         XI    OPCOD,XX50                                               22456021
GCON44   TM    GBIT1,XXA0     BINARY INSTRUCTION                        22464021
       BC    ZERO,GCON45           GEN LIT ELEM ATXT HEX,NO ALLIGN      22472021
         MVI   DX1(OPD3),XX41 HEX HFWORD BNDRY                          22480021
       BC    UNCOND,GCON6          GEN ATXT WITH HFWORD ALLIGNMNT       22488021
GCON45   MVI   DX1(OPD3),XX01 HEX  NO BNDRY                             22496021
       BC    UNCOND,GCON6          GEN LIT ELEM ATXT                    22504021
GCON7    CLI   XCON1+NX16,XX08                                          22512021
       BC    NOTEQ,GCON5           GEN ATXT WITHOUT ALLIGNMNT           22520021
         TM    GBIT1,XX18     FLOATING POINT                            22528021
       BC    XNOEQ,GCON72          GEN ATXT WITH DBL WD BOUNDRY         22536021
         TM    GBIT1,XXA0     L   BINARY                                22544021
       BC    NOTZER,GCON8          TEST FURTHER                         22552021
         TM    GBIT2,XX02                                               22560021
       BC    ONES,GCON8A           GEN ATXT WITH FULL WD BOUNDRY        22568021
       BC    UNCOND,GCON45         GEN ATXT WITHOUT BNDRY ALLIGN        22576021
GCON72   MVI   DX1(OPD3),XXC1 HEX   DBL WORD BNDRY                      22584021
       BC    UNCOND,GCON6          GEN ATXT FOR CONSTANT                22592021
GCON8  TM    GBIT1,HFWORD                                               22600021
       BC    ZERO,GCON88           NOT A HALFWD INSTRUCTION             22608021
         XI    OPCOD,XX40                                               22616021
GCON88   TM    OPCOD,XX50           RX TYPE INSTRUCTION...              22624021
       BC    NOTONE,GCON89          NO                                  22632021
         TM    OPCOD,XXA0                                               22640021
       BC    ZERO,GCON8A            YES, REQUIRES WORD BOUNDARY         22648021
GCON89   TM    GBIT1,XXB8           BINARY OR FLOATING POINT            22656021
       BC    ZERO,GCON45           GEN ATXT WITHOUT BNDRY ALLIGN        22664021
GCON8A   MVI   DX1(OPD3),XX81       HEX FULL WORD BOUNDARY              22672021
       BC    UNCOND,GCON6          GEN ATXT FOR CONSTANT                22680021
GBDISP   MVI   DX0(OPD3),XX70 SET UP                                    22688021
         MVC   DX1(LX2,OPD3),BDISP1 BDISP ELEMENT                       22696021
       BC    UNCOND,GGN1                FOR A TEXT OUTPUT               22704021
* GN'S, PN'S, VN'S                                                      22712021
GGN      MVI   DX0(OPD3),XX50 SET UP                                    22720021
         MVC   DX1(LX2,OPD3),XGN1   GN ELEMENT                          22728021
GGN1   TM    GBIT1,HFWORD                                               22736021
       BC    ZERO,GADD3            GEN ATXT FOR DATA NAME               22744021
         TM    GBIT2,XX01                                               22752021
       BC    ZERO,GGN2       BRANCH IF NOT HALFWORD                     22760021
         XI    OPCOD,XX50     PUT 4 IN HI  ORDER                        22768021
       BC    UNCOND,GADD3          GEN ATXT FOR DNM                     22776021
GGN2     XI    OPCOD,XX40     PUT 5 IN HI ORDER                         22784021
GADD3    CLI   DX0(OPD3),PAPNREF      CHECK FOR PN AND VN REFS WHICH    22792021
       BE    GADD4                   HAVE EXTRA BYTE                    22800021
         CLI   DX0(OPD3),PAVNREF                                        22808021
       BE    GADD4                 INCREM PTR AND GEN ATXT FOR DNM      22816021
         LA    OPD3,DX3(OPD3)         INCREMENT POINTER                 22824021
         B     GADNUM              GENERATE ATXT FOR DNM                22832021
GPN      MVI   DX0(OPD3),PAPNREF        SET UP PN ELEMENT               22840021
         MVC   DX1(LX3,OPD3),XPN1+NX1                                   22848021
       BC    UNCOND,GGN1           COMPLT ATXT AND WRITE OUT            22856021
GVN      MVI   DX0(OPD3),PAVNREF      SET UP VN                         22864021
         MVC   DX1(LX3,OPD3),XVN1+NX1         ELEMENT                   22872021
       BC    UNCOND,GGN1           COMPLT ATXT AND WRITE OUT            22880021
GDEBUG   MVI   DX0(OPD3),XX60 GTREF1                                    22888021
         MVC   DX1(LX2,OPD3),GDEBG1                                     22896021
       BC    UNCOND,GGN1           COMPLT ATXT AND WRITE OUT            22904021
GGTRF1   MVC   GDEBG1(LX2),DX1(OPD1) GTREF1                             22912021
       BC    UNCOND,GDEBUG         GEN GTREF FOR DEBUG                  22920021
GGTRF2   MVC   XCNTR1(LX3),DX1(OPD1) GTREF2                             22928021
       BC    UNCOND,GCNTR        ELEMENT                                22936021
GTALLY TM    GBIT1,HFWORD                                               22944021
       BC    ZERO,GNOLN3     BRANCH IF HALFWORD NOT WANTED              22952021
         XI    OPCOD,XX40     PUT 5 IN HIGH ORDER (1 ALREADY THERE)     22960021
GNOLN3   MVI   DX0(OPD3),XX60  SET UP TALLY                             22968021
         MVI   DX1(OPD3),XX06                                           22976021
         MVI   DX2(OPD3),XX00                                           22984021
       BC    UNCOND,GADD3          GEN ATXT FOR DNM                     22992021
GALLIT   MVI   DX1(OPD3),XX10 CONST IS BCD   NO BOUNDARY REQUIREMENT    23000021
       SR      GXRA,GXRA                                                23008021
         IC    GXRA,DX1(OPD1)                                           23016021
       BCTR  GXRA,RW0          SUBTRACT ONE FROM GXRA                   23024021
       EX    GXRA,CHNGL1     INSERT LENGTH  OF LITERAL                  23032021
         LA    GXRA,DX1(GXRA)                                           23040021
       BC    UNCOND,GFNCON         GEN LITERAL ATXT                     23048021
GFLTLT TM    GBIT1,DBLFPT                                               23056021
       BC    ZERO,GSGLFP           GEN SINGLE FLOATING PT ATXT LIT      23064021
         MVI   DX1(OPD3),XXE0 DOUBLE PRECISION FLOATING POINT CONST     23072021
         LA    GXRA,DX7                                                 23080021
       BC    UNCOND,GFNFPT         MOVE LIT TO OUTPUT AND GEN ATXT      23088021
GSGLFP   MVI   DX1(OPD3),XXA0 SINGLE PRECISION FLOATING POINT CONST     23096021
         LA    GXRA,DX3                                                 23104021
GFNFPT EX    GXRA,CHNGL1     MOVE FLTNG PT LIT TO  OUTPUT AREA          23112021
         LA    GXRA,DX1(GXRA)                                           23120021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23128021
* FIGCONS                                                               23136021
GFGCON   CLI   DX1(OPD1),XXF0                                           23144021
       BC    NOTEQ,GFGCLN    BRANCH IF FIGCON IS NOT ZERO               23152021
       TM    GBIT1,DECBIN                                               23160021
       BC    ONES,GFGCNB     BRANCH IF FIGCON IS IN BINARY MODE         23168021
       TM    GBIT1,DECOP                                                23176021
       BC    ONES,GFGCND     BRANCH IF FIGCON IS IN DECIMAL MODE        23184021
         TM    GBIT1,XX18                                               23192021
       BC    ONES,GFCNFP     BRANCH IF FIGCON IS IN FLOATING POINT      23200021
GFGCLN   MVI   DX1(OPD3),XX10 CONST IS BCD NO BOUNDARY REQUIREMENT      23208021
         MVC   DX3(LX1,OPD3),DX1(OPD1) BCD FIG CON                      23216021
       SR      GXRA,GXRA                                                23224021
       TM    GBIT1,TWOADR    FIGCON EXTERNAL DEC                        23232021
       BC    ZERO,GEXDC1     BRANCH IF THERE ARE NOT TWO ADDRESSES      23240021
       TM    GBIT1,GAD1DN                                               23248021
       BC    ZERO,GEXDC2     BRANCH IF 1ST ADR IS NOT COMPLETED         23256021
       TM    GBIT1,DECOP                                                23264021
       BC    ZERO,GEXDC2     BRANCH IF THERE ARE NOT 2 LENGTH FIELD     23272021
       LH    GXRA,XL2                                                   23280021
       CH    GXRA,XC001                                                 23288021
GEXDC4 BC    HI,GEXDC3             IF MORE THAN LEN01,ZERO FLD          23296021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23304021
GEXDC3 SH    GXRA,GTWO                                                  23312021
       EX    GXRA,CHNGL4     MOVE OTHER BCD ZEROES                      23320021
         LA    GXRA,DX2(GXRA)                                           23328021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23336021
GEXDC1   TM    GBIT2,XX80                                               23344021
       BC    ONES,GEXDC7     BRANCH IF RELADR   LGN EQUALS 1            23352021
GEXDC2 IC    GXRA,XL1        XL1 ALREADY DECREMENTED                    23360021
         LA    GXRA,DX1(GXRA)                                           23368021
         CLI   XL1,XX00                                                 23376021
       BC    UNCOND,GEXDC4         PROP ZEROS IF NEC AND GEN ATXT       23384021
GFCNFP TM    GBIT1,DBLFPT                                               23392021
       BC    ZERO,GFLPT1     BRANCH IF NOT DBL PRECISION                23400021
         LA    GXRA,DX7                                                 23408021
         MVI   DX1(OPD3),XXE0 FLOATING PT  DBL WD BOUNDARY              23416021
       BC    UNCOND,GFLPT2         GEN DBLWD FLOATING PT LITDEF         23424021
GFLPT1   LA    GXRA,DX3                                                 23432021
         MVI   DX1(OPD3),XXA0 FLOATING PT  FULL WD BNDRY                23440021
GFLPT2 EX    GXRA,CHNGL5     MOVE FLOATING PT ZERO                      23448021
         LA    GXRA,DX1(GXRA)                                           23456021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23464021
GFGCND   MVI   DX3(OPD3),XX0F ID ZERO                                   23472021
         MVI   DX1(OPD3),XX04 ID CONST   NO BOUNDARY REQUIREMENT        23480021
GEXDC7   LA    GXRA,DX1                                                 23488021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23496021
GFGCNB TM    GBIT1,HFWORD                                               23504021
       BC    ZERO,GBI1       BRANCH IF HFWORD NOT WANTED                23512021
         XI    OPCOD,XX40     PUT 5 IN HI ORDER (1 ALREADY THERE)       23520021
GBI1     MVC   DX3(LX4,OPD3),GZERO FULL WD BINARY ZERO                  23528021
         MVI   DX1(OPD3),XX88 BINARY FULL WORD BOUNDARY CONSTANT        23536021
         LA    GXRA,DX4                                                 23544021
GFNCON   MVI   DX0(OPD3),XX04 LTL ELEMENT                               23552021
       TM    MADCSW,MSWON          LIT POINTED TO BY AN ADCON...        23560021
       BC    ZERO,GFNCO1            NO                                  23568021
         MVI   DX0(OPD3),XX10        YES,CHANGE TO 10 (DSPLTL ELEMEN    23576021
       NI    MADCSW,MSWOFF             RESET ADCON LIT SW               23584021
GFNCO1 EQU   *                                                          23592021
       ST    OPD3,GLTSAV                                                23600021
         STC   GXRA,GHFWD+NX1                                           23608021
         MVC   DX2(LX1,OPD3),GHFWD+NX1 LENGTH                           23616021
         LA    OPD3,DX3(OPD3)                                           23624021
       AH    OPD3,GHFWD                                                 23632021
       S     OPD3,GLTSAV                                                23640021
       L     RW2,GLTSAV                                                 23648021
       LR    RW3,OPD3                                                   23656021
       BAL   RETRG,PUTLTL          UP LIT CNTR AND PUT ATXT OPTIM       23664021
       L     OPD3,GLTSAV                                                23672021
         TM    GBIT2,XX80                                               23680021
       BO    GRELIT               LITERAL                               23688021
         MVI   DX0(OPD3),XX68 LTL ELEMENT                               23696021
         MVC   DX1(LX2,OPD3),LTLCTR SET LIT ID NUMBER                   23704021
         LA    OPD3,DX3(OPD3)                                           23712021
       BC    UNCOND,GADNUM         GEN ATXT ADD FOR DNM                 23720021
*                                                                       23728021
GNUMLT SR      GXRA,GXRA                                                23736021
         IC    GXRA,DX1(OPD1)                                           23744021
       SH    GXRA,GTHREE                                                23752021
       TM    GBIT1,DECBIN                                               23760021
       BC    ONES,GBILIT           IF BINARY INSTRUCTION, BRANCH        23768021
         MVI   DX1(OPD3),XX04 INT DEC   NO BOUNDARY REQUIREMENT         23776021
       EX    GXRA,CHNGL2     MOVE ACTUAL LITERAL                        23784021
         LA    GXRA,DX1(GXRA)                                           23792021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23800021
GBILIT   CLI   DX1(OPD1),XX07                                           23808021
       BC    NOTHI,GBILT7          IF LITERAL LESS THAN 7 BYTS,BR       23816021
       LA    RETRG,GBILT8                                               23824021
       BC    UNCOND,GBILT2         IF LITERAL MORE THAN 6 BYTS,BR       23832021
GBILT7 EX    GXRA,GZAP                 ZAP                              23840021
       CVB   GRX1,GTEMP      FROM ID TO BIN                             23848021
       EX    GXRA,GBICHG               COMPARE                          23856021
       BL    GBIFUL                IF GT MAX BIN HW VALUE GEN FWD       23864021
       BC    EQ,GBIHAF             IF EQ MAX HWD VAL GEN HALFWD         23872021
       EX    GXRA,GBICG2               COMPARE                          23880021
       BC    HI,GBIFUL             IF LT MIN BIN HWD VAL GEN FLWD       23888021
GBIHAF TM    GBIT1,HFWORD                                               23896021
       BC    ZERO,GBIHF2           IF NOT DBL FLPT,SKIP NXT             23904021
         XI    OPCOD,XX50     PUT 4 IN HI ORDER (1 ALREADY THERE)       23912021
GBIHF2   MVI   DX1(OPD3),XX48 BINARY HALFWORD CONSTANT                  23920021
       STH   GRX1,GFLWD                                                 23928021
         MVC   DX3(LX2,OPD3),GFLWD                                      23936021
         LA    GXRA,DX2                                                 23944021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 23952021
GBIFUL TM    GBIT1,HFWORD                                               23960021
       BC    ZERO,GBIFL2           IF NOT DBL FLPT SKIP NXT             23968021
         XI    OPCOD,XX40     PUT FIVE IN HI ORDER (1 ALREADY THERE)    23976021
GBIFL2   MVI   DX1(OPD3),XX88 BINARY FULLWORD CONSTANT                  23984021
       ST    GRX1,GFLWD                                                 23992021
         MVC   DX3(LX4,OPD3),GFLWD                                      24000021
         LA    GXRA,DX4                                                 24008021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 24016021
GJOHN  STM   GRY,GR15,GSVRG                                             24024021
         LA    GXRA,DX9                                                 24032021
       LR    OPD1,GRX1                                                  24040021
       S     OPD1,GFOUR                                                 24048021
       BAL   RETRG,GBILT2          CONVERT DNM TO BINARY                24056021
       LM    GRY,GR15,GSVRG                                             24064021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     24072021
GBILT2 AR    OPD1,GXRA       CONVERT                                    24080021
         ZAP   GTEMP(LX8),DX0(LX5,OPD1)                                 24088021
       CVB   GRX,GTEMP           6 TO 10 BYTES                          24096021
         SRDA  GRX,DX32               ID TO                             24104021
         MVN   GTEMP+NX7(LX1),DX4(OPD1) SET SIGN IN CASE OF 9 TRAILING  24112021
       SR    OPD1,GXRA                                                  24120021
       SH    GXRA,GFIVE                   BINARY                        24128021
       EX    GXRA,GMOVE                MVO                              24136021
       CVB   GRY1,GTEMP                                                 24144021
       M     GRY,TENPW9                                                 24152021
       ALR   GRX1,GRY1                                                  24160021
         BC    R12,GBILT3     BRANCH IF NO CARRY                        24168021
       AH    GRX,XC001                                                  24176021
GBILT3 AR    GRX,GRY                                                    24184021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     24192021
GBILT8   LA    GXRA,DX5(GXRA)                                           24200021
       EX    GXRA,GBILT4               COMPARE                          24208021
       BC    LO,GBIL64             IF GR THAN MAX FULLWD,GEN DBLWD      24216021
       BC    HI,GBILT5             IF LT MAX FULLWD, TEST FURTHER       24224021
GBIL64   MVI   DX1(OPD3),XXC8 BINARY DOUBLE WORD CONSTANT               24232021
       TM    GBIT1,HFWORD                                               24240021
       BC    ZERO,GBI64            IF NOT DBL FLPT SKIP NXT             24248021
         XI    OPCOD,XX40     PUT 5 IN HI ORDER  (1 ALREADY THERE)      24256021
GBI64    LA    GXRA,DX8                                                 24264021
       ST    GRX,GFLWD                                                  24272021
         MVC   DX3(LX4,OPD3),GFLWD                                      24280021
       ST    GRX1,GFLWD                                                 24288021
         MVC   DX7(LX4,OPD3),GFLWD                                      24296021
       BC    UNCOND,GFNCON         GEN LITERAL DEF ATXT                 24304021
GBILT5 EX    GXRA,GBILT6               COMPARE                          24312021
       BC    HI,GBIL64             IF LT MIN FLWD VAL,GEN DBLWD         24320021
       BC    UNCOND,GBIFUL         OTHERWISE, GEN FULLWORD              24328021
*                                                                       24336021
GNOPT7 LA    RW2,OPCOD                                                  24344021
       BC    UNCOND,GNOPT8         GENERATE ATXT FOR MACRO              24352021
GNOTPT LA    GXRA,GADPAR                                                24360021
       SR    OPD3,GXRA                                                  24368021
         LA    OPD3,DX5(OPD3)                                           24376021
       STH   OPD3,COUNT                                                 24384021
       ST    GXRA,OP3                                                   24392021
         TM    GBIT2,XX40                                               24400021
         BC    ONES,GNOPT4-NX4    BRANCH TO NEXT EX INST                24408021
       BCTR  OPD3,RW0              SUBTRACT 1 FROM REG6.                24416021
       EX    OPD3,CHNGL9               MOVE                             24424021
GNOPT4 EQU   *                                                          24432021
GNOPT9 STM   RW1,RW3,GCOSAV                                             24440021
       L     RW1,COSADR                                                 24448021
         TM    GBIT2,XX40                                               24456021
       BC    ONES,GNOPT7           FOR MACRO BRANCH                     24464021
*                                                                       24472021
         B     AXT017              CHECK TYPE OF INSTRUC AND ALLIGN     24480021
AXT001   EQU   *                                                        24488021
         LA    RW2,OPCOD-NX1                                            24496021
GNOPT8 LH    RW3,COUNT                                                  24504021
         TM    GBIT2,XX40                                               24512021
       BC      ONES,GNOPT5         IF MACRO SUBTRACT 3 FROM COUNT       24520021
       SH    RW3,GTWO                                                   24528021
GNOPT6 BAL   RETRG,PUTA            WRITE OUT ATEXT                      24536021
         TM    GBIT2,XX04                                               24544021
         BZ    AXT102              FINISH P2TXT,RESTOR REGS,RETURN      24552021
         XI    GBIT2,XX04                                               24560021
         L     OPD3,OP3                                                 24568021
         MVI   OPCOD,XXD2                MOVE  TEMP TO  TS2.            24576021
         MVI   GABS,XX03                 SET LENGTH.                    24584021
         TM    GBIT2,XX01                                               24592021
         BZ    AXT103              IF NOT HFWD INSTRUC,BR FOR FLWD      24600021
         MVI   GABS,XX01                                                24608021
AXT104   MVC   DX0(LX4,OPD3),AXTC01       FIRST OPERAND OF MOVE.        24616021
         LA    OPD3,DX4(OPD3)                                           24624021
         CLC   PLUS1(LX3),GZERO          TAKE CARE OF PLUS ELEMENT I    24632021
         BNE   AXT105                   ANY.                            24640021
         MVI   DX0(OPD3),XX80                                           24648021
         MVC   DX1(LX3,OPD3),PLUS1                                      24656021
         LA    OPD3,DX4(OPD3)                                           24664021
*                                                                       24672021
AXT105   MVC   DX0(LX4,OPD3),AXTC02       2ND OPERAND OF MOVE           24680021
         LA    OPD3,DX4(OPD3)                                           24688021
         B     GNOTPT              FILL IN MORE ATXT                    24696021
*                                                                       24704021
AXT103   CLI   OTPT+NX3,XX90             STM                            24712021
         BNE   AXT104                   NO                              24720021
         MVI   GABS,XX07                 YES,SET LENGTH TO8.            24728021
         B     AXT104              FILL IN OPERANDS FOR ATXT            24736021
AXT102   EQU   *                                                        24744021
         XC    OP1(LX8),OP1                                             24752021
         MVI   XL1,XX00                                                 24760021
         MVC   XL1+NX1(GCNLGN),XL1                                      24768021
         MVI   GABS,XX00                                                24776021
         MVC   COUNT(LX2),GFIVE                                         24784021
         MVI   OPCOD-NX1,XX48                                           24792021
       LM      GR1,GR15,GSVRG                                           24800021
       BCR     UNCOND,RETRG        FIN P2TXT ELM,RESTR REGS,RETURN      24808021
GNOPT5 SH    RW3,GTHREE                                                 24816021
       BC    UNCOND,GNOPT6         WRITE MACRO ATXT                     24824021
GNOPT2   MVC   OTPT(LX5),COUNT                                          24832021
       BC    UNCOND,GNOPT4         GEN INSTRUC AND WRITE ATXT           24840021
GOPT3C EQU   PUTA                                                       24848021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     24856021
* INSTRUCTION ENTRY POINTS                                              24864021
ADD      MVI   OPCOD,XX1A     AR OP CODE=1A  CHANGED IF A OR AH OR A    24872021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24880021
ADDLBI   MVI   OPCOD,XX1E     ALR OP CODE=1E  CHANGED IF AL             24888021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24896021
SUBLBI   MVI   OPCOD,XX1F     SLR OP CODE=1F  CHANGED IF SL             24904021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24912021
COMP     MVI   OPCOD,XX19     CR OP CODE=19   CHANGED IF C OR CH OR     24920021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24928021
MULT     MVI   OPCOD,XX1C     MR OP CODE=1C  CHANGED IF M OR MH OR M    24936021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24944021
DIV      MVI   OPCOD,XX1D     DR OP CODE=1D  CHANGED IF D OR DP         24952021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24960021
LTRBI    MVI   OPCOD,XX12     LTR OP CODE=12  CHANGED IF PACK           24968021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24976021
LNRBI    MVI   OPCOD,XX11     LNR OP CODE=11  CHANGED IF MVO            24984021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 24992021
LCRBI    MVI   OPCOD,XX13     LCR OP CODE=13  CHANGED IF UNPACK         25000021
       BC    UNCOND,GHIBYT         GEN ATXT FOR INSTRUC                 25008021
CVBBI    MVI   OPCOD,XX4F     CVB OP CODE=4F                            25016021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              25024021
CVDBI    MVI   OPCOD,XX4E     CVD OP CODE=4E                            25032021
         MVI   GBIT1,XX20     WANT TO CONVERT NUMLIT TO BINARY IF AN    25040021
       STM   GR1,GR15,GSVRG                                             25048021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS    3 WITH GADPA     25056021
       BC    UNCOND,SETRX          GEN ATXT FOR RX INSTRUC              25064021
ORLG     MVI   OPCOD,XX16     OR OP=16  CHANGE IF O,OR OC               25072021
       BC    UNCOND,GHIBT1         GEN ATXT FOR LOGICL INSTRUC          25080021
EXORLG   MVI   OPCOD,XX17     XR OP=17  CHANGE IF X,OR XC               25088021
       BC    UNCOND,GHIBT1         GEN ATXT FOR LOGICL INSTRUC          25096021
ANDLG    MVI   OPCOD,XX14     NR OP=14  CHANGE IF N,OR NC               25104021
       BC    UNCOND,GHIBT1         GEN ATXT FOR LOGICL INSTRUC          25112021
MVN      MVI   OPCOD,XX11     MVN LO ORDER OP FIELD=1                   25120021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25128021
MVI      MVI   OPCOD,XX92     MVI OP CODE =92                           25136021
       BC    UNCOND,GHIBT4         GEN ATXT FOR SI INSTRUC              25144021
CLI      MVI   OPCOD,XX95     CLI OP CODE=95                            25152021
       BC    UNCOND,GHIBT4         GEN ATXT FOR SI INSTRUC              25160021
OI       MVI   OPCOD,XX96     OI OP CODE=96                             25168021
       BC    UNCOND,GHIBT4         GEN ATXT FOR SI INSTRUC              25176021
XI       MVI   OPCOD,XX97     XI OP CODE=97                             25184021
       BC    UNCOND,GHIBT4         GEN ATXT FOR SI INSTRUC              25192021
NI       MVI   OPCOD,XX94     NI OP CODE=94                             25200021
       BC    UNCOND,GHIBT4         GENERATE ATXT FOR SI INSTRUC         25208021
TM       MVI   OPCOD,XX91     TM OP CODE=91                             25216021
GHIBT4 STM   GR1,GR15,GSVRG                                             25224021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS   3 WITH GADPAR     25232021
         MVC   GABS(LX1),IMM                                            25240021
         MVI   GBIT1,XX00                                               25248021
       BC    UNCOND,GCHKOP         GEN ATXT FOR RX OPERAND2             25256021
GDOSSD   XI    OPCOD,XXE0     PUT F IN HI ORDER (1 ALREADY THERE)       25264021
         MVI   GBIT1,XX44     SET BIT FOR 2 ADR  AND DEC OP             25272021
       LH    GXRA,XL2        SUBTRACT                                   25280021
       BCTR  GXRA,RW0               ONE FROM LENGTH2                    25288021
       STC   GXRA,GABS              AND STORE IN HI 4 BITS OF GABS      25296021
       LH    GXRA,XL1        SUBTRACT                                   25304021
       BCTR  GXRA,RW0               ONE FROM LENGTH1                    25312021
       STC   GXRA,XL1               AND STORE IN                        25320021
         MVO   GABS(LX1),XL1(LX1)            HI 4 BITS OF GABS          25328021
       BC    UNCOND,GCHKOP         GEN ATXT FOR SS OPERANDS             25336021
*                                                                       25344021
MVZ      MVI   OPCOD,XX13     MVZ OP CODE=D3                            25352021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25360021
TR       MVI   OPCOD,XX1C     TR OP CODE=DC                             25368021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25376021
TRT      MVI   OPCOD,XX1D     TRT OP CODE=DD                            25384021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25392021
EDIT     MVI   OPCOD,XX1E     ED OP CODE=DE                             25400021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25408021
EDMARK   MVI   OPCOD,XX1F     EDMK OP CODE=DF                           25416021
       BC    UNCOND,GFXLSS         GEN ATXT FOR LOGICL SS INSTRUC       25424021
LHALF    OI    GBIT2,XX01                                               25432021
       BC    UNCOND,LOAD           GEN ATXT FOR LH INSTRUC              25440021
STHALF   OI    GBIT2,XX01                                               25448021
       BC    UNCOND,STORE          GEN ATXT FOR STH INSTRUC             25456021
SHALF    OI    GBIT2,XX01                                               25464021
       BC    UNCOND,SUB            GEN ATXT FOR SH INSTRUC              25472021
MHALF    OI    GBIT2,XX01                                               25480021
       BC    UNCOND,MULT           GEN ATXT FOR MH INSTRUC              25488021
IC       MVI   OPCOD,XX43     IC OP CODE=43                             25496021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              25504021
STC      MVI   OPCOD,XX42     STC OP CODE=42                            25512021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              25520021
LA       MVI   OPCOD,XX41     LA OP CODE=41                             25528021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              25536021
*SLA    MVI   OPCOD,X'8B'     SLA OPCODE=8B                             25544021
*       BC    UNCOND,SETRX0                                             25552021
*SRA    MVI   OPCOD,X'8A'     SRA OP CODE=8A                            25560021
*       BC    UNCOND,SETRX0                                             25568021
*SLDA   MVI   OPCOD,X'8F'     SLDA OP CODE=8F                           25576021
*       BC    UNCOND,SETRX0                                             25584021
SRDA     MVI   OPCOD,XX8E     SRDA OP CODE=8E                           25592021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              25600021
*SLL    MVI   OPCOD,X'89'     SLL OP CODE=89                            25608021
*       BC    UNCOND,SETRX0                                             25616021
*SRL    MVI   OPCOD,X'88'     SRL OP CODE=88                            25624021
*       BC    UNCOND,SETRX0                                             25632021
*SLDL   MVI   OPCOD,X'8D'     SLDL OP CODE=8D                           25640021
*       BC    UNCOND,SETRX0                                             25648021
*SRDL   MVI   OPCOD,X'8C'     SRDL OP CODE=8C                           25656021
*       BC    UNCOND,SETRX0                                             25664021
*EX     MVI   OPCOD,X'44'     EX OP CODE=44                             25672021
*       BC    UNCOND,SETRX0                                             25680021
*BXLE   STM   GR1,GR15,GSVRG                                            25688021
*       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR     25696021
*       BAL   RETRG,GTSTNM                                              25704021
*       MVI   OPCOD,X'87'     BXLE OP CODE IS 98                        25712021
*       BC    UNCOND,SETRSB                                             25720021
*       MVI   GCGBR2+1,X'87'  BXLE OP CODE                              25728021
*       BC    UNCOND,GOTBR2                                             25736021
*BXH    STM   GR1,GR15,GSVRG                                            25744021
*       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR     25752021
*       BAL   RETRG,GTSTNM                                              25760021
*       MVI   OPCOD,X'86'     BXH OP CODE IS 86                         25768021
*       BC    UNCOND,SETRSB                                             25776021
*       MVI   GCGBR2+1,X'86'  BXH OP CODE                               25784021
*GOTBR2 MVC   GCGBR2+2(1),XREG2                                         25792021
*       MVO   GCGBR2+2(1),XREG1(1)                                      25800021
*       MVI   GCNGBR+1,X'0D'                                            25808021
*       MVC   COUNT(8),GCNGBR                                           25816021
*       MVC   COUNT+8(5),GCGBR2                                         25824021
*       BC    UNCOND,GNOPT9                                             25832021
LM       MVI   OPCOD,XX98     LM OP CODE=98                             25840021
       BC    UNCOND,SETRS          GEN ATXT FOR RS INSTRUC              25848021
STM      MVI   OPCOD,XX90     STM OP CODE=90                            25856021
SETRS  STM   GR1,GR15,GSVRG                                             25864021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR      25872021
         XI    GBIT2,XX02                                               25880021
         MVC   GABS(LX1),XREG2     LO 4 BITS OPND2 TO LO 4 BITS         25888021
       BC    UNCOND,SETRX1         COMPLT ATXT FOR RS INSTRUC           25896021
BRANCH STM   GR1,GR15,GSVRG                                             25904021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR      25912021
       BAL   RETRG,GTSTNM          FOR BR OF PN,VN MOD DIRECT ATXT      25920021
         MVI   OPCOD,XX07     BCR OP CODE IS 07   CHANGED IF BC         25928021
       BC    UNCOND,GHBT3B         BR TO GEN ATXT FOR BRANCH            25936021
         MVI   GCNGBR+NX9,XX07      BCR OP CODE                         25944021
       B     GOUTBR                FOR PN MOVE BR STRING TO OUTAREA     25952021
GTSTNM   CLC   XGN1(LX2),GZERO                                          25960021
       BC    EQ,GTSTN2       BRANCH IF NOT GN                           25968021
         MVI   GCNGBR+NX5,XX50                                          25976021
         MVC   GCNGBR+NX6(LX2),XGN1                                     25984021
         B     DX8(RETRG)          BRANCH TO PUT OUT DIRECT ATXT        25992021
GTSTN2   CLC   XVN1(LX4),GZERO        SET VNREF CODE                    26000021
       BC    NOTEQ,GTSTN3    BRANCH IF VN                               26008021
         CLC   XPN1(LX4),GZERO                                          26016021
       BCR   EQ,RETRG        BR IF NOT PN                               26024021
         MVI   GCPNVNBR+NX5,PAPNREF     INSERT PRIORITY & PN NUMBER     26032021
         MVC   GCPNVNBR+NX6(LX3),XPN1+NX1                               26040021
         LA    RETRG,GOUTBR2        SET 14 FOR RETURN FROM PNUSED R     26048021
         LH    RW3,XPN1+NX2             GO TO MARK PNUTBL               26056021
         B     GOUTBR2                 CONTINUE                         26064021
GTSTN3   MVI   GCPNVNBR+NX5,PAVNREF   INSERT PRIORITY AND               26072021
         MVC   GCPNVNBR+NX6(LX3),XVN1+NX1         VN NUMBER             26080021
       B     GOUTBR2               FOR VN COMPLT BR ATXT AND WRITE      26088021
BRNLNK STM   GR1,GR15,GSVRG                                             26096021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR      26104021
       BAL   RETRG,GTSTNM          FOR PN OR VN MOD DIRECT ATXT         26112021
         MVI   OPCOD,XX05     BALR OP CODE IS 05   CHANGED IF BAL       26120021
       BC    UNCOND,GHBT3B         BR TO GEN ATXT FOR BALR              26128021
         MVI   GCNGBR+NX9,XX05 BCR OP CODE                              26136021
       BC    UNCOND,GOUTBR         FOR PN COMPLT ATXT,MOVE TO OUT       26144021
BRNCNT STM   GR1,GR15,GSVRG                                             26152021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS  3 WITH GADPAR      26160021
       BAL   RETRG,GTSTNM          FOR PN OR VN MOD DIRECT ATXT         26168021
         MVI   OPCOD,XX06     BCTR OP CODE IS 06   CHANGED IF BCT       26176021
       BC    UNCOND,GHBT3B         BR TO GEN ATXT FOR BCTR              26184021
         MVI   GCNGBR+NX9,XX06 BCTR OP CODE                             26192021
GOUTBR   BAL   RETRG,GDES15        DESTROY 15                           26200021
         MVO   GCNGBR+NX10(LX1),XREG1(LX1)                              26208021
         MVI   GCNGBR+NX1,XX0B                                          26216021
         MVC   COUNT(LX11),GCNGBR                                       26224021
       BC    UNCOND,GNOPT9         WRITE OUT ATXT                       26232021
GOUTBR2  BAL   RETRG,GDES15            DESTROY REG 15                   26240021
         MVO   GCPNVNBR+NX11(LX1),XREG1(LX1)                            26248021
         MVI   GCPNVNBR+NX1,XX0C         SET LENGTH                     26256021
         MVC   COUNT(LX12),GCPNVNBR  MOVE BRANCH STRING TO OUTPUT AR    26264021
         B     GNOPT9              WRITE OUT ATXT                       26272021
LDFLL    MVI   OPCOD,XX28     LDR OP CODE=28  CHANGED IF LD             26280021
GHBT2    MVI   GBIT1,XX10     DOUBLE PRECISION FLOATING POINT CONSTA    26288021
GHIBT2   OI    GBIT1,XX08                FLOATING POINT.                26296021
       BC    UNCOND,GHIBT3         SAVE REGS AND BR TO GEN ATXT         26304021
GHBT3B   MVI   GBIT1,XX00                                               26312021
       BC    UNCOND,GHBT3C         BR TO GEN ATXT                       26320021
GHIBT3 STM   GR1,GR15,GSVRG                                             26328021
       LM    OPD1,OPD3,OP1   LD REGS WITH OPND PTRS   3 WITH GADPAR     26336021
GHBT3C CLC   XWC1(GCNLN2),GZERO                                         26344021
       BC    NOTEQ,GSTRX3    BRANCH IF RX TYPE INSTRUCTION              26352021
       C     OPD1,GZERO                                                 26360021
       BC    EQ,SETRR        BRANCH IF RR TYPE INSTRUCTION              26368021
GSTRX3   XI    OPCOD,XX40     PUT 4 IN HI ORDER (0 OR 2 OR 3 THERE N    26376021
         CLI   XXREG,XX00                                               26384021
       BC    EQ,SETRX              IF REG0, BR TO GEN RX DOP ATXT       26392021
GFKRG    MVC   GABS(LX1),XXREG                                          26400021
       BC    UNCOND,SETRX          GENERATE ATXT FOR RX INSTRUC         26408021
GFKRG2   XI    OPCOD,XX40                                               26416021
       BC    UNCOND,GFKRG          MOVE IN REGNO,BR TO GEN INSTRUC      26424021
LDFLS    MVI   OPCOD,XX38     LER OP CODE=38  CHANGED IF LE             26432021
       BC    UNCOND,GHIBT2         GEN FLPT ATXT INSTRUC                26440021
ADFLS    MVI   OPCOD,XX3A     AER OP CODE=3A  CHANGED IF AE             26448021
       BC    UNCOND,GHIBT2         GEN SGL FLPT ATXT INSTRUC            26456021
ADFLL    MVI   OPCOD,XX2A     ADR OP CODE=2A  CHANGED IF AD             26464021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26472021
*ADUNS  MVI   OPCOD,X'3E'     AUR OP CODE=3E  CHANGED IF AU             26480021
*       BC    UNCOND,GHIBT2                                             26488021
*ADUNL  MVI   OPCOD,X'2E'     AWR OP CODE=2E  CHANGED IF AW             26496021
*       BC    UNCOND,GHBT2                                              26504021
SUBNS    MVI   OPCOD,XX3B     SER OP CODE=3B  CHANGED IF SE             26512021
       BC    UNCOND,GHIBT2         GEN FLPT ATXT INSTRUC                26520021
SUBNL    MVI   OPCOD,XX2B     SDR OP CODE=2B  CHANGED IF SD             26528021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26536021
SUBUNS   MVI   OPCOD,XX3F     SUR OP CODE=3F  CHANGED IF SU             26544021
       BC    UNCOND,GHIBT2         GEN SNGL FLPT ATXT INSTRUC           26552021
SUBUNL   MVI   OPCOD,XX2F     SWR OP CODE=2F  CHANGED IF SW             26560021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26568021
CMPFLS   MVI   OPCOD,XX39     CER OP CODE=39  CHANGED IF CE             26576021
       BC    UNCOND,GHIBT2         GEN SNGL FLPT ATXT INSTRUC           26584021
CMPFLL   MVI   OPCOD,XX29     CDR OP CODE=29  CHANGED IF CD             26592021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26600021
PNBCD  STM   RETRG,RW3,PUTSAV                                           26608021
         LA    RW3,DX1                                                  26616021
       LA    RW2,GADPAR                                                 26624021
         MVI   GADPAR,XX3C    PNBCD                                     26632021
         B     PUTA+NX4           BRANCH TO PUT A RTN                   26640021
MACRO  STM   GR1,GR15,GSVRG                                             26648021
       LM    OPD1,OPD3,OP1                                              26656021
         MVI   GBIT2,XX40     HAVE MACRO                                26664021
         MVI   OPCOD,XX44     MACRO                                     26672021
         MVC   GABS(LX1),GMCTYP                                         26680021
       NI    MADCSW,MSWOFF                                              26688021
       CLI   GMCTYP,MADCON         ADCON...                             26696021
       BC    NOTEQ,GCKOP3           NO                                  26704021
         CLI   DX0(OPD1),MANLIT                                         26712021
       BC    NOTEQ,GCKOP3          NOT ALPHANUM LIT,GEN PROPER ATXT     26720021
       OI    MADCSW,MSWON           YES, SET ADCON SW                   26728021
       BC    UNCOND,GCKOP3         GEN ATXT FOR ADCON                   26736021
SVC      MVI   OPCOD,XX0A     SVC OPCODE                                26744021
       BC    UNCOND,CNOP2          SKIP NXT TO KEEP SVC OP CODE         26752021
CNOP     MVI   OPCOD,XX00     CNOP OP CODE                              26760021
CNOP2  STM   GR1,GR15,GSVRG                                             26768021
       LM    OPD1,OPD3,OP1                                              26776021
         MVC   GABS(LX1),IMM                                            26784021
       BC    UNCOND,GNOPT2         WRITE OUT SVC DIRECT ATXT            26792021
MULTS    MVI   OPCOD,XX3C     MER OP CODE=3C  CHANGED IF ME             26800021
       BC    UNCOND,GHIBT2         GEN SNGL FLPT ATXT INSTRUC           26808021
MULTFL   MVI   OPCOD,XX2C     MDR OP CODE=2C  CHANGED IF MD             26816021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26824021
DIVFLS   MVI   OPCOD,XX3D     DER OP CODE=3D  CHANGED IF DE             26832021
       BC    UNCOND,GHIBT2         GEN SNGL FLPT ATXT INSTRUC           26840021
DIVFLL   MVI   OPCOD,XX2D     DDR OP CODE=2D  CHANGED IF DD             26848021
       BC    UNCOND,GHBT2          GEN DBL FLPT ATXT INSTRUC            26856021
STORFS   MVI   OPCOD,XX70     STE OP CODE=70                            26864021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              26872021
STORFL   MVI   OPCOD,XX60     STD OP CODE=60                            26880021
       BC    UNCOND,SETRX0         GEN ATXT FOR RX INSTRUC              26888021
HALVEL   MVI   OPCOD,XX24     HDR OP CODE=24                            26896021
       BC    UNCOND,SETRR1         GEN ATXT FOR RR INSTRUC              26904021
HALVES   MVI   OPCOD,XX34     HER OP CODE=34                            26912021
       BC    UNCOND,SETRR1         GEN ATXT FOR RR INSTRUC              26920021
LDNEGS   MVI   OPCOD,XX31     LNER OP CODE=31                           26928021
       BC    UNCOND,SETRR1         GEN ATXT FOR RR INSTRUC              26936021
*LDNEGL MVI   OPCOD,X'21'     LNDR OP CODE=21                           26944021
*       BC    UNCOND,SETRR1                                             26952021
*LDPOSL MVI   OPCOD,X'20'     LPDR OP CODE=20                           26960021
*       BC    UNCOND,SETRR1                                             26968021
*LDPOSS MVI   OPCOD,X'30'     LPER OP CODE=30                           26976021
*       BC    UNCOND,SETRR1                                             26984021
*LDCMPL MVI   OPCOD,X'23'     LCDR OP CODE=23                           26992021
*       BC    UNCOND,SETRR1                                             27000021
*LDCMPS MVI   OPCOD,X'33'     LCER OP CODE=33                           27008021
*       BC    UNCOND,SETRR1                                             27016021
LDTSTL   MVI   OPCOD,XX22     LTDR OP CODE=22                           27024021
       BC    UNCOND,SETRR1         GEN ATXT FOR RR INSTRUC              27032021
LDTSTS   MVI   OPCOD,XX32     LTER OP CODE=32                           27040021
       BC    UNCOND,SETRR1         GEN ATXT FOR RR INSTRUC              27048021
GNSTEP LH    GR14,FIVEGN                                                27056021
         LA    GR14,DX1(GR14)                                           27064021
       STH   GR14,FIVEGN                                                27072021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     27080021
GCONMV   MVC   DX3(LX1,OPD3),DX0(RETRG)                                 27088021
*   THE FOLLOWING INSTRUCTIONS ARE EXECUTED BY THE EX INSTRUCTION       27096021
GBILT4   CP    GFLHI(LX10),DX4(LX1,OPD1)                                27104021
GBILT6   CP    GFLLO(LX10),DX4(LX1,OPD1)                                27112021
CHNGL1   MVC   DX3(LX1,OPD3),DX2(OPD1) FOR ALPHA LIT + FLTNG PT LIT     27120021
CHNGL4   MVC   DX4(LX1,OPD3),DX3(OPD3) FOR FIG CON BCD                  27128021
CHNGL2   MVC   DX3(LX1,OPD3),DX4(OPD1) FOR NUM LIT                      27136021
CHNGL5   MVC   DX3(LX1,OPD3),GZERO FOR FIG CON FLTNG PT                 27144021
CHNGL9   MVC   OTPT(LX1),COUNT                                          27152021
GZAP     ZAP   GTEMP(LX8),DX4(LX1,OPD1)                                 27160021
GBICHG   CP    GHFHI(LX5),DX4(LX1,OPD1)                                 27168021
GBICG2   CP    GHFLO(LX5),DX4(LX1,OPD1)                                 27176021
AXTI00   MVC   DX0(LX0,RW2),OTPT+NX5                                    27184021
GMOVE    MVO   GTEMP+NX3(LX5),DX4(LX1,OPD1)                             27192021
GDC1     MVC   DX1(LX1,OPD3),XCON1                                      27200021
         EJECT                                                    51894 27208021
DNTOR0   DS    0H                                                 51894 27216021
         MVI   REG,RW0             LOAD INTO REG 0                51894 27224021
         B     ROUT                CONTINUE                       51894 27232021
DNTOR1   DS    0H                                                 51894 27240021
         MVI   REG,RW1             LOAD INTO REG 1                51894 27248021
ROUT     DS    0H                                                 51894 27256021
GDNCNG ST    RETRG,EXHIBP                                               27264021
         CLC   DX4(LX3,RW3),XTALLV+NX4 TEST IF TALLY                    27272021
       BC    NOTEQ,GODP5     BRANCH IF NOT TALLY                        27280021
         MVI   TALLY1,XX05                                              27288021
       BC    UNCOND,GODP6X         GEN LOAD INSTRUC AND BR              27296021
GODP5    NI    DX3(RW3),XXF0                                            27304021
         CLI   DX3(RW3),XXB0       TEST MINOR CODE                      27312021
       ST    RW3,OP1                                                    27320021
       BC    EQ,GODP6        BINARY                                     27328021
         MVI   XL1+NX1,XX08                                             27336021
         MVI   XCNTR1,XX30    TEMP STORAGE OTHER THAN ARITH             27344021
         MVI   XCNTR1+NX2,XX01                                          27352021
       BC    HI,GOPID        ID                                         27360021
         MVC   XL2+NX1(LX1),DX9(RW3)                                    27368021
       LH    RETRG,XL2                                                  27376021
       SH    RETRG,XC016                                                27384021
         BL    GODPCK              IF LT 16, NO DBL PACK NEEDED         27392021
         STH   RETRG,PLUS2+NX1                                          27400021
         MVI   XL2+NX1,XX10                                             27408021
GODPCK EQU   *                                                          27416021
       BAL   RETRG,PACK      DO A PACK  GTREF2(8),DN(L2)                27424021
       BC    UNCOND,GODP2          UP TS TO 8 AND GEN CUB ATXT          27432021
GOPID    IC    RETRG,DX9(RW3)                                           27440021
         SRL   RETRG,DX1                                                27448021
         LA    RETRG,DX1(RETRG)                                         27456021
         STC   RETRG,XL2+NX1                                            27464021
       BAL   RETRG,ZAP       DO A ZAP  GTREF2(8),DN(L2)                 27472021
GODP2    DS    0H                                                 51894 27480021
         MVC   XREG1(LX1),REG                                     51894 27488021
         CLC   TS2MAX(LX2),XC008                                        27496021
         BNL   GFXTS3              ENOUGH TS2 ALLOCATED           51894 27504021
         MVC   TS2MAX(LX2),XC008                                  51894 27512021
GFXTS3   MVI   XCNTR1,XX30                                              27520021
         MVI   XCNTR1+NX2,XX01                                          27528021
       BAL   RETRG,CVBBI     DO A CVB  XRC,GTREF2                       27536021
         B     GODPXT              EXIT                           51894 27544021
*DEL                                                               5189 27552021
*DEL                                                               5189 27560021
*DEL                                                               5189 27568021
GODP6  SR    RETRG,RETRG                                                27576021
         IC    RETRG,DX9(RW3)                                           27584021
       CH    RETRG,XC009           DOUBLE PRECISION...                  27592021
       BC    NOTHI,GODP6X           NO                                  27600021
         MVI   PLUS1+NX2,XX04        YES, SET UP A-TEXT BUFFER FOR '    27608021
GODP6X   DS    0H                                                 51894 27616021
         MVC   XREG1(LX1),REG                                     51894 27624021
       BAL   RETRG,LOAD      DO A LH  XRC,DN                            27632021
GODPXT   DS    0H                                                 51894 27640021
       L     RETRG,EXHIBP                                               27648021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     27656021
*              END OF A-TEXT GENERATOR                                  27664021
       TITLE 'EVAL VERB ANALYZER'                                       27672021
IKF50A CSECT                                                            27680021
       SPACE 2                                                          27688021
*     XEVAL - INITIALIZES FOR SUBSEQUENT VERB ANALYZERS                 27696021
*            GETS NUMBER OF DECIMAL PLACES IN RESULT                    27704021
*            GETS MAXIMUM NUMBER OF DECIMAL PLACES IN THIS STRING       27712021
*            CHECKS FOR ROUNDED AND ON SIZE ERROR OPTIONS               27720021
*            CHECKS FOR ADD CORRESPONDING                               27728021
*            CHECKS FOR DIVIDE ROUNDED REMAINDER                        27736021
       SPACE 2                                                          27744021
       USING *,XRVERB                                                   27752021
XEVAL  EQU   *                                                          27760021
         MVI   XGSWT,XX00           SET XGSWT = 0                       27768021
         XC    XRDMX(LX4),XRDMX     SET XRDMX = XGDRE = 0               27776021
       BAL   XRSUB,XINITN          INIT GEN REG TABLES                  27784021
       BAL   XRSUB,XINITF          INIT FL PT REG TABLES                27792021
       BAL   XRSUB,XINTL1          INIT DOP BUFFS SET XOPMOD = 0        27800021
         NI    XGNSW,XXDF           ALLOW PRINTING OF MSG 11            27808021
       SPACE 2                                                          27816021
       L     XR1,XAINTR            XR1 HAS @TIB FOR XINTR               27824021
       BAL   XRSUB,XTBDEB          XR1 NOW HAS @TAM FOR XINTR           27832021
         MVC   DX4(LX2,XR1),XC000    SET # OF BYTES USED = 0            27840021
       SPACE 2                                                          27848021
         MVC   XRDMX+NX1(LX1),DOP1+NX2 XRDMX = MAX # OF DEC PLACES      27856021
         MVC   XGDRE+NX1(LX1),DOP1+NX3 XGDRE = # OF DEC PLACES IN RES   27864021
             SPACE 2                                                    27872021
       CLI   ELEMCT,XTWO           IS ON SIZE ERROR OPTION USED         27880021
       BNH   XG001                 NO                                   27888021
       OI    XGSWT,XSIZER          YES TURN ON SWITCH AND               27896021
         MVC   XSZTRA(LX2),DOP3+NX1  GET ON SIZE ERROR TRANSFER         27904021
       SPACE 2                                                          27912021
         CLC   XSZTRA(LX2),XMINON   IS THIS AN ADD CORRESPONDING        27920021
       BNE   XG002                 NO                                   27928021
       TM    XGNSW,XADDCR          YES, IS THIS THE FIRST ADD           27936021
       BO    XG001                 NO                                   27944021
       OI    XGNSW,XADDCR          YES, FOR FIRST ADD OF AN ADD         27952021
         MVI   XIMM,XX7F                 CORRESPONDING RESET OBJ        27960021
         MVI   GDEBG1,XX04         TIME SIZE ERROR SWITCH               27968021
         BAL   XRSUB,NI           PUT A TEXT NI INST                    27976021
       SPACE 2                                                          27984021
XG001  EQU   *                                                          27992021
         CLC   DOP1+NX5(LX2),XC000 IS THIS A DIVIDE REMAINDER      7884 28000021
         BE    XG003               NO                              7884 28008021
         OI    XGNSW,DIVREM        YES, TURN ON SWITCH             7884 28016021
         SPACE 2                                                   7884 28024021
XG003    DS    0H                                                  7884 28032021
         CLI   DOP1+NX4,XX00        IS ROUNDED OPTION USED              28040021
       BE    PH5CTL                NO RETURN                            28048021
       OI    XGSWT,XROUND          YES TURN ON SWITCH                   28056021
       SPACE 2                                                          28064021
         LH    XR4,XGDRE           UPDATE XGDRE AND XRDMX          7884 28072021
       CH    XR4,XC018             IS RESULT ALREADY 18 DECIMALS        28080021
       BE    PH5CTL                YES RETURN                           28088021
         TM    XGNSW,DIVREM        IS THIS A DIVIDE REMAINDER      7884 28096021
       BZ    XG005               NO                                     28104021
       OI    XGNSW,ADDONE        YES, TURN ON SWITCH INDICATING A       28112021
XG005  EQU   *                   DEC PLACE HAS BEEN ADDED               28120021
       AH    XR4,XC001             NO ADD ONE                           28128021
       STH   XR4,XGDRE                                                  28136021
         CLC   XGDRE(LX2),XRDMX     IS # OF DEC IN RES > MAX # DEC      28144021
       BNH   PH5CTL                NO RETURN                            28152021
         MVC   XRDMX+NX1(LX1),XGDRE+NX1 YES SET XRDMX = XGDRE           28160021
       B     PH5CTL                RETURN                               28168021
       SPACE 2                                                          28176021
XG002  TM    XGNSW,XADDCR          IS THIS AN ADD CORR                  28184021
       BZ    XG001                 NO                                   28192021
       OI    XGSWT,XADDCR          YES AND IT IS THE LAST ADD           28200021
         B     XG001              BRANCH TO XG001                       28208021
       TITLE 'SUBSCRIPT VERB ANALYZER'                                  28216021
*      SSCRPT   -ROUTINE WHICH GETS NECESSARY INFORMATION FOR COMPU     28224021
*               -THE ADDRESS OF A SUBSCRIPTED ELEMENT.                  28232021
*               - INPUT  IS FOUND IN INPUT BUFFER                       28240021
*               - OUTPUT IS LENGHTS OR VLC'S OF VARIOUS LEVEL,          28248021
*                           ID NUMBER OF THIS SUBCRIPT COMBINATION,     28256021
*                           ATTRIBUTES OF SUBSCRIPTS AND SUBSCRIPTE     28264021
*                           NAME,IN WORK AREA.                          28272021
*                           FIND OUT WHETHER OR NOT IT IS A NEW SUB     28280021
*                           COMBINATION,AND IF NOT RETURNS POINTER      28288021
*                           ENTRY IN TAMER CONTAINING RESULT OF         28296021
*                           PREVIOUS COMPUTATION.                       28304021
*                                                                       28312021
       SPACE 5                                                          28320021
       USING   *,XRVERB                                                 28328021
SSCRPT EQU   *                                                          28336021
       ST    RETRG,SCHLD2         R14 PICKED UP IF RETURN TO SEARCHAL   28344021
       BAL   XRSUB,XINTL1               INITIALIZE  WORK AREA.          28352021
       SR    XR0,XR0                                                    28360021
       IC    XR0,ELEMCT                                                 28368021
       AH    XR0,XC001                                                  28376021
         SLL   XR0,DX2                                                  28384021
       STH   XR0,XSSUBN                 SET LENGHT OF ENTRY IN TAME     28392021
       LR    XR2,XR0                                                    28400021
       SH    XR2,XC008                                                  28408021
       L     XR5,XAOPE1(XR2)                                            28416021
         MVC   XSIDNB(LX2),XDIDK+NX1(XR5) GET ID NUMBER OF THIS SUB.    28424021
         SRL   XR2,DX2                   BINATION.                      28432021
       BCTR  XR2,RW0               SUBTRACT 1 FROM REG2                 28440021
         STH   XR2,XSSUBN+NX2            SET SUBCRIPT NUMBER.           28448021
       BCTR  XR2,RW0               SUBTRACT 1 FROM REG2                 28456021
         SLL   XR2,DX2                   INITIALIAZE INDEXES TO PICK    28464021
       L     XR6,XAOPE2                 I,D,K OF SUBS OR THEIR VALU     28472021
       OI    XOPMOD,XALLSN              IF LITTERALS.                   28480021
       SPACE 2                                                          28488021
XGET01   CLI   DX0(XR6),XGDTN            IS IT A DATA NAME SUBC.        28496021
       BC    XZERO,XGET00               YES                             28504021
         CLI   DX0(XR6),INDXNM     NO, IS IT AN INDEX NAME              28512021
       BE    IX000                YES                                   28520021
         CLI   DX0(XR6),XGNLT            NO,IS IT A LITTERAL.           28528021
       BC    XNOEQ,XGETLG               NO- LOGIC ERROR.                28536021
       SR    XR3,XR3                    YES- PICK-UP BINARY VALUE O     28544021
       IC    XR3,XGNBYT(XR6)            LITTERAL.                       28552021
       SH    XR3,XC003                  X                               28560021
       EX    XR3,XGTMV                  X                               28568021
         XC    XSUTMP(LX12),XSUTMP                                      28576021
         NI    XSUTMP+NX12,XX0F                                         28584021
         CVB   XR3,XSUTMP+NX8                                           28592021
       O     XR3,XSUMK1                 SET SWITCH INDICATING NUMER     28600021
*                                       SUBCRIPT.                       28608021
       SPACE 2                                                          28616021
XGET02 ST    XR3,XSSKK(XR2)             STORE IN WORK-AREA.             28624021
       LA    XR6,OPSIZ(XR6)             GET NEXT SUBCRIPT IF ANY LE     28632021
       SH    XR2,XC004                  X                               28640021
       BC    XGTEQ,XGET01               X                               28648021
       SPACE 2                                                          28656021
*        PICK-UP  I,D,K OF SUBSCRIPTED DATA-NAME AND LENGHTS OF HIG     28664021
*        SUBCRIPTED LEVEL.                                              28672021
*                                                                       28680021
         LA    XR3,DOP1                                                 28688021
       SR    XR2,XR2                                                    28696021
         IC    XR2,DX1(XR3)                                             28704021
       BCTR  XR2,XR0               SUBTRACT 1 FROM REG2                 28712021
       AR    XR2,XR3                                                    28720021
         MVC   XSOIDK+NX1(LX3),DX0(XR2)  MOVE DICT PTR                  28728021
       CLI   DOP2,INDXNM                                                28736021
       BE    XGET10               DONT NEED LENGTHS FOR INDEX NAMES     28744021
       IC    XR2,XGMINC(XR3)                                            28752021
         SLL   XR2,DX28                  PICK-UP MBS AND O FIELD.       28760021
         SRL   XR2,DX29                  X                              28768021
         STC   XR2,XSUTMP+NX15           SAVE IT                        28776021
         SRL   XR2,DX1                   XR2 HAS NUMBER OF SUBSCRIPT    28784021
*                                       REQUIRED                        28792021
         TM    XSUTMP+NX15,XX01                                         28800021
       BC    XZERO,XGET03               O NOT ON.                       28808021
*                                       ARE AT THE END OF ATTRIBUTE     28816021
       BAL   XRSUB,XLENGH               GET LENGHT OF SUB ELEMENT.      28824021
         CLC   XOPLGH(LX4),XC000         IS IT A FIXED LENGHT.          28832021
       BC    XZERO,XGET04               NO,                             28840021
         MVC   XSL1(LX4),XOPLGH    YES, SAVE IT IN WORK-AREA      44300 28848021
       BC    UNCON,XGET05          FOR FIXED LEN SKIP NXT 2 INSTRUC     28856021
XGET04   NI    XOPMOD,XX7F                                              28864021
         MVC   XSVLC1(LX2),XOPVLC        MOVE VARIABLE LENGHT.          28872021
XGET05 BCTR  XR2,RW0                      IS THERE MORE THAN ONE SU     28880021
       LTR   XR2,XR2                                                    28888021
       BC    XZERO,XGET10               NO                              28896021
       BC    UNCON,XGET09               YES,PICK-UP OTHER ONE.          28904021
XGET03 BCTR  XR2,RW0                      SET XR2 TO BE THE DISPLAC     28912021
XGET09   DS    0H                                                 44300 28920021
         SLL   XR2,DX2                    INTO LENGTH TABLE       44300 28928021
       SR    XR6,XR6                    SET XR3 TO POINT TO LENGHT      28936021
       IC    XR6,XGNBYT(XR3)            INPUT STRING.                   28944021
       BCTR  XR6,RW0                      X                             28952021
         TM    DX7(XR3),XX02             Q BIT ON                       28960021
       BC    XZERO,XGETGG          NO,SKIP NXT INSTRUC                  28968021
       SH    XR6,XC003                                                  28976021
XGETGG EQU   *                                                          28984021
       AR    XR3,XR6                    X                               28992021
XGET08 SH    XR3,XC003                  X                               29000021
         MVI   XSUTMP+NX4,XX00                                    44300 29008021
         MVC   XSUTMP+NX5(LX3),DX0(XR3)   MOVE LENGHT TO WORD BOUNDAR   29016021
         L     XR6,XSUTMP+NX4                                     44300 29024021
         TM    XSUTMP+NX5,XX80           IS IT A  VLC                   29032021
       BC    XTHRE,XGET06               YES                             29040021
         ST    XR6,XSL1(XR2)       NO, SAVE IT IN LENGTH TABLE    44300 29048021
       BC    UNCON,XGET07          FOR FXD LEN SKIP NXT 2 INSTRUC       29056021
XGET06   NI    XOPMOD,XX7F                                              29064021
         SRL   XR2,DX1                                            44300 29072021
       STH   XR6,XSVLC1(XR2)            MOVE VLC.                       29080021
         SLL   XR2,DX1                                            44300 29088021
XGET07   DS    0H                                                 44300 29096021
         SH    XR2,XC004           GET READY TO PICK UP NEXT LEN  44300 29104021
       BC    XTWO,XGET08           IF DISP LT 2, BRANCH TO SAVE         29112021
         TM    XSUTMP+NX15,XX01          IS LAST LENGHT ALREADY IN (    29120021
       BC    XTHRE,XGET10               FLAG ON).  YES -                29128021
       LTR   XR2,XR2                    NO                              29136021
       BC    XZERO,XGET08               GET LAST LENGHT.                29144021
       SPACE 2                                                          29152021
XGET10 EQU   *                                                          29160021
         CLI   SCHSW,XX01          SSCRPT ENTERED FROM SEARCHAL...      29168021
       BE    XSCOMP               YES,DONT ENTER INTO XSCRPT TBL        29176021
         CLC   IXLIT1(LX6),XC000   INDEX + OR - LITERAL...              29184021
       BE    XSN05                NO                                    29192021
         LA    RW0,DX12            IF INDEXING WITH LITERALS,XSCRPT     29200021
         MVC   XSSUBN(LX2),XC012   TBL ENTRY DOES NOT INCLUDE DICT      29208021
       B     XSN04                PTRS TO INDEX NAMES AS THERE          29216021
* MUST NEVER BE A MATCH FOR THIS COMPUTATION                            29224021
XSN05  L     XR1,XASCRP                                                 29232021
*DEL                                                               4430 29240021
       BAL   XRSUB,XTBDEB               GET ADDRESS OF FIRST BYTE O     29248021
       LR    XRVAR,RW0                                                  29256021
*                                       TABLE IN XR2,AND DISPLT. IN     29264021
       LR    XR0,XR2                                                    29272021
       AR    XR0,XR3                    XR3 HAS ADDRESS OF END OF T     29280021
       LR    XR5,XR2                                                    29288021
       BC    UNCON,XSN02           CHK FOR NEW SSCRIPT COMBINATION      29296021
       SPACE 2                                                          29304021
XSN03    LH    XR6,DX0(XR5)              XR6 HAS TOTAL LENGHT OF THI    29312021
       CH    XR6,XSSUBN                 ENTRY -IS IT THE SAME  AS T     29320021
       BC    XNOEQ,XSN01                ONE IN WORK AREA. -NO           29328021
       LR    XR4,XR6                    YES -NOW ARE ALL I,D,K FIEL     29336021
       SH    XR4,XC009                  MATCHING                        29344021
       EX    XR4,XSNCLC                COMPARE                          29352021
       BC    XNOEQ,XSN01                NO-                             29360021
       SR    XR5,XR2                    GET DISPL. OF THIS ENTRY.       29368021
       AH    XR5,XC004                  YES IT IS NOT A NEW  SUBSCR     29376021
       STH   XR5,XSNPT                  COMBINATION.                    29384021
       AH    XR5,XC004                  SET POINTERS TO THIS TAMER      29392021
       STH   XR5,XSOPT                  ENTRY.                          29400021
XGETXT L     RW1,XASNT                                                  29408021
       L     XRVAR,XINST                                                29416021
       BALR  RETRG,XRVAR           BR TO INSERT ROUTINE IN TAMER        29424021
         MVC   DX0(LX4,XR2),XSIDNB                                      29432021
       BC    UNCON,PH5CTL          GET NXT P2 TXT                       29440021
       SPACE 2                                                          29448021
XSN01  AR    XR5,XR6                    GET NEXT ENTRY IN TAMER IF      29456021
XSN02  CR    XR5,XR0                    ANY LEFT AND TRY MATCHING C     29464021
       BC    XONE,XSN03                 ARISON AGAIN.                   29472021
       LR    RW0,XRVAR                                                  29480021
       SPACE 2                                                          29488021
*                                       NO ASK A NEW ENTRY IN TAMER     29496021
XSN04  L     XR1,XASCRP           XR0 HAS ENTRY LENGTH                  29504021
       L     XRVAR,XINST                   X                            29512021
       BALR  RETRG,XRVAR           BR TO INSERT RTN IN TAMER            29520021
*                                       AND SET POINTER TO SOME OF      29528021
       AH    XR3,XC004                  ELEMENT OF THIS ENTRY.          29536021
       STH   XR3,XSNPT                  X  POINTER TO OLD IDK           29544021
       AH    XR3,XC004                  X                               29552021
       STH   XR3,XSOPT                  X                               29560021
       BC    UNCON,XSCOMP          UPDATE IDK FIELD OF SSCRIPT DNM      29568021
*                                                                       29576021
*                                                                       29584021
XGET00   NI    XOPMOD,XX7F               RESET SWITCH-ALLSUBS ARE LI    29592021
         MVI   XSUTMP,XX00               PICK -UP I,D,K OF DATA-NAME    29600021
       SR    XR3,XR3                                                    29608021
         IC    XR3,DX1(XR6)                                             29616021
       BCTR  XR3,XR0               SUBTRACT 1 FROM REG3                 29624021
XGET11 AR    XR3,XR6                                                    29632021
         MVC   XSUTMP+NX1(LX3),DX0(XR3)  MOVE DICT PTR                  29640021
       L     XR3,XSUTMP                 X                               29648021
       BC    UNCON,XGET02          GET NXT SSCRIPT                      29656021
* INDEX-NAME                                                            29664021
IX000    CLI   DX1(XR6),XGINFP     IS IT INDEX + OR - A LITERAL...      29672021
       BNE   XGET00               NO, PICK UP DICT PTR                  29680021
         NI    XOPMOD,XX7F         ALL SS OR INDX ARE NOT LITERALS      29688021
         MVI   INDXSW,XX01                                              29696021
         LH    XR3,DX10(XR6)                                            29704021
       LR    XR4,XR2              SET XR4 AS INDEX INTO LENGTH TBL      29712021
         SRL   XR4,DX1             AND LITERAL TBL                      29720021
       STH   XR3,IXLIT1(XR4)                                            29728021
         XC    XSUTMP+NX12(LX4),XSUTMP+NX12  CLEAR WORK AREA      44300 29736021
         MVC   XSUTMP+NX14(LX2),DX5(XR6)   PICK UP LENGTH OR VLC  44300 29744021
         L     XR5,XSUTMP+NX12                                    44300 29752021
         LA    XR3,DX7                                            44300 29760021
         TM    DX2(XR6),XX80       VARIABLE LENGTH SUBJECT        44300 29768021
         BO    IX001               YES                            44300 29776021
         ST    XR5,XSL1(XR2)       NO, SET LENGTH                 44300 29784021
         B     XGET11              GET DICT PTR                   44300 29792021
IX001    DS    0H                                                 44300 29800021
         STH   XR5,XSVLC1(XR4)     SET VLC                        44300 29808021
         B     XGET11              GET DICT PTR                   44300 29816021
       SPACE 2                                                          29824021
*                                                                       29832021
*      LOGIC ERROR NUMBER 2.                                            29840021
*                                                                       29848021
XGETLG BAL   XRSUB,ERRPRO          WRITE ERROR TXT                      29856021
       DC    AL1(ERRN02)                                                29864021
       DC    AL1(8)                                                     29872021
       DS    0H                                                         29880021
XGTMV    ZAP   XSUTMP(LX16),XGLITV(LX0,XR6)                             29888021
*                                                                       29896021
       DS    0H                                                         29904021
XSNCLC   CLC   DX8(LX0,XR5),XSSUBN+NX8    COMPARE                       29912021
       SPACE 10                                                         29920021
       SPACE 10                                                         29928021
*      XSCOMP   - GENERATES INSTRUCTIONS DUE TO SUBSCRIPTING OF A       29936021
*               - DATA-NAME,AND UPDATE I,D,K FIELD OF THE SUBSCRIPT     29944021
*               - DATA-NAME.                                            29952021
       SPACE 5                                                          29960021
XSCOMP EQU   *                                                          29968021
       TM    XOPMOD,XALLSN              ARE ALL SUBSCRIPT LITERAL.      29976021
       BC    XZERO,XSC001               NO,-                            29984021
         LH    XR6,XSSUBN+NX2            YES- PICK-UP SUBS.COUNT.       29992021
       BCTR  XR6,RW0               SUBTRACT 1 FROM REG6                 30000021
         SLL   XR6,DX2                                            44300 30008021
*DEL                                                               4430 30016021
*DEL                                                               4430 30024021
       SR    XR1,XR1                                                    30032021
*             ALL SUBSCRIPT ARE NUMERIC AND LENGHTS ARE CONSTANT.       30040021
XSC002 L     XR3,XSSKK(XR6)             COMPUTE                         30048021
         LA    XR3,DX0(XR3)       (K*L1)+(J*L2)+(I*L3)-(L1+L2+L3) 44300 30056021
         M     XR2,XSL1(XR6)                                      44300 30064021
       AR    XR1,XR3                    X                               30072021
*DEL                                                               4430 30080021
       SH    XR6,XC004                  X                               30088021
       BC   XGTEQ,XSC002                X                               30096021
         L     XR3,XSL1                                           44300 30104021
         A     XR3,XSL2                                           44300 30112021
         A     XR3,XSL3                                           44300 30120021
       SR    XR1,XR3                    X                               30128021
         BNM   XSC004         SUBSCRIPT NOT INVALID               51877 30136021
         SR    XR1,XR1        SUBSCRIPT INVALID - USE 1ST OCCUR   51877 30144021
XSC004   DS    0H                                                 51877 30152021
       SR    XR3,XR3                    X                               30160021
         MVI   XSUTMP,XX00                                              30168021
         MVC   XSUTMP+NX1(LX3),DOP1+NX4  MOVE I,D,K FROM INPUT STRING   30176021
       L     XR2,XSUTMP                                                 30184021
         SRDL  XR2,DX8                                                  30192021
         SLL   XR2,DX20                                                 30200021
         SRL   XR2,DX20                  XR2 HAS  D FIELD               30208021
         SRL   XR3,DX24                  XR3 HAS BASE LOCATOR NUMBER    30216021
       AR    XR2,XR1                    ADD DISPLACT. DUE TO SUBSCR     30224021
XSC00P EQU   *                                                          30232021
       CH    XR2,XC4095                 -IS IT TOO LARGE                30240021
       BC    XTWO,XSC003                YES                             30248021
       SPACE 2                                                          30256021
         SLL   XR2,DX8             NO, SET NEW DISP IN NEW              30264021
       OR    XR2,XR3                    I,D,K FIELD.                    30272021
       L     XR4,XSUTMP                                                 30280021
       N     XR4,XSUMK3                 X                               30288021
       OR    XR2,XR4                    X                               30296021
       ST    XR2,XSNIDK                 X                               30304021
       B     XSC014                MOVE NEW ENTRY TO TAMER TBL          30312021
XINEXT L     XRVERB,SCHOLD        RESTORE BASE OF SEARCHAL RTNE         30320021
       L     RETRG,SCHLD2                                               30328021
       BR    RETRG                RETURN TO SEARCHAL                    30336021
       SPACE 2                                                          30344021
XSCOEX EQU   XGETXT                                                     30352021
*                                                                       30360021
       SPACE 2                                                          30368021
XSC003   LA    XR3,DX1(XR3)              DISPL.WAS TOO LARGE- TAKE N    30376021
       SH    XR2,XC4096                 BASE  LOCATOR.                  30384021
       BC    UNCON,XSC00P          CHK DISP,IF TOO LARGE,REPEAT         30392021
       SPACE 2                                                          30400021
*              GENERATE CODES FOR A NON ALL LITERAL SUBSCRIPT COMBI     30408021
XSC001   CLI   SCHSW,XX01                                               30416021
       BNE   SCH0A1                IF NOT FROM SRCHALL,GET REGNO        30424021
       LA    XR1,XC000            DUMMY REG TBL ENTRY FOR R0            30432021
       B     SCHAA1               REG=R0                                30440021
SCH0A1 BAL   XRSUB,XRSUAS         ASK A REGISTER                        30448021
       L     XR1,XLIRP                  REG.NUMBER WILL BE IN 3(XR1     30456021
         MVC   DX0(LX2,XR1),XSNPT                                       30464021
         OI    DX2(XR1),XRFSUB                                          30472021
         OI    DX2(XR1),XSUBAC                                          30480021
         MVC   XREG1(LX1),DX3(XR1)                                      30488021
SCHAA1 EQU   *                                                          30496021
         ST    XR1,SAVER1                                         44300 30504021
         MVC   XOP1(LX4),XAOPE1          GENERATE    LA  REG,DATA-NA    30512021
       BAL   XRSUB,LA                   X                               30520021
       CLI   DOP2,INDXNM          IS IT AN INDEX-NAME...                30528021
       BE    XSCI00               YES                                   30536021
         L     XR0,XSL1           NO, COMPUTE L1+L2+L3            44300 30544021
         A     XR0,XSL2                                           44300 30552021
         A     XR0,XSL3                                           44300 30560021
         ST    XR0,SAVER0                                         44300 30568021
       SPACE 2                                                          30576021
         BAL   XRSUB,XRSUAS          ASK REGA. REG NO IN XREGNO         30584021
         LH    XR2,XSSUBN+NX2      XR2 HAS NUMB OF SUBSCRIPTS           30592021
       BCTR  XR2,RW0               SUBTRACT 1 FROM REG2                 30600021
         SLL   XR2,DX2                   INITIALIZE LOOP FOR CODES G    30608021
       L     XR5,XAOPE2(XR2)            RATION.                         30616021
       LA    XR3,XSSKK                                                  30624021
       LA    XR4,XSL1                                                   30632021
         LA    XR6,XSVLC1                                         44300 30640021
XSC009   TM    DX0(XR3),XX80             IS IT A LITERAL SUBS           30648021
       BC    XZERO,XSC006               NO-                             30656021
         CLC   DX0(LX2,XR6),XC000       YES, IS IT FIXED LENGTH   44300 30664021
       BC    XNOEQ,XSC007               NO-                             30672021
         L     XR1,DX0(XR3)        YES, COMPUTE AT COMPILE TIME   44300 30680021
         LA    XR1,DX0(XR1)                                       44300 30688021
         M     XR0,DX0(XR4)                SS*L                   44300 30696021
         L     XR0,SAVER0                                         44300 30704021
         SR    XR0,XR1                  SUBTRACT FROM L1+L2+L3    44300 30712021
         ST    XR0,SAVER0                                         44300 30720021
         B     XSC008                   SKIP TO NEXT SS           44300 30728021
       SPACE 2                                                          30736021
XSC007   MVC   XCON1+NX13(LX3),DX1(XR3)   GENERATE  LITERAL SUBS * VL   30744021
         MVI   XCON1+NX16,XX04           X                              30752021
         MVC   XREG1(LX1),XREGNO   L   REGA,LITERAL                     30760021
       BAL   XRSUB,L                    X    MH   REGA,VLC              30768021
XSCSVT   MVC   XREG1(LX1),XREGNO                                        30776021
*DEL                                                               4430 30784021
       BAL   XRSUB,BRNCNT          GEN ATXT FOR BCTR INSTRUC            30792021
XSC016   MVI   XCNTR1,XX04         SET CODE FOR VLC REFERENCE           30800021
         MVC   XCNTR1+NX1(LX2),DX0(XR6)                           44300 30808021
XSC011   MVC   XREG1(LX1),XREGNO         X                              30816021
       BAL   XRSUB,MH                   X                               30824021
         L     XR1,SAVER1                                         44300 30832021
         MVC   XREG1(LX1),DX3(XR1)        ADD IT TO ADDRESS OF DATA-N   30840021
         MVC   XREG2(LX1),XREGNO                                        30848021
       BAL   XRSUB,AR                            AR  REG,REGA.          30856021
         CLI   INDXSW,XX01         IS IT AN INDEX COMPUTATION...        30864021
       BE    XSCI03               YES                                   30872021
       BC    UNCON,XSC008          GET DISP FOR NXT SSCRIPT,IF LEFT     30880021
       SPACE 2                                                          30888021
* NON LITERAL SUBSCRIPT                                                 30896021
XSC006   BAL   XRSUB,XZX3X5        IF SUBSCRIPT IS ED OR ID             30904021
       BAL   XRSUB,XLENGH               CONVERT IT  TO                  30912021
         BAL   XRSUB,XZX3X5             BINARY FIRST                    30920021
       ST    XR5,XOP1                   X                               30928021
       CLI   XGTEM2,XGEXDC              X                               30936021
       BC    XZERO,XSCZAP               X                               30944021
       CLI   XGTEM2,XGINDC              X                               30952021
       BC    XNOEQ,XSCSUT               X                               30960021
XSCZAP   MVI   XELEN+NX1,XX08            X                              30968021
       BAL   XRSUB,XTAMPO               X                               30976021
         MVC   XWC1(LX2),XEREL1          X                              30984021
         MVI   XL1+NX1,XX08              X                              30992021
         MVC   XL2(LX2),XOPLGH+NX2        X                             31000021
         LH    XR0,XL2                                            44300 31008021
       CLI   XGTEM2,XGEXDC              X                               31016021
       BC    XZERO,XSCEXD               X                               31024021
         SH    XR0,XC004                                          44300 31032021
       BC    XNOGT,XSCSAT          IF LEN NOT GT 4,SKIP NXT 2 INST      31040021
         STC   XR0,XPLUS2+NX2                                     44300 31048021
         MVI   XL2+NX1,XX04                                             31056021
XSCSAT EQU   *                                                          31064021
       BAL   XRSUB,ZAP                  X                               31072021
XSCCVB EQU   *                                                          31080021
         MVC   XREG1(LX1),XREGNO                                        31088021
         MVC   XWC1(LX2),XEREL1          X                              31096021
       BAL   XRSUB,CVB                  X                               31104021
       BAL   XRSUB,XERELS               X                               31112021
         CLC   DX0(LX2,XR6),XC000       FIXED LENGTH              44300 31120021
       BC    XNOEQ,XSCSVT               X                               31128021
       BC    UNCON,XSCSWT               X                               31136021
XSCEXD   DS    0H                                                 44300 31144021
         SH    XR0,XC006                                          44300 31152021
       BC    XNOGT,XSCEXP          IF NOT GT 6,SKIP NXT 2 INSTRUC       31160021
         STC   XR0,XPLUS2+NX2                                     44300 31168021
         MVI   XL2+NX1,XX06                                             31176021
XSCEXP BAL   XRSUB,PACK            GEN ATXT FOR PACK INSTRUC            31184021
       BC    UNCON,XSCCVB               X                               31192021
XSCSUT   CLI   XBDBY+NX1,XX04                                           31200021
       BC    XNOGT,XSCSBT          GEN ATXT FOR L AND MH INSTRUCS       31208021
         MVI   XPLUS1+NX2,XX04          L  REGA,DNSUBS                  31216021
XSCSBT EQU   *               OR  L      REGA,DNSUBS+4                   31224021
         MVC   XREG1(LX1),XREGNO                MH  REGA,L              31232021
       BAL   XRSUB,L                       OR  MH  REGA,VLC             31240021
         CLC   DX0(LX2,XR6),XC000       FIXED LENGTH              44300 31248021
       BC    XNOEQ,XSCSVT          GEN ATXT FOR COMPUT OF SSCRIPT       31256021
XSCSWT   DS    0H                                                 44300 31264021
         MVC   XCON1+NX12(LX4),DX0(XR4)                           44300 31272021
         MVI   XCON1+NX16,XX02           AND    AR REG,REGA             31280021
       BC    UNCON,XSC011          GEN ATXT FOR MH AND AR INSTRUCS      31288021
       SPACE 2                                                          31296021
XSC008   LA    XR3,DX4(XR3)              GET DISPLACT. DUE TO NEXT      31304021
         CLC   DX0(LX4,XR3),XC000              SUBSCRIPT  IF ANY LEFT   31312021
       BC    XZERO,XSC012               X                               31320021
         LA    XR4,DX4(XR4)                                       44300 31328021
         LA    XR6,DX2(XR6)                                       44300 31336021
       SH    XR2,XC004                  X                               31344021
       L     XR5,XAOPE2(XR2)            X                               31352021
       BC    UNCON,XSC009               X                               31360021
       SPACE 2                                                          31368021
XSC012   DS    0H                                                 44300 31376021
         L     XR0,SAVER0                                         44300 31384021
         L     XR1,SAVER1                                         44300 31392021
         LTR   XR0,XR0                                            44300 31400021
       BC    XZERO,XSC015          UPDATE FLAG IN REG CNTRL TBL         31408021
         ST    XR0,XCON1+NX12                                           31416021
         MVI   XCON1+NX16,XX04                       S  REG,CONSTANT    31424021
         MVC   XREG1(LX1),DX3(XR1)                                      31432021
       BAL   XRSUB,SUB             GEN ATXT FOR SUBTRACT INSTRUC        31440021
XSC015 EQU   *                                                          31448021
*         UPDATE  FLAG IN REGISTER CONTROL TABLE                        31456021
         MVI   XSNIDK,XX00                                              31464021
         OC    XSNIDK+NX1(LX3),DOP1+NX4  MOVE I,D,K FROM INPUT STRING   31472021
       NC    XSNIDK,XSUMK4              X                               31480021
         L     XR1,SAVER1                                         44300 31488021
         OC    XSNIDK+NX2(LX1),DX3(XR1)   X                             31496021
         OI    XSNIDK+NX1,XRRRFL         X                              31504021
         XI    DX2(XR1),XSUBAC                                          31512021
XSC014 EQU   *                                                          31520021
       L     XR1,XASCRP                 MOVE NEW ENTRY IN TAMER TAB     31528021
       BAL   XRSUB,XTBDEB               X                               31536021
       AR    XR2,XR3                                                    31544021
       LH    XR5,XSSUBN                 X                               31552021
       SR    XR2,XR5                                                    31560021
       BCTR  XR5,RW0                      X                             31568021
       EX    XR5,XTAMOV                 X                               31576021
       BC    UNCON,XSCOEX               EXIT.                           31584021
* INDEX-NAME COMPUTATION                                                31592021
* ADDRESS OF DATA-NAME PLUS INDEX1 + INDEX2 + INDEX3 PLUS               31600021
*                  (LIT1*L1) + (LIT2*L2) + (LIT3*L3)                    31608021
XSCI00 LA    XR6,DOP2                                                   31616021
         LH    XR5,XSSUBN+NX2      PICK UP COUNT OF INDEX-NAMES         31624021
         CLI   SCHSW,XX01          ENTERED FROM SEARCHAL...             31632021
       BNE   XSCI01               NO                                    31640021
       BCTR  XR5,XR0              YES, DONT USE LAST INDEX              31648021
XSCI01   MVC   XREG1(LX1),DX3(XR1)  GEN... ADD REGA,INDEX-NAME          31656021
       ST    XR6,OP1                                                    31664021
       BAL   XRSUB,ADD             GEN ATXT FOR ADD INSTRUC             31672021
       LA    XR6,OPSIZ(XR6)                                             31680021
       BCT   XR5,XSCI01            GEN ATXT FOR A TO NXT INDX           31688021
         CLC   IXLIT1(LX6),XC000   ANY LITERALS TO BE ADDED...          31696021
       BNE   XSCI04               YES, GENERATE CODE                    31704021
         CLI   SCHSW,XX01          ENTERED FROM SEARCH ALL...           31712021
       BE    XINEXT               YES, RETURN TO IT                     31720021
       B     XSC015               MAKE TABLE ENTRY                      31728021
XSCI04 EQU   *                                                          31736021
       BAL   XRSUB,XRSUAS         ASK REGA (NUMB IN XREGNO)             31744021
         LH    XR5,XSSUBN+NX2      SET XR5 AS INDEX TO LENGTH AND       31752021
       BCTR XR5,XR0               LITERAL TABLES                        31760021
         SLL   XR5,DX2                                            44300 31768021
       LA    XR4,XSL1                                                   31776021
       AR    XR4,XR5                                                    31784021
       SR    XR2,XR2                                                    31792021
       LA    XR3,IXLIT1                                                 31800021
         SRL   XR5,DX1                                            44300 31808021
       AR    XR3,XR5                                                    31816021
         LA    XR6,XSVLC1                                         44300 31824021
         AR    XR6,XR5                                            44300 31832021
XSCI02   CLC   DX0(LX2,XR3),XC000   LITERAL TO BE ADDED AT THIS LEVEL   31840021
       BE    XSCI03               NO                                    31848021
         CLC   DX0(LX2,XR6),XC000  YES, IS IT FIXED LENGTH        44300 31856021
       BE    XSCI05               YES, ADD IT LATER                     31864021
         MVC   XREG1(LX1),XREGNO         GEN  LH REGA,LITERAL           31872021
         MVC   XCON1+NX14(LX2),DX0(XR3)     MH REGA,VLC                 31880021
         MVI   XCON1+NX16,XX02                AR REG,REGA               31888021
       BAL   XRSUB,LH              GEN ATXT FOR LH INSTRUC              31896021
       B     XSC016               GENERATE INSTRUCTIONS                 31904021
XSCI05   DS    0H                                                 44300 31912021
         LH    XR1,DX0(XR3)        COMPUTE LITERAL*LENGTH         44300 31920021
         M     XR0,DX0(XR4)                                       44300 31928021
         AR    XR2,XR1             ADD TO PREVIOUS CALCULATION    44300 31936021
XSCI03   DS    0H                                                 44300 31944021
         SH    XR4,XC004                                          44300 31952021
         SH    XR6,XC002                                          44300 31960021
       SH    XR3,XC002                                                  31968021
       SH    XR5,XC002            ANY MORE LITERALS TO BE ADDED...      31976021
       BC    XGTEQ,XSCI02         YES                                   31984021
       CH    XR2,XC000            ANY LIT * LNGTH TO BE ADDED...        31992021
       BE    XSCI06               NO                                    32000021
         ST    XR2,XCON1+NX12                                           32008021
         MVI   XCON1+NX16,XX04     (LITERAL = SUM OF ALL LITERAL *      32016021
         L     XR1,SAVER1                                         44300 32024021
         MVC   XREG1(LX1),DX3(XR1)    LENGTH CALCULATIONS)              32032021
       BAL   XRSUB,ADD            * ADD REG,LITERAL                     32040021
XSCI06 EQU   *                                                          32048021
         MVI   INDXSW,XX00                                              32056021
       B     XSC015                UPDATE FLAG IN REG CNTRL TBL         32064021
       DS    0H                                                         32072021
XTAMOV   MVC   DX0(LX0,XR2),XSSUBN        MOVE ENTRY IN TAMER.          32080021
         TITLE 'MULTIPLY VERB ANALYZER  M  U  L  T  I  P  L  Y'         32088021
*      XOTMUL  -  MULTIPLY ANALYZER.                                    32096021
*                                                                       32104021
*                                                                       32112021
       SPACE 5                                                          32120021
       USING *,XRVERB                                                   32128021
XOTMUL BAL   XRSUB,XOTSEL          GET OPERAND INFO INTO BUFFERS        32136021
XOTM00 TM    XOPMOD,XFLOAT              IS IT FLOATING MODE.            32144021
       BC    XTHRE,XOTM01               YES.                            32152021
*                                                                       32160021
       OI    XOPMOD,XMULFL      BINARY-MODE.                            32168021
       BAL   XRSUB,XCTMUL          COMPILE TIME MULTIPLICATION          32176021
       BAL   XRSUB,XHSMD1          SET MODE ROUTINE                     32184021
       TM    XGSWT,XIDMOD               IS IT ID.                       32192021
       BC    XTHRE,XOTM02               YES                             32200021
       BAL   XRSUB,XBISCL               CONVERT,AND SCALE (SCALING      32208021
*                                       FOR P PICTURE  999PP .).        32216021
       BAL   XRSUB,XZBMP                GENERATE  INSTRUCTIONS FOR      32224021
*                                                  MULTIPLY.            32232021
         NI    XFIRX+NX1,XX2F                                           32240021
XOTM08 TM    XGNSW,XDIVON                                               32248021
       BC    XZERO,XOTM09          NOT A NEG EXPONENT                   32256021
       XI    XOPMOD,XMULFL                                              32264021
       XI    XGNSW,XDIVON                                               32272021
       BC    UNCON,XOTE40          GO TO EXPONENT VERB ANALYZER         32280021
XOTM09 EQU   XFINAL                                                     32288021
*                                                                       32296021
       SPACE 2                                                          32304021
*                               ID-MODE.                                32312021
XOTM02 BAL   XRSUB,XW000           SCALE OPERANDS                       32320021
         TM    XFIRX+NX1,XGOVFL                                         32328021
       BC    XTHRE,XOTM03               DP MULTIPLICATION.              32336021
*                                                                       32344021
       BAL   XRSUB,XXMPL                GENERATE  MP OP1,OP2.           32352021
       BC    UNCON,XOTM08          CHECK FOR NEG EXPONENT               32360021
       SPACE 2                                                          32368021
XOTM03 EQU   *                          DP MULTIPLY CALL.               32376021
         MVI   BDISP1+NX1,WORKA                                         32384021
       BAL   XRSUB,XDPZAP          GENERATE ZAP                         32392021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      32400021
         MVI   BDISP1+NX1,WORKB                                         32408021
       BAL   XRSUB,XDPZAP          GENERATE ZAP                         32416021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      32424021
       DC    C'XMU0'                                                    32432021
       LH    XR0,XFDDP                                                  32440021
*                                                                       32448021
       CH    XR0,XC000                                                  32456021
       BC    XZERO,XDP101          NO DECIMALS NEED BE DROPPED          32464021
         TM    XFDDP+NX1,XX01                                           32472021
       BC    XZERO,XDP100          NUMBER OF DECIMALS EVEN              32480021
       AH    XR0,XC001                                                  32488021
XDP100   SRA   XR0,DX1                                                  32496021
         MVI   XPLUS1+NX2,XX10                                          32504021
         MVI   XPLUS2+NX2,XX10                                          32512021
         LA    XR1,DX16                                                 32520021
       SR    XR1,XR0                                                    32528021
       STH   XR1,XL2                                                    32536021
       BAL   XRSUB,XBDSET          SET A-TEXT                           32544021
       BAL   XRSUB,MVO             GENERATE MVO                         32552021
         STC   XR0,XPLUS1+NX2                                           32560021
       BAL   XRSUB,XBDSET          SET A-TEXT                           32568021
         MVI   XL2+NX1,XX10                                             32576021
       BAL   XRSUB,MVO             GENERATE MVO                         32584021
         TM    XFDDP+NX1,XX01                                           32592021
       BC    XTHRE,XDP101          NUMBER OF DECIMALS ODD               32600021
       BAL   XRSUB,XBDSET          SET A-TEXT                           32608021
         MVI   XPLUS1+NX2,XX10                                          32616021
         MVI   XPLUS2+NX2,XX10                                          32624021
         MVI   XL2+NX1,XX0F                                             32632021
       BAL   XRSUB,MVO             GENERATE MVO                         32640021
*                                                                       32648021
*      WARNING- POSSIBLE TRUNCATION.                                    32656021
*      ERROR NUMBER 11.                                                 32664021
*                                                                       32672021
XDP103 BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               32680021
       DC    AL1(ERRN11)                                                32688021
       DC    AL1(0)                                                     32696021
       LA    XR1,WORKF                                                  32704021
       BAL   XR2,XZPDPR            GENERATE ZAP INTO TEMP STOR          32712021
       BC    UNCON,XOTM08          CHECK FOR NEG EXPONENT               32720021
**                                                                      32728021
**                                                                      32736021
*                                                                       32744021
*                                                                       32752021
*  FLOATING POINT MULTIPLY.                                             32760021
*                                                                       32768021
XOTM01 BAL   XRSUB,FPCVBG               CONVERT TO IFP ANY OPERAND      32776021
       BAL   XRSUB,FPLDAN               AS NEEDED - LOAD OP1 IN REG     32784021
       BAL   XRSUB,FPSETA               SET A-TEXT                      32792021
       LA    XRSUB,XOTM05                                               32800021
         TM    Y1IRX+NX1(XR3),XGDPFP                                    32808021
       BC    XTHRE,MULTFL               MD   OR  MDR .                  32816021
       BC    UNCON,MULTS                ME   OR  MER .                  32824021
XOTM05 BAL   XRSUB,FPRESF          SET FLAGS IN RESULT BUFFER           32832021
         OI    XFIRX+NX1,XX05            XG2IRX+XGDPFP.                 32840021
       BC    UNCON,XOTM08          CHECK FOR NEG EXPONENT               32848021
       SPACE 2                                                          32856021
*                                                                       32864021
XDP101   MVI   XIMM,XX0F                                                32872021
         MVI   BDISP1,XXD0                                              32880021
         MVI   BDISP1+NX1,WORKF                                         32888021
         MVI   XPLUS1+NX2,XX10                                          32896021
       BAL   XRSUB,NI              GENERATE NI                          32904021
       BC    UNCON,XDP103          GENERATE ERROR MESSAGE               32912021
       SPACE 5                                                          32920021
*      XCTMUL   . COMPILE TIME ARITHMETIC FOR MULTIPLICATION.           32928021
*                                                                       32936021
*                                                                       32944021
       SPACE 5                                                          32952021
XCTMUL   STM   XR0,XR15,XGSAV1                                          32960021
       SPACE 2                                                          32968021
       LA    XR5,XVAL1                                                  32976021
         LA    XR1,DX2                   TAKE CARE OF SCALING DUE       32984021
XCTM01 BAL   XRSUB,XSCAL                TO PICTURE CONTAINING INTEG     32992021
         MVC   Y1DAS(LX2,XR5),Y1DBS(XR5)   P'S  -----  999PPP           33000021
       LA    XR5,XVAL2                                                  33008021
       BCT   XR1,XCTM01            LOOP TWICE SCALING BOTH OPERANDS     33016021
       LA    XR3,XVAL1                                                  33024021
       LH    XR4,Y1DAS(XR3)             PRODUCT.                        33032021
       AH    XR4,Y1DAS(XR5)             X                               33040021
       STH   XR4,XFDAS                  X                               33048021
       LH    XR2,Y1FAS(XR3)             MAX. NUMBER OF DIGIT OF         33056021
       AH    XR2,Y1FAS(XR5)             PRODUCT IS                      33064021
       CH    XR2,XC030                  GREATER THAN 30 -               33072021
       BC    XTWO,XCTM03                X                               33080021
       BC    XZERO,XCTM10          PRODUCT IS 30 DIGITS                 33088021
       CH    XR4,XC030                                                  33096021
       BC    XTWO,XCTM03           PRODUCT HAS MORE THAN 30 DECS        33104021
XCTM13   CLI   Y1FAS+NX1(XR5),XX0F                                      33112021
       BC    XTWO,XCTM04                PERFORM COMPILE TIME            33120021
XCTM06   ZAP   XFVAL(LX16),DX0(LX16,XR3) MULTIPLICATION                 33128021
       LH    XR6,Y1LAS(XR5)                                             33136021
       AH    XR5,XC016                                                  33144021
       SR    XR5,XR6                                                    33152021
       BCTR  XR6,RW0               SUBTRACT ONE FOR EX INSTRUCTION      33160021
       EX    XR6,XCTMP                 RESTORE REGS FOR EXIT            33168021
         LA    XR5,XFVAL                                                33176021
       BAL   XRSUB,XIDSZ                COMPUTE SIZES OF RESULT.        33184021
         MVC   XFLAS(LX6),XIDBY          X                              33192021
       SPACE 2                                                          33200021
XCTMEX   LM    XR0,XR15,XGSAV1     EXIT                                 33208021
       BCR   UNCON,XRSUB                X                               33216021
       SPACE 2                                                          33224021
XCTM04 BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      33232021
       BC    UNCON,XCTM06          MULTIPLY                             33240021
       SPACE 2                                                          33248021
XCTMP    MP    XFVAL(LX16),DX0(LX0,XR5)                                 33256021
XCTM10 LA    XRSUB,XCTM11                                               33264021
         CLC   Y1FAS+NX1(LX1,XR3),Y1FAS+NX1(XR5)                        33272021
       BC    XONE,XZX3X5                IF NUMBER OF DIGITS IN PROD     33280021
XCTM11   TM    Y1FAS+NX1(XR5),XX01       IS 30 MAKE SURE THAT MULTIP    33288021
       BC    XTHRE,XCTM13               HAS AN ODD NUMBER OF DIGITS     33296021
XCTM03 STH   XR4,XTDEC                  SET INPUT OF TRUNCATION ROU     33304021
       SR    XR2,XR4                    X                               33312021
       BC    XONE,XCTM09           IF NEG SET XTINI TO ZERO             33320021
       STH   XR2,XTINI                  X                               33328021
XCTM12 EQU   *                                                          33336021
       BAL   XRSUB,XT000                X                               33344021
         MVC   XFDDP(LX4),XTDDD                                         33352021
       SH    XR4,XTDDD                  UPDATE CHAR. OF RESULT          33360021
       STH   XR4,XFDAS                  X                               33368021
       LA    XR5,XFVAL                                                  33376021
       BAL   XRSUB,XSETOR          SET BUFFER TO MAX                    33384021
       BC    UNCON,XCTMEX               X                               33392021
XCTM09   XC    XTINI(LX2),XTINI                                         33400021
       BC    UNCON,XCTM12          GO TO TRUNC ROUTINE                  33408021
         TITLE 'EXPONENTIATION ANALYZER   E  X  P  O  N  E  N  T'       33416021
*                                                                       33424021
*      EXPONENTIATION.   EXPONENT IS IN DOP1 -XR3 POINTS TO IT (X1V     33432021
*                        BASE IS IN  DOP2    -XR5   -    -     (X2V     33440021
*        A)- IF EXPONENT IS A FLOATING POINT NUMBER OR HAS A PICTUR     33448021
*            SPECIFYING DECIMAL PLACES A CALL TO FPOWER WILL BE         33456021
*            GENERATED.                                                 33464021
*          - IF BASE IS FLOATING-POINT AND EXPONENT IS AN INTEGER       33472021
*            DATA-NAME A CALL TO GPOWER WILL BE GENERATED.              33480021
*          - IF BASE IS FLOATING-POINT AND EXPONENT IS AN INTEGER       33488021
*            LITERAL AN IN-LINE LOOP WILL BE GENERATED.                 33496021
*        B)- BASE IS NOT FLOATING-POINT AND EXPONENT IS AN INTEGER.     33504021
*          - 1) EXPONENT = INTEGER DATA-NAME -- CALL TO XPOWER IS       33512021
*               GENERATED.                                              33520021
*          - 2) EXPONENT = INTEGER LITERAL -- AN IN-LINE LOOP IS        33528021
*               GENERATED UNLESS THE MAXIMUM POSSIBLE RESULT EXEEDS     33536021
*               30 DIGITS , IN WHICH A CALL TO XPOWER IS GENERATED.     33544021
*                                                                       33552021
*                                                                       33560021
       SPACE 5                                                          33568021
       USING *,XRVERB                                                   33576021
EXPONE EQU   *                                                          33584021
       L     XRVERB,ADCN02                                              33592021
       USING XOTMUL,XRVERB                                              33600021
       BAL   XRSUB,XOTSEL               GET OPERANDS AND INITIALIZE     33608021
       TM    XOPMOD,XFLOAT              WORK-AREA.                      33616021
*                                                                       33624021
*   IF ONE OPERAND IS FLOATING POINT GO TO FPOWER.                      33632021
*                                                                       33640021
       BC    XTHRE,XOTEX1          FLOATING POINT OPERATION             33648021
XOTE65 EQU   *                                                          33656021
         CLI   X1DBS+NX1,XX00            IF EXPONENT IS NOT AN INTEG    33664021
       BC    XNOEQ,XOTE60               GO TO FPOWER CALL GENERATIO     33672021
         TM    X1IRX+NX1,XZGNLT          EXPONENT IS A DATA-NAME INT    33680021
       BC    XZERO,XOTEX2               GO TO XPOWER ,OR, GPOWER CA     33688021
*                                                                       33696021
*  EXPONENT IS AN INTEGER LITERAL TRY TO GENERATE AN IN-LINE LOOP.      33704021
*  CHECK FOR  EXPONENT = 0,OR,1,OR,2.                                   33712021
*                                                                       33720021
         CVB   XR0,X1VAL+NX8             XR0 HAS BINARY VALUE OF EXP    33728021
       LPR   XR1,XR0                    XR1 HAS ABSOLUTE  -  -    -     33736021
       CH    XR1,XC002                                                  33744021
       BC    XNOEQ,XOTEX3               IF EXPONENT IS = 2  GENERAT     33752021
       MVC   X1VAL(XLEVAL),X2VAL        A SINGLE MULTIPLY AND EVENT     33760021
       LTR   XR0,XR0                    DIVIDE RESULT INTO 1 IF IT      33768021
       BC    XGTEQ,XOTM00                     -2.                       33776021
       OI    XGNSW,XDIVON                                               33784021
       BC    UNCON,XOTM00          GO TO MULTIPLY VERB ANALYZER         33792021
XOTEX3 CH    XR1,XC000                  IF EXPONENT IS 0  SET RESUT     33800021
       BC    XZERO,XOTEX4               TO ONE.                         33808021
       CH    XR1,XC001                  IF EXPONENT = 1 SET RESULT      33816021
       BC    XNOEQ,XOTE72               BASE*1.                         33824021
       LTR   XR0,XR0                    IF EXPONENT = -1 SET RESULT     33832021
       BC    XTWO,XOTM00                1/BASE.                         33840021
       BC    UNCON,XOTEX6          EXP IS <= 0                          33848021
XOTE72 EQU   *                                                          33856021
       TM    XOPMOD,XFLOAT                                              33864021
       BC    XTHRE,XOTE63          FLOATING POINT OPERATION             33872021
       SPACE 2                                                          33880021
*  COMPUTE SIZE OF MAXIMUM RESULT                                       33888021
*                                                                       33896021
*                                                                       33904021
         MVC   X1VAL(XLEVAL),X2VAL                                      33912021
         XC    X1TEL(LX4),X1TEL                                         33920021
       BCTR  XR1,RW0               SUBTRACT 1 FOR 1ST TIME THRU         33928021
XOTE07 EQU   *                                                          33936021
         MVC   XGTEM2(LX2),X1BBS                                        33944021
       BAL   XRSUB,XCTMUL          GO TO COMPILE TIME MULTIPLY          33952021
         TM    XFIRX+NX1,XGOVFL          IF MORE THAN 30 DIGITS IN A    33960021
       BC    XTHRE,XOTE08               INTERM. RESULT GO TO XPOWER     33968021
         MVC   X1VAL(LX16),XFVAL                                        33976021
         MVC   X1LBS(LX8),XFLAS                                         33984021
         XC    X1LAS(LX8),X1LAS                                         33992021
         XC    X1ALP(LX2),X1ALP                                         34000021
       XC    XFVAL(XFLVAL),XFVAL                                        34008021
       BCT   XR1,XOTE07                 KEEP MULTIPLYING UNTILL EXP     34016021
*                                       IS SATISFIED.                   34024021
*  NO OVERFLOW HAS OCCURED - INITIALIZE OBJECT TIME LOOP -GENERATE      34032021
*  L   XRN,EXPONENT                                                     34040021
*                                                                       34048021
         TM    X2IRX+NX1,XZGNLT                                         34056021
       BC    XNOEQ,XOTE18          2ND OPERAND IS A LITERAL             34064021
XOTE63 EQU   *                                                          34072021
       LPR   XR1,XR0                                                    34080021
       BCTR  XR1,RW0               SUBTRACT 1 FOR OBJ TIME LOOP         34088021
         ST    XR1,XCON1+NX12                                           34096021
         MVI   XCON1+NX16,XX04                                          34104021
       BAL   XRSUB,XRSASG          ASSIGN A REG                         34112021
         MVC   XREG1(LX1),XREGNO                                        34120021
       BAL   XRSUB,LOAD            GENERATE A LOAD INSTRUCTION          34128021
       L     XR2,XLIRP                                                  34136021
         OI    DX2(XR2),XX05             XRVAL1+XRFREE                  34144021
       TM    XOPMOD,XFLOAT                                              34152021
       BC    XTHRE,XOTE66          FLOATING POINT OPERATION             34160021
*                                                                       34168021
*  DETERMINE IF THE MULTIPLICATION SHOULD BE PERFORMED IN ID OR         34176021
*  IN BINARY                                                            34184021
*                                                                       34192021
       TM    X2IRX,XGBINR                                               34200021
       BC    NOTHR,XOTE10               ID LOOP- BASE IS ID.            34208021
         CLI   X1BBS+NX1,XX08                                           34216021
       BC    XTWO,XOTE10                ID LOOP- RESULT TOO BIG         34224021
         CLI   XGTEM2+NX1,XX04                                          34232021
       BC    XTWO,XOTE10                ID LOOP-MULTIPLIER TOO BIG      34240021
*                                                                       34248021
*  GENERATE A BINARY MULTIPLICATION  IN A LOOP.                         34256021
*                                                                       34264021
*        LH   RODD,BASE                                                 34272021
*    5GN LH   REVEN,BASE                                                34280021
*        MR   REVEN,REVEN                                               34288021
*        BCT  XRN,5GN     XRN CONTAINS EXPONENT.                        34296021
*                                                                       34304021
       MVI   X1IRX,XGBINR                                               34312021
       BAL   XRSUB,XBISCL               SCALE BASE  (P'S).              34320021
       BAL   XRSUB,XRDBIR               ASK A PAIR                      34328021
       L     XR4,XLIRP                  XR4 HAS EVEN REG.               34336021
         L     XR6,DX4(XR4)              XR6  -  ODD   - .              34344021
       LR    XR3,XR5                                                    34352021
       LH    XR5,XMINTW                                                 34360021
       BAL   XRSUB,XZBINA          SET A-TEXT                           34368021
         MVC   XREG1(LX1),DX3(XR6)                                      34376021
       BAL   XRSUB,LOAD                 LOAD ODD REG.                   34384021
       BAL   XR5,XOTEGN            GENERATE GN                          34392021
         MVC   XREGNO(LX1),DX3(XR4)       LOAD EVEN                     34400021
*                                                                       34408021
       BAL   XRSUB,XSLGVX          GENERATE A LOAD INSTRUCTION          34416021
         MVC   XREG1(LX1),DX3(XR4)        SET A-TEXT FOR MULTIPLY.      34424021
         MVC   XREG2(LX1),DX3(XR4)                                      34432021
*                                                                       34440021
* SET RESULT BUFFER.                                                    34448021
*                                                                       34456021
         CLI   X1BBS+NX1,XX04                                           34464021
       BC    XTWO,XOTE11           LENGTH > FULLWORD                    34472021
       BAL   XRSUB,XZX4X6          EXCHANGE R4 AND R6                   34480021
         NC    DX0(LX3,XR6),XREMK6                                      34488021
         L     XRVAR,FPALOD                                             34496021
       USING FPLLOD,XRVAR                                               34504021
       BAL   XRSUB,FPLLN           SET FLAGS                            34512021
       USING XOTMUL,XRVERB                                              34520021
XOTE13 BAL   XRSUB,MULT            GENERATE MULTIPLY                    34528021
XOTE67 EQU   *                                                          34536021
         MVC   XREG1(LX1),DX3(XR2)                                      34544021
         MVC   XGN1(LX2),XGNTMP          GENERATE     BCT  XRN,5GN      34552021
       BAL   XRSUB,BRNCNT          GENERATE BCT                         34560021
         NC    DX0(LX3,XR2),XREMK6        RELEASE REG. CONTAINING EXP   34568021
XOTE18   MVC   XFTEL(LX6),X2TEL                                         34576021
XOTE17   MVC   XFVAL(LX16),X1VAL                                        34584021
         MVC   XFLAS(LX8),X1LBS                                         34592021
       LTR   XR0,XR0                                                    34600021
       BC    XGTEQ,XOTE16          EXPONENT >= ZERO                     34608021
*                                                                       34616021
*  IF EXPONENT IS NEGATIVE DIVIDE RESULT OF MULTIPLICATION INTO ONE     34624021
*                                                                       34632021
XOTE40 XC    X1VAL(XLEVAL),X1VAL                                        34640021
         MVC   X1VAL(LX16),XFVAL                                        34648021
         MVC   X1TEL(LX6),XFTEL                                         34656021
         MVC   X1LBS(LX8),XFLAS                                         34664021
       XC    XFVAL(XFLVAL),XFVAL                                        34672021
XOTE51 XC    X2VAL(XLEVAL),X2VAL                                        34680021
       TM    XOPMOD,XFLOAT                                              34688021
       BC    XZERO,XOTE68          NOT FL PT OPERATION                  34696021
         MVI   X2VAL+NX8,XX41            MOVE 1. TO X2VAL.              34704021
         MVI   X2VAL+NX9,XX10                                           34712021
       MVI   X2IRX,XGINFP                                               34720021
         MVI   X2IRX+NX1,XX64            XGDPFP+XFTPT+XGNCON.           34728021
       BC    UNCON,XOTE69          DIVIDE PRODUCT INTO 1                34736021
XOTE68 EQU   *                                                          34744021
         MVI   X2VAL+NX15,XX1F                                          34752021
       LA    XR4,X2VAL                                                  34760021
       BAL   XRSUB,XONDGT          UPDATE OPERAND BUFFER                34768021
XOTE69 EQU   *                                                          34776021
       LA    XR3,X1VAL                                                  34784021
       LA    XR5,X2VAL                                                  34792021
       L     XRVERB,ADCN03                                              34800021
       USING XOTDIV,XRVERB                                              34808021
       BC    UNCON,XOTD00          GO TO DIVIDE VERB ANALYZER           34816021
       USING XOTMUL,XRVERB                                              34824021
       SPACE 2                                                          34832021
XOTEX6 MVC   X1VAL(XLEVAL),X2VAL                                        34840021
       BC    UNCON,XOTE51          SWITCH OPERANDS                      34848021
XOTE11   OI    DX2(XR4),XRDPRE                                          34856021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    34864021
         OI    X2IRX+NX1,XG2IRX                                         34872021
       BC    UNCON,XOTE13          GENERATE MULTIPLY                    34880021
       SPACE 2                                                          34888021
*  GENERATE AN  ID MULTIPLICATION IN A LOOP.                            34896021
*                                                                       34904021
*        ZAP  TEMP(L1),BASE(L)                                          34912021
*   5GN  MP   TEMP(L2),BASE(L)                                          34920021
*        BCT  XRN,5GN              XRN CONTAINS EXPONENT.               34928021
*                                                                       34936021
*                                                                       34944021
XOTE10 MVI   X1IRX,XGINDC                                               34952021
       BAL   XRSUB,XW000           SCALE OPERAND                        34960021
       LR    XR3,XR5                                                    34968021
         MVC   XFTEL(LX6),X2TEL                                         34976021
         MVI   XYLEN,XX11                                               34984021
       BAL   XRSUB,XYOAF           SET A-TEXT                           34992021
       BAL   XR5,XOTEGN            GENERATE GN                          35000021
         MVC   XWC1(LX2),XEREL1                                         35008021
         MVI   XL1+NX1,XX10                                             35016021
       LH    XR5,XMINFV                                                 35024021
         MVC   X2TEL(LX6),XFTEL                                         35032021
         MVC   XFTEL(LX4),XYTEL                                         35040021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           35048021
         MVC   X2TEL(LX4),XFTEL                                         35056021
       BC    UNCON,XOTE13          GENERATE MULTIPLY                    35064021
*                                                                       35072021
*  OUTPUT A LABEL                                                       35080021
*                                                                       35088021
XOTEGN BAL   XRSUB,XSTLHN          GET GN NUMBER                        35096021
         XC    XGN1(LX2),XGN1                                           35104021
         MVC   PH4GN+NX1(LX2),XGNTMP   MOVE GN #                        35112021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 35120021
       BCR   UNCON,XR5             RETURN                               35128021
*                                                                       35136021
*   SET RESULT TO ONE.                                                  35144021
*                                                                       35152021
XOTEX4 TM    XOPMOD,XFLOAT                                              35160021
       BC    XZERO,XOTE71          NOT FL PT OPERATION                  35168021
       MVI   XFIRX,XGINFP                                               35176021
         MVI   XFIRX+NX1,XX64            XGDPFP+XFTPT+XGNCON.           35184021
         MVI   XFVAL+NX8,XX41            SET RESULT TO 1 IN IFP.        35192021
         MVI   XFVAL+NX9,XX10                                           35200021
       BC    UNCON,XOTE16          RESET BUFFER ADDRESSES               35208021
XOTE71   MVI   X1VAL+NX15,XX1F                                          35216021
         MVI   XFIRX+NX1,XGCOLT                                         35224021
       MVI   XFIRX,XGINDC                                               35232021
       BC    UNCON,XOTE17          SET RESULT BUFFER                    35240021
*                                                                       35248021
*  GENERATE CALL TO FPOWER.                                             35256021
*                                                                       35264021
*        LD   0,BASE                                                    35272021
*        MVC  WORKA+8(8,13),EXPONENT                                    35280021
*        L    15,V(FPOWER)                                              35288021
*        BALR 14,15                                                     35296021
*  RESULT IN  REGISTER 0.                                               35304021
*                                                                       35312021
*      IF EXPONENT IS KNOWN TO BE AN INTEGER AT COMPILE TIME A CALL     35320021
*      TO GPOWER WILL BE GENERATED UNLESS IT IS A LITERAL INTEGER,      35328021
*      IN WHICH CASE AN IN LINE LOOP WILL BE GENERATED.                 35336021
*                                                                       35344021
*  CALLING SEQUENCE TO GPOWER IS                                        35352021
*        LD  0,BASE                                                     35360021
*        L   0,EXPONENT                                                 35368021
*        L   15,=V(GPOWER)                                              35376021
*        BALR 14,15                                                     35384021
*                                                                       35392021
*  THE IN-LINE LOOP WILL BE                                             35400021
*        LD  RF1,BASE                                                   35408021
*        L   R1,EXPONT-1                                                35416021
*        LDR RF2,RF1                                                    35424021
*   5GN  MDR RF1,RF2                                                    35432021
*        BCT R1,5GN                                                     35440021
*                                                                       35448021
XOTEX1 EQU   *                                                          35456021
       CLI   X1IRX,XGEXFP               EFP.                            35464021
       BC    XZERO,XOTE60                YES.                           35472021
         TM    X1IRX+NX1,XFTPT                                          35480021
       BC    XTHRE,XOTE60          INTERNAL FL PT OPERAND               35488021
       CLI   X2IRX,XGEXFP                                               35496021
       BC    XNOEQ,XOTE65          NOT EXT FL PT OPERAND                35504021
       LA    XR3,X2VAL                                                  35512021
       BAL   XRSUB,EFPIFP          CONVERT EFP TO IFP                   35520021
       LA    XR3,X1VAL                                                  35528021
       BC    UNCON,XOTE65          CHECK FOR INTEGER EXPONENT           35536021
*                                                                       35544021
*  CALL TO FPOWER.                                                      35552021
*                                                                       35560021
XOTE60 BAL   XRSUB,FPCVBG          CONVERT BOTH OPERANDS TO IFP         35568021
         TM    X1IRX+NX1,XGDPFP                                         35576021
       BC    XTHRE,XOTE21          DP FL PT OPERAND                     35584021
       BAL   XRSUB,FPLDL                MOVE EXPONENT TO  WORKA+8(1     35592021
XOTE21   MVI   BDISP1,XXD0                                              35600021
         MVI   BDISP1+NX1,WORKP                                         35608021
       LH    XR5,XMINFV                                                 35616021
       BAL   XRSUB,FPSETA          SET A-TEXT                           35624021
       LA    XRSUB,XOTE20                                               35632021
         TM    X1IRX+NX1,XINREG                                         35640021
       BC    XNOEQ,STORFL          OPERAND IN REG                       35648021
         MVI   XL1+NX1,XX08                                             35656021
       BC    UNCON,MVC             GENERATE MVC                         35664021
XOTE20 LA    XR3,X2VAL                  LOAD  BASE IN 0                 35672021
       BAL   XRSUB,FPLD0           GENERATE LOAD INSTRUCTION            35680021
       BAL   XRSUB,VBADCE                    L  15,V(FPOWER)            35688021
       DC    C'FPW0'              BALR  14,15                           35696021
XOTE70 EQU   *                                                          35704021
       LA    XR3,XFVAL                                                  35712021
       LA    XR4,FPRTB0                                                 35720021
       BAL   XRSUB,XZWHIR          GET REG TBL                          35728021
       MVI   XFIRX,XGINFP                                               35736021
         MVI   XFIRX+NX1,XX2D            XINREG+XG2IRX+XFTPT+XGDPFP     35744021
       SPACE 2                                                          35752021
*  EXIT  FROM EXPONENTIATION ROUTINE.                                   35760021
*                                                                       35768021
XOTE16 BAL   XRSUB,XRSVAL          RESET BUFFER ADDRESSES               35776021
*                                                                       35784021
       BC    UNCON,XOTM08          CHECK FOR NEG EXPONENT               35792021
*                                                                       35800021
*  CALL TO GPOWER.                                                      35808021
*                                                                       35816021
XOTE64 LA    XR3,X2VAL                                                  35824021
       BAL   XRSUB,FPLD0           GENERATE LOAD INSTRUCTION            35832021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      35840021
       DC    C'GPW0'                                                    35848021
       BC    UNCON,XOTE70          SET FLAGS IN FINAL RESULT BUFF       35856021
*                                                                       35864021
*      IN-LINE LOOP.                                                    35872021
*                                                                       35880021
XOTE66 LA    XR3,X2VAL                                                  35888021
       BAL   XRSUB,FPLDL                LD RF1,BASE                     35896021
       BAL   XRSUB,XZWHIR          GET REG TBL                          35904021
       L     XR4,XLIRP                                                  35912021
       BAL   XRSUB,XRSASF          ASSIGN A REG                         35920021
       L     XR6,XLIRP                                                  35928021
         MVC   XREG1(LX1),DX3(XR6)        LDR  RF2,RF1                  35936021
         MVC   XREG2(LX1),DX3(XR4)                                      35944021
       BAL   XRSUB,LDFLL           GENERATE A LOAD INSTRUCTION          35952021
       BAL   XR5,XOTEGN                 5GN   MDR  RF1,RF2              35960021
         MVC   XREG1(LX1),DX3(XR4)                                      35968021
         MVC   XREG2(LX1),DX3(XR6)                                      35976021
       BAL   XRSUB,MULTFL          GENERATE FL PT MULTIPLY              35984021
         NC    DX0(LX3,XR6),XREMK6                                      35992021
       BC    UNCON,XOTE67          GENERATE BCT                         36000021
       SPACE 2                                                          36008021
*  GENERATE  CALL  TO XPOWER                                            36016021
*                                                                       36024021
*        ZAP  WORKA(16,13),BASE(L)                                      36032021
*        L    0,EXPONENT                                                36040021
*        L    15,V(XPOWER)                                              36048021
*        BALR 14,15                                                     36056021
*        DC   XL1   NUMBER OF DEC. IN BASE.                             36064021
*        DC   XL1   DMAX.                                               36072021
*   RESULT IN  WORKA(16,13)                                             36080021
*                                                                       36088021
XOTEX2   MVI   XREGNO,XX00                                              36096021
       BAL   XRSUB,XFREER          FREE REG                             36104021
       TM    X1IRX,XGBINR                                               36112021
       BC    XTHRE,XOTE30          EXPONENT IS BINARY                   36120021
       BAL   XRSUB,XIDBIB               CONVERT EXPON. TO BINARY.       36128021
*                                                                       36136021
*   IF EXPONENT IS ASSIGNED MORE THAN A ONE BINARY WORD , ONLY THE      36144021
*   LOW ORDER WORD WILL BE USED TO BUILD THE CALLING SEQUENCE           36152021
*   TO XPOWER.                                                          36160021
*                                                                       36168021
XOTE30 EQU   *                          TAKE CARE OF EXPONENT WITH      36176021
         TM    X1IRX+NX1,XG2IRX          A TOO LARGE NUMERIC FIELD,O    36184021
       BC    XZERO,XOTE33               CONTAINING P'S IN THE PICTU     36192021
       BAL   XR1,XODDRG            GET ASSOCIATED ODD REG               36200021
       L     XRVAR,FPALOD                                               36208021
       USING FPLLOD,XRVAR                                               36216021
       BAL   XRSUB,FPLLN           SET FLAGS                            36224021
       DROP  XRVAR                                                      36232021
       LA    XR5,X2VAL                                                  36240021
         XI    X1IRX+NX1,XG2IRX                                         36248021
XOTE33   TM    X1IRX+NX1,XINREG                                         36256021
       BC    XTHRE,XOTE34          OPERAND IS IN REG                    36264021
         CLI   X1BBS+NX1,XX04                                           36272021
       BC    XLOEQ,XOTE35          LENGTH <= FOUR                       36280021
         MVI   XPLUS1+NX2,XX04                                          36288021
XOTE35   MVI   XREGNO,XX00                                              36296021
         BAL   XRSUB,XSLGVX        GENERATE A LOAD INSTRUCTION          36304021
XOTE34   CLI   X1ALP+NX1,XX00                                           36312021
       BC    XZERO,XOTE31          NO SCALING                           36320021
         MVI   XFBAS+NX1,XX04                                           36328021
       BAL   XRSUB,XZSCL           SCALE OPERAND                        36336021
XOTE31   MVI   XREGNO,XX00                                              36344021
         BAL   XRSUB,XSLGVX        LOAD EXPONENT IN REG 0               36352021
         XC    X1ALP(LX2),X1ALP                                         36360021
       TM    XOPMOD,XFLOAT                                              36368021
       BC    XTHRE,XOTE64          FL PT OPERATION                      36376021
XOTE32 BAL   XRSUB,XSCAL           COMPILE TIME SCALE                   36384021
         NI    X1IRX,XXF0                                               36392021
       OI    X1IRX,XGINDC                                               36400021
       BAL   XRSUB,XW000                CONVERT TO ID AND SCALE BAS     36408021
         MVI   BDISP1,XXD0                                              36416021
         MVI   BDISP1+NX1,WORKA                                         36424021
       LR    XR3,XR5                                                    36432021
       LH    XR5,XMINFV                                                 36440021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           36448021
         MVI   XL1+NX1,XX10                                             36456021
       BAL   XRSUB,ZAP                  ZAP  BASE                       36464021
       BAL   XRSUB,VBADCE               CALL XPOWER                     36472021
       DC    C'XPR0'                                                    36480021
         MVC   XCON1+NX1(LX1),X2DBS+NX1   GENERATE  DC'S                36488021
         MVI   XFDAS+NX1,XX00                                           36496021
         MVC   XCON1+NX2(LX1),XRDMX+NX1                                 36504021
         MVC   XFDAS(LX2),XRDMX                                         36512021
         MVI   XCON1,XX02                                               36520021
       MVI   XIMM,MDC                                                   36528021
       BAL   XRSUB,MACRO           GENERATE MACRO                       36536021
       LA    XR3,XFVAL                                                  36544021
       BAL   XRSUB,WKZAP1          GENERATE ZAP FROM WORK AREA          36552021
       LA    XR5,XFVAL                                                  36560021
*                                                                       36568021
       MVI   XFIRX,XGINDC                                               36576021
       BAL   XRSUB,XSETOR          SET BUFFER TO MAX VALUES             36584021
       BC    UNCON,XOTE16          RESET BUFFER ADDRESSES               36592021
XOTE08   MVI   XCON1+NX16,XX04                                          36600021
         ST    RW0,XCON1+NX12                                           36608021
       BAL   XRSUB,LOAD            GENERATE A LOAD INSTRUCTION          36616021
       BC    UNCON,XOTE32          COMPILE TIME SCALING                 36624021
         TITLE 'DIVIDE ANALYZER         D  I  V  I  D  E'               36632021
IKF50B CSECT                                                            36640021
*      XOTDIV  -  DIVIDE ANALYZER.                                      36648021
*                                                                       36656021
*                                                                       36664021
       SPACE 5                                                          36672021
       USING *,XRVERB                                                   36680021
XOTDIV BAL   XRSUB,XOTSEL          GET OPERAND INFO INTO BUFFERS        36688021
         TM    XGNSW,DIVREM        DIVIDE REMAINDER               41562 36696021
         BZ    XOTD00              NO                             41562 36704021
         MVI   DIVREMSW,XX01                                      41562 36712021
         LA    XR4,XQVAL                                          41562 36720021
         LA    XR6,XKVAL                                          41562 36728021
         LA    XR1,DX2                                            41562 36736021
         XC    XQVAL(XQKLEN),XQVAL                                41562 36744021
XOTD10   DS    0H                                                 41562 36752021
         TM    Y1IRX+NX1(XR3),XZGNLT   LITERAL                    41562 36760021
         BNZ   XOTD11                   YES                       41562 36768021
         MVC   DX0(XLEVAL,XR4),DX0(XR3)                           41562 36776021
         CLI   Y1TEL+NX1(XR3),XX00      IN TEMP STORAGE           41562 36784021
         BE    XOTD12                   NO                        41562 36792021
         MVC   XELEN(LX2),Y1TEL(XR3)                              41562 36800021
         BAL   XRSUB,XTAMPO             GET NEW TEMP STORAGE      41562 36808021
         MVC   XL1(LX2),XYTEL                                     41562 36816021
         MVC   XWC1(LX2),XEREL1                                   41562 36824021
         MVC   XL2(LX2),Y1TEL(XR3)                                41562 36832021
         LH    XR0,Y1TEM(XR3)                                     41562 36840021
         SLA   XR0,DX3                                            41562 36848021
         STH   XR0,XWC2                                           41562 36856021
         BAL   XRSUB,ZAP                GENERATE ZAP              41562 36864021
         MVC   Y1TEL(LX4,XR4),XYTEL                               41562 36872021
         B     XOTD11              CHECK NEXT OPERAND             41562 36880021
XOTD12   DS    0H                                                 41562 36888021
         LR    XR0,XR3                                            41562 36896021
         L     XR3,Y1INPT(XR3)                                    41562 36904021
         BAL   XRSUB,XLENGH        GET LENGTH                     41562 36912021
         LR    XR3,XR0                                            41562 36920021
         MVC   XELEN(LX2),XOPLGH+NX2                              41562 36928021
         BAL   XRSUB,XTAMPO        GET NEW TEMP STORAGE           41562 36936021
         MVC   XL1(LX2),XYTEL                                     41562 36944021
         MVC   XWC1(LX2),XEREL1                                   41562 36952021
         MVC   XWC2(LX2),XEREL1                                   41562 36960021
         BAL   XRSUB,EXORLG        GENERATE XC                    41562 36968021
         MVC   Y1TEL(LX4,XR4),XYTEL                               41562 36976021
         LH    XR0,XYTEL                                          41562 36984021
         SH    XR0,XOPLGH+NX2                                     41562 36992021
         MVC   XL1(LX2),XOPLGH+NX2                                41562 37000021
         AH    XR0,XEREL1                                         41562 37008021
         STH   XR0,XWC1                                           41562 37016021
         MVC   OP1(LX4),Y1INPT(XR3)                               41562 37024021
         BAL   XRSUB,MVC           GENERATE MVC                   41562 37032021
XOTD11   DS    0H                                                 41562 37040021
         BAL   XRSUB,XZX3X5        SWITCH OPERANDS                41562 37048021
         BAL   XRSUB,XZX4X6        SWITCH OPERANDS                41562 37056021
         BCT   XR1,XOTD10          CHECK NEXT OPERAND             41562 37064021
XOTD00 TM    XOPMOD,XFLOAT                                              37072021
       BC    XTHRE,XOTD01               FLOATING POINT MODE.            37080021
       BAL   XRSUB,XMONDV               SET DMAX.                       37088021
*                                                                       37096021
       OI    XOPMOD,XDIVFL                                              37104021
*                                                                       37112021
*      XCTDIV  - COMPILE TIME DIVISION.                                 37120021
*                     NOTATION '   I1 =INTEGER OF DIVIDEND.             37128021
*                               DMAX  =MAX.NUMBER OF DECIMAL IN THE     37136021
*                                                          SOURCE F     37144021
*                               D1 DECIMAL OF DIVIDEND.                 37152021
*                               D2 DECIMAL OF DIVISOR.                  37160021
*                 RESULT AT OBJECT TIME WILL HAVE  D1-D2 DECIMAL PL     37168021
*                 IF  D1-D2 GREATER THAN DMAX,OR DMAX DECIMAL  OTHE     37176021
       SPACE 5                                                          37184021
         BAL   XRSUB,XZX3X5        SWITCH OPERANDS                      37192021
       BAL   XRSUB,XSCAL                X                               37200021
         BAL   XRSUB,XZX3X5        SWITCH OPERANDS                      37208021
         MVC   Y1DAS(LX2,XR3),Y1DBS(XR3)                                37216021
         LH    XR4,Y1DBS(XR5)                                           37224021
       SH    XR4,Y1DBS(XR3)             D1-D2                           37232021
       CH    XR4,XRDMX                  D1-D2 = DMAX                    37240021
       BC    XGTEQ,XCTD01               YES                             37248021
         MVC   XFDAS(LX2),XRDMX          UPDATE DECIMALS OF RESULT.     37256021
       SH    XR4,XRDMX                                                  37264021
       LCR   XR4,XR4                    D2+DMAX-D1                      37272021
       LR    XR6,XR4                    SAVE THAT SCALING FACTOR IN     37280021
       AH    XR6,Y1ALP(XR5)             SCALE  DIVIDEND.                37288021
       STH   XR6,Y1ALP(XR5)             X                               37296021
       BAL   XRSUB,XSCAL                X                               37304021
         TM    Y1IRX+NX1(XR5),XGOVFL     OVERFLOW.                      37312021
       BC    XTHRE,XCTD02               YES-                            37320021
       AH    XR4,Y1DBS(XR5)             UPDATE DECIMAL PLACES OF DI     37328021
       STH   XR4,Y1DAS(XR5)             AFTER SCAL.                     37336021
       SPACE 2                                                          37344021
XCTD03   ZAP   XFVAL(LX16),DX0(LX16,XR5) SET RESULT INFORMATION.        37352021
         MVC   XFLAS(LX6),Y1LAS(XR5)     X                              37360021
       SPACE 2                                                          37368021
XCTDXT EQU   *                                                          37376021
       BAL   XRSUB,XRSVAL          RESET OPERAND BUFFER ADDRESSES       37384021
       BAL   XRSUB,XHSMD1          SET MODE OF OPERATION                37392021
       TM    X1IRX+NX1,XZGNLT                                           37400021
       BNZ   XOTD62                DIVISOR IS A LITERAL                 37408021
       TM    XGSWT,XSIZER                                               37416021
       BZ    XOTD60                NO SIZE ERROR OPTION IN SOURCE       37424021
         CLI   X1FAS+NX1,XX00                                           37432021
       BC    XNOEQ,XOTD67          NUMBER OF DIGITS NOT EQUAL TO 0      37440021
         MVI   XREG1,XX0F                                               37448021
       BC    UNCON,XOTD68          GENERATE BRANCH FOR SIZE ERROR       37456021
XOTD67 EQU   *                                                          37464021
       TM    X1IRX,XGBINR                                               37472021
       BC    XTHRE,XOTD61               CHECK FOR ZERO DIVISOR          37480021
XOTD65   ZAP   XCON2(LX16),XINDCZ(LX1)   ONLY IF ON SIZE ERROR          37488021
         MVI   XCON2+NX16,XX01           IS SPECIFOED,IN WHICH          37496021
         MVI   XL2+NX1,XX01                                             37504021
       LH    XR5,XMINTH                 CASE BRANCH TO ON SIZE          37512021
       BAL   XRSUB,XZSIDB               ERROR CODING IF                 37520021
       BAL   XRSUB,COMP                 DIVISOR IS ACTUALLY ZERO.       37528021
XOTD63 MVI   XREG1,XZERO                                                37536021
XOTD68 BAL   XR2,XZRDVV            ASSIGN TRANSFER IF NEEDED            37544021
         MVC   XGN1(LX2),XZRTRA                                         37552021
       BAL   XRSUB,BC              GENERATE BC                          37560021
       LA    XR5,X2VAL                                                  37568021
       TM    XOPMOD,XFLOAT                                              37576021
       BC    XTHRE,XOTD09          FL PT OPERATION                      37584021
       BC    UNCON,XOTD60          CHECK MODE FOR DIVIDE                37592021
XOTD61 LA    XRSUB,XOTD65                                               37600021
         CLI   X1BBS+NX1,XX04                                           37608021
       BC    XTWO,XBIIDB           BIN DIVISOR > FWD CONVERT TO ID      37616021
       BAL   XR1,XLTRGN                   LTR  XRN,XRN                  37624021
       BC    UNCON,XOTD63          GENERATE BC                          37632021
*                                                                       37640021
*                                                                       37648021
XOTD62 BAL   XRSUB,XODOVF          CHECK FOR ZERO DIVISOR               37656021
XOTD60 EQU   *                                                          37664021
       TM    XGSWT,XIDMOD                                               37672021
       BC    XTHRE,XOTD02               GO TO ID DIVIDE                 37680021
       SPACE 2                                                          37688021
       BAL   XRSUB,XBISCD               BINARY DIVIDE - SCALE           37696021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      37704021
       BAL   XRSUB,XSLODB               MAKE SURE DIVIDEND IS IN A      37712021
         CLI   X1BAS+NX1,XX02                                           37720021
       BC    XTWO,XOTD06           LENGTH > HALFWORD                    37728021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      37736021
       BAL   XRSUB,XSLOAS          GENERATE A LOAD INSTRUCTION          37744021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      37752021
XOTD06 BAL   XRSUB,XZBINA               SET A- TEXT                     37760021
       BAL   XRSUB,D                      DIVIDE.                       37768021
         MVI   XFIRX,XX0B                                               37776021
       BAL   XR1,XODDRG            GET ODD REG TBL OF EVEN-ODD PAIR     37784021
         MVO   XFIRX(LX1),DX3(LX1,XR4)                                  37792021
         OI    XFIRX+NX1,XINREG                                         37800021
XOTD08 BC    UNCON,XFINAL          STORE IR                             37808021
       SPACE 2                                                          37816021
*                                                                       37824021
       SPACE 2                                                          37832021
XOTD02 BAL   XRSUB,XW000                SCALE.                          37840021
         TM    Y1IRX+NX1(XR5),XGOVFL                                    37848021
       BC    XTHRE,XOTD03               DP DIVISION ROUTINE. 30 INT     37856021
         CLI   Y1LAS+NX1(XR3),XX08                                      37864021
       BC    XTWO,XOTD04                DP DIVISION,DIVISOR GREATER     37872021
*                                       THAN 8 BYTES.                   37880021
       LH    XR4,Y1LAS(XR5)             SINGLE PRECISION DIVIDE.        37888021
       LR    XR6,XR4                                                    37896021
       AH    XR4,Y1LAS(XR3)                                             37904021
       CH    XR4,XC016                                                  37912021
       BC    XTWO,XOTD05                L1+L2 GREATER THAN 16 GO TO     37920021
       BAL   XRSUB,LTLTST          ARE BOTH OPERANDS LITERALS           37928021
       BC    UNCON,XOTD07          NO                                   37936021
       TM    XGSWT,XSIZER                                               37944021
       BC    XTHRE,XOTD70          SIZE ERROR IS IN SOURCE              37952021
       BAL   XRSUB,XODOVF          TEST FOR POSSIBLE SIZE ERROR         37960021
XOTD70 EQU   *                                                          37968021
       LH    XR2,Y1LAS(XR3)             BOTH OPERANDS ARE NUM. LITE     37976021
         LA    XR6,DX16                                                 37984021
       SR    XR6,XR2                    16- LENGTH DIVISOR.             37992021
       AR    XR3,XR6                                                    38000021
       BCTR  XR2,RW0               SUBTRACT ONE FOR EX INSTRUCTION      38008021
       EX    XR2,XOTDP                 DIVIDE                           38016021
       BCTR  XR6,RW0               SUBTRACT ONE FOR EX INSTRUCTION      38024021
       EX    XR6,XOTZAP                ZAP                              38032021
       LA    XR3,X1VAL                                                  38040021
         BAL   XRSUB,XSETLT        SET FLAGS IN RESULT BUFFER           38048021
       LA    XR5,XFVAL                                                  38056021
       BAL   XRSUB,XIDSZ           GET LENGTHS OF OPERAND               38064021
         MVC   XFLAS(LX6),XIDBY                                         38072021
       LA    XR5,X2VAL                                                  38080021
       BC    UNCON,XOTD08          STORE IR                             38088021
XOTD07 EQU   *                                                          38096021
       STC   XR4,XYLEN                  OBJECT TIME SUBROUTINE.         38104021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      38112021
       BAL   XRSUB,XYOAF                LOAD DIVIDEND IN   TEMP (L1     38120021
       STH   XR4,Y1LAS(XR3)                                             38128021
       BAL   XRSUB,XZSIDA               SET  A-TEXT.                    38136021
       BAL   XRSUB,DP                   GENERATE DP.  -QUOTIENT IS      38144021
*                                       LEFT ADJUSTED IN DIVIDEND F     38152021
*                                       SO IT HAS TO BE RIGHT ADJUS     38160021
       BAL   XRSUB,XEWCL           SET LENGTH AND DISPLACEMENT          38168021
         MVC   XL1(LX2),XYTEL            X                              38176021
         MVC   XWC1(LX2),XEREL1          ZAP   TEMP(L1+L2+A),TEMP(L1    38184021
       LH    XR2,XEREL1                                                 38192021
       AH    XR2,Y1TEL(XR3)                                             38200021
       SR    XR2,XR4                                                    38208021
       STH   XR2,XWC2                                                   38216021
       STH   XR6,XL2                    X                               38224021
         MVC   XFTEL(LX5),Y1TEL(XR3)                                    38232021
       BAL   XRSUB,ZAP                  X                               38240021
       BC    UNCON,XOTD08          STORE IR                             38248021
*                                                                       38256021
*                                                                       38264021
*                                                                       38272021
*  FLOATING-POINT DIVIDE.                                               38280021
*                                                                       38288021
XOTD01 BAL   XRSUB,FPCVBG          MAKE OPERANDS SAME FL PT FORMAT      38296021
       TM    XGSWT,XSIZER                                               38304021
       BC    XZERO,XOTD09          NO SIZE ERROR IN SOURCE              38312021
       BAL   XRSUB,FPLOAD          GENERATE A FL PT LOAD INST           38320021
         PACK  XREG1(LX1),Y1IRX(LX1,XR3)                                38328021
         NI    XREG1,XX0F                                               38336021
         MVC   XREG2(LX1),XREG1          CHECK FOR ZERO DIVISOR         38344021
       LA    XRSUB,XOTD63               IN CASE OF ON SIZE ERROR.       38352021
         TM    Y1IRX+NX1(XR3),XG2IRX                                    38360021
       BC    XTHRE,LDTSTL          GENERATE A DP FL PT LTR              38368021
       BC    UNCON,LDTSTS          GENERATE A FL PT LTR                 38376021
XOTD09 EQU   *                                                          38384021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      38392021
       BAL   XRSUB,FPLOAD          GENERATE A FL PT LOAD INST           38400021
       BAL   XRSUB,FPSETA          SET A-TEXT                           38408021
       LA    XRSUB,XOTDF0                                               38416021
         TM    Y1IRX+NX1(XR3),XGDPFP                                    38424021
       BC    XTHRE,DIVFLL          GENERATE A DP FL PT DIVIDE           38432021
       BC    UNCON,DIVFLS          GENERATE A FL PT DIVIDE              38440021
XOTDF0 BAL   XRSUB,FPRESF          SET OPERAND BUFFER FLAGS             38448021
       BC    UNCON,XOTD08          STORE IR                             38456021
       SPACE 2                                                          38464021
*                                                                       38472021
*                                                                       38480021
XOTD03 EQU   *                          CALL TO OBJECT TIME SUB FOR     38488021
*                                            DIVISION OF A 30 DIGIT     38496021
*                                       FIELD INTO A 60 DIGITS FIEL     38504021
*                                                                       38512021
         MVI   BDISP1+NX1,WORKC                                         38520021
       BAL   XRSUB,XDPZAP          GENERATE ZAP INTO WORK AREA          38528021
       BAL   XRSUB,VBADCE          CALL DIVIDE SUBROUTINE               38536021
       DC    C'XDI0'                                                    38544021
       LA    XR1,WORKD                                                  38552021
       BAL   XR2,XZPDPR            GENERATE ZAP OUT OF WORK AREA        38560021
         TM    XFIRX+NX1,XGOVFL                                         38568021
       BC    XZERO,XOTD08          NO OVERFLOW STORE IR                 38576021
         MVC   XWC1(LX2),XEREL1                                         38584021
         MVI   XIMM,XX0F                                                38592021
       BAL   XRSUB,NI              GENERATE NI                          38600021
*                                                                       38608021
*      WARNING - POSSIBLE TRUNCATION.                                   38616021
*                                                                       38624021
       BAL   XRSUB,ERRPRO          GENERATE TRUNCATION MESSAGE          38632021
       DC    AL1(ERRN11)                                                38640021
       DC    AL1(0)                                                     38648021
       BC    UNCON,XOTD08          STORE IR                             38656021
XOTD04 EQU   *                          DP DIVIDE DIVISOR GREATER       38664021
XOTD05 EQU   *                                                          38672021
*                                       THAN 15 DIGITS.                 38680021
*                                                                       38688021
*                                                                       38696021
*                                       OR  L DVD+L DVS GREATER THA     38704021
*                                       16.                             38712021
       BAL   XRSUB,XBDSET          SET A-TEXT                           38720021
         MVI   BDISP1+NX1,WORKA                                         38728021
         MVI   BDISP2+NX1,WORKA                                         38736021
       BAL   XRSUB,EXORLG          GENERATE XC                          38744021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      38752021
         MVI   BDISP1+NX1,WORKB                                         38760021
       BAL   XRSUB,XDPZAP          GENERATE ZAP INTO WORK AREA          38768021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      38776021
       BC    UNCON,XOTD03          CALL DIVIDE SUBROUTINE               38784021
*                                                                       38792021
*                                                                       38800021
*                                                                       38808021
*                                                                       38816021
XOTDP    DP    DX0(LX16,XR5),DX0(LX0,XR3)                               38824021
XOTZAP   ZAP   XFVAL(LX16),DX0(LX0,XR5)                                 38832021
XODOVF   CP    X1VAL(LX16),XINDCZ(LX1)                                  38840021
       BCR   XNOEQ,XRSUB           LITERAL NOT EQUAL TO ZERO            38848021
       LA    XR5,XFVAL                                                  38856021
       BAL   XRSUB,XSETOR          SET RESULT BUFFER TO MAX             38864021
       LA    XR5,X2VAL                                                  38872021
       MVI   XFIRX,XGINDC                                               38880021
         OI    XFIRX+NX1,XGCOLT                                         38888021
*                                                                       38896021
*--------------- GIVE A MESSAGE  ZERO LITERAL DIVISOR.                  38904021
*                                                                       38912021
*      ERROR NUMBER 3.                                                  38920021
*                                                                       38928021
       BAL   XRSUB,ERRPRO          GENERATE ZERO DIVISOR MESSAGE        38936021
       DC    AL1(ERRN03)                                                38944021
       DC    AL1(1)                                                     38952021
       BC    UNCON,XOTD08          STORE IR                             38960021
       SPACE 2                                                          38968021
XCTD01 STH   XR4,XFDAS                  D1-D2 DECIMAL PLACES.           38976021
         MVC   Y1DAS(LX2,XR5),Y1DBS(XR5)                                38984021
       BAL   XRSUB,XSCAL                X                               38992021
       BC    UNCON,XCTD03               X                               39000021
       SPACE 2                                                          39008021
XCTD02 EQU   *                                                          39016021
       LR    XR6,XR5                    UPDATE RESULT                   39024021
       LA    XR5,XFVAL                  INFORMATION FOR OVERFLOW CA     39032021
       BAL   XRSUB,XSETOR          SET RESULT BUFFER TO MAX             39040021
       LR    XR5,XR6                                                    39048021
       SPACE 2                                                          39056021
       LH    XR6,Y1ALP(XR5)                                             39064021
       SR    XR6,XR4                    P'S+SCALING FACTOR - P'S =      39072021
       AH    XR6,Y1FBS(XR5)                                             39080021
       SH    XR6,Y1DBS(XR5)                                             39088021
       BC    XONE,XCTD0V           INT CANNOT BE NEG SET TO ZERO        39096021
XCTD1V EQU   *                                                          39104021
       LR    XR1,XR6                    XR1 = I1                        39112021
       AH    XR4,Y1DBS(XR5)             XR4 = D2+DMAX                   39120021
       AR    XR6,XR4                    I1+D2+DMAX                      39128021
       CH    XR6,XC060                                                  39136021
       BC    XTWO,XCTD04           DIVIDEND GREATER THAN 60 DIGITS      39144021
       SPACE 2                                                          39152021
XCTD06 STH   XR4,Y1DAS(XR5)             I1+D2+DMAX LESS THAN 60         39160021
         MVI   Y1BAS+NX1(XR5),XXFF       UPDATE CHAR. OF DIVIDEND AF    39168021
       AR    XR4,XR1                    SCALING.                        39176021
       SH    XR4,Y1IND(XR5)             XR4= D2+DMAX+I1 -INTEGER  T     39184021
       STH   XR4,Y1FAS(XR5)                                  DROPPE     39192021
         SRA   XR4,DX1                                                  39200021
         LA    XR4,DX1(XR4)              SET ID LENGTH.                 39208021
       STH   XR4,Y1LAS(XR5)             X                               39216021
       BC    UNCON,XCTDXT               X                               39224021
       SPACE 2                                                          39232021
XCTD04   CLC   Y1DBS(LX2,XR3),XRDMX      IS D2 GREATER THAN DMAX.       39240021
       BC    XTWO,XCTD05                YES -                           39248021
       LR    XR2,XR4                    NO,                             39256021
       SH    XR2,XC060                  D2+DMAX-60                      39264021
       AR    XR2,XR1                    I1-(60-D2-DMAX) INTEGER TO      39272021
       STH   XR2,Y1IND(XR5)             DROPPED BEFORE SCALING DVD.     39280021
       BC    UNCON,XCTD06               X                               39288021
       SPACE 2                                                          39296021
XCTD05 SH    XR6,Y1DBS(XR3)             D2IS GREATER THAN DMAX.         39304021
       LR    XR2,XR6                    I1+DMAX                         39312021
       AH    XR6,XRDMX                  I1+DMAX+DMAX                    39320021
       CH    XR6,XC060                  IS  I1+2DMAX GREATER THAN 6     39328021
       BC    XTWO,XCTD07                YES-                            39336021
       SH    XR2,XC060                  NO,                             39344021
       AH    XR2,Y1DBS(XR3)             XR2 HAS NUMBER OF DECIMAL T     39352021
*                                       DROPPED FROM DIVISOR=D2-(60     39360021
*                                       DMAX).                          39368021
XCTD08 LR    XR0,XR1                                                    39376021
       BAL   XRSUB,XADJCT          UPDATE DIVIDEND BUFFER               39384021
       LR    XR1,XR0                                                    39392021
       LH    XR4,XRDMX                                                  39400021
       AH    XR4,Y1DAS(XR3)             ADJUST DIVD. SCALING FACTOR     39408021
       LH    XR6,Y1ALP(XR5)             X                               39416021
       SR    XR6,XR2                    X                               39424021
       STH   XR6,Y1ALP(XR5)             X                               39432021
       BC    UNCON,XCTD06               X                               39440021
       SPACE 2                                                          39448021
XCTD07 LH    XR2,Y1DBS(XR3)                                             39456021
       SH    XR2,XRDMX                  D2-DMAX                         39464021
       SR    XR4,XR2                    D2+DMAX-(D2-DMAX)= 2DMAX        39472021
       SH    XR4,XC060                  -(60-2DMAX)                     39480021
       AR    XR4,XR1                                                    39488021
       STH   XR4,Y1IND(XR5)             X                               39496021
       BC    UNCON,XCTD08               ADJUST DIVISOR.                 39504021
XCTD0V SR    XR6,XR6                                                    39512021
       BC    UNCON,XCTD1V          CHECK FOR DIVIDEND > 60 DIGITS       39520021
*                                                                       39528021
*                                                                       39536021
         TITLE 'ADD AND SUBTRACT ANALYZER    A  D  D / S  U  B  T  R  AX39544021
                 C  T'                                                  39552021
*            ADD , OR , SUB ANALYZER.                                   39560021
*                                                                       39568021
*                                                                       39576021
       SPACE 5                                                          39584021
       USING *,XRVERB                                                   39592021
XOTADD SR    RW1,RW1                                                    39600021
       BC    UNCON,X0TDDD          THIS IS AN ADD OPERATION             39608021
       SPACE 3                                                          39616021
       USING *,XRVERB                                                   39624021
XOTSUB LR    RW1,GXRA                                                   39632021
       SPACE 3                                                          39640021
X0TDDD BALR  XRVAR,RW0             SET UP ADDRESSABILITY                39648021
       USING *,XRVAR                                                    39656021
XOTDDD BAL   XRSUB,XOTSEL          GET OPERAND INFO INTO BUFFERS        39664021
       LTR   RW1,RW1                                                    39672021
       BC    XZERO,XOTA00          ADD OPERATION                        39680021
       OI    XOPMOD,XXSUB                                               39688021
XOTA00 TM    XOPMOD,XFLOAT              IS IT FLOATING POINT.           39696021
       BC    XTHRE,XOTA01               YES-                            39704021
*                                                                       39712021
XOTCMP EQU   *                          ENTRY FROM COMPARE ROUTINE      39720021
         MVN   X1TYP(LX1),X1VAL+NX15             MAKE                   39728021
         MVN   X2TYP(LX1),X2VAL+NX15      SURE THAT NAX. VALUE OF OPE   39736021
       BAL   XRSUB,LTLTST          ARE BOTH OPERANDS LITERALS           39744021
       BC    UNCON,XOTABR          NO                                   39752021
       BC    UNCON,XOTABQ          YES                                  39760021
XOTABR EQU   *                                                          39768021
         OI    X1VAL+NX15,XX0F           HAVE A + SIGN FOR COMPILE      39776021
         OI    X2VAL+NX15,XX0F           TIME ARITHMETIC.               39784021
XOTABQ EQU   *                                                          39792021
       SPACE 5                                                          39800021
*      XA000    - SCALES TWO OPERANDS FOR ADDITION AND NUMERIC COMP     39808021
*               - AT COMPILE TIME ARITHMETIC.COMPUTE THE MAX.LENGHT     39816021
*               - OPERANDS WILL HAVE AFTER SCALING AT OBJECT TIME.      39824021
*               - DETERMINES IF AN OVERFLOW CAN OCCUR AT OBJECT TIM     39832021
*               - DURING SCALING.                                       39840021
       SPACE 5                                                          39848021
*                                                                       39856021
*  ALIGN OPERAND WHICH HAS THE LEAST DECIMAL PLACES.                    39864021
*                                                                       39872021
         CLC   Y1DBS(LX2,XR3),Y1DBS(XR5)                                39880021
       BC    XGTEQ,XA001           DEC IN 1ST OP >= DEC IN 2ND OP       39888021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      39896021
XA001  LH    XR6,Y1DBS(XR3)                                             39904021
       SH    XR6,Y1DBS(XR5)                                             39912021
       AH    XR6,Y1ALP(XR5)                                             39920021
       STH   XR6,Y1ALP(XR5)                                             39928021
         MVC   Y1DAS(LX2,XR5),Y1DBS(XR3)                                39936021
       BAL   XRSUB,XSCAL           SCALE OPERAND                        39944021
         TM    Y1IRX+NX1(XR5),XGOVFL                                    39952021
       BC    XTHRE,XA003           OVERFLOW IN SCALING                  39960021
XA005  BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      39968021
       BAL   XRSUB,XSCAL           SCALE OPERAND                        39976021
         MVC   Y1DAS(LX2,XR5),Y1DBS(XR5)                                39984021
XAEXIT EQU   *                                                          39992021
       BAL   XRSUB,XRSVAL          RESET OPERAND BUFFER ADDRESSES       40000021
       SPACE 5                                                          40008021
*      XCTADD  - COMPILE TIME ARITHMETIC FOR ADD. OPERAND IN XR3 AN     40016021
*              - XRS ALREADY SCALED.                                    40024021
       SPACE 5                                                          40032021
         MVC   XFDAS(LX2),Y1DAS(XR3)                                    40040021
         TM    X1IRX+NX1,XGOVFL                                         40048021
       BC    XTHRE,XCTA01          OVERFLOW IN SCALING 1ST OPER         40056021
         TM    X2IRX+NX1,XGOVFL                                         40064021
       BC    XTHRE,XCTA01          OVERFLOW IN SCALING 2ND OPER         40072021
*                                       RESULT                          40080021
         ZAP   XFVAL(LX16),X2VAL(LX16)                                  40088021
       BAL   XRSUB,LTLTST          ARE BOTH OPERANDS LITERALS           40096021
       BC    UNCON,XCTA02          NO                                   40104021
       TM    XOPMOD,XXSUB                                               40112021
       BC    XZERO,XCTA02          THIS OPERATION IS AN ADDITION        40120021
         SP    XFVAL(LX16),X1VAL(LX16)                                  40128021
       BC    UNCON,XCTA03          GET SIZES OF RESULT                  40136021
XCTA02   AP    XFVAL(LX16),X1VAL(LX16)                                  40144021
XCTA03 EQU   *                                                          40152021
       LA    XR5,XFVAL                  GET SIZES OF RESULT.            40160021
       BAL   XRSUB,XIDSZ                X                               40168021
         CLI   XIDDN+NX1,XX1E            MORE THAN 30 DIGITS.           40176021
         BH    XCTA00              YES, IT IS 31                        40184021
         MVC   XFLAS(LX6),XIDBY          NO,MOVE SIZES IN RESULT BUF    40192021
       SPACE 2                                                          40200021
XCTAXT EQU   *                                                          40208021
       BAL   XRSUB,XRSVAL          RESET OPERAND BUFFER ADDRESSES       40216021
         MVN   X1VAL+NX15(LX1),X1TYP      RESET SIGN TO ITS TRUE VALU   40224021
         MVN   X2VAL+NX15(LX1),X2TYP      (APPLICABLE FOR LITERAL OPE   40232021
*                                       ONLY).                          40240021
       BAL   XRSUB,XHSMD1          SET MODE OF OPERATION                40248021
       TM    XGSWT,XIDMOD                                               40256021
       BC    XTHRE,XOTA02               - ID MODE.                      40264021
*                                       -  BINARY.                      40272021
       SPACE 2                                                          40280021
       BAL   XRSUB,XBISCL               OBJECT TIME SCALING.            40288021
         CLI   XFBAS+NX1,XX04                                           40296021
       BC    XTWO,XOTA03                DP ADD -                        40304021
       TM    XOPMOD,XXSUB              IS IT A SUBST.                   40312021
       BC    XTHRE,XOTA25          YES                                  40320021
         TM    Y1IRX+NX1(XR3),XINREG    SINGLE PRECISION ADD            40328021
       BC    XTHRE,XOTA04               - IS AT LEAST ONE OF OPERAN     40336021
         TM    Y1IRX+NX1(XR5),XINREG       IN REG.                      40344021
       BC    XZERO,XOTA05          NO                                   40352021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      40360021
XOTA04 BAL   XRSUB,XZBINA               YES - SET-ATEXT                 40368021
       BAL   XR1,XADSUB            GENERATE ADD OR SUBTRACT INST        40376021
XOTA08   MVC   XFTEL(LX6),Y1TEL(XR3)                                    40384021
         NI    XFIRX+NX1,XX2F                                           40392021
       TM    XGSWT,XAROPE              IT IS A COMPARE SUBSTRACTIOM     40400021
       BC    XTHRE,XOTAFN          NO                                   40408021
       TM    XGSWT,XIDMOD               YES,GO AND SET TRANSFER.        40416021
       BC    XZERO,XOTC00               ACCORDING TO SET CONDITION      40424021
XOTC01   MVC   XREG1(LX1),XSPSW          CODE.                          40432021
       L     XRVAR,XCAMPR               X                               40440021
       USING XCOMBG,XRVAR               X                               40448021
       BC    UNCON,XCOM09               X                               40456021
       USING XOTDDD,XRVAR               X                               40464021
XOTC00   CLI   XFBAS+NX1,XX04            X                              40472021
       BC    XNOGT,XOTC01               X                               40480021
       BAL   XRSUB,XZWHIR               X                               40488021
       L     XR4,XLIRP                  X                               40496021
         MVC   XREGNO(LX1),DX3(XR4)       X                             40504021
         L     XR4,DX4(XR4)              X                              40512021
         MVC   XREGNP(LX1),DX3(XR4)       X                             40520021
         B     DX12(XRVERB)       BRANCH TO ..                          40528021
XOTAFN EQU   XFINAL                                                     40536021
*                                                                       40544021
       SPACE 2                                                          40552021
*                                                                       40560021
       SPACE 2                                                          40568021
XOTA25 BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      40576021
XOTA05 BAL   XRSUB,XSLOAS               LOAD XR3 OP. IN  IR.            40584021
       BC    UNCON,XOTA04               X                               40592021
       SPACE 2                                                          40600021
XOTA03 LA    XRSUB,XOTA24                                               40608021
       TM    XOPMOD,XXSUB                                               40616021
       BC    XTHRE,XZX3X5          IF SUBTRACTION  SWITCH OPERANDS      40624021
*                                                                       40632021
         TM    Y1IRX+NX1(XR3),XIN2RE    MAKE SURE DOP1 IS IN A          40640021
       BC    XTHRE,XOTA06               DOUBLE IR , AND THAT  XR5       40648021
         CLI   Y1BAS+NX1(XR3),XX04       IS A DOUBLE WORD OR IN A DO    40656021
       BC    XTWO,XOTA07                REG.                            40664021
XOTA24 EQU   *                                                          40672021
       BAL   XRSUB,XSLODB               X                               40680021
XOTA06   CLI   Y1BAS+NX1(XR5),XX04       X                              40688021
       BC    XTWO,XOTA09                X                               40696021
XOTA07 BAL   XRSUB,XZX3X5               X                               40704021
       BAL   XRSUB,XSLODB               X                               40712021
       TM    XOPMOD,XXSUB                                               40720021
       BC    XZERO,XOTA09          OPERATION IS ADDITION                40728021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      40736021
XOTA09 BAL   XRSUB,XZBINA               SET  A- TEXT                    40744021
         MVC   XUTEM(LX1),XREG1          SAVE VALUE OF HIGH ORDER RE    40752021
       BAL   XR1,XADSUB            GENERATE ADD OR SUBTRACT INST        40760021
*                                                                       40768021
         TM    Y1IRX+NX1(XR5),XINREG     IS  2ND OP IN  IR.             40776021
       BC    XTHRE,XZSL01               YES,                            40784021
         MVI   XPLUS1+NX2,XX04           NO -  SET A-TEXT  WITH         40792021
       BAL   XRSUB,XZBINA                          OP2 + 4.             40800021
       BC    UNCON,XZSL02               -                               40808021
XZSL01 BAL   XRSUB,XZX3X5               SET A-TEXT WITH  LOW ORDER      40816021
       BAL   XR1,XODDRG            GET ODD REG TBL OF EVEN-ODD PAIR     40824021
         MVC   XREG2(LX1),DX3(XR4)        X                             40832021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      40840021
XZSL02 BAL   XR1,XODDRG            GET ODD REG TBL OF EVEN-ODD PAIR     40848021
         MVC   XREG1(LX1),DX3(XR4)                                      40856021
       LA    XRSUB,XOTA60                                               40864021
       TM    XOPMOD,XXSUB               AL , OR , SL                    40872021
       BC    XTHRE,SUBLBI          GENERATE SL                          40880021
       BAL   XRSUB,ADDLBI          GENERATE AL                          40888021
         MVI   XREG1,XX0C                                               40896021
       BC    UNCON,XOTA61          GENERATE A BC INSTRUCTION            40904021
XOTA60   MVI   XREG1,XX03                                               40912021
XOTA61 EQU   *                                                          40920021
*                                                                       40928021
       BAL   XRSUB,XSTLHN                            BC  NOCARY,5GN     40936021
       BAL   XRSUB,BC                   X                               40944021
       SPACE 2                                                          40952021
         MVI   XCON1+NX15,XX01           GENERATE                       40960021
         MVI   XCON1+NX16,XX02                        A   R2P ,ONE      40968021
         MVC   XREG1(LX1),XUTEM                                         40976021
       BAL   XR1,XADSUB            GENERATE AN ADD OR SUBTRACT INST     40984021
*                                                                       40992021
*                                                                       41000021
*                                                                       41008021
       SPACE 2                                                          41016021
*      WRITE OUT LABEL 5GN  *****                                       41024021
         MVC   PH4GN+NX1(LX2),XGNTMP   MOVE GN #                        41032021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 41040021
       BC    UNCON,XOTA08          TEST IF CALLED BY COMPARE            41048021
       SPACE 2                                                          41056021
XOTA02 EQU   *                                                          41064021
       TM    XGSWT,XAROPE               DO NOT SUB IN DATA MAME         41072021
       BC    XZERO,XOTAL1               FOR IF.                         41080021
         TM    XGSWT,XX03                XSIZER+XROUND                  41088021
       BC    XNOEQ,XOTAL1          EITHER OR BOTH                       41096021
       BAL   XRSUB,XMONDV          CHECK IF SIMPLE ADD/SUBT CAN BE      41104021
         TM    XMONDD,XX03                                              41112021
       BC    NOTHR,XOTAL1          CANNOT STORE DIRECTLY                41120021
*                                                                       41128021
*  IS IT     A=A+B  OR   A=A-B  -  IF YES AVOID THE STORE, EXECUTE      41136021
*  THE AP OR  SP INSTRUCTION  WITH A  AS RESULT FIELD.                  41144021
*                                                                       41152021
         NI    DOP5+XGMINC,XXF0                                         41160021
         CLI   DOP5+XGMINC,XXC0    IF STORE TERM IS NOT ID, DO NOT      41168021
       BC    XNOEQ,XOTAL1               STORE RESULT DIRECTLY IN DA     41176021
*                                       NAME .                          41184021
         TM    X1IRX+NX1,XZGNLT   IS FIRST DOP A LIT                    41192021
         BC    R7,XOTAL2          YES                                   41200021
         TM    X2IRX+NX1,XZGNLT   NO, IS SECOND DOP A LIT               41208021
         BC    R7,XOTAL5          YES                                   41216021
       CLI   DOP1,TEMRES         NO, IS THIS AN ADD SERIES              41224021
       BE    XOTAL7              YES                                    41232021
         CLC   DOP5+NX3(LX4),DOP1+NX3  NO, DOES DOP5 = DOP1       43130 41240021
       BE    XOTAL8              YES                                    41248021
XOTAL7 EQU   *                                                          41256021
         CLC   DOP5+NX3(LX4),DOP2+NX3   DOES DOP5 = DOP2          43130 41264021
       BC    XNOEQ,XOTAL1          NO                                   41272021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      41280021
XOTAL3 EQU   *                                                          41288021
         CLC   Y1ALP(LX2,XR3),Y1ALP(XR5)                                41296021
       BC    XTWO,XOTAL1           SCALING FOR 1ST OP > 2ND OP          41304021
       OI    XGNSW,XADABA                                               41312021
       LH    XR2,Y1ALP(XR3)                                             41320021
       LH    XR6,Y1ALP(XR5)                                             41328021
       LCR   XR2,XR2                                                    41336021
       STH   XR2,Y1ALP(XR5)                                             41344021
       BAL   XRSUB,XSCAL           SCALE OPERAND                        41352021
         MVC   Y1LAS(LX6,XR3),Y1LBS(XR3)                                41360021
       AR    XR2,XR6                                                    41368021
         STH   XR2,Y1ALP(XR5)                                           41376021
         XC    Y1ALP(LX2,XR3),Y1ALP(XR3)                                41384021
       BAL   XRSUB,XW000           OBJECT TIME SCALE                    41392021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           41400021
         BAL   XR1,XADSUB          GENERATE ADD OR SUBTRACT INSTR       41408021
       BC    UNCON,XRESTG          BYPASS STORING IR                    41416021
*                                                                       41424021
XOTAL2 EQU   *                                                          41432021
         TM    X2IRX+NX1,XZGNLT   IS DOP2 A LIT                         41440021
       BZ    XOTAL7              NO                                     41448021
XOTAL1 EQU   *                                                          41456021
       BAL   XRSUB,XRSVAL          RESET OPERAND BUFFER ADDRESSES       41464021
*                                                                       41472021
       BAL   XRSUB,XW000           OBJECT TIME SCALE                    41480021
       BAL   XRSUB,LTLTST          ARE BOTH OPERANDS LITERALS           41488021
       BC    UNCON,XOTANL          NO                                   41496021
       LA    XRSUB,XOTAFN                                               41504021
         TM    XFIRX+NX1,XGOVFL                                         41512021
       BC    XZERO,XSETLT          SET RESULT BUFFER FLAGS              41520021
XOTANL EQU   *                                                          41528021
       LA    XRSUB,XOTA21                                               41536021
       TM    XOPMOD,XXSUB                                               41544021
       BC    XTHRE,XZX3X5          SUBT OPERATION  SWITCH OPERANDS      41552021
*                                                                       41560021
*                                                                       41568021
         CLC   Y1TEL+NX1(LX1,XR3),Y1TEL+NX1(XR5)                        41576021
       BC    XONE,XZX3X5           TEMP STOR OF 1ST OP < 2ND OP         41584021
XOTA21   MVC   XYLEN,XFLAS+NX1           MAKE SURE  THAT ONE OP. IS     41592021
       BAL   XRSUB,XYOAF                TEMP LARGE ENOUGH TO HOLD       41600021
         MVC   Y1LAS(LX2,XR3),XFLAS                                     41608021
       BAL   XRSUB,XZSIDA               RESULT.                         41616021
       BAL   XR1,XADSUB            GENERATE ADD OR SUBTRACT INST        41624021
         TM    XFIRX+NX1,XGOVFL          IS THERE A CHANCE TO GET 31    41632021
       BC    XZERO,XOTA08                    DIGITS.  NO-               41640021
       TM    XGSWT,XAROPE                                               41648021
       BC    XZERO,XOTA08          NOT AN ARITHMETIC OPERATION          41656021
       BAL   XRSUB,XEWCL                X                               41664021
         MVC   XWC1(LX2),XEREL1          X                              41672021
         CLI   XFDDP+NX1,XX00            YES - DROP EITHER A DEC. OR    41680021
       BC    XNOEQ,XOTA22          X                                    41688021
         MVI   XIMM,XX0F                 DROP  INTEGER                  41696021
       BAL   XRSUB,NI                            NI  TEMP,X'0F'         41704021
*                                                                       41712021
*      WARNING   POSSIBLE TRUNCATIOM.                                   41720021
*                                                                       41728021
       BAL   XRSUB,ERRPRO          GENERATE TRUNCATION MESSAGE          41736021
       DC    AL1(ERRN11)                                                41744021
       DC    AL1(0)                                                     41752021
*                                                                       41760021
       BC    UNCON,XOTA08          TEST IF CALLED BY COMPARE            41768021
       SPACE 2                                                          41776021
XOTA22   MVC   XWC2(LX2),XEREL1          DROP A DECINAL                 41784021
         MVI   XL1+NX1,XX10                                             41792021
         MVI   XL2+NX1,XX0F                                             41800021
       BAL   XRSUB,MVO                        MVO  TEMP(16),TEMP(15     41808021
       BC    UNCON,XOTA08          TEST IF CALLED BY COMPARE            41816021
       SPACE 2                                                          41824021
XOTAL5 EQU   *                                                          41832021
         CLC   DOP5+NX1(LX4),DOP1+NX4   DOP5 EQ DOP1...           60613 41840021
       BNE   XOTAL1              NO                                     41848021
XOTAL8 EQU   *                                                          41856021
       TM    XOPMOD,XXSUB        IS THIS A SUBTRACTION                  41864021
       BO    XOTAL1                YES                                  41872021
       B     XOTAL3              NO                                     41880021
       EJECT                                                            41888021
*                                                                       41896021
*                                                                       41904021
       SPACE 2                                                          41912021
*                                                                       41920021
*                                                                       41928021
*  FLOATING-POINT ADD OR SUB.                                           41936021
*                                                                       41944021
XOTA01 BAL   XRSUB,FPCVBG          MAKE BOTH OPDS SAME FL PT FORMAT     41952021
       TM    XOPMOD,XXSUB                                               41960021
       BC    XZERO,XOTAF0          ADD OPERATION                        41968021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      41976021
       BAL   XRSUB,FPLOAD          GENERATE A FL PT LOAD                41984021
XOTAF0 BAL   XRSUB,FPLDAN          LOAD 1 OPERAND IF NEITHER IS         41992021
       BAL   XRSUB,FPSETA          SET A-TEXT                           42000021
       LA    XRSUB,FPADDS                                               42008021
         TM    Y1IRX+NX1(XR3),XGDPFP                                    42016021
       BC    XTHRE,FPADD0          OPERATION MUST BE DP                 42024021
       TM    XOPMOD,XXSUB                                               42032021
       BC    XTHRE,SUBNS                SE   OR  SER  .                 42040021
       BC    UNCON,ADFLS                AE   OR  AER  .                 42048021
FPADD0 TM    XOPMOD,XXSUB                                               42056021
       BC    XTHRE,SUBNL                SD   OR  SDR  .                 42064021
       BC    UNCON,ADFLL                AD   OR  ADR  .                 42072021
FPADDS BAL   XRSUB,FPRESF          SET FLAGS IN RESULT BUFFER           42080021
       BC    UNCON,XOTAFN          STORE IR                             42088021
       SPACE 2                                                          42096021
XA003    MVC   XTDEC(LX2),Y1DAS(XR5)     IN CASE OF OVERFLOW COMPUTE    42104021
       BAL   XRSUB,XT000                NUMBER OF INT.TO BE TRUNCAT     42112021
         MVC   Y1IND(LX2,XR5),XTIII     AND NUMBER OF DEC. TO BE        42120021
         MVC   XFVAL(LX16),XC9999        DROPPED                        42128021
       BAL   XRSUB,XSETOP          SET BUFFER TO MAX                    42136021
         CLI   XTDDD+NX1,XX00            IS THERE ANY DECIMAL TO DRO    42144021
       BC    XZERO,XA005                NO-                             42152021
       LH    XR1,Y1ALP(XR5)             YES,DECREASE SCALING FACTOR     42160021
       LH    XR2,XTDDD                  AND REUPDATE BUFFER OPERAND     42168021
       SR    XR1,XR2                    ACCORDING TO .                  42176021
       STH   XR1,Y1ALP(XR5)             X ADJUST FIRST OPERAND.         42184021
       LH    XR1,Y1DAS(XR5)             X                               42192021
       SR    XR1,XR2                    X                               42200021
       STH   XR1,Y1DAS(XR5)             X                               42208021
       BAL   XRSUB,XADJCT               ADJUST 2ND. OPERAND             42216021
       BC    UNCON,XAEXIT          PERFORM COMPILE TIME ARITHMETIC      42224021
       SPACE 2                                                          42232021
XCTA01 EQU   *                                                          42240021
XCTA00 LH    XR6,XFDAS                                                  42248021
       CH    XR6,XRDMX                                                  42256021
       BC    XLOEQ,XCTA04          RESULT DEC <= MAX DEC                42264021
       BCTR  XR6,RW0               DROP 1 DEC PLACE                     42272021
       STH   XR6,XFDAS                                                  42280021
         MVI   XFDDP+NX1,XX01                                           42288021
XCTA05 LA    XR5,XFVAL                                                  42296021
       BAL   XRSUB,XSETOR          SET OPERAND TO MAX                   42304021
       BC    UNCON,XCTAXT          GENERATE INSTRUCTIONS                42312021
XCTA04   MVI   XFIND+NX1,XX01                                           42320021
       BC    UNCON,XCTA05          SET OPERAND TO MAX                   42328021
*                                                                       42336021
       EJECT                                                            42344021
*  BEGINING OF  A WHEN CONDITION  ON A  SEARCH ALL                      42352021
* SET UP TABLE DESCRIPTOR FOR SEARCH ALL OBJECT TIME SUBROUTINE         42360021
* IN TS4 IN TGT.                                                        42368021
*        4 BYTES   ADDR OF TABLE                                        42376021
*        4 BYTES   MAX NO. OF OCCURRENCES                               42384021
*        4BYTES    GN REF FOR 'AT END' ADDRESS                          42392021
*        1 BYTE    (UMB OF KEYS (FROM 'ENDSCHAL' ROUTINE)               42400021
*        1 BYTE    NOT USED                                             42408021
*        2 BYTES   LENGTH OF A TABLE ENTRY                              42416021
*                                                                       42424021
*                                                                       42432021
         USING *,XRVERB                                                 42440021
SEARCHAL CLI   ELEMCT,XX04         FIRST KEY HAS X LEVELS OF OCCURS     42448021
         BL    SCHA08             X=0 OR 1                              42456021
         BE    SCHA00             X=2                                   42464021
*                                 X=3                                   42472021
*                                                                       42480021
* IF TABLE HAS MORE THAN 1 LEVEL OF OCCURS ITS ADDR UP TO THE           42488021
* LOWEST LEVEL MUST BE CALCULATED SO THE SEARCH NEED BE DONE ONLY       42496021
* ON THIS LOWEST LEVEL. ROUTINE 'SSCRPT' IS CALLED TO GENERATE THE      42504021
* NECESSARY CODE. SINCE 'SSCRPT' EXPECTS A VALUE FOR THE LOWEST         42512021
* LEVEL THIS ROUTINE CREATES A DUMMY SUBSCRIPT EQUIVALENT TO THE        42520021
* FIRST OCCURRENCE.                                                     42528021
*                                                                       42536021
* MOVE SUBSCRIPTS OR INDEXES FROM DOPS USED BY THIS ROUTINE TO          42544021
* THOSE EXPECTED BY 'SSCRPT'                                            42552021
         LA    RW1,DOP4                                                 42560021
         MVC   GNHOLD(LX3),DOP3    SAVE 'AT END' ADDR                   42568021
         MVC   DOP3(LDOP),DOP5    CHANGE DOPS TO FIT 'SSCRPT'           42576021
SCHA07   MVC   DOP5(LDOP),DOP2    (DOP2 = HIEST LEVEL SS OR INDX)       42584021
         MVC   DOP2(LDOP),DOP4                                          42592021
         MVC   DX0(LX5,RW1),SCHLIT  SET LAST DOP TO OCCURRENCE=1        42600021
         MVI   SCHSW,XX01          TELL SSCRPT CONTROL COMES FROM       42608021
         ST    XRVERB,SCHOLD      BEG OF WHEN (SEARCHAL)                42616021
         L     XRVERB,ADCN39      ADDR OF 'SSCRPT'                      42624021
         BALR  RETRG,XRVERB       GO TO 'SSCRPT'                        42632021
         MVI   SCHSW,XX00                                               42640021
         MVC   DOP2(LDOP),DOP5    RESTORE DOPS                          42648021
         MVC   DOP3(LX3),GNHOLD                                         42656021
SCHA01   MVI   XCNTR1,TS4CODE                                           42664021
         MVI   XCNTR1+NX2,XX01                                          42672021
         BAL   XRSUB,STORE              ST  0,TS4                       42680021
         MVC   AXTIDK+NX1(LX3),DOP1+NX4   SAVE  I,D,K OF  TABLE.        42688021
*                                                                       42696021
*  SET  OCCURENCE NUMBER  IN TS4.                                       42704021
*                                                                       42712021
         MVI   XREGNO,XX01                                              42720021
         BAL   XRSUB,XFREER        FREE REG ONE                         42728021
         LA    RW3,DOP2                                                 42736021
         CLI   DOP2,XX32           NUMERIC LITERAL...                   42744021
         BE    SCHA02             YES                                   42752021
         BAL   XRSUB,DNTOR1       DATA-NAME.  CONVERT TO BINARY         42760021
SCHA04   MVI   XCNTR1,TS4CODE                                           42768021
         MVI   XCNTR1+NX2,XX05           L   1,OCC-NUMB                 42776021
         MVI   XREG1,XX01                ST  1,TS4+4                    42784021
         BAL   XRSUB,STORE         GENERATE A STORE INSTRUCTION         42792021
*                                                                       42800021
* SET AT END ADDRESS  IN TS4.                                           42808021
*                                                                       42816021
         MVI   XCNTR1,TS4CODE                                           42824021
         MVI   XCNTR1+NX2,XX09                                          42832021
         MVC   XGN2(LX2),DOP3+NX1                                       42840021
         MVI   XL1+NX1,XX04              MVC   TS4+8(4),GN              42848021
         BAL   XRSUB,MVC           GENERATE MVC                         42856021
*                                                                       42864021
*  SET  ENTRY LENGTH.                                                   42872021
*                                                                       42880021
         LA    RW3,DOP1                                                 42888021
         BAL   XRSUB,XLENGH       GET TABLE LENGTH                      42896021
         MVI   XCNTR1,TS4CODE                                           42904021
         MVI   XCNTR1+NX2,XX0F           MVC  TS4+14(2),LENGTH          42912021
         MVI   XL1+NX1,XX02                                             42920021
         CLC   XOPVLC(LX2),XC000   VLC...                               42928021
         BE    SCHA05             NO                                    42936021
         MVI   XCNTR2,XX04                                              42944021
         MVC   XCNTR2+NX1(LX2),XOPVLC                                   42952021
SCHA06   BAL   XRSUB,MVC           GENERATE MVC                         42960021
         XC    AXTLENG(LX6),AXTLENG      INITIALIAZE CELLS FOR SEARC    42968021
         MVI   AXTLENG+NX1,XX01          ALL EQUATE VERB.               42976021
         MVC   AXTDISP(LX2),XC016                                       42984021
         B     PH5CTL            LEAVE 'BEG OF WHEN'                    42992021
*                                                                       43000021
SCHA05   MVC   XCON2+NX14(LX2),XOPLGH+NX2                               43008021
         MVI   XCON2+NX16,XX02                                          43016021
         B     SCHA06              GENERATE MVC                         43024021
*                                                                       43032021
*                                                                       43040021
SCHA02   ST    RW3,OP1                                                  43048021
         MVI   XREG1,XX01                                               43056021
         BAL   XRSUB,LOAD         L  R1,LIT=OCCUR NUMB                  43064021
         B     SCHA04              GENERATE A STORE INSTRUCTION         43072021
*                                                                       43080021
* 2 LEVELS OF OCCURS                                                    43088021
SCHA00   LA    RW1,DOP3                                                 43096021
         MVC   GNHOLD(LX3),DOP3    SAVE 'AT END' ADDR                   43104021
         B     SCHA07             MOVE DOPS,THEN GO TO 'SSCRPT'         43112021
*                                                                       43120021
* 0 OR 1 LEVEL OF OCCURS                                                43128021
SCHA08   MVC   OP1(LX4),XAOPE1                                          43136021
         BAL   XRSUB,LA           * LA R0,TABLE                         43144021
         B     SCHA01             SET UP REST OF CALLING SEQ TO OJTSR   43152021
       EJECT                                                            43160021
*                                                                       43168021
*                                                                       43176021
*                                                                       43184021
*  EQUATE VERB IN SEARCH ALL                                            43192021
*                                                                       43200021
*                                                                       43208021
         USING *,XRVERB                                                 43216021
EQUSCHR  LH    RW0,AXTLENG              SET-UP A-TEXT CELL FOR DISP     43224021
*                                       IN TS2                          43232021
         AH    RW0,AXTCKEY                                              43240021
         STH   RW0,AXTLENG        AXTLENG IS PTR TO NEXT KEY AREA       43248021
*                                                                       43256021
         LA    RW3,DOP2                                                 43264021
         BAL   XRSUB,XLENGH        GET LENGTH OF OPERAND                43272021
         MVC   MYSAVE(LX4),GZERO                                        43280021
         TM    DX7(XR3),SCHASCN    ASCENDING KEY...                     43288021
         BZ    EQU000             NO                                    43296021
         OI    MYSAVE,XX80              SET ASCENDING BIT               43304021
EQU000   CLI   XGTEM2,XGBINR      KEY TYPE BINARY...                    43312021
         BNE   EQU001             NO                                    43320021
         OI    MYSAVE,XX40              SET BINARY FLAG                 43328021
EQU001   CLI   XGTEM2,XGINDC                                            43336021
         BNE   EQU002              NOT ID                               43344021
         OI    MYSAVE,XX20              SET INT DEC FLAG                43352021
EQU002   CLI   XGTEM2,XGEXDC                                            43360021
         BNE   EQU003              NOT ED                               43368021
         OI    MYSAVE,XX10              SET EXT DEC FLAG                43376021
EQU003   TM    MYSAVE,XX70        NUMERIC...                            43384021
         BNZ   EQU004            YES                                    43392021
         OI    MYSAVE,XX08              SET ALPHANUMERIC FLAG           43400021
EQU004   MVC   MYSAVE+NX1(LX1),XOPLGH+NX3 SET LENGTH                    43408021
         MVC   AXTCKEY(LX2),XOPLGH+NX2                                  43416021
         MVC   XGTEM2+NX5(LX3),DOP2+NX4   TAKE  I,D,K OF KEY.           43424021
         MVI   XGTEM2+NX4,XX00                                          43432021
         L     RW0,XGTEM2+NX4                                           43440021
         S     RW0,AXTIDK                                               43448021
         SR    RW1,RW1                                                  43456021
         SRDL  RW0,DX8                                                  43464021
         LTR   RW1,RW1                                                  43472021
         BNE   EQUERR                   KEY NOT AT A FIXED OFFSET       43480021
         STH   RW0,XGTEM2+NX4      = OFFSET                             43488021
         MVC   MYSAVE+NX2(LX2),XGTEM2+NX4 SET OFFSET                    43496021
         LA    RW1,KEYDC                                                43504021
         LH    RW0,AXTKEYN       PICK UP NUMB OF KEYS PROCESSED         43512021
         SLL   RW0,DX2            USE AS INDEX INTO KEY SAVE AREA       43520021
         AR    RW1,RW0                                                  43528021
         MVC   DX0(LX4,RW1),MYSAVE SAVE KEY INFO                        43536021
         LH    RW0,AXTKEYN                                              43544021
         AH    RW0,XC001          INCR COUNT OF KEYS                    43552021
         STH   RW0,AXTKEYN                                              43560021
         CLI   XGTEM2,XX07                                              43568021
         BNH   EQU005              NOT NUMERIC                          43576021
         CLI   XGTEM2,XX0E         2ND OP NOT NUMERIC= KEY NOT NUM      43584021
         BNL   EQU005              NOT NUMERIC                          43592021
         CLI   DOP1,XGIRI          INTERMEDIATE RESULT                  43600021
         BE    EQU010              YES                                  43608021
         CLI   DOP1,XX34           ALPHA LITERAL...                     43616021
         BE    EQU006              YES                                  43624021
         CLI   DOP1,XX36           INDEX NAME...                        43632021
         BE    EQU006              YES                                  43640021
         CLI   DOP1,XX32           NUMERIC LIT...                       43648021
         BE    EQU010              YES                                  43656021
         CLI   DOP1,XX75           FIGCON...                            43664021
         BE    EQU011              YES                                  43672021
         CLI   DOP1,XX39           PLURAL FIGCON...                     43680021
         BE    EQU012              YES                                  43688021
         LA    RW3,DOP1                                                 43696021
         BAL   XRSUB,XLENGH        GET LENGTHS                          43704021
         CLI   XGTEM2,XX07                                              43712021
         BNH   EQU005              NOT NUMERIC                          43720021
         CLI   XGTEM2,XX0E                                              43728021
         BNL   EQU005              NOT NUMERIC                          43736021
EQU010   L     XRVERB,ADCN1D                                            43744021
         USING MOVE,XRVERB                                              43752021
         B     MVCONT             BRANCH TO MOVE ROUTINE                43760021
         DROP  XRVERB                                                   43768021
         USING EQUSCHR,XRVERB                                           43776021
*                                                                       43784021
*                                                                       43792021
EQU005   LA    RW3,DOP2                                                 43800021
         BAL   XRSUB,XLENGH        GET LENGTHS                          43808021
         CLI   DOP1,XX32            NUMERIC LITERAL...                  43816021
         BNE   EQU006              NO                                   43824021
         LA    RW2,DOP1                                                 43832021
         L     XRVAR,AIMINIT0                                           43840021
         USING IMINIT0,XRVAR                                            43848021
         BAL   RETRG,IMLIT         CONVERT NUMERIC LIT TO ALPHA LIT     43856021
         DROP  XRVAR                                                    43864021
EQU006   CLI   DOP1,XX75           FIGCON...                            43872021
         BE    EQU013             YES                                   43880021
         CLI   DOP1,XX39           PLURAL FIGCON...                     43888021
         BE    EQU012             YES                                   43896021
         MVC   OP1(LX4),XAOPE1                                          43904021
EQU017   MVC   SAVEOP,OP1          SAVE ADDR OF CMPRAND DOP       45693 43912021
         MVC   XL1+NX1(LX1),XOPLGH+NX3  SET LNGTH OF MVC          45693 43920021
         MVI   XCNTR1,TS2CODE                                           43928021
         MVC   XCNTR1+NX1(LX2),AXTLENG                                  43936021
         BAL   XRSUB,MVC          * MVC  TS2,DOP                        43944021
* IF ALPHANUMERIC COMPARAND IS SHORTER THAN KEY,PAD WITH BLANKS   45693 43952021
         L     R2,SAVEOP                                          45693 43960021
         SR    R0,R0                                              45693 43968021
         IC    R0,MYSAVE+NX1       PICK UP KEY LNGTH              45693 43976021
         SR    R1,R1                                              45693 43984021
         IC    R1,DX1(R2)          GET LNGTH IF LIT               45693 43992021
         CLI   DX0(R2),XX34        LITERAL..                      45693 44000021
         BE    EQU018              YES                            45693 44008021
         LA    R3,DOP1                                            45693 44016021
         BAL   RETRG,XLENGH        GET LNGTH OF DN                45693 44024021
         IC    R1,XOPLGH+NX3       GET CMPRAND LGTH LIF DN        45693 44032021
EQU018   SR    R0,R1                                              45693 44040021
         LTR   R0,R0               KEY LNGTH GR TH CMPRAND..      45693 44048021
         BNP   PH5CTL              NO                             45693 44056021
* KEY IS LONGER THAN COMPARAND. PAD COMPRAND WITH BLANKS          45693 44064021
* GENERATE LITERAL OF BLANKS IN DOP4                              45693 44072021
         MVI   DOP4,XX34           SET ALPHA LITERAL CODE         45693 44080021
         STC   R0,DOP4+NX1         SET LIT LNGTH                  45693 44088021
         LR    R3,R0                                              45693 44096021
         LA    R2,DOP4+NX2                                        45693 44104021
EQU019   MVI   DX0(R2),XX40        GENERATE LIT OF BLANKS EQ TO   45693 44112021
         LA    R2,DX1(R2)          LNGTH OF DIFFERENCE BTWN       45693 44120021
         BCT   R3,EQU019           KEY AND CMPRAND                45693 44128021
         MVC   OP1(LX4),XAOPE4                                    45693 44136021
         LH    R3,AXTLENG          SET DISPL IN TS2 TO            45693 44144021
         AR    R3,R1               END OF COMPARAND               45693 44152021
         STH   R3,ALIGN                                           45693 44160021
         MVC   XCNTR1+NX1(LX2),ALIGN                              45693 44168021
         MVI   XCNTR1,TS2CODE                                     45693 44176021
         STC   R0,XL1+NX1          SET LNGTH FOR MVC              45693 44184021
         BAL   RETRG,MVC           * MVC TS2(END OF CMPRND),BLANKS45693 44192021
         B     PH5CTL              RETURN TO CONTROL                    44200021
*                                                                       44208021
EQU011   CLI   DOP1+NX1,XXF0                                            44216021
         BE    EQU010              YES                                  44224021
EQU013   LA    RW5,DX1                                                  44232021
         LA    RW1,DOP1+NX1                                             44240021
         B     EQU015              MOVE 1 BYTE                          44248021
EQU012   SR    RW5,RW5                  EXPAND FIGCON                   44256021
         IC    RW5,DOP1+NX1                                             44264021
         LA    RW1,DOP1+NX2                                             44272021
EQU015   MVI   DOP3,XX34                                                44280021
         MVC   DOP3+NX1(LX1),XOPLGH+NX3                                 44288021
         LA    RW2,DOP3+NX2                                             44296021
         LR    RW4,RW5                                                  44304021
       LR    RW0,RW5                                                    44312021
         BCTR  RW5,R0             DECREMENT BY ONE                      44320021
EQU016 EX    RW5,EQUMVC                MOVE                             44328021
         AR    RW4,RW0                                                  44336021
         AR    RW2,RW0                                                  44344021
         C     RW4,XOPLGH                                               44352021
       BL    EQU016                RW4 < XOPLGH                         44360021
         MVC   OP1(LX4),XAOPE3                                          44368021
         B     EQU017              GENERATE MVC                         44376021
*                                                                       44384021
EQUMVC   MVC   DX0(LX0,RW2),DX0(RW1)                                    44392021
*                                                                       44400021
*                                                                       44408021
EQUERR   BAL   RETRG,ERRPRO        GENERATE ERROR MESSAGE               44416021
         DC    AL1(ERRN14)                                              44424021
         DC    AL1(2)             E LEVEL  MESG                         44432021
         B     PH5CTL              DO NOT PROCESS STATEMENT             44440021
*                                                                       44448021
         USING IMINIT0,XRVAR                                            44456021
IMINIT0  EQU   *                                                        44464021
IMLIT    STM   RW2,RW3,IMLSAV                                           44472021
         SR    RW0,RW0                                                  44480021
         LR    RW1,RW0                                                  44488021
         UNPK  IMWORK(LX15),DX4(LX8,RW2)                                44496021
         UNPK  IMWORK+NX14(LX7),DX11(LX4,RW2)  THESE 2 UNPACKS UNPACK 1 44504021
         IC    RW1,DX1(RW2)            BYTES EVEN IF LIT REQUIRES LESS  44512021
         SH    RW1,XC002               GET NO OF BYTES ACTUALLY USED    44520021
         SLL   RW1,DX1                 TO EXRRESS LIT                   44528021
         LA    RW3,IMWORK-NX2(RW1)     CALC ADDR OF BYTE INTO           44536021
         TM    DX1(RW3),XX01           WHICH LAST DIGIT OF LIT          44544021
         BO    IMLIT1                  WAS UNPACKED                     44552021
         OI    DX1(RW3),XXFF           TEST IF SIGN IS '-' OR '+'       44560021
IMLIT1   MVO   DX0(LX1,RW3),DX1(LX1,RW3)   BRANCH IF + MOVE SIGN TO     44568021
         IC    RW1,DX2(RW2)            SIGNPOSITIVE                     44576021
         IC    RW0,DX3(RW2)            STORE NUMBER OF DIGITS AS LONG   44584021
         AR    RW1,RW0                                                  44592021
         STC   RW1,DX1(RW2)            OPERAND POINTED TO BY RW2        44600021
         SR    RW3,RW1                 //34/LENGTH/UNPACKED LIT//       44608021
         MVC   DX2(LX18,RW2),DX1(RW3)                                   44616021
         MVI   DX0(RW2),XX34                                            44624021
         LM    RW2,RW3,IMLSAV                                           44632021
         BR    RETRG                   EXIT                             44640021
         DROP  XRVAR                                                    44648021
       EJECT                                                            44656021
*  END OF WHEN                                                          44664021
*                                                                       44672021
*   INPUT- DOP1 DN=TABLE                                                44680021
*          DOP2 INDEX FOR LEVEL BEING SEARCHED                          44688021
*                                                                       44696021
         USING *,XRVERB                                                 44704021
ENDSCHAL MVI   XCNTR1,TS4CODE                                           44712021
         MVI   XCNTR1+NX2,XX0D    MOVE TOTAL NUMB OF KEYS TO            44720021
         LH    RW0,AXTKEYN        TABLE DESCRIPTOR IN TS4               44728021
         STC   RW0,XIMM                                                 44736021
         BAL   XRSUB,MVI           GENERATE MVI                         44744021
         SLA   RW0,DX2                                                  44752021
         AH    RW0,XC012                                                44760021
         C     RW0,TS4MAX                                               44768021
         BL    ENDSCH01            DO NOT STORE INTO TS4MAX             44776021
         STH   RW0,TS4MAX                                               44784021
ENDSCH01 EQU   *                                                        44792021
         LH    RW0,AXTLENG                                              44800021
         AH    RW0,AXTCKEY        GET TOTAL OF TS2 NEEDED               44808021
         CH    RW0,TS2MAX         ENUF TS2 CELLS ALLOCATED...           44816021
         BNH   ENDSCH03           YES                                   44824021
         STH   RW0,TS2MAX         NO, UP COUNT OF TS2                   44832021
ENDSCH03 EQU   *                                                        44840021
* GENERATE CALLING SEQUENCE TO SEARCH ALL SUBROUTINE                    44848021
*                                                                       44856021
*                    LA     0,KEYFIELD                                  44864021
*                    LA     1,TABLE DESCRIPTOR                          44872021
*                    CNOP   2,4                                         44880021
*                    L      15,V(ILBOSCH0)                              44888021
*                    BALR   14,15                                       44896021
*                    DC     X'NN'      TYPE OF FIRST KEY                44904021
*                    DC     X'NN'      LENGTH OF FIRST KEY              44912021
*                    DC     X'NNNN'    OFFSET OF FIRST KEY              44920021
*                    DC     ...                                         44928021
*                    DC     ...        SAME INFO FOR OTHER KEYS         44936021
*                    DC     ...                                         44944021
*                                                                       44952021
         MVI   XCNTR1,TS2CODE                                           44960021
         MVI   XCNTR1+NX2,XX01                                          44968021
         BAL   XRSUB,LA           LA   0,TS2=1                          44976021
         MVI   XREG1,XX01                                               44984021
         MVI   XCNTR1,TS4CODE                                           44992021
         MVI   XCNTR1+NX2,XX01                                          45000021
         BAL   XRSUB,LA           LA   1,TS4=1                          45008021
         BAL   XRSUB,DICNOP        CNOP   2,4                           45016021
         BAL   XRSUB,VBADCE       L   15,V(ILBOSCH0)                    45024021
         DC    CL4'SCH0'          BALR   14,15                          45032021
* GENERATE A DC OF EACH KEY BEING TESTED                                45040021
         LH    RW1,AXTKEYN       PICKUP NUMB OF KEYS                    45048021
         LTR   RW1,RW1            ANY DC'S TO BE GENERATED...           45056021
         BZ    PH5CTL             NO, EXIT                              45064021
         LA    RW2,KEYDC                                                45072021
ENDSCH02 EQU   *                                                        45080021
         MVI   XCON1,XX04                                               45088021
         MVC   XCON1+NX1(LX4),DX0(RW2)                                  45096021
         MVI   XIMM,MDC                                                 45104021
         BAL   XRSUB,MACRO       * DC  XL4'KEY INFO'                    45112021
         AH    RW2,XC004                                                45120021
         BCT   RW1,ENDSCH02        FALL THRU IF NO MORE DCS             45128021
*                                                                       45136021
* GENERATE CODE TO SET THE INDEX FOR THE LEVEL BEING SEARCHED TO        45144021
* THE TABLE ENTRY FOUND IN THE SUBROUTINE (POINTED TO BY R0 ON RETURN   45152021
* FROM THE SUBROUTINE)                                                  45160021
*                                                                       45168021
         CLI   ELEMCT,XX01                                              45176021
         BNE   PH5CTL      ********************************             45184021
         MVI   BDISP1,XX10                                              45192021
         MVI   XREG1,XX01                                               45200021
         BAL   RETRG,LOAD         * L   1,0(1)  (PICK UP TBL ADDR)      45208021
         MVI   XREG2,XX01                                               45216021
         BAL   RETRG,SUB          * SR  0,1                             45224021
         MVC   OP1,XAOPE1                                               45232021
         BAL   RETRG,STORE        * ST  0,INDEX-NAME                    45240021
         B     PH5CTL            LEAVE 'END OF WHEN'                    45248021
WRITE    DS    0H                                                 59733 45256021
REWRIT   DS    0H                                                 59733 45264021
*                                                                 59733 45272021
*        DUMMY WRITE/REWRITE ROUTINE TO ELIMINATE XREF ELEMENT    59733 45280021
*        DUPLICATION DUE TO TWIN STRINGS FOR FROM OPTION.         59733 45288021
*                                                                 59733 45296021
         USING *,XRVERB                                           59733 45304021
         TM    WRITSW,XX01         SECOND STRING...               59733 45312021
         BO    SCNDSTRG            YES                            59733 45320021
         CLC   DOP4(LX2),ONZERO         MOVE EXPECTED...          59733 45328021
         BE    SCNDSTRG            NO                             59733 45336021
         OI    WRITSW,XX01         YES, INDICATE SO               59733 45344021
         B     PH5BVB              HOUSEKEEPING                   59733 45352021
SCNDSTRG DS    0H                                                 59733 45360021
         NI    WRITSW,X'FF'-XX01        TURN OFF SWITCH           59733 45368021
         B     PH5BVB              HOUSEKEEPING                   59733 45376021
      EJECT                                                             45384021
         TITLE 'COMPARE VERB ANALYZER   C  O  M  P  A  R  E'            45392021
IKF50C CSECT                                                            45400021
*      EQUAL  COMPARISON FOR NUMERIC.                                   45408021
*                                                                       45416021
*                                                                       45424021
       USING *,XRVERB                                                   45432021
PEQNUM EQU   *                                                          45440021
       MVI   XCPSW,XZERO                SET TRANSFER CODES FOR DIRE     45448021
       MVI   XSPSW,XZERO                COMPARISON,OR FOR COMPARISO     45456021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                45464021
*      SET  3  TRANSFER CODES  IN CASE  OF BINARY DP COMPARE.           45472021
         MVI   XT1,XX00                                                 45480021
       MVI   XT2,XNOEQ                  GO TO  DP BINARY COMPARE.       45488021
       MVI   XT3,XZERO                  X                               45496021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    45504021
*                                                                       45512021
       SPACE 5                                                          45520021
*      NOT EQUAL COMPARISON FOR NUMERIC                                 45528021
*                                                                       45536021
*                                                                       45544021
       USING *,XRVERB                                                   45552021
NEQNUM EQU   *                                                          45560021
       MVI   XCPSW,XNOEQ                                                45568021
       MVI   XSPSW,XNOEQ                                                45576021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                45584021
*  SET  3 TRANSFER CODES IN CASE OF DP BINARY COMPARE.                  45592021
*                                                                       45600021
       MVI   XT1,XNOEQ                                                  45608021
         MVI   XT2,XX00                                                 45616021
       MVI   XT3,XNOEQ                                                  45624021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    45632021
*                                                                       45640021
       SPACE 5                                                          45648021
*      GREATER THAN  COMPARE FOR NUMERIC.                               45656021
*                                                                       45664021
*                                                                       45672021
       USING *,XRVERB                                                   45680021
PGTNUM EQU   *                                                          45688021
       MVI   XCPSW,XTWO                                                 45696021
       MVI   XSPSW,XONE                                                 45704021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                45712021
*   SET 3 TRANSFER CODES  IN CASE OF DP BINARY COMPARE.                 45720021
*                                                                       45728021
       MVI   XT1,XONE                                                   45736021
         MVI   XT2,XX00                                                 45744021
         MVI   XT3,XX00                                                 45752021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    45760021
*                                                                       45768021
       SPACE 5                                                          45776021
*      NON  GREATER THAN COMPARE FOR NUMERIC FIELD.                     45784021
*                                                                       45792021
*                                                                       45800021
       USING *,XRVERB                                                   45808021
NGTNUM EQU   *                                                          45816021
       MVI   XCPSW,XNOGT                                                45824021
       MVI   XSPSW,XGTEQ                                                45832021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                45840021
*      SET   3 TRANSFER CODES IN CASE OF DP BINARY COMPARE.             45848021
*                                                                       45856021
       MVI   XT1,XGTEQ                                                  45864021
         MVI   XT2,XX00                                                 45872021
         MVI   XT3,XX00                                                 45880021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    45888021
*                                                                       45896021
       SPACE 5                                                          45904021
*      LESS THAN COMPARE FOR NUMERIC FIELD.                             45912021
*                                                                       45920021
*                                                                       45928021
       USING *,XRVERB                                                   45936021
PLTNUM EQU   *                                                          45944021
       MVI   XCPSW,XONE                                                 45952021
       MVI   XSPSW,XTWO                                                 45960021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                45968021
*      SET 3 TRANSFER CODES FOR DP BINARY COMPARE.                      45976021
*                                                                       45984021
       MVI   XT1,XTWO                                                   45992021
       MVI   XT2,XONE                                                   46000021
       MVI   XT3,XNOEQ                                                  46008021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    46016021
*                                                                       46024021
       SPACE 5                                                          46032021
*      NOT LESS THAN COMPARE FOR NUMERIC FIELD.           >             46040021
*                                                                       46048021
*                                                                       46056021
       USING *,XRVERB                                                   46064021
NLTNUM EQU   *                                                          46072021
       MVI   XCPSW,XGTEQ                                                46080021
       MVI   XSPSW,XNOGT                                                46088021
       BC    UNCON,XC0MBG          GO TO COMMON ANALYZER                46096021
*      SET 3 TRANSFER CODES FOR DP BINARY COMPARE.                      46104021
*                                                                       46112021
       MVI   XT1,XONE                                                   46120021
       MVI   XT2,XTWO                                                   46128021
       MVI   XT3,XZERO                                                  46136021
       BC    UNCON,XBDP0P          GENERATE TRANSFER                    46144021
*                                                                       46152021
       SPACE 5                                                          46160021
XC0MBG BALR  XRVAR,RW0             SET UP ADDRESSABILITY                46168021
       USING *,XRVAR                                                    46176021
XCOMBG EQU   *                                                          46184021
       SPACE 2                                                          46192021
         BAL   XRSUB,XOTSEL        GET OPERAND INFO INTO BUFFERS        46200021
       XI    XGSWT,XAROPE                                               46208021
       TM    XOPMOD,XFLOAT                                              46216021
       BC    XTHRE,COMPFL               FLOATING POINT COMPARE.         46224021
       BAL   XRSUB,LTLTST          ARE BOTH OPERANDS LITERALS           46232021
       BC    UNCON,XCOM03          NO                                   46240021
*                                                                       46248021
*            ERROR NUMBER 13.                                           46256021
*                                                                       46264021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               46272021
       DC    AL1(ERRN13)                                                46280021
       DC    AL1(2)                                                     46288021
       BC    UNCON,PH5CTL          RETURN TO CONTROL                    46296021
XCOM03 EQU   *                                                          46304021
         TM    Y1IRX+NX1(XR5),XLITZR     CHECK FOR COMPARISON WITH      46312021
       BC    XTHRE,XCOM00               ZERO LITERAL.                   46320021
         TM    Y1IRX+NX1(XR3),XLITZR     X                              46328021
       BC    XTHRE,XCOM00               X                               46336021
         CLC   Y1DBS+NX1(LX1,XR3),Y1DBS+NX1(XR5)                        46344021
       BC    XNOEQ,XCOM01          NUMBER OF DEC IN OPDS NOT EQUAL      46352021
         CLC   Y1ALP+NX1(LX1,XR3),Y1ALP+NX1(XR5)                        46360021
       BC    XNOEQ,XCOM01          SCALING FACTOR OF OPDS NOT EQUAL     46368021
*      BOTH  FIELD ARE ALIGNED - COMPARE THEM DIRECTLY.                 46376021
*                                                                       46384021
XCOM00   MVI   X1ALP+NX1,XX00                                           46392021
         MVI   X2ALP+NX1,XX00                                           46400021
       BAL   XRSUB,XHSMD1               SET MODE.                       46408021
       TM    XGSWT,XIDMOD                                               46416021
       BC    NOTHR,XCOM02          BINARY MODE                          46424021
       BAL   XRSUB,XW000                X                               46432021
       BAL   XRSUB,XZSIDB               X                               46440021
XCOM08 BAL   XRSUB,COMP                      CP  OP1,OP2   OR           46448021
*                                                                       46456021
* ---------------------                                                 46464021
COMPF0 EQU   *                                                          46472021
         MVC   XREG1(LX1),XCPSW               C(H)XR, OP2               46480021
XCOM09   MVC   XGN1(LX2),DOP3+NX1                                       46488021
*                                                                       46496021
       BAL   XRSUB,BC                        BC COND,4GN                46504021
       BC    UNCON,XRESTG          REL REG AND TEMP STOR USED           46512021
*                                                                       46520021
       SPACE 2                                                          46528021
XCOM02   CLI   X1BBS+NX1,XX04            FOR DP  BINARY  GENERATE A     46536021
       BC    XTWO,XCOM01                SUBSTRACTION IN ANY CASES.      46544021
         CLI   X2BBS+NX1,XX04            X                              46552021
       BC    XTWO,XCOM01                X                               46560021
         BAL   XRSUB,XBISCL        CONVERT TO BINARY IF NECESSARY       46568021
         BAL   XRSUB,XSLOAS        L  XR,OP1                            46576021
       BAL   XRSUB,XZBINB          SET A-TEXT                           46584021
       BC    UNCON,XCOM08               GENERATE COMPARE.               46592021
       SPACE 2                                                          46600021
*                                                                       46608021
*                                                                       46616021
*  FLOATING -POINT COMPARE.                                             46624021
*                                                                       46632021
COMPFL BAL   XRSUB,FPCVBG          MAKE BOTH FL PT OPDS SAME FORMAT     46640021
       BAL   XRSUB,FPLOAD          LOAD ONE OPERAND INTO A REG          46648021
       BAL   XRSUB,FPSETA          SET A-TEXT                           46656021
       LA    XRSUB,COMPF0                                               46664021
         TM    Y1IRX+NX1(XR3),XGDPFP                                    46672021
       BC    XTHRE,CMPFLL               CE   OR  CER.                   46680021
       BC    UNCON,CMPFLS               CD   OR  CDR.                   46688021
       SPACE 5                                                          46696021
XCOM01 OI    XOPMOD,XXSUB               GENERATE A SUBSTRACT            46704021
       L     XRVAR,XATADD                                               46712021
       USING XOTDDD,XRVAR                       OP2 -OP1                46720021
       BC    UNCON,XOTCMP          GO TO SUBTRACT ROUTINE               46728021
       USING XCOMBG,XRVAR                                               46736021
       SPACE 2                                                          46744021
       SPACE 5                                                          46752021
*      XBDPCP  - GENERATE  TRANSFER AND TEST ON A DP BINARY DIFEREN     46760021
*                                                                       46768021
*                                                                       46776021
XBDP0P BALR  XRVAR,RW0             SET UP ADDRESSABILITY                46784021
       USING *,XRVAR                                                    46792021
*                                                                       46800021
         MVC   XREG1(LX1),XREGNO         GENERATE                       46808021
         MVC   XREG2(LX1),XREGNO                 LTR   XR0,XR0          46816021
       BAL   XRSUB,LTRBI           GENERATE LTR                         46824021
         CLI   XT1,XX00                                                 46832021
       BC    XZERO,XBDPZ1          NO TRANSFER                          46840021
         MVC   XGN1(LX2),DOP3+NX1  GET PH4 TRANSFER                     46848021
         MVC   XREG1(LX1),XT1                                           46856021
       BAL   XRSUB,BC                        BC 1COND,4GN               46864021
XBDPZ1   CLI   XT2,XX00                                                 46872021
       BC    XZERO,XBDPZ2          NO TRANSFER                          46880021
       BAL   XRSUB,XSTLHN                 GET A PHASE 5  GN.            46888021
         MVC   XREG1(LX1),XT2                                           46896021
       BAL   XRSUB,BC                        BC 2COND,5GN               46904021
XBDPZ2   CLI   XT3,XX00                                                 46912021
       BC    XZERO,XBDPZ3          NO TRANSFER                          46920021
         MVC   XREG1(LX1),XREGNP      LTR   XR1,XR1                     46928021
         MVC   XREG2(LX1),XREGNP         X                              46936021
       BAL   XRSUB,LTRBI                X                               46944021
         MVC   XREG1(LX1),XT3                                           46952021
         MVC   XGN1(LX2),DOP3+NX1  BC  COND,4GN                         46960021
       BAL   XRSUB,BC              GENERATE BC                          46968021
XBDPZ3 EQU   *                                                          46976021
         CLI   XT2,XX00                                                 46984021
       BC    XZERO,XBDPZ4          NO TRANSFER                          46992021
         MVC   PH4GN+NX1(LX2),XGNTMP   MOVE GN #                        47000021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 47008021
XBDPZ4 EQU   *                                                          47016021
       BC    UNCON,XRESTG          REL REG AND TEMP STOR USED           47024021
*                                                                       47032021
         TITLE 'IKFCBL50: INDEX COMPARE VERB ANALYZERS'           51894 47040021
*                                                                 51894 47048021
*                                                                 51894 47056021
* RELATION CONDITION INVOLVING INDEX-NAMES.                       51894 47064021
*                                                                 51894 47072021
*                                                                 51894 47080021
* INPUT:  DOP1 = 1ST OP       DOP2 = 2ND OP       DOP3 = GN       51894 47088021
*                                                                 51894 47096021
*                                                                 51894 47104021
         USING *,XRVERB                                           51894 47112021
IFINEQUA MVI   IFINCODE,XZERO                                     51894 47120021
         MVI   IFINCOD2,XZERO                                     51894 47128021
         B     IFINCOMR            BR TO COMMON IF ROUTINE        51894 47136021
*                                                                 51894 47144021
*                                                                 51894 47152021
         USING *,XRVERB                                           51894 47160021
IFINNEQU MVI   IFINCODE,XNOEQ                                     51894 47168021
         MVI   IFINCOD2,XNOEQ                                     51894 47176021
         B     IFINCOMR            BR TO COMMON IF ROUTINE        51894 47184021
*                                                                 51894 47192021
*                                                                 51894 47200021
         USING *,XRVERB                                           51894 47208021
IFINGREA MVI   IFINCODE,XTWO                                      51894 47216021
         MVI   IFINCOD2,XONE                                      51894 47224021
         B     IFINCOMR            BR TO COMMON IF ROUTINE        51894 47232021
*                                                                 51894 47240021
*                                                                 51894 47248021
         USING *,XRVERB                                           51894 47256021
IFINNGRE MVI   IFINCODE,XNOGT                                     51894 47264021
         MVI   IFINCOD2,XGTEQ                                     51894 47272021
         B     IFINCOMR            BR TO COMMON IF ROUTINE        51894 47280021
*                                                                 51894 47288021
*                                                                 51894 47296021
         USING *,XRVERB                                           51894 47304021
IFINLESS MVI   IFINCODE,XONE                                      51894 47312021
         MVI   IFINCOD2,XTWO                                      51894 47320021
         B     IFINCOMR            BR TO COMMON IF ROUTINE        51894 47328021
*                                                                 51894 47336021
*                                                                 51894 47344021
         USING *,XRVERB                                           51894 47352021
IFINNLES MVI   IFINCODE,XGTEQ                                     51894 47360021
         MVI   IFINCOD2,XNOGT                                     51894 47368021
*                                                                 51894 47376021
*                                                                 51894 47384021
*  COMMON  IF  ROUTINE - TRANSFER CODE IS IN IFINCODE. IF OPERANDS51894 47392021
*  ARE  EXCHANGED THIS CODE WILL BE INVERTED.                     51894 47400021
*                                                                 51894 47408021
*                                                                 51894 47416021
IFINCOMR BALR  XRVERB,RW0          ESTABLISH ADDRESSABILITY       51894 47424021
         USING *,XRVERB                                           51894 47432021
         LA    XR4,DOP1                                           51894 47440021
         LA    XR6,DOP2                                           51894 47448021
         CLI   DX0(RW4),XX36                                      51894 47456021
         BE    IFIN000             PROCESS INDEX NAME             51894 47464021
         BAL   XRSUB,XZX4X6        EXCHANGE OPERAND.              51894 47472021
         XC    IFINCODE(LX1),IFINCOD2    REVERSE TRANSFER CODE    51894 47480021
         XC    IFINCOD2(LX1),IFINCODE                             51894 47488021
         XC    IFINCODE(LX1),IFINCOD2                             51894 47496021
         CLI   DX0(RW4),XX36                                      51894 47504021
         BNE   IFIN001             NONE OF THE OPERANDS IS AN     51894 47512021
*                                  INDEX-NAME - THEY BOTH HAVE    51894 47520021
*                                  BE INDEX DATA ITEM.            51894 47528021
*                                                                 51894 47536021
*   INDEX NAME AND INDEX NAME      OR                             51894 47544021
*        -     -  INDEX DATA ITEM  -                              51894 47552021
*        -     -  IDENTIFIER                                      51894 47560021
*                                                                 51894 47568021
*                                                                 51894 47576021
IFIN000  CLI   DX0(RW6),XX36                                      51894 47584021
         BE    IFIN002             TWO INDEX NAME.                51894 47592021
         CLI   DX0(RW6),XGIRI      INTERMEDIATE RESULT            51894 47600021
         BE    IFIN007             YES                            51894 47608021
IFIN010  DS    0H                                                 51894 47616021
         LR    RW5,RW4                                            51894 47624021
         MVI   XREGNO,XX01                                        51894 47632021
         BAL   XRSUB,XFREER        FREE REG 1                     51894 47640021
         LR    RW4,RW5                                            51894 47648021
         CLI   DX0(RW6),XX32       LITERAL.                       51894 47656021
         BNE   IFIN005             NO                             51894 47664021
         MVI   XREG1,XX01                                         51894 47672021
         ST    RW6,OP1                                            51894 47680021
         BAL   XRSUB,LOAD          GEN  L  1,LIT                  51894 47688021
         B     IFIN006             CONTINUE                       51894 47696021
IFIN005  DS    0H                                                 51894 47704021
         CLI   DX0(RW6),XGFCT      FIGCON...                      51894 47712021
         BNE   IFIN003             NO                             51894 47720021
         MVI   XREG1,XX01          YES, FIGCON MUST BE ZERO       51894 47728021
         MVI   XREG2,XX01          INSTEAD OF  L  1,=F'0'         51894 47736021
         BAL   RETRG,SR            GENERATE   SR  1,1             51894 47744021
         B     IFIN006             CONTINUE                       51894 47752021
IFIN003  DS    0H                                                 51894 47760021
         LR    RW3,RW6                                            51894 47768021
         BAL   XRSUB,XLENGH        GET LENGTH OF DNM              51894 47776021
         CLI   XGTEM2,SETINDI                                     51894 47784021
         BE    IFIN001             DIRECT COMPARE.                51894 47792021
         BAL   XRSUB,DNTOR1        L   1,IDENT                    51894 47800021
IFIN006  DS    0H                                                 51894 47808021
         MVI   XREG1,XX01          BCTR 1,0                       51894 47816021
         BAL   XRSUB,BRNCNT        GEN ATXT FOR BCTR INSTRUC      51894 47824021
         LR    RW3,RW4                                            51894 47832021
         BAL   XRSUB,SETLEN        MH   1,L1                      51894 47840021
         MVI   XREG1,XX01                                         51894 47848021
         BAL   XRSUB,MULT          GEN ATXT FOR MULTIPLY INSTRUC  51894 47856021
         MVC   IFINCODE(LX1),IFINCOD2   REVERSE TRANSFER CODE     51894 47864021
         ST    RW4,OP1                                            51894 47872021
         MVI   XREG1,XX01                                         51894 47880021
         BAL   XRSUB,COMP          C   1,INDX                     51894 47888021
*                                                                 51894 47896021
*                                                                 51894 47904021
IFIN004  DS    0H                                                 51894 47912021
         MVC   XREG1(LX1),IFINCODE                                51894 47920021
         MVC   XGN1(LX2),DOP3+NX1  BC  CODE,GN                    51894 47928021
         BAL   XRSUB,BC            GEN ATXT FOR BC INSTRUC        51894 47936021
         CLI   XRESTGSW,XX01       COMPARE INDEX TO INTR RES      51894 47944021
         MVI   XRESTGSW,XX00                                      51894 47952021
         BNE   PH5CTL              NO                             51894 47960021
         B     XRESTG              YES, RELEASE STORAGE           51894 47968021
*                                                                 51894 47976021
*                                                                 51894 47984021
*                                  TWO INDEX-NAMES.               51894 47992021
IFIN002  DS    0H                                                 51894 48000021
         LR    RW5,RW4             SAVE R4 OVER XFREEP            51894 48008021
         MVI   XREGNO,XX01                                        51894 48016021
         BAL   XRSUB,XFREER        FREE REG 1                     51894 48024021
         MVI   XREGNO,XX02                                        51894 48032021
         BAL   XRSUB,XFREER        FREE REG 2                     51894 48040021
         MVI   XREGNO,XX03                                        51894 48048021
         BAL   XRSUB,XFREER        FREE REG 3                     51894 48056021
         LR    RW4,RW5                                            51894 48064021
         MVI   XREG1,XX02                                         51894 48072021
         ST    RW4,OP1                                            51894 48080021
         BAL   XRSUB,LOAD          L   2,INDX1                    51894 48088021
         MVI   BDISP1+NX1,XX20                                    51894 48096021
         MVI   XREG1,XX02                                         51894 48104021
         BAL   XRSUB,SRDA          SRDA 2,32                      51894 48112021
         LR    RW3,RW4                                            51894 48120021
         BAL   XRSUB,SETLEN        SET ATXT BUFFER                51894 48128021
         BAL   XRSUB,LOAD          LH   0,L1                      51894 48136021
         MVI   XREG1,XX02                                         51894 48144021
         BAL   XRSUB,DIV           DR   2.0                       51894 48152021
         ST    RW6,OP1                                            51894 48160021
         BAL   XRSUB,LOAD          L   0,INDX2                    51894 48168021
         MVI   BDISP1+NX1,XX20                                    51894 48176021
         BAL   XRSUB,SRDA          SRDA   0,32                    51894 48184021
         LR    RW3,RW6                                            51894 48192021
         BAL   XRSUB,SETLEN        SET ATXT BUFFER                51894 48200021
         MVI   XREG1,XX02          LH   2,L2                      51894 48208021
         BAL   XRSUB,LOAD          GEN ATXT FOR LOAD INSTRUC      51894 48216021
         MVI   XREG2,XX02                                         51894 48224021
         BAL   XRSUB,DIV           DR   0,2                       51894 48232021
         MVI   XREG1,XX03                                         51894 48240021
         MVI   XREG2,XX01                                         51894 48248021
         BAL   XRSUB,COMP          GEN CR   3,1                   51894 48256021
         B     IFIN004             GEN BC CODE,GN                 51894 48264021
*                                                                 51894 48272021
*   COMPARE WITHOUT CONVERSION.                                   51894 48280021
*                                                                 51894 48288021
IFIN001  DS    0H                                                 51894 48296021
         ST    RW4,OP1                                            51894 48304021
         ST    RW6,OP2                                            51894 48312021
         MVI   XL1+NX1,XX04        CLC   OP1(4),OP2               51894 48320021
         BAL   XRSUB,CLC           GEN ATXT FOR CLC INSTRUC       51894 48328021
         B     IFIN004             GEN BC CODE,GN                 51894 48336021
*                                                                 51894 48344021
*                                                                 51894 48352021
IFIN007  DS    0H                                                 51894 48360021
         LR    RW3,RW6                                            51894 48368021
         BAL   XRSUB,XSETVQ        GET INTR RES INFO              51894 48376021
         MVI   X1TEL+NX1,XX00                                     51894 48384021
         TM    X2IRX+NX1,XZGNLT    IS IT A LITERAL                51894 48392021
         BZ    IFIN008             NO                             51894 48400021
         MVC   DX0(LX3,RW6),SCHLITX                               51894 48408021
         ZAP   DX3(LX5,RW6),X2VAL+NX12(LX4)                       51894 48416021
         B     IFIN010             YES, TREAT AS 32 ELEMENT       51894 48424021
IFIN008  DS    0H                                                 51894 48432021
         MVI   XRESTGSW,XX01                                      51894 48440021
         TM    X2IRX+NX1,XINREG    INTR RES IN A REG              51894 48448021
         BO    IFIN009             YES                            51894 48456021
         LR    RW5,RW4                                            51894 48464021
         MVI   XREGNO,XX01                                        51894 48472021
         BAL   XRSUB,XFREER        FREE REG 1                     51894 48480021
         LR    RW4,RW5                                            51894 48488021
         LA    XR3,X2VAL           NO                             51894 48496021
         BAL   XRSUB,XEWCL         GET TS SLOT                    51894 48504021
         LH    XR3,XEREL1                                         51894 48512021
         AH    XR3,XYTEL                                          51894 48520021
         SH    XR3,XC008                                          51894 48528021
         STH   XR3,XWC1                                           51894 48536021
         MVI   XREG1,XX01                                         51894 48544021
         BAL   XRSUB,CVB           GEN  CVB  1,TS                 51894 48552021
         B     IFIN006             GEN BCTR                       51894 48560021
IFIN009  DS    0H                                                 51894 48568021
         UNPK  XREG2(LX1),X2IRX(LX1)                              51894 48576021
         NI    XREG2,HIBITS                                       51894 48584021
         CLI   XREG2,XX01          ALREADY IN REG 1               51894 48592021
         BNE   IFIN011             NO, GEN  LR  1,REG             51894 48600021
         MVI   XREG2,XX00          YES                            51894 48608021
         B     IFIN006             GEN BCTR                       51894 48616021
IFIN011  DS    0H                                                 51894 48624021
         LR    RW5,RW4                                            51894 48632021
         MVI   XREGNO,XX01                                        51894 48640021
         BAL   XRSUB,XFREER        FREE REG 1                     51894 48648021
         LR    RW4,RW5                                            51894 48656021
         MVI   XREG1,XX01                                         51894 48664021
         BAL   XRSUB,LOAD          GEN  LR  1,REG                 51894 48672021
         B     IFIN006             CONTINUE                       51894 48680021
*                                                                 51894 48688021
*                                                                 51894 48696021
SETLEN   DS    0H                                                 51894 48704021
         TM    DX2(RW3),XX80       VLC                            51894 48712021
         BO    SETLEN1             YES                            51894 48720021
         MVI   XCON1+NX16,XX02     NO                             51894 48728021
         MVC   XCON1+NX14(LX2),DX5(RW3)                           51894 48736021
         BR    XRSUB               RETURN                         51894 48744021
SETLEN1  DS    0H                                                 51894 48752021
         MVI   XCNTR1,XX04                                        51894 48760021
         MVC   XCNTR1+NX1(LX2),DX5(RW3)                           51894 48768021
         BR    XRSUB               RETURN                         51894 48776021
*                                                                 51894 48784021
*                                                                 51894 48792021
         TITLE 'MOVE VERB ANALYZER      M  O  V  E'                     48800021
IKF50G   CSECT                                                    51894 48808021
*                                                                       48816021
*      MOVE     - MOVE  VERB                                            48824021
*                                                                       48832021
*                                                                       48840021
*                                                                       48848021
*                                                                       48856021
*                                                                       48864021
       SPACE 5                                                          48872021
       USING *,XRVERB                                                   48880021
MOVE   EQU   *                                                          48888021
         CLI   DOP1,XX30                                                48896021
         BC    NOTEQ,DOP2SPEC      1ST OPERNAD NOT A DATA NAME          48904021
         CLI   DOP1+NX4,XXFF                                            48912021
         BC    NOTEQ,DOP2SPEC      1ST OPERNAD NOT A SPEC REG           48920021
         CLI   DOP1+NX6,XX08                                            48928021
         BC    EQ,SPECREG          CURRENT-DATE                         48936021
         CLI   DOP1+NX6,XX09                                            48944021
         BC    EQ,SPECREG          TIME-OF-DAY                          48952021
DOP2SPEC CLI   DOP2,XX30                                                48960021
         BC    NOTEQ,MVCONT        2ND OPERNAD NOT A DATA NAME          48968021
         CLI   DOP2+NX4,XXFF                                            48976021
         BC    NOTEQ,MVCONT        2ND OPERNAD NOT A SPEC REG           48984021
         CLI   DOP2+NX6,XX08                                            48992021
         BC    EQ,SPREGERR         CURRENT-DATE                         49000021
         CLI   DOP2+NX6,XX09                                            49008021
         BC    NOTEQ,MVCONT        NOT TIME-OF-DAY                      49016021
SPREGERR BAL   XRSUB,ERRPRO        GENERATE ERROR MESSAGE               49024021
         DC    AL1(ERRN15)                                              49032021
         DC    AL1(2)                                                   49040021
         B     PH5CTL             DO NOT PROCESS ILLEGAL STATEMENT      49048021
SPECREG  EQU   *                                                        49056021
         MVI   XCNTR1,TS2CODE                                           49064021
         MVI   XCNTR1+NX2,XX01                                          49072021
         LA    XR3,DX8                                                  49080021
         CH    XR3,TS2MAX          IS TS2 LARGE ENOUGH                  49088021
         BNH   SPECREG1            YES                                  49096021
         STH   XR3,TS2MAX                                               49104021
SPECREG1 DS    0H                                                       49112021
         BAL   RETRG,LA            GENERATE LA                          49120021
         CLI   DOP1+NX6,XX09       IS THIS TIME-OF-DAY                  49128021
         BE    SPECREG2            YES                                  49136021
         BAL   RETRG,VBADCE        NO, CALL CURRENT-DATE SUBR           49144021
         DC    CL4'DTE0'                                                49152021
         B     SPECREG3            CONTINUE                             49160021
SPECREG2 DS    0H                                                       49168021
         BAL   RETRG,VBADCE        CALL TIME-OF-DAY SUBR                49176021
         DC    CL4'DTE1'                                                49184021
SPECREG3 DS    0H                                                       49192021
         XC    DOP1+XDIDK(LX4),DOP1+XDIDK                               49200021
MVCONT   CLI   DOP2,XXFA            CHECK FOR SPECIAL MOVE FOR DISPL    49208021
       BC    EQ,DIFPMV         FOUND SPECIAL CASE                       49216021
         MVI   XGSWT,XX00                                               49224021
         NI    XGNSW,XXDF                RESET MESSAGE  NO 11 SWITCH    49232021
       BAL   XRSUB,XINITN          INIT GEN REG TBLS                    49240021
       BAL   XRSUB,XOTSEM               GET OPERANDS IN WORK AREA.      49248021
*  X1VAL  = SENDING FIELD -XR3 POINTS TO IT.                            49256021
*  X2VAL  = RECEIVING -   -XR5    -    - - .                            49264021
         TM    Y1IRX(XR3),XXF0          SENDING NON-NUMERIC...          49272021
       BC    NOTHR,XM000                NO-                             49280021
         TM    Y1IRX(XR5),XXF0                                          49288021
         BNO   MOVE14              NUMERIC MOVE                         49296021
         CLI   X2IRX,XXF5          IS RF NUMERIC EDITED                 49304021
         BE    MOVE14              YES                                  49312021
         CLI   X2IRX,XXF6          NO, IS RF STERL REPORT ITEM          49320021
         MVI   X2FBS+NX1,XX12                                           49328021
         BE    MOVE14              YES                                  49336021
XALMV1   L     XRVERB,XALAMA       NO                                   49344021
         BR    XRVERB              GO TO ALPHABETIC MOVE ANALYZER       49352021
*                                                                       49360021
*   SENDING IS NON NUMERIC  RECEIVING IS NUMERIC                        49368021
*                                                                       49376021
MOVE14 CLI   DOP1,XGFCT                                                 49384021
       BE    MOVE06                     SEND. IS  FIGCON                49392021
       CLI   DOP1,PLFCON                                                49400021
       BE    MOVE01                     SENDING IS PLURAL FIGCON.       49408021
       CLI   DOP1,XGALC                                                 49416021
       BE    MOVE01                     SEND. IS ALPH. LITERAL.         49424021
       CLI   DOP1,XGDTN                                                 49432021
       BNE   XMOELG                SENDING IS NOT DATA NAME             49440021
       LA    XR3,DOP1                                                   49448021
       BAL   XRSUB,XLENGH               GET SENDING TYPE IF DATA-NAME.  49456021
       CLI   XGTEM2,XGGPFL                                              49464021
       BE    XALMV1               FIXED LENGTH GROUP                    49472021
       CLI   XGTEM2,XGGPVL                                              49480021
       BE    XALMV1               VARIABLE LENGTH GROUP                 49488021
         LH    XR6,XOPLGH+NX2            SEND. IS NOW  ASSUMED TO BE    49496021
       CH    XR6,XC018                  ALPHANUMERIC. MAKE  SURE  THAT  49504021
       BNH   MOVE03                     ITS LENGTH IS = 18.             49512021
*                                                                       49520021
*  IF  ALPHANUM. FIELD IS MORE THAN 18 BYTES ,JUST MOVE THE RIGTHMOST   49528021
*  18 BYTES - FAKE IT BY UPDATING THE I,D,K FIELD  OF THE DATA-NAME.    49536021
*                                                                       49544021
       BAL   XRSUB,ERRPRO               GIVE AN ERROR MESSAGE.          49552021
       DC    AL1(ERRN04)                                                49560021
       DC    AL1(0)                                                     49568021
       SH    XR6,XC018                  GET EXTRA LENGTH.               49576021
         MVC   XGTEM2+NX1(LX3),DOP1+NX4   GET I,D,K .                   49584021
         MVI   XGTEM2,XX00                                              49592021
       L     XR0,XGTEM2                                                 49600021
         SRDL  XR0,DX8                                                  49608021
         SLL   XR0,DX20                                                 49616021
         SRL   XR1,DX24                  XR1 HAS BL NUMBER.             49624021
         SRL   XR0,DX20                  XR0 HAS D FIELD (DISPLACEMENT) 49632021
       AR    XR0,XR6                    UPDATE D FIELD WITH EXTRA LENGT 49640021
MOVE05 CH    XR0,XC4095                 D HAS TO BE  < 4095.            49648021
       BH    MOVE04                DISPLACEMENT > 4095                  49656021
         SLL   XR0,DX8                                                  49664021
       OR    XR0,XR1                    RESTORE I,D,K FIELD WITH NEW    49672021
       L     XR6,XGTEM2                 D FIELD.                        49680021
       N     XR6,XSUMK3                                                 49688021
       OR    XR0,XR6                                                    49696021
       ST    XR0,XGTEM2                                                 49704021
         MVC   DOP1+NX4(LX3),XGTEM2+NX1                                 49712021
         LA    XR6,DX18                                                 49720021
       SPACE 2                                                          49728021
MOVE03 STH   XR6,X1FBS                                                  49736021
       BAL   XRSUB,XSETVN               FAKE AN ED FIELD.               49744021
       LA    XR3,X1VAL                                                  49752021
       MVI   X1IRX,XGEXDC                                               49760021
       B     XNUMOV                GO TO NUMERIC MOVE                   49768021
*                                                                       49776021
*                                                                       49784021
MOVE04   LA    XR1,DX1(XR1)              UPDATE BL NUMBER               49792021
       SH    XR0,XC4096                 X                               49800021
       B     MOVE05                     X                               49808021
       SPACE 2                                                          49816021
MOVE06   CLI   DOP1+NX1,XXF0             IS IT FIGCON  0                49824021
       BE    XCONV0                     YES                             49832021
         MVC   DOP1+NX2(LX1),DOP1+NX1                                   49840021
         MVI   DOP1+NX1,XX01                                            49848021
       SPACE 2                                                          49856021
MOVE01 SR    XR0,XR0                    PLURAL FIGCON  OR  ALPH. LIT.   49864021
         IC    XR0,DOP1+NX1                                             49872021
         LH    XR6,X2FBS           NUMBER DIGIT OF SENDING =            49880021
         AH    XR6,X2ALP                .                               49888021
       SH    XR6,X2DBS                  NUMBER OF INTEGRAL PLACES OF    49896021
       BNH   XCONV0                     RECEIVING.                      49904021
       STH   XR6,X1FBS                                                  49912021
       MVI   X1IRX,XGINDC               SET NEW TYPE FOR SENDING AS FI  49920021
         MVI   X1IRX+NX1,XGNCON          IS CHANGED TO A NUM. LIT.      49928021
         MVI   X1VAL+NX15,XX0C           SET SIGN.                      49936021
*                                                                       49944021
* GENERATE PACK DEC. LITERAL OUT OF THE FIGCON OR  NON NUM. LITERAL.    49952021
*                                                                       49960021
         LA    XR2,X1VAL+NX15            INITIALIZE POINTERS.           49968021
         LA    XR1,DOP1+NX1                                             49976021
       LR    XR4,XR1                    SAVE POINTER TO COUNT FIELD.    49984021
       AR    XR1,XR0                                                    49992021
       LR    XR0,XR1                    SAVE POINTER TO RIGTMOST DIGIT  50000021
MOVE08   MVO   DX0(LX1,XR2),DX0(LX1,XR1) MOVE DIGIT IN LEFT PART OF BYT 50008021
       BAL   XRSUB,MOVETP               TEST FOR END OF LITERAL GENER.  50016021
         MVN   DX0(LX1,XR2),DX0(XR1)      MOVE DIGIT IN RIGTH PART.     50024021
       BAL   XRSUB,MOVETS          CHECK IF FINISHED                    50032021
       B     MOVE08                KEEP GENERATING                      50040021
MOVETP   BCTR  XR2,R0                    UPDATE BYTE POINTER IN X1VAL.  50048021
MOVETS BCT   XR6,MOVE09            FALL THRU ONLY IF FINSIHED           50056021
MOVE02 LA      XR5,X1VAL                SET REMAINING OF X1VAL BUFFER   50064021
       BAL     XRSUB,XIDSZ         GET SIZE OF OPERNAD GENERATED        50072021
         MVC   X1LBS(LX6),XIDBY                                         50080021
       LA      XR5,X2VAL                                                50088021
*                                                                       50096021
*                                                                       50104021
         MVC   DOP1+NX4(LX10),X1VAL+NX6   CHANGE  DOP1 INTO A           50112021
       MVI   DOP1,XGNLT                 NUMERIC LITERAL.                50120021
         MVI   DOP1+NX1,XX0C             COUNT.                         50128021
         MVI   DOP1+NX2,XX12             NUMER OF INTEGRAL PLACES.      50136021
         MVI   DOP1+NX3,XX00             NUMBER OF DEC.                 50144021
*                                                                       50152021
       B     XNUMOV                     ENOUGH DIGIT = X1FBS            50160021
MOVE09   BCTR  XR1,R0             DECREMENT BY ONE                      50168021
       CR    XR1,XR4                                                    50176021
       BCR   XNOEQ,XRSUB                FIGCON NON EXHAUSTED            50184021
       CLI   DOP1,XGALC                                                 50192021
       BE      MOVE02              GET SIZE OF OPERAND GENERATED        50200021
       LR    XR1,XR0                    START OVER  WITH FIGCON.        50208021
       BCR   UNCON,XRSUB           KEEP GENERATING                      50216021
       SPACE 5                                                          50224021
XCONV0   LA    XR4,X1VAL           CHANGE FIGCON TO NUMERIC 0           50232021
       BAL   XRSUB,XONDGT          SET BUFFER FOR ONE DIGIT             50240021
         MVI   X1VAL+NX15,XX0C                                          50248021
         OI    X1IRX+NX1,XLITZR                                         50256021
       BC    UNCON,XNUMOV          GO TO NUMERIC MOVE                   50264021
XM000    TM    Y1IRX(XR5),XXF0                                          50272021
       BC    XTHRE,XM001                SENDING NUMERIC- RECEIVING      50280021
*                                       NUMERIC -HAS TO BE REPORT I     50288021
*       BOTH  FIELD ARE NUMERIC.                                        50296021
*                                                                       50304021
XNUMOV EQU   *                                                          50312021
         MVN   X1TYP(LX1),X1IRX                                         50320021
         MVN   X2TYP(LX1),X2IRX                                         50328021
       LH    XR6,XGDRE                  ADJUST  DEC. NUMBER OF RESU     50336021
       TM    XGSWT,XROUND               FIELD AND  SET  DMAX  TO DR     50344021
       BC    XZERO,XM002                X                               50352021
       BCTR  XR6,RW0                      X                             50360021
XM002  STH   XR6,XRDMX                  X                               50368021
       CLI   Y1IRX(XR5),XGEXDC                                          50376021
       BC    XNOEQ,XM004           2ND OPND NOT ED                      50384021
       CLI   Y1IRX(XR3),XGEXDC                                          50392021
       BC    XNOEQ,XM004           1ST OPND NOT ED                      50400021
*                                                                       50408021
*      BOTH  FIELD ARE ED.                                              50416021
*                                                                       50424021
       BAL   XRSUB,XMVSCL          SCALE SENDING FIELD                  50432021
         MVC   X1FAS(LX2),X1FBS         RESET NUMBER OF DIGITS.         50440021
*                                                                       50448021
         TM    X1IRX+NX1,XZGNLT         IF SENDING IS LITERAL           50456021
       BC    XZERO,XMED30              JUST UNPACK ID SCALED LITERA     50464021
XMED31 EQU   *                                                          50472021
*                                       CONTAINED IN X1VAL              50480021
         MVC   XL1(LX2),X2FAS           X                               50488021
       BAL   XRSUB,XF0F0           GENERATE F0                          50496021
       L     XR2,XAOPE5                                                 50504021
         UNPK  XFVAL(LX16),X1VAL(LX9)                                   50512021
         UNPK  XFVAL+NX15(LX15),X1VAL+NX8(LX8)                          50520021
       LH    XR1,X2FAS                                                  50528021
         LA    XR4,XFVAL+NX30                                           50536021
       SR    XR4,XR1                                                    50544021
       BCTR  XR1,RW0               SUBTRACT 1 FOR EX INSTRUCTION        50552021
       EX    XR1,XEDMOW                                                 50560021
         TM    DOP2+XGSCIN,SIGNED                                       50568021
       BC    XTHRE,XMED04          RECEIVING FIELD IS SIGNED            50576021
       AR    XR2,XR1                                                    50584021
         OI    DX2(XR2),XXF0                                            50592021
XMED04 BAL   XRVAR,MVC001          GENERATE MVC                         50600021
       BC    UNCON,XMEDXT          CHECK FOR SUBSCRIPTS                 50608021
*                                                                       50616021
XMED09   TM    DOP2+XGSCIN,SIGNED                                       50624021
       BC    XZERO,XMED10          RECEIVING FIELD NOT SIGNED           50632021
       BC    UNCON,XMEDXT          CHECK FOR SUBSCRIPTS                 50640021
XMED30 EQU   *                                                          50648021
       LH    XR6,X1ALP                                                  50656021
       LTR   XR6,XR6                         CODING GENERATED.          50664021
       BC    XONE,XMED00                  IF   LR =LENGHT OF RECEIV     50672021
       CH    XR6,X2FAS                         LS =  -       SENDIN     50680021
       BC    XGTEQ,XMED05               I = SCALE TO ALIGN SENDING      50688021
       LH    XR5,X2FAS                             ING.                 50696021
       SH    XR5,X1FAS                         RF=RECEIVING,SF=SEND     50704021
       SR    XR5,XR6                    A) I>0     LR-LS-I >0           50712021
       BC    XLOEQ,XMED01          LR-LS-I <= 0                         50720021
       LTR   XR6,XR6                    MVC RF+LR-LS-I(LS),SF           50728021
       BC    XZERO,XMED01               MVC RF(LR-LS-I),=F0F0F0...      50736021
XMED05   MVC   XL1(LX2),X2FAS                 OR                        50744021
*                                       MVC  RF+LR-I(I),=F0F0....       50752021
       BAL   XRSUB,XF0F0                  IF BOTH PRECEEDING INSTRU     50760021
       BAL   XRVAR,MVC001                  ARE NECE. THE WHOLE RF W     50768021
       CH    XR6,X2FAS                    RESET TO F0F0...BEFORE  S     50776021
       BC    XGTEQ,XMEDXT          I >= LR                              50784021
       LTR   XR6,XR6                    MVZ RF+LR-1(1),SF+LS-1          50792021
       BC    XONE,XMEDXT                  (ONLY IF RF IS SIGNED.        50800021
XMED01 LTR   XR5,XR5                                                    50808021
       BC    XONE,XMED02                OI  RF +LR-I-1,X'F0'            50816021
         STC   XR5,XPLUS1+NX2                 (ONLY IF I>0)             50824021
         MVC   XL1(LX2),X1FAS                                           50832021
       BC    UNCON,XMED03               B)  I>0    LR-LS-I )0           50840021
XMED02 LCR   XR4,XR5                                                    50848021
         STC   XR4,XPLUS2+NX2            MVC RF(LR-I),SF+LS-LR+I        50856021
       LH    XR2,X2FAS                  MVC RF +LR -I(I),=F0F0F0...     50864021
       SR    XR2,XR6                    MVZ RF+LR-1(1),SF+LS-1          50872021
       STH   XR2,XL1                    OI  RF+LR-I-1,X'F0'             50880021
XMED03 BAL   XRVAR,MVC002          GENERATE MVC                         50888021
*                                       C) I LT 0,LS-J LT LR,J=-I       50896021
*                                                                       50904021
       LTR   XR6,XR6                      MVC RF+LR-LS+J(LS-J),SF       50912021
       BC    XZERO,XMED06                 MVC RF(LR-LS+J),=F0F0F0..     50920021
       LTR   XR5,XR5                      MVZ RF+LR-1,SF+LS-1           50928021
       BC    XTWO,XMED07           LR-LS-I > 0                          50936021
       LH    XR2,X2FAS                                                  50944021
       SR    XR2,XR6                    D) I)0   LS-J >LR               50952021
         STC   XR2,XPLUS1+NX2                                           50960021
       CH    XR6,XC001                     MVC RF(LR),SF+LS-LR-J        50968021
       BC    XZERO,XMED11                  MVZ RF+LR-1,SF+LS-1          50976021
       STH   XR6,XL1                                                    50984021
       BC    UNCON,XMED22               E) I GT 0 , I GT LR,            50992021
*                                                                       51000021
XMED06 LTR   XR5,XR5                          MVC  RF(LR),=F0F0...      51008021
       BC    XLOEQ,XMED07          LR-LS+J <= 0                         51016021
       CH    XR5,XC001                  F)  I LT 0 , J GT LS            51024021
       BC    XZERO,XMED11          LR-LS+J = 1                          51032021
       STH   XR5,XL1                          MVC  RF(LR),=F0F0...      51040021
XMED22 BAL   XRSUB,XF0F0           GENERATE F0 CONSTANT                 51048021
         BAL   XRVAR,MVC001        GENERATE MVC                         51056021
*                                                                       51064021
XMED07 LTR   XR6,XR6                                                    51072021
       BC    XZERO,XMED09          I = 0                                51080021
         TM    DOP2+XGSCIN,SIGNED                                       51088021
       BC    XZERO,XMED10          REC FLD NOT SIGNED                   51096021
       LH    XR0,X1FAS                                                  51104021
       BCTR  XR0,RW0               LS-1                                 51112021
         STC   XR0,XPLUS2+NX2                                           51120021
       LH    XR0,X2FAS                                                  51128021
       BCTR  XR0,RW0               LR-1                                 51136021
         STC   XR0,XPLUS1+NX2                                           51144021
         MVC   XOP1(LX4),X2INPT                                         51152021
         MVC   XOP2(LX4),X1INPT                                         51160021
         MVI   XL1+NX1,XX01                                             51168021
       BAL   XRSUB,MVZ             GENERATE MVZ                         51176021
XMED10 LTR   XR6,XR6                                                    51184021
       BC    XONE,XMEDXT           I < 0                                51192021
XMED44   MVI   XIMM,XXF0                                                51200021
         LH    XR0,X2FAS                                                51208021
       SR    XR0,XR6                                                    51216021
XMED46 BCTR  XR0,RW0               LR-I-1                               51224021
         STC   XR0,XPLUS1+NX2                                           51232021
         MVC   XOP1(LX4),X2INPT                                         51240021
       BAL   XRSUB,OI              GENERATE OI                          51248021
XMEDXT L     XR3,XAOPE2                                                 51256021
       BAL   XRSUB,XSPRO           CHECK FOR Q-ROUTINES                 51264021
*                                                                       51272021
*   TAKE CARE  OF UNSIGNED SENDING TO SIGNED RECEIVING.                 51280021
*   MAKE SURE  THE RECEIVING GET A  C  SIGN.                            51288021
*                                                                       51296021
       CLI   X2IRX,XGEXDC                                               51304021
       BE    XMED50                REC FLD IS ED                        51312021
       CLI   X2IRX,XGINDC                                               51320021
       BNE   XMED49                     DO IT ONLY FOR  ID AND ED RECV. 51328021
XMED50 CLI   DOP1,XGNLT                                                 51336021
       BE    XMED49                SENDING IS A LITERAL                 51344021
       CLI   DOP1,XGDTN                                                 51352021
       BNE   XMED49                SENDING IS NOT A DATA NAME           51360021
       LR    RW6,RW3                                                    51368021
       LA    RW3,DOP1                                                   51376021
       BAL   XRSUB,XLENGH               GET  TYPE OF SENDING.           51384021
       CLI   XGTEM2,XGALN                                               51392021
       BE    XMED51                SENDING IS ALPHANUMERIC              51400021
         CLC   XIDBY(LX6),XC000                                         51408021
       BE    XMED49                SENDING IS NON-NUMERIC               51416021
         TM    DOP1+NX7,XX01             SENDING IS NUMERIC             51424021
       BO    XMED49                     BUT SIGNED -FORGET IT.          51432021
XMED51   TM    DOP2+NX7,XX01            IF REC IS UNSIGNED FORGET IT.   51440021
         BZ    XMED49              REC FLD UNSIGNED                     51448021
         MVC   OP1(LX4),XAOPE2                                          51456021
       LA    XR3,DOP2                                                   51464021
       BAL   XRSUB,XLENGH               FOR ED  GENERATE                51472021
       L     XR0,XOPLGH                                                 51480021
       BCTR  XR0,XR0               LR-1                                 51488021
         STC   XR0,XPLUS1+NX2           NI  DN+LN,X'0F'                 51496021
         MVI   XIMM,XX0F                         OI  DN+LN,X'C0'        51504021
       CLI   X2IRX,XGEXDC               FOR ID  GENERATE                51512021
       BE    XMED52                             NI  DN+LN,X'F0'         51520021
         MVI   XIMM,XXF0                         OI  DN+LN,X'0C'        51528021
XMED52 BAL   XRSUB,NI              GENERATE NI                          51536021
         MVC   OP1(LX4),XAOPE2                                          51544021
       L     XR0,XOPLGH                                                 51552021
       BCTR  XR0,XR0               LR-1                                 51560021
         STC   XR0,XPLUS1+NX2                                           51568021
         MVI   XIMM,XXC0                                                51576021
       CLI   X2IRX,XGEXDC                                               51584021
       BE    XMED53                REC FLD IS ED                        51592021
         MVI   XIMM,XX0C                    SET  SIGN TO C .            51600021
XMED53 BAL   XRSUB,OI              GENERATE OI                          51608021
       LR    XR3,XR6                                                    51616021
XMED49   TM    XGSWT,XSIZER                                             51624021
       BC    XZERO,XRESTG          NO SIZE ERROR IN SOURCE              51632021
       BAL   XRSUB,XSZPRI          GENERATE SIZE ERROR TRANSFER         51640021
       BC    UNCON,XRESTG          RELEASE ANY TEMP STOR USED           51648021
XMED11   MVC   XOP1(LX4),X2INPT                                         51656021
         MVI   XIMM,XXF0                                                51664021
       BAL   XRSUB,MVI             GENERATE MVI                         51672021
       BC    UNCON,XMED07          CHECK FOR I = 0                      51680021
XMED00 LCR   XR5,XR6                                                    51688021
       CH    XR5,X1FAS                                                  51696021
       BC    XGTEQ,XMED05          GENERATE MVC RF(LR),=F0F0...         51704021
       LH    XR4,X2FAS                                                  51712021
       SH    XR4,X1FAS                                                  51720021
       AR    XR4,XR5                                                    51728021
       BC    XONE,XMED20           LR-LS+J < 0                          51736021
         STC   XR4,XPLUS1+NX2                                           51744021
       LH    XR2,X1FAS                                                  51752021
       SR    XR2,XR5                                                    51760021
       STH   XR2,XL1                                                    51768021
       BC    UNCON,XMED21          GENERATE MVC                         51776021
XMED20 LCR   XR2,XR4                                                    51784021
         STC   XR2,XPLUS2+NX2                                           51792021
         MVC   XL1(LX2),X2FAS                                           51800021
XMED21 BAL   XRVAR,MVC002          GENERATE MVC                         51808021
*                                                                       51816021
*                                                                       51824021
       LR    XR5,XR4                                                    51832021
       BC    UNCON,XMED06          CHECK FOR LR-LS+J <= 0               51840021
*                                                                       51848021
*                                                                       51856021
*                                                                       51864021
*                                                                       51872021
XEDMOW   MVC   DX2(LX0,XR2),DX0(XR4)                                    51880021
       SPACE 5                                                          51888021
XF0F0  L     XR2,XAOPE5                 GENERATE  A CONSTANT OF         51896021
       ST    XR2,XOP2                   X                               51904021
         MVI   DX0(XR2),XX34                    F0F0..........          51912021
       LH    XR0,XL1                      THE LENGHT BEING GIVEN IN     51920021
         STC   XR0,DX1(XR2)                XL1                          51928021
         LA    XR2,DX2(XR2)              X                              51936021
XF0F01   MVI   DX0(XR2),XXF0                                            51944021
         LA    XR2,DX1(XR2)              X                              51952021
       BCT   XR0,XF0F01                 X                               51960021
       BCR   UNCON,XRSUB                X                               51968021
       SPACE 2                                                          51976021
MVC002   MVC   XOP2(LX4),X1INPT                                         51984021
MVC001   MVC   XOP1(LX4),X2INPT                                         51992021
       BAL   XRSUB,MVC             GENERATE MVC                         52000021
       BCR   UNCON,XRVAR           RETURN                               52008021
       SPACE 10                                                         52016021
*      ID,BI  TO  ID,BI,ED                                              52024021
XM004  CLI   X1IRX,XGINDC                                               52032021
       BC    XZERO,XM005           SENDING ID                           52040021
       TM    X1IRX,XGBINR                                               52048021
       BC    NOTHR,XM006    SENDING IS ED,IFP,EFP,STERL.NON REPORT      52056021
*       SENDING IS  BI OR ID.                                           52064021
XM005  CLI   X2TYP,XGINFP                                               52072021
         BE    XM008               RECEIVING IS IFP.                    52080021
       CLI   X2TYP,XGEXFP                                               52088021
       BC    XZERO,XM008         RECEIVING IS EFP.                      52096021
*                                                                       52104021
XMMDEB EQU   *                                                          52112021
         CLI   X2IRX,XXF6                                               52120021
       BC    XZERO,XM009                FOR  STERLING BY-PASS ON-LI     52128021
         CLI   X2TYP,XX0D                                               52136021
       BC    XZERO,XM009                ON SIZE ERROR.                  52144021
*      RECEIVING  IS  ID, BI ,ED OR REPORT ITEM(NON STERLING).          52152021
*                                                                       52160021
       TM    XGSWT,XSIZER                                               52168021
       BC    NOTHR,XM009           NO SIZE ERROR                        52176021
       BAL   XRSUB,XSZPRO        SIZE ERROR CHECKING.                   52184021
XM009  EQU   *                                                          52192021
       BAL   XRSUB,XMVSCL        COMPILE TIME SCALING.                  52200021
         CLI   X2IRX,XXF5                                               52208021
       BE    XZZ001                REC FLD IS A REPORT ITEM             52216021
       TM    X2IRX,XGBINR                                               52224021
       BC    NOTHR,XZZ007          REC FLD NOT BINARY                   52232021
       TM    PHZSW1,TRUNC         TRUNC OPTION IN EFFECT...             52240021
       BZ    XM010                NO                                    52248021
*                                                                       52256021
*                                                                       52264021
*      RECEIVING  IS  ID,ED, REPORT NON STERLING.                       52272021
XZZ001 EQU   *                                                          52280021
       LH    XR6,X1FAS                  FOR REPORT RESET TO ZERO        52288021
       SH    XR6,X2FAS                  EXTRA HIGH ORDER DIGITS.        52296021
       BC    XLOEQ,XM010                X                               52304021
       LH    XR2,X1IND                                                  52312021
       AR    XR2,XR6                                                    52320021
       STH   XR2,X1IND                                                  52328021
         OI    X1IRX+NX1,XGOVFL                                         52336021
XM010  TM    X2IRX,XGBINR                                               52344021
       BC    XTHRE,XM011           REC FLD IS BINARY                    52352021
XZZ007   BAL   XRSUB,XW000         SCALE OPERAND                        52360021
       CLI   X2IRX,XGEXDC                                               52368021
       BC    XZERO,XM012                FOR ED  UNPACK.                 52376021
         CLI   X2IRX,XXF5                                               52384021
       BC    XZERO,XMRPTG               FOR REPORT GO TO EDIT ROUTI     52392021
         CLI   X2IRX,XX0D                                               52400021
       BC    XZERO,XSTMOV          STERLING-NON REPORT TARGET FIELD     52408021
         CLI   X2IRX,XXF6                                               52416021
       BC    XZERO,XSTREP          STERLING REPORT TARGET FIELD.        52424021
         TM    X1IRX+NX1,XZGNLT                                         52432021
       BC    XZERO,XM070           SENDING IS NOT A LITERAL             52440021
         MVC   XCON(LX16),X1VAL                                         52448021
         MVC   X2BAS(LX2),X2LAS          FAKE BINARY MOVE WITH ID LE    52456021
*                                                                       52464021
         TM    X2FAS+NX1,XX01                                           52472021
       BC    XTHRE,XM071           LENGTH OF REC IS ODD                 52480021
         LA    XR2,XCON+NX16                                            52488021
       SH    XR2,X2LAS                                                  52496021
         NI    DX0(XR2),XX0F                                            52504021
XM071    TM    DOP2+XGSCIN,SIGNED                                       52512021
       BC    XTHRE,XM016           REC FLD IS SIGNED                    52520021
         OI    XCON+NX15,XX0F                                           52528021
       BC    UNCON,XM016           GENERATE MVC                         52536021
XM070  EQU   *                                                          52544021
       LA    XR5,X2VAL                                                  52552021
         BAL   XRSUB,XZX3X5        ZAP  RES(L),TEMP+A(L1)               52560021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           52568021
       LH    XR6,XL2                        WITH   L1 ) L               52576021
       SH    XR6,XL1                                                    52584021
       BC    XLOEQ,XM013           GENERATE ZAP                         52592021
         STC   XR6,XPLUS2+NX2                                           52600021
         MVC   XL2(LX2),XL1                                             52608021
XM013  BAL   XRSUB,ZAP             GENERATE ZAP                         52616021
         CLC   X1FAS(LX2),X2FAS           IN CASE OF RES. WITH AN EV    52624021
       BC    XNOGT,XM014                NUMBER OF DIGIT  RESET EVEN     52632021
XBYPST EQU   *                                                          52640021
         TM    X2FAS+NX1,XX01            EXTRA  HIGH ORDER DIGIT.       52648021
       BC    XTHRE,XM014           NUMBER OF DIGITS ODD IN REC FLD      52656021
       TM    XGSWT,XSIZER                                               52664021
       BC    XTHRE,XM014           SIZE ERROR IN SOURCE                 52672021
         MVC   XOP1(LX4),X2INPT                                         52680021
         MVI   XIMM,XX0F                                                52688021
       BAL   XRSUB,NI              GENERATE NI                          52696021
XM014  EQU   *                                                          52704021
         TM    DOP2+XGSCIN,SIGNED                                       52712021
*                                                                       52720021
       BC    XTHRE,XMEDXT          REC FLD IS SIGNED                    52728021
       LH    XR0,X2LAS                                                  52736021
         MVI   XIMM,XX0F                                                52744021
       BC    UNCON,XMED46          GENERATE OI                          52752021
*      ID  TO ED  UNPACK ROUTINE.                                       52760021
XM012    TM    X1IRX+NX1,XZGNLT                                         52768021
       BC    XNOEQ,XMED31          SENDING IS A LITERAL                 52776021
       BAL   XRSUB,XRSVAL          RESET BUFFER ADDRESSES               52784021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      52792021
         CLI   X2FAS+NX1,XX10                                           52800021
       BC    XTWO,XM015                 DP  UNPACK (MORE THAN 16 BY     52808021
*                                                                       52816021
*                                                                       52824021
       BAL   XRSUB,XZSIDA               UNPK  OP2(L2),OP1(L1)           52832021
         MVC   XL1+NX1(LX1),X2FAS+NX1                                   52840021
       BC    UNCON,XM0146          GENERATE UNPACK                      52848021
*      UNPACK A FIELD OF  17 OR 18 DIGITS.                              52856021
*                                                                       52864021
XM015  BAL   XRSUB,XZSIDA          SET A-TEXT                           52872021
         LA    XR6,DX2                                                  52880021
       LH    XR2,X2FAS                                                  52888021
       SH    XR2,XC002                                                  52896021
       STH   XR2,XL1                                                    52904021
       LH    XR1,XL2                                                    52912021
       BCT   XR1,XM019                  TAKE CARE OF OPERAND WHICH      52920021
         LA    XR1,DX1                   ARE ONE BYTE LONG.             52928021
       BCTR  XR6,RW0               LENGTH = 1                           52936021
XM019  STH   XR1,XL2                                                    52944021
       BAL   XRSUB,LCRBI                UNPK  OP2(L2-2),OP1(L1-1)       52952021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           52960021
       BCTR  XR2,RW0               DISP = DISP-1                        52968021
         STC   XR2,XPLUS1+NX2                                           52976021
         MVI   XL1+NX1,XX03                                             52984021
       STH   XR6,XL2                                                    52992021
       BCTR  XR1,RW0               DISP = DISP-1                        53000021
         STC   XR1,XPLUS2+NX2                                           53008021
XM0146 BAL   XRSUB,LCRBI                UNPK  OP2+L2-3(3),OP1+L1-2(     53016021
         SR    XR6,XR6                                                  53024021
         TM    DOP2+XGSCIN,SIGNED                                       53032021
       BC    XTHRE,XMEDXT          REC FLD IS SIGNED                    53040021
       BC    UNCON,XMED44          GENERATE OI                          53048021
       SPACE 5                                                          53056021
*      RECEIVING IS BINARY .                                            53064021
XM011    TM    X1IRX+NX1,XGOVFL                                         53072021
       BC    XTHRE,XM0111          OVERFLOW IN SCALING SENDING          53080021
         TM    X1IRX+NX1,XZGNLT                                         53088021
       BC    XZERO,XM072           SENDING IS NOT A LITERAL             53096021
*                                                                       53104021
*                                                                       53112021
         TM    DOP2+XGSCIN,SIGNED  IS RECEIVING FIELD SIGNED            53120021
       BO    XM017                YES                                   53128021
         OI    X1VAL+NX15,POSI     NO, MAKE SURE LIT IS POS             53136021
XM017  EQU   *                                                          53144021
         MVC   XZLENG(LX2),X1BAS                                        53152021
       BAL   XR2,XCONLV            CONVERT LITERAL TO BINARY            53160021
XM016  LH    XR3,XMINON                                                 53168021
         MVC   XCONL(LX1),X2BAS+NX1                                     53176021
*                                                                       53184021
*                                                                       53192021
       BC    UNCON,XM080           GENERATE MVC                         53200021
*                                                                       53208021
XM072    CLC   X1ALP(LX2),XC000          ANY SCALING AT ALL?            53216021
       BC    XNOEQ,XM040                SCALING REQUIRED.               53224021
XM0SCL   BAL   XRSUB,XBISCL        CONVERT TO BINARY AND SCALE          53232021
XM030    TM    X1IRX+NX1,XX09            XINREG+XG2IRX                  53240021
       BC    XZERO,XM023           NO                                   53248021
       BC    XTHRE,XM024           YES                                  53256021
*            SENDING IS SINGLE WORD.                                    53264021
         TM    DOP2+XGSCIN,SIGNED                                       53272021
       BC    XTHRE,XZZ002          REC FLD IS SIGNED                    53280021
       BAL   XRSUB,XZWHIR          GET REG TBL ADDRESS                  53288021
       L     XR4,XLIRP            SET SENDING                           53296021
         MVC   XREG1(LX1),DX3(XR4)  TO ITS ABSOLUTE VALUE               53304021
         MVC   XREG2(LX1),XREG1                                         53312021
       BAL   XRSUB,LPRBI           GENERATE LPR                         53320021
XZZ002 EQU   *                                                          53328021
         CLI   X2BAS+NX1,XX04                                           53336021
       BC    XTWO,XM025                 REC. IS DOUBLE WORD.            53344021
XM026  BAL   XRSUB,XZBINA          SET A-TEXT                           53352021
*            GENERATE    ST  XRN,REC.                                   53360021
       BAL   XRSUB,ST              GENERATE ST                          53368021
       BC    UNCON,XMEDXT          EXIT ROUTINE                         53376021
XM025  BAL   XRSUB,XSLODB          LOAD DOUBLE                          53384021
XM027  BAL   XR1,XODDRG                 GET ODD REG.                    53392021
*                                                                       53400021
*                                                                       53408021
         MVC   XREG2(LX1),DX3(XR4)                                      53416021
       BAL   XRSUB,XZBINA          SET A-TEXT                           53424021
       BAL   XRSUB,STM                  STM   XR2P,XR2P+1,REC.          53432021
       BC    UNCON,XMEDXT          EXIT ROUTINE                         53440021
XM024  LA    XRSUB,XZZ004                                               53448021
         TM    DOP2+XGSCIN,SIGNED                                       53456021
       BC    XZERO,XBIIDB          REC FLD NOT SIGNED                   53464021
         CLI   X2BAS+NX1,XX04                                           53472021
       BC    XTWO,XM027                 STM                             53480021
       BAL   XR1,XODDRG            GET ODD REG                          53488021
         NI    X1IRX+NX1,XXF6            XINREG+XG2IRX                  53496021
       BAL   XRSUB,XZWHIR          GET REG TBL ADDRESS                  53504021
       BC    UNCON,XM026                ST ODDREG.,REC.                 53512021
XM023    TM    DOP2+XGSCIN,SIGNED                                       53520021
       BC    XTHRE,XZZ003          REC FLD SIGNED                       53528021
       LA    XRSUB,XM030                                                53536021
         CLI   X1BBS+NX1,XX04                                           53544021
       BH    XSLODB                SENDING > 4 BYTES                    53552021
       B     XSLOAS                SENDING < 4 BYTES                    53560021
XZZ003 LH    XR6,X1BAS                                                  53568021
       SH    XR6,X2BAS                                                  53576021
       BC    XONE,XM029                 SENDING IS SMALLER THAN REC     53584021
         STC   XR6,XPLUS2+NX2                                           53592021
XM080  BAL   XRSUB,XZX3X5               MVC  REC(LR),SEND+LS-LR         53600021
       BAL   XRSUB,XZLOGB          SET A-TEXT                           53608021
       BAL   XRSUB,MVC             GENERATE MVC                         53616021
       BC    UNCON,XMEDXT          EXIT ROUTINE                         53624021
XM029    CLI   X2BAS+NX1,XX04                                           53632021
       BC    XTWO,XM025            REC FLD > 4 BYTES                    53640021
         BAL   XRSUB,XSLOAS        GENERATE LOAD INSTRUCTION            53648021
       BC    UNCON,XM026           SET A-TEXT                           53656021
XM040  BAL   XRSUB,XSCBOA               IS SCALING POSSIBLE IN BINA     53664021
       BC    UNCON,XM0111               NO                              53672021
         MVC   XFBAS(LX2),X2BAS                                         53680021
       CLI   X1IRX,XGINDC               IS SENDING ID.                  53688021
       BC    XNOEQ,XM0SCL               NO,SCALE IN BINARY.             53696021
         CLI   X1BBS+NX1,XX04            IS BINARY SIZE BEFORE SCALI    53704021
       BC    XLOEQ,XM0SCL               A DOUBLE WORD - NO, SCALE I     53712021
XM0111 BAL   XRSUB,XW000                CONVERT TO ID AND SCALE IN      53720021
         TM    DOP2+XGSCIN,SIGNED                                       53728021
       BC    XTHRE,XZZ005          REC FLD SIGNED                       53736021
XZZ004   OI    DOP2+XGSCIN,SIGNED                                       53744021
       LH    XR6,X1TEL            SET SENDING TO                        53752021
       BCTR  XR6,XR0              ITS ABSOLUTE VALUE                    53760021
         STC   XR6,XPLUS1+NX2                                           53768021
       LH    XR6,X1TEM                                                  53776021
         SLA   XR6,DX3                                                  53784021
       STH   XR6,XWC1                                                   53792021
         MVI   XIMM,XX0F                                                53800021
       BAL   XRSUB,OI              GENERATE OI                          53808021
XZZ005 EQU   *                                                          53816021
       BAL   XRSUB,XIDBIA               CONVERT BACK TO BINARY          53824021
       BC    UNCON,XM030           CHECK FOR DP                         53832021
XM001    CLI   Y1IRX(XR5),XXF5                                          53840021
       BC    XZERO,XNUMOV          RED FLD IS REPORT ITEM               53848021
         CLI   Y1IRX(XR5),XXF6                                          53856021
       BC    XNOEQ,XALMV1          REC FLD IS NOT STERL REPORT ITEM     53864021
       BC    UNCON,XNUMOV          REC FLD IS STERL REPORT ITEM         53872021
*                                                                       53880021
*      LOGIC ERROR NUMBER 5.                                            53888021
*                                                                       53896021
XMOELG EQU   *                                                          53904021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               53912021
       DC    AL1(ERRN05)                                                53920021
       DC    AL1(8)                                                     53928021
XM006  LA    XRSUB,XM005                                                53936021
       CLI   Y1IRX(XR3),XGEXDC                                          53944021
       BC    XZERO,XPACK                SENDING IS ED -- PACK IT.       53952021
*                                       TRY FOR IFP OR EFP SENDING      53960021
*                                                                       53968021
*            SENDING IS IFP,OR,EFP.                                     53976021
*                                                                       53984021
         LA    XRSUB,XMFP12                                             53992021
       CLI   X1TYP,XGEXFP                                               54000021
       BC    XZERO,EFPIFP          SENDING IS EFP                       54008021
*                                                                       54016021
         CLI   X1TYP,XGINFP        SF IFP                               54024021
       BC    XNOEQ,XMFP11          GENERATE ERROR MESSAGE               54032021
XMFP12 EQU   *                                                          54040021
*                                                                       54048021
       CLI   X2TYP,XGINFP                                               54056021
       BC    XZERO,XM008                REC. IS IFP)                    54064021
       CLI   X2TYP,XGEXFP                                               54072021
       BC    XZERO,XM008                REC. IS EFP.                    54080021
       LA    XRSUB,XMMDEB                                               54088021
       CLI   X2TYP,XGBINR                                               54096021
       BC    XZERO,IFPBI                RECEIV  IS  BINARY              54104021
       BC    UNCON,IFPID                REC. IS ID,REPORT FIELD,ED.     54112021
*                                                                       54120021
*                                                                       54128021
*      LOGIC ERROR NUMBER 6.                                            54136021
*                                                                       54144021
XMFP11 BAL   XRSUB,ERRPRO          TERMINATE COMPILATION                54152021
       DC    AL1(ERRN06)                                                54160021
       DC    AL1(8)                                                     54168021
*                                                                       54176021
       SPACE 2                                                          54184021
*                                                                       54192021
* RECEIVING IS STERLING NON-REPORT.CALL OBJECT TIME SUBR IDT0           54200021
*      CALLING SEQUENCE IS                                              54208021
*                             L     1,GN=SIZE-ERROR TRANSF              54216021
*                                 OR                                    54224021
*                             SR    1,1   IF NO SIZE ERROR RTNE         54232021
*                             LA   0,STERLING-FIELD                     54240021
*                             L     15,=V(IDT0)                         54248021
*                             BALR 14,15                                54256021
*                             DC   AL4(SENDING-FIELD)                   54264021
*                             DC   XL2    2BYTES OF INFORMATION         54272021
*                                         DIRECTLY MOVED FROM PH5 I     54280021
*                                         STRING.                       54288021
*                                                                       54296021
*                                                                       54304021
*                                                                       54312021
XSTMOV   MVI   XREGNO,XX01                                              54320021
       BAL   XRSUB,XFREER         FREE REG 1                            54328021
       TM    XGSWT,XSIZER                                               54336021
       BZ    XSTL03               NO SIZE ERROR RTNE                    54344021
       BAL   XR2,XZRDVV           IF SIZE ERROR SPECIFIED, GEN          54352021
         MVI   XREG1,XX01          RETURN TRANSF. FOR SUBR IN CASE      54360021
         MVC   XGN1(LX2),XZRTRA    ERROR CONDIT DOES OCCUR              54368021
       BAL   XRSUB,LOAD           *  L   1,GN=SIZE-ERROR TRANSF         54376021
       B     XSTL00                GENERATE LA                          54384021
XSTL03   MVI   XREG1,XX01                                               54392021
         MVI   XREG2,XX01          IF NO SIZE ERROR, R1 MUST BE 0       54400021
       BAL   XRSUB,SUB            *   SR   1,1                          54408021
XSTL00   MVI   XYLEN,XX10                                               54416021
       BAL   XRSUB,XYOAF                MOVE SENDING IN A 16 BYTES      54424021
         MVC   XOP1(LX4),X2INPT          FIELD.                         54432021
       BAL   XRSUB,LA                   LA  0,ST-FLD.                   54440021
         CLI   X2IRX,XXF6                                               54448021
       BC    XZERO,XSTR00          REC FLD IS STERL REPORT ITEM         54456021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      54464021
       DC    C'IDT0'                                                    54472021
         BAL   XR2,SUBST1               GENERATE DC                     54480021
*                                                                       54488021
*                                                                       54496021
       L     XR3,XAOPE2                                                 54504021
       BAL   XR2,SUBST2            GENERATE DC                          54512021
         CLI   X2IRX,XXF6                                               54520021
       BC    XZERO,XSTR02          REC FLD IS STERL REPORT ITEM         54528021
       BC    UNCON,XMEDXT               EXIT.                           54536021
       SPACE 2                                                          54544021
*                                                                       54552021
*                                                                       54560021
*                                                                       54568021
*  RECEIVING  IS FLOATING POINT                                         54576021
*                                                                       54584021
XM008  EQU   *                                                          54592021
*                                                                       54600021
*                                                                       54608021
       BAL   XRSUB,FPCVBG          MAKE SURE SENDING IS IFP             54616021
       LA    XRSUB,XMEDXT                                               54624021
       CLI   X2TYP,XGEXFP                                               54632021
       BC    XZERO,IFPEFP          REC FLD IS EFP                       54640021
       LA    XRSUB,XMFP00                                               54648021
         TM    X2IRX+NX1,XGDPFP                                         54656021
       BC    XTHRE,FPLDL                  LD,OR,  SDR  N,N  AND  LE     54664021
       BC    UNCON,FPLDS                  LE                            54672021
XMFP00 BAL   XRSUB,FPSETA          SET A-TEXT                           54680021
       LA    XRSUB,XMEDXT                                               54688021
         TM    X2IRX+NX1,XGDPFP                                         54696021
       BC    XTHRE,STORFL               STD                             54704021
       BC    UNCON,STORFS               STE                             54712021
         EJECT                                                          54720021
*                                                                       54728021
*      STERLING REPORT MOVE- CALL TO 'IDR0' IS GENERATED                54736021
*      CALLING SEQUENCE IS-                                             54744021
*                                                                       54752021
*      L    1,GN=ON-SIZE-ERROR RTNE TRANSFER                            54760021
*        OR                                                             54768021
*      SR   1,1  IF NO SIZE ERROR ROUTINE                               54776021
*      LA    0,STELING-REPORT-FIELD.                                    54784021
*      LA   2,LIT=PICTURE ADDR                                          54792021
*      L    15,V(IDR0)                                                  54800021
*      BALR  14,15                                                      54808021
*      DC    AL4(SENDING FIELD)                                         54816021
*      DC    XL1(PICTURE LENGTH)                                        54824021
*      DC   XL3'0'                                                      54832021
*      DC    XL1(LENGTH OF REPORT FIELD)                                54840021
*      DC    XL1(NUMBER OF DECIMAL DIGITS)                              54848021
*      DC    XL1(NUMBER OF POUNDS DIGITS)                               54856021
*      DC    XL1(INFO)                                                  54864021
*                                                                       54872021
       SPACE 5                                                          54880021
XSTREP EQU   XSTMOV                                                     54888021
XSTR00   MVI   XREGNO,XX02                                              54896021
       BAL   XRSUB,XFREER         FREE UP REG 2                         54904021
       SR    XR1,XR1                                                    54912021
       L     XR5,XAOPE2                                                 54920021
         IC    XR1,DX8(XR5)                                             54928021
       SH    XR1,XC005            GET LENGTH OF POCTURE ADDR            54936021
       MVI   DOP5,XGALC           SET UP ALPHANUM. LIT IN DOP5          54944021
         STC   XR1,DOP5+NX1        SET UP LITERAL LENGTH                54952021
       BCTR  XR1,XR0               SUBTRACT 1 FOR EX INSTRUCTION        54960021
       EX    XR1,XSTRMV           SET UP LITERAL OF PICTURE ADDR        54968021
         LA    XR1,DX1(XR1)                                             54976021
       LA    XR2,DOP5                                                   54984021
       ST    XR2,XOP1                                                   54992021
         MVI   XREG1,XX02                                               55000021
       BAL   XRSUB,LA             *  LA  2,LIT=PICTURE ADDR             55008021
       BAL   XRSUB,VBADCE         *  L   15,V(IDR0)                     55016021
       DC    C'IDR0'              *  BALR  14,15                        55024021
       BAL   XR2,SUBST1           *  DC  AL4(SENDING TEMP STOR)         55032021
         STC   XR1,XCON1+NX1                                            55040021
         MVI   XCON1,XX04          *  DC  XL1'PICTURE LENGTH'           55048021
       BAL   XR2,SUBST4           *  DC  XL3,'0'                        55056021
XSTR02   MVC   XCON1+NX1(LX1),DX11(XR5)   DC  XL1(LENGTH OF REPORT FI   55064021
         MVC   XCON1+NX2(LX1),DX13(XR5)   DC  XL1 NUMBER OF DEC         55072021
         MVC   XCON1+NX3(LX1),DX12(XR5)   DC  XL1NUMBER OF POUNDS       55080021
         MVC   XCON1+NX4(LX1),DX9(XR5)    DC  XL1 INFO                  55088021
         MVI   XCON1,XX04                                               55096021
       BAL   XR2,SUBST4            GENERATE DC                          55104021
*                                                                       55112021
       BC    UNCON,XMEDXT          EXIT ROUTINE                         55120021
*                                                                       55128021
*                                                                       55136021
XSTRMV   MVC   DOP5+NX2(LX0),DX14(XR5)                                  55144021
         TITLE 'ARITHMETIC / MOVE / SUBSCRIPT  ROUTINES'                55152021
       SPACE 10                                                         55160021
*      XSZPRO  -  ONSIZE ERROR  PROCESSING -  CHECK IF  CALCULATED      55168021
*              -  RESULT MIGHT BE  GREATER THAN RESULT FIELD - IF Y     55176021
*              -  GENERATE  INSTRUCTIONS TO CHECK THAT CONDITION AN     55184021
*                 TRANSFER TO ON SIZE ERROR CODING.                     55192021
       SPACE 5                                                          55200021
XSZPRO EQU   *                                                          55208021
       STM   XR0,XR15,XGSAV2                                            55216021
         LH    XR6,X2FBS                                                55224021
       AH    XR6,X2ALP                                                  55232021
       SH    XR6,X2DBS                  XR6 HAS NUMB. OF INT. OF RE     55240021
       BC    XLOEQ,XSZP01          NO INTEGERS                          55248021
       AH    XR6,X1DBS                                                  55256021
       SH    XR6,X1ALP                                                  55264021
XSZP03 CH    XR6,X1FBS                                                  55272021
         BNM   XSZP05              NO SIZE ERROR POSSIBLE               55280021
         TM    X1IRX+NX1,XZGNLT                                         55288021
       BC    XZERO,XSZN00          1ST OPERAND IS NOT A LITERAL         55296021
         MVI   XREG1,XX0F                                               55304021
       BC    UNCON,XSZP09          GENERATE BC                          55312021
*                                                                       55320021
XSZN00 EQU   *                                                          55328021
       TM    X1IRX,XGBINR                                               55336021
       BC    XTHRE,XSZP04          1ST OPND IS BINARY                   55344021
XSZP06   STC   XR6,XGTEM2+NX15                                          55352021
         SRA   XR6,DX1                                                  55360021
         LA    XR6,DX1(XR6)                                             55368021
         MVC   XYLEN(LX1),X1LBS+NX1                                     55376021
       BAL   XRSUB,XYOBF                 ZAP  TEMP , OP                 55384021
       LH    XR1,XYTEL                                                  55392021
       SR    XR1,XR6                                                    55400021
       BC    XZERO,XSZP66          TEST LEADING BYTE                    55408021
         MVC   XWC1(LX2),XEREL1                                         55416021
       STH   XR1,XL1                      CLC  TEMP(L),=0               55424021
         STC   XR1,XCON2+NX16            WITH  L= LENGHT OF TEMP -      55432021
       BAL   XRSUB,CLC                           LENGHT OF MAX.NUMB     55440021
XSZP68 MVI   XREG1,XNOEQ                                                55448021
XSZP67 BAL   XR2,XZRDVV            GET TRANSFER                         55456021
         MVC   XGN1(LX2),XZRTRA          BC  COND,SIZE ERROR            55464021
       BAL   XRSUB,BC              GENERATE BC                          55472021
       CH    XR6,XYTEL                                                  55480021
       BC    XZERO,XSZP05          RETURN                               55488021
XSZP66   TM    XGTEM2+NX15,XX01              IF LEADING BYTE HAS TO     55496021
       BC    XTHRE,XSZP05                   HAVE  A LEADING ZERO        55504021
       LH    XR2,XEREL1                         TM  HIGHORDERBYTE,X     55512021
       AR    XR2,XR1                            BC  NOTZERO,ONSIZEE     55520021
       STH   XR2,XWC1                                                   55528021
         MVI   XIMM,XXF0                                                55536021
       BAL   XRSUB,TM              GENERATE TM                          55544021
       LH    XR6,XYTEL                                                  55552021
       BC    UNCON,XSZP68          GENERATE BC                          55560021
*                                                                       55568021
* THERE ARE NO INTEGERS IN THE RECEIVING FIELD, BUT STILL MUST    49550 55576021
* CHECK IF THERE ARE LESS P'S TO RIGHT OF DECIMAL POINT IN        49550 55584021
* SENDING FIELD THAN IN RECEIVING FIELD.                          49550 55592021
*                                                                       55600021
XSZP01   DS    0H                                                 49550 55608021
         LH    XR6,X1DBS                                          49550 55616021
         SR    XR1,XR1                                            49550 55624021
         CLI   X2IRX,XXF5          NUMERIC EDITED                 49550 55632021
         BE    XSZP02              YES                            49550 55640021
         TM    DOP2+XGSCAL,XGSCSG  NO, LEFT SCALE                 49550 55648021
         BO    XSZP03              YES                            49550 55656021
         IC    XR1,DOP2+XGSCAL     NO, PICK UP NUMBER OF DECIMALS 49550 55664021
         B     XSZP07              CONTINUE                       49550 55672021
XSZP02   DS    0H                                                 49550 55680021
         TM    DOP2+NX10,XGSCSG    LEFT SCALE                     49550 55688021
         BO    XSZP03              YES                            49550 55696021
         IC    XR1,DOP2+NX10       NO, PICK UP NUMBER OF DECIMALS 49550 55704021
XSZP07   DS    0H                                                 49550 55712021
         SR    XR6,XR1             #DEC IN SF - #DEC IN RF        49550 55720021
         IC    XR1,DOP2+XGDGLG     PICK UP #DIGITS IN RF          49550 55728021
         SLL   XR1,DX27            SHIFT OUT HIGH ORDER 3 BITS    49550 55736021
         SRL   XR1,DX27            IN CASE RF IS NUMERIC EDITED   49550 55744021
         AR    XR6,XR1             ADD #DIGITS                    49550 55752021
         BNM   XSZP03              CHECK IF SIZE ERROR POSSIBLE   49550 55760021
         SR    XR6,XR6                                            49550 55768021
         B     XSZP03              CHECK IF SIZE ERROR POSSIBLE   49550 55776021
       SPACE 2                                                          55784021
XSZP04 LA    XRSUB,XSZP06               IF DP BINARY GO TO ID           55792021
         CLI   X1BBS+NX1,XX04                                           55800021
       BC    XTWO,XBIIDB           DP, GO TO ID                         55808021
*                                                                       55816021
       SPACE 2                                                          55824021
         LTR   XR6,XR6                                                  55832021
         BE    XSZP14              GENERATE COMPARE INSTRUCTION         55840021
         LH    XR1,XC001                                                55848021
XSZP08 MH    XR1,XC010                          L RA, OP                55856021
       BCT   XR6,XSZP08                        LPR RB,RA                55864021
XSZP15   EQU   *                                                        55872021
         BAL   XRSUB,XSLOAS        GENERATE LOAD INSTRUCTION            55880021
       LH    XR5,XMINTW                                                 55888021
       BAL   XRSUB,XZBINB          SET A-TEXT                           55896021
       BAL   XRSUB,XRSASG                      C(H)  RA ,= 10...0       55904021
         MVC   XREG1(LX1),XREGNO                BC    XGTEQ,ONSIZ ER    55912021
       BAL   XRSUB,LPR             GENERATE LPR                         55920021
         MVC   XREG1(LX1),XREGNO                                        55928021
         ST    XR1,XCON1+NX12                                           55936021
         MVI   XCON1+NX16,XX04                                          55944021
       BAL   XRSUB,COMP            GENERATE A COMPARE INSTRUCTION       55952021
       MVI   XREG1,XGTEQ                                                55960021
XSZP09 LH    XR6,XYTEL                                                  55968021
       BC    UNCON,XSZP67          GENERATE BC                          55976021
*                                                                       55984021
XSZP14   SR    XR1,XR1                                                  55992021
         B     XSZP15              GENERATE COMPARE                     56000021
       SPACE 5                                                          56008021
*      XSZPRI   -GENERATE TRANSFER NECESSARY AFTER THE STORE TO BYP     56016021
*               -THE ON SIZE ERROR CODING.                              56024021
       SPACE 3                                                          56032021
XSZPRI STM   XR0,XR15,XGSAV2                                            56040021
       TM    XGNSW,XADDCR                                               56048021
       BC    XZERO,XSZP10               NOT  ADD  CORRESPONDING         56056021
       TM    XGSWT,XADDCR                                               56064021
       BC    XTHRE,XSZP11               LAST ADD OF AN ADD CORRESPO     56072021
         MVI   XREG1,XX0F                         BC  UNCON,5GN2        56080021
       BAL   XRSUB,XSTLHN          GET TRANSFER                         56088021
       BAL   XRSUB,BC              GENERATE BC                          56096021
         BAL   XR5,XSZPRY              GENERATE GN                      56104021
         MVI   XIMM,XX80                 ON.                            56112021
*----    SET  SWITH                                                     56120021
         MVI   GDEBG1,XX04                                              56128021
       BAL   XRSUB,OI              GENERATE OI                          56136021
         MVC   PH4GN+NX1(LX2),XGNTMP   MOVE GN #                        56144021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 56152021
XSZP05   DS    0H                  ERROR SWITCH                         56160021
         LM    XR0,XR15,XGSAV2     EXIT                                 56168021
         BR    XRSUB               RETURN                               56176021
       SPACE 2                                                          56184021
XSZP11   MVI   XIMM,XX80                      TM  XSWT,X'80'            56192021
*---   SET SWITCH                                                       56200021
       XI    XGNSW,XADDCR          RESET ADD CORRESPONDING SWT.         56208021
         MVI   GDEBG1,XX04                                              56216021
       BAL   XRSUB,TM              GENERATE TM                          56224021
       MVI   XREG1,XZERO                      BC  XZERO,4GN (GOTO O     56232021
*                                            SIZE ERROR).               56240021
XSZP12   MVC   XGN1(LX2),XSZTRA                                         56248021
       BAL   XRSUB,BC              GENERATE BC                          56256021
       LA    XR5,XSZP05                                                 56264021
XSZPRY EQU   *                                                          56272021
       TM    XGNSW,XZRDIV                                               56280021
       BC    XZERO,XSZP21               WRITE OUT LABEL                 56288021
         MVC   PH4GN+NX1(LX2),XZRTRA   MOVE GN #                        56296021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 56304021
         NI    XGNSW,XXFD                                               56312021
         BAL   XRSUB,KILSUB   KILL SUBSCRIPT OPTIMIZATION         51323 56320021
XSZP21 EQU   *                                                          56328021
       BCR   UNCON,XR5             RETURN                               56336021
       SPACE 2                                                          56344021
XSZP10   MVI   XREG1,XX0F                   BC  UNCON,4GN   BYPASS O    56352021
       BC    UNCON,XSZP12                  SIZE ERROR CODING.           56360021
       SPACE 10                                                         56368021
*      XMVSCL   SCALING FOR MOVE OR STORE  OF THE SENDING FIELD TO      56376021
*               ALIGN IT WITH THE  RECEIVING FIELD.                     56384021
       SPACE 5                                                          56392021
XMVSCL STM   XR0,XR15,XGSAV1                                            56400021
       LH    XR6,Y1DBS(XR5)          DEC OF SENDING                     56408021
       STH   XR6,Y1DAS(XR3)                                             56416021
       SH    XR6,Y1DBS(XR3)          - DEC OF RECEIVING                 56424021
       AH    XR6,Y1ALP(XR3)          + NUMBER OF P'S OF SENDING(999     56432021
       SH    XR6,Y1ALP(XR5)          -   -       P'S    RECEIV          56440021
       STH   XR6,Y1ALP(XR3)          = SCALING FACTOR OF SENDING        56448021
         BAL   XRSUB,XZX3X5        SWITCH OPERANDS                      56456021
       BAL   XRSUB,XSCAL             SCALE (COMPILE TIME SCALING)       56464021
         TM    Y1IRX+NX1(XR5),XGOVFL  IF OVERFLOW                       56472021
       BC    XTHRE,XMVSCO          SET NUMBER OF INTEGERS TO TRUNC      56480021
XMVSEX   MVC   Y1LAS(LX8,XR3),Y1LBS(XR3)                                56488021
       LM    XR0,XR15,XGSAV1                                            56496021
       BCR   UNCON,XRSUB           RETURN                               56504021
XMVSCO LH    XR6,Y1FBS(XR5)  DETERMINE NUMB. OF INTEG. TO BE TRUNCA     56512021
       AH    XR6,Y1ALP(XR5)          TRUNCATED.                         56520021
       SH    XR6,XC030                                                  56528021
       STH   XR6,Y1IND(XR5)                                             56536021
       BAL   XRSUB,XSETOP          SET BUFFWR TO MAX                    56544021
       BC    UNCON,XMVSEX          RETURN                               56552021
       SPACE 5                                                          56560021
* GEN CODING TO CONVERT IFP DN'S TO EFP IN PARAM AREA                   56568021
*     PRIOR TO DISPLAY OR EXHIBIT STRINGS.                              56576021
*     ENTERED FROM MOVE ANALYZER.                                       56584021
DIFPMV EQU   *                                                          56592021
       TM    FLAGSW,MSWON          SECOND STRING MOVES...               56600021
       BC    ONES,DON               YES, IGNORE THIS MOVE               56608021
       LA    RW1,DIFPC1                                                 56616021
       LA    RW2,DIFPC2            ASSUME SINGLE PRECISION              56624021
       LA    RW5,FPLENS                                                 56632021
         TM    DOP1+NX9,XX01        SINGLE PRECISION...                 56640021
       BC    ZERO,DIFP01            YES,                                56648021
       LA    RW1,RW4+DIFPC1           NO, DOUBLE PRECISION              56656021
       LA    RW2,RB1+DIFPC2                                             56664021
       LA    RW5,FPLENL                                                 56672021
       LA    RW4,DOP1                                                   56680021
       ST    RW4,OP1                                                    56688021
       BAL   RETRG,LDFLL           *    LD   0,DN      IF DOUBLE PR     56696021
       BC    UNCOND,DIFP02         GENERATE CNOP                        56704021
DIFP01 BAL   RETRG,SUBNL           *    SDR  0,0       IF SINGLE PR     56712021
         MVC   OP1(LX4),XAOPE1                                          56720021
       BAL   RETRG,LDFLS           *    LE   0,DN                       56728021
DIFP02   MVI   IMM,XX18                                                 56736021
       BAL   RETRG,CNOP            *    CNOP 6,8                        56744021
       LA    RW3,DIFPVI            *    L    15,VIRT=IFEF               56752021
       BAL   RETRG,VBALRE          *    BLAR 14,15                      56760021
         MVI   GMACDC,XX04                                              56768021
         MVC   GMACDC+NX1(LX4),DX0(RW1)                                 56776021
       MVI   GMCTYP,MDC                                                 56784021
       BAL   RETRG,MACRO           *    DC   XL4'080E0100'              56792021
*                              OR...            '11170100'              56800021
         MVI   GMACDC,XX08                                              56808021
         MVC   GMACDC+NX1(LX8),DX0(RW2)                                 56816021
       MVI   GMCTYP,MDC                                                 56824021
       BAL   RETRG,MACRO           *    DC   XL8'FL-PT-8'               56832021
*                              OR...         XL8'FL-PT-17'              56840021
         STC   RW5,XL1+NX1                                              56848021
       STH   RW5,DIPARE                                                 56856021
         MVI   BDISP2,XXD0                                              56864021
         MVI   BDISP2+NX1,MWORKA    DISPLACEMENT OF OTSR WORK AREA      56872021
         MVI   XCNTR1,XX1C                                              56880021
         MVI   XCNTR1+NX2,XX01                                          56888021
         MVC   PLUS1+NX1(LX2),DOP2+NX2                                  56896021
       BAL   RETRG,MVC             *    MVC  PARAM1+N(14),120(13)       56904021
*                              OR...                 (23)               56912021
         MVC   DIFPNN(LX2),DOP2+NX2                                     56920021
       AH    RW5,DIFPNN                                                 56928021
       CH    RW5,PARMAX           UPDATE PARMAX IN                      56936021
       BNH   DON                  COMMON IF NECESSARY                   56944021
       STH   RW5,PARMAX                                                 56952021
       BC    UNCOND,DON            RETURN TO CONTROL                    56960021
XMRPTG L     XRVERB,ARPMOV        GO TO REPORT MOVE                     56968021
       BCR     UNCOND,XRVERB       ANALYZER                             56976021
         EJECT                                                          56984021
IKF50D CSECT                                                            56992021
*                                                                       57000021
*                                                                       57008021
*=1    REPORT MOVE ANALYZER                                             57016021
*                                                                       57024021
*                                                                       57032021
       USING *,XRVERB                                                   57040021
RPMOVE EQU   *                                                          57048021
         XC    RPDATA(LX70),RPDATA  INITIALIZE DATA AREAS TO 0.         57056021
*                                                                       57064021
* DEVELOP EDIT PATTERN                                                  57072021
*                                                                       57080021
         MVI   RPPAT,XX40           BLANK TO BYTE 1 OF PATTERN          57088021
         LA    XR6,RPPAT+NX1        POINT XR6 TO BYTE 2                 57096021
         TM    X2FAS+NX1,XX01       IS NUMBER OF DIGITS ODD             57104021
       BC    ONES,RPPRES           YES                                  57112021
         MVI   RPPAT+NX1,XX20       NO-ENTER DIG SELECT FOR LEADING     57120021
         MVI   RPEVNL+NX1,XX01      WHICH WILL BE IGNORED IN FINAL M    57128021
         LA    XR6,DX1(XR6)         POINT TO NEXT BYTE OF PATTERN       57136021
RPPRES SR    XR3,XR3                                                    57144021
       SR    XR4,XR4                                                    57152021
         LA    XR2,DOP2+NX8         GET ADDR OF BYTE 7 OF RPT ATTRIB    57160021
         IC    XR3,DOP2+NX8                                             57168021
       AR    XR2,XR3               ADD COUNT OF REPORT BYTES            57176021
       BCTR  XR2,RW0                 SUB 1, GIVING ADDR OF LAST PIC     57184021
       ST    XR2,RPLAST                                                 57192021
         LA    XR5,DOP2+NX12        POINT XR5 TO FIRST PICTURE CHARA    57200021
       BC    UNCOND,RPSCA1         PICK UP NO OCCURRENCES IN REG4       57208021
*                                                                       57216021
RPSCAN AR    XR6,XR4               UPDATE POINTER TO PATTERN            57224021
       C     XR5,RPLAST            WAS LAST PICT CHAR PROCESSED         57232021
       BC    EQ,RPLNTH             YES                                  57240021
         LA    XR5,DX2(XR5)         NO-POINT TO NEXT PICTURE CHARACT    57248021
RPSCA1   IC    XR4,DX1(XR5)         PICK UP NO. OCCURRENCES IN XR4      57256021
         CLI   DX0(XR5),XC9                                             57264021
       BC    EQ,RPS9S              G                                    57272021
         CLI   DX0(XR5),XX4E                                            57280021
       BC    EQ,RPSSGN             +                                    57288021
         CLI   DX0(XR5),XX60                                            57296021
       BC    EQ,RPSSGN             -                                    57304021
         CLC   DX0(LX1,XR5),CURSGN       CURRENCY SIGN IS IN COMMON CEL 57312021
       BC    EQ,RPSSGN             $                                    57320021
         CLI   DX0(XR5),XX5C                                            57328021
       BC    EQ,RPSSUP             *                                    57336021
         CLI   DX0(XR5),XCZ                                             57344021
       BC    EQ,RPSSUP             Z                                    57352021
         CLC   DX0(LX1,XR5),COMMAD+NX1                                  57360021
       BC    EQ,RPSDEC             .                                    57368021
         CLC   DX0(LX1,XR5),COMMAD                                      57376021
       BC    EQ,RPSINS             ,                                    57384021
         CLI   DX0(XR5),XX40                                            57392021
       BC    EQ,RPSINS             B                                    57400021
         CLI   DX0(XR5),XC0                                             57408021
       BC    EQ,RPSINS             0                                    57416021
       BC    UNCOND,RPSCRD         CR,DB                                57424021
*                                                                       57432021
* CHARACTER IS 9                                                        57440021
*                                                                       57448021
RPS9S  TM    RPNUMS,MSWON          IS IT FIRST NUMERIC CHARACTER        57456021
       BC    ONES,RPS9S1           NO                                   57464021
         MVI   RPPAT,XC0            YES-MAKE ZERO THE FILL CHAR         57472021
       BAL   XRSUB,RPSNM           DO PROCESSING FOR 1ST NUMERIC CH     57480021
         MVI   DX0(XR6),XX21        ENTER SIGNIF START CHAR IN PATTE    57488021
       BC    UNCOND,RPSCAN         GO GET NEXT PICT CHAR                57496021
RPS9S1 BAL   XRSUB,RPPRP2          NOT 1ST NUMERIC-PROPAGATE IN PAT     57504021
RPS9SD TM    RPSTRS,MSWON          DOES IT FOLLOW FLTG OR SUPP STRI     57512021
       BC    ZERO,RPSCAN           NO                                   57520021
       L     XR3,RPLSTN            YES-                                 57528021
         MVI   DX0(XR3),XX21        PUT SIG ST IN LAST NUMERIC POSIT    57536021
       LR    XR2,XR6               CALC NO. OF INSERTION CHARS TO B     57544021
       SR    XR2,XR3               OVERLAID WITH FILL IF THEY PRECE     57552021
       BCTR  XR2,RW0                 FIRST SIGNIF. POSITION.            57560021
         CLI   RFLTIL+NX1,XX00      DOES IT FOLLOW FLOATING STRING      57568021
       BC    EQ,RPS9S2             NO        N=XRG-RPLSTN-1             57576021
       BCTR  XR2,RW0                 YES       N=XRG-RPLSTN-2           57584021
       LR    XR3,XR6                                                    57592021
       S     XR3,ARPPTM                                                 57600021
       STH   XR3,RPLAD             SAVE CURR DISPLACEMENT FOR LA        57608021
RPS9S2 CH    XR2,XC000             ANY INSERTION CHARS TO OVERLAY       57616021
       BC    NOTHI,RPS9S3          NO                                   57624021
         MVI   RINSL1+NX1,XX0C      YES                                 57632021
       L     XR3,RPLSTN                                                 57640021
       S     XR3,ARPPTM                                                 57648021
       STH   XR3,RPLSTD            SAVE DISP OF LAST NUM FOR TM         57656021
       CH    XR2,XC001             IS THERE MORE THAN 1 CHAR TO OVE     57664021
       BC    NOTHI,RPS9S3          NO                                   57672021
         MVI   RINSL2+NX1,XX06      YES                                 57680021
       BCTR  XR2,RW0               SUBTRACT 1 FROM REG2                 57688021
       STH   XR2,RPLM1             SAVE N-1 AS LENGTH FOR MVC           57696021
RPS9S3 NI    RPSTRS,MSWOFF         TURN OFF STRING SWITCH               57704021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       57712021
*                                                                       57720021
* CHARACTER IS +,- OR $                                                 57728021
*                                                                       57736021
RPSSGN TM    RPNUMS,MSWON          DID ANY NUMERIC CHARACTERS PRECE     57744021
       BC    ZERO,RPSSG4           NO-L.H.SIGN OR FIRST FLTG CHAR       57752021
         CLC   DX0(LX1,XR5),CURSGN       YES, IS IT CURRENCY SIGN...    57760021
         BE    RPSSG1                  YES, MUST BE FLTG CURRENCY SIGN  57768021
         CLI   RSGNL1+NX1,XX00      NO-WAS THERE ANY PREVIOUS SIGN      57776021
       BC    EQ,RPSSG2             NO-MUST BE R.H.SIGN                  57784021
*                                                                       57792021
RPSSG1 BAL   XRSUB,RPPRP1          FLTG CHAR-PROPAGATE                  57800021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       57808021
*                                                                       57816021
RPSSG2   MVI   DX0(XR6),XX60        R.H.SIGN-PUT - IN PATTERN           57824021
         CLC   RPRINL(LX2),XC000    ANY R.H INSERTION CHARS             57832021
       BC    EQ,RPSSG3             NO                                   57840021
       LH    XR3,RPRINL            YES-UPDATE R.H.INSERTION COUNT       57848021
         LA    XR3,DX1(XR3)                                             57856021
       STH   XR3,RPRINL                                                 57864021
RPSSG3 LR    XR3,XR6                                                    57872021
       S     XR3,ARPPTM                                                 57880021
       STH   XR3,RPSGND            SAVE DISPLACEMENT FOR MVI            57888021
       BC    UNCOND,RPSSG7         GO SAVE SIGN                         57896021
RPSSG4   MVC   DX0(LX1,XR6),DX0(XR5) LH SIGN OR 1ST FLT. PUT IN PATTE   57904021
*                                  JUST SO IT WILL SHOW IN LITERAL.     57912021
       CH    XR4,XC001             CHK NO. OCCURRENCES                  57920021
       BC    NOTHI,RPSSG5          ONE-L.H SIGN                         57928021
       BCTR  XR4,RW0                 1ST FLT. N-1 NOMERIC POSITIONS     57936021
         LA    XR6,DX1(XR6)         UPDATE PATTERN POINTER              57944021
       BAL   XRSUB,RPSNM           DO PROCESSING FOR 1ST NUM CHARS      57952021
         MVI   RFLTIL+NX1,XX02      INDICATE FLT                        57960021
       OI    RPSTRS,MSWON          TURN ON STRING SWITCH                57968021
*                                                                       57976021
RPSSG5 LR    XR3,XR6               LH SIGN                              57984021
       S     XR3,ARPPTM                                                 57992021
         CLC   DX0(LX1,XR5),CURSGN       IS IT CURRENCY SIGN?           58000021
       BC    NOTEQ,RPSSG6          CHECK FOR PLUS OR MINUS              58008021
         MVI   RDOLIL+NX1,XX04      YES                                 58016021
         STH   XR3,RPDOLD              SAVE DISPL FOR MVI OF CURR SIGN  58024021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58032021
RPSSG6   MVI   RSGNL1+NX1,XX04      PLUS OR MINUS                       58040021
       STH   XR3,RPSGND            SAVE DISPL FOR MVI                   58048021
RPSSG7   MVC   RPSIGN(LX1),DX0(XR5)  SAVE SIGN                          58056021
         MVI   RSGNL2+NX1,XX08      SET SWITCH FOR BC, MVI              58064021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58072021
*                                                                       58080021
*      * OR Z                                                           58088021
*                                                                       58096021
RPSSUP TM    RPNUMS,MSWON          IS IT FIRST NUMERIC CHAR             58104021
       BC    ZERO,RPSSU1           YES                                  58112021
       BAL   XRSUB,RPPRP1          NO-PROPAGATE IN PATTERN              58120021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58128021
RPSSU1   CLI   DX0(XR5),XX5C        IS IT *                             58136021
       BC    NOTEQ,RPSSU2          NO                                   58144021
         MVI   RPPAT,XX5C           YES-MAKE IT THE FILL CHAR           58152021
RPSSU2 BAL   XRSUB,RPSNM           DO PROCESSING FOR 1ST NUM CHAR       58160021
       OI    RPSTRS,MSWON          TURN ON STRING SWITCH                58168021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58176021
*                                                                       58184021
*      7 B OR 0                                                         58192021
*                                                                       58200021
RPSINS   MVC   RPCHAR,DX0(XR5)      SAVE CHARACTER                      58208021
       BAL   XRSUB,RPPRP3          PROPAGATE IN PATTERN                 58216021
       TM    RPNUMS,MSWON          ANY NUMERIC CHARACTERS YET           58224021
       BC    ONES,RPSIN2           CHK IF ALL NUM CHARS SCANNED         58232021
RPSIN1 LH    XR3,RPLINL            NO-UPDATE L.H. INS CHAR COUNT        58240021
       AR    XR3,XR4                                                    58248021
       STH   XR3,RPLINL                                                 58256021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58264021
RPSIN2   CLC   RPNMCT(LX2),X2FAS    YES-HAVE ALL NUM CHARS BEEN SCAN    58272021
       BC    NOTEQ,RPSCAN          NO                                   58280021
RPSIN3 LH    XR3,RPRINL            YES-UPDATE R.H. INS CHAR COUNT       58288021
       AR    XR3,XR4                                                    58296021
       STH   XR3,RPRINL                                                 58304021
       BC    UNCOND,RPSCAN         UPDATE POINTER TO PATTERN,SCAN       58312021
*                                                                       58320021
*      .  (ACTUAL DECIMAL POINT)                                        58328021
*                                                                       58336021
RPSDEC LR    XR3,XR6                                                    58344021
       S     XR3,ARPPTM                                                 58352021
       STH   XR3,RPDECD            SAVE DISPLACEMENT (FOR * WHEN ZE     58360021
         MVC   DX0(LX1,XR6),DX0(XR5) PUT FUNCTIONAL DEC-PT IN PATTERN   58368021
       TM    RPNUMS,MSWON          ANY NUMERIC CHARACTERS YET           58376021
       BC    ZERO,RPSIN1           NO-TREAT AS L.H. INS. CHAR.          58384021
         CLC   RPNMCT(LX2),X2FAS    HAVE ALL NUM CHARS BEEN SCANNED     58392021
       BC    EQ,RPSIN3             YES                                  58400021
       BC    UNCOND,RPS9SD         NO-IF STRING GOING, SAME EFFECT      58408021
*                                                                       58416021
*      CR,DB                                                            58424021
*                                                                       58432021
RPSCRD   MVC   DX0(LX2,XR6),DX0(XR5) ENTER IN PATTERN                   58440021
         CLC   RPRINL(LX2),XC000    ANY R.H. INS CHARACTERS             58448021
       BC    NOTEQ,RPCR1           YES-GO TREAT AS R.H.INS.             58456021
         CLI   RPPAT,XX40           NO-IS BLANK THE FILL CHAR           58464021
       BC    NOTEQ,RPCR2           NO-MVI,MVI REQUIRED                  58472021
       BC    UNCOND,RPCR3          YES-GO UPDATE PATTERN PTR, EXIT      58480021
RPCR1  LH    XR3,RPRINL            R.H.INS CHARS-UPDATE COUNT           58488021
         LA    XR3,DX2(XR3)                                             58496021
       STH   XR3,RPRINL                                                 58504021
RPCR2  LR    XR3,XR6                                                    58512021
       S     XR3,ARPPTM                                                 58520021
         LA    XR3,DX1(XR3)                                             58528021
       STH   XR3,RPSGND            SAVE DISPLACEMENT FOR MVI'S          58536021
         MVI   RSGNL2+NX1,XX08      SET SWITCHES FOR BC, MVI, MVI       58544021
         MVI   RSGNL3+NX1,XX04                                          58552021
RPCR3    LA    XR6,DX2(XR6)                                             58560021
       BC    UNCOND,RPLNTH         MUST BE LAST CHAR-SCAN FINISHED      58568021
*                                                                       58576021
* ROUTINE FOR FIRST NUMERIC CHARACTER   (9,*,Z, FLOATING $,+,-)         58584021
*                                                                       58592021
RPSNM  ST    XRSUB,RPSNSV                                               58600021
       OI    RPNUMS,MSWON          INDICATE NUMERIC CHARACTER SCANN     58608021
         CLC   RPLINL(LX2),XC000    ANY L.H. INSERTION CHARACTERS       58616021
       BC    EQ,RPSNM3             NO-GO PROPAGATE                      58624021
       LH    XR3,RPLINL            YES-                                 58632021
         CLI   RDOLIL+NX1,XX00     DOES FIXED CURR SIGN PRECEDE...      58640021
       BNE   RPSNMA               YES                                   58648021
         CLI   RSGNL1+NX1,XX00     NO, DOES FIXED + OR - PRECEDE        58656021
       BE    RPSNM0               NO                                    58664021
RPSNMA   LA    XR3,DX1(XR3)        YES,ADD TO LEFT HND INSERTN COUNT    58672021
         STH   XR3,RPLINL                                               58680021
RPSNM0   BCTR  XR3,RW0             SUBTRACT 1 FROM REG3                 58688021
       LA    XR2,RPPAT                                                  58696021
       AH    XR2,RPEVNL                                                 58704021
       IC    XR1,RPPAT             SAVE FILL                            58712021
       EX    XR3,RPMVIN            MOVE INS CHARS TO LEFT OF FILL       58720021
       AH    XR2,RPLINL                                                 58728021
         MVI   DX0(XR2),XX20        ENTER DIGIT SELECT FOR LDG ZERO.    58736021
       SH    XR2,RPEVNL            IF NO LDG ZERO, RPEVNL=0, AND FI     58744021
         STC   XR1,DX0(XR2)         OVERLAYS.  OTHERWISE,FILL PRECED    58752021
         LA    XR3,DX3                                                  58760021
         LA    XR2,DX0                                                  58768021
*                                 DECREMENT DISPLACEMENTS BY AMT        58776021
*                                 INSERTION CHARS WERE SHIFTED          58784021
*                                 (1+RPEVNL)                            58792021
RPSNM2 LH    XR1,RPSGND(XR2)                                            58800021
       BCTR  XR1,XR0               SUBTRACT 1 FROM REG1                 58808021
       SH    XR1,RPEVNL                                                 58816021
       STH   XR1,RPSGND(XR2)                                            58824021
         LA    XR2,DX2(XR2)                                             58832021
       BCT   XR3,RPSNM2           IF MORE FIELDS GO CHECK               58840021
RPSNM3 BAL   XRSUB,RPPRP1          PROPAGATE DIG SELECT IN PATTERN      58848021
       L     XRSUB,RPSNSV                                               58856021
       BCR   UNCOND,XRSUB          EXIT                                 58864021
RPMVIN   MVC   RPPAT(LX1),DX1(XR2)   EXECUTED MOVE OF L.H. INS CHARS    58872021
*                                                                       58880021
* ROUTINE TO PROPAGATE CHARACTERS IN EDIT PATTERN                       58888021
*                                                                       58896021
RPPRP1 LR    XR3,XR4               ENTRY PT. FOR 1ST NUM CHAR-GET C     58904021
       AR    XR3,XR6               ADD ADDR OF CURRENT PATTERN BYTE     58912021
       BCTR  XR3,RW0                 LESS 1                             58920021
       ST    XR3,RPLSTN            SAVE AS ADDR OF LAST NUM POSITIO     58928021
RPPRP2   MVI   RPCHAR,XX20          ENTRY/NON-1ST NUM. PROP. DIG. SE    58936021
       LH    XR3,RPNMCT                                                 58944021
       AR    XR3,XR4                                                    58952021
       STH   XR3,RPNMCT            UPDATE COUNT OF NUMERIC POSITION     58960021
RPPRP3   MVC   DX0(LX1,XR6),RPCHAR   NON-NUM ENTRY PT. MV CHAR TO PAT   58968021
       LR    XR3,XR4                                                    58976021
       CH    XR3,XC001                                                  58984021
       BCR   NOTHI,XRSUB           EXIT                                 58992021
       SH    XR3,XC002                                                  59000021
       EX    XR3,RPPRMV            MORE THAN ONE-PROPAGATE IT           59008021
       BCR   UNCOND,XRSUB          EXIT                                 59016021
RPPRMV   MVC   DX1(LX1,XR6),DX0(XR6) EXECUTED MOVE TO PROPAGATE CHAR    59024021
*                                                                       59032021
* CALCULATE INSTRUCTION LENGTHS AND OTHER REQUIRED PARAMETERS           59040021
*                                                                       59048021
RPLNTH BCTR  XR6,RW0               SUBTRACT 1 FROM REG6                 59056021
       S     XR6,ARPPTM                                                 59064021
       STH   XR6,RPTS2D            SAVE PATTERN DISPL AS TS2 DISPL      59072021
       LH    XR6,RSGNL1            COMPUTE SIGN INSTRUCTION LENGTHS     59080021
       AH    XR6,RSGNL2                                                 59088021
       AH    XR6,RSGNL3                                                 59096021
       STH   XR6,RSGNIL                                                 59104021
       LH    XR6,RINSL1            COMPUTE INSERTION-FILLING INSTR      59112021
       AH    XR6,RINSL2                                                 59120021
       STH   XR6,RINSIL                                                 59128021
         TM    DOP2+NX9,XX80        IS BLANK WHEN ZERO INDICATED        59136021
       BC    ZERO,RPLTH1           NO                                   59144021
         MVI   RPBCHR,XX40          YES-SAVE BLANK AS IMMED. VALUE      59152021
       BC    UNCOND,RPLTH2         GEN BC AND MVI ATXT INSTRUCS         59160021
RPLTH1   TM    DOP2+NX9,XX40        IS ASTERISK WHEN ZERO INDICATED     59168021
       BC    ZERO,RPLTH5           NO                                   59176021
         MVI   RPBCHR,XX5C          YES-SAVE * AS IMMED. VALUE          59184021
         CLC   RPDECD(LX2),XC000    ANY DECIMAL PT.                     59192021
       BC    EQ,RPLTH2             NO                                   59200021
         MVI   RBWZL3+NX1,XX04      YES-INSTR TO RESTORE REQUIRED       59208021
RPLTH2   MVI   RBWZL1+NX1,XX08      BC,MVI                              59216021
       LH    XR6,RPTS2D                                                 59224021
       SH    XR6,RPEVNL                                                 59232021
       CH    XR6,XC002             IS THERE MORE THAN 1 BYTE TO FIL     59240021
       BC    NOTHI,RPLTH3          NO                                   59248021
         MVI   RBWZL2+NX1,XX06      YES- MVC REQUIRED                   59256021
RPLTH3 LH    XR6,RFLTIL                                                 59264021
       AH    XR6,RSGNIL                                                 59272021
       AH    XR6,RDOLIL                                                 59280021
       AH    XR6,RINSIL                                                 59288021
       CH    XR6,XC000             WILL ANY EDITING INSTRUCTIONS FO     59296021
       BC    EQ,RPLTH4             NO                                   59304021
         MVI   RBWZL4+NX1,XX04      YES-BRANCH AROUND REQUIRED          59312021
RPLTH4 LH    XR5,RBWZL1            NOW CALCULATE BWZ INSTR LENGTHS      59320021
       AH    XR5,RBWZL2                                                 59328021
       AH    XR5,RBWZL3                                                 59336021
       AH    XR5,RBWZL4                                                 59344021
       STH   XR5,RBWZIL                                                 59352021
RPLTH5 LH    XR6,RFLTIL            COMPUTE TOTAL LENGTH OF EDITING      59360021
       AH    XR6,RSGNIL            INSTRUCTIONS FOLLOWING BALR          59368021
       AH    XR6,RDOLIL                                                 59376021
       AH    XR6,RINSIL                                                 59384021
       AH    XR6,RBWZIL                                                 59392021
       STH   XR6,RPTOTL                                                 59400021
*                                                                       59408021
* GENERATE INSTRUCTIONS                                                 59416021
*                                                                       59424021
         TM    X1IRX+NX1,XZGNLT    IS SOURCE FIELD A LITERAL...         59432021
       BC    NOTEQ,RPGMVS          YES                                  59440021
         CLI   X1TEL+NX1,XX00       NO-IS DATA NAME IN TS               59448021
       BC    NOTZER,RPGMVS         YES                                  59456021
         CLC   X1FAS(LX2),X2FAS     NO-IS SOURCE SHORTER                59464021
       BC    EQ,RPGMVP             NO                                   59472021
RPGMVS LH    XR6,X2FAS             YES                                  59480021
         SRA   XR6,DX1                                                  59488021
         LA    XR6,DX1(XR6)                                             59496021
       STC   XR6,XYLEN             XR6 HAS NO.BYTES FOR ID NUMBER       59504021
       LA    XR3,X1VAL                                                  59512021
       BAL   XRSUB,XYOAF           GEN. MOVE TO TS, IF NOT DONE         59520021
       LH    XR5,XEREL1                                                 59528021
       AH    XR5,XYTEL                                                  59536021
       SR    XR5,XR6                                                    59544021
       STH   XR5,RPIDD             SAVE DISPLACEMENT IN TS              59552021
       OI    RTSEDS,MSWON          INDICATE EDIT SOURCE IS TS           59560021
*                                                                       59568021
RPGMVP   MVI   XCNTR1,XX30                                              59576021
         MVI   XCNTR1+NX2,XX01                                          59584021
         MVC   XOP1(LX4),XAOPE3                                         59592021
       LH    XR6,RPTS2D                                                 59600021
       STH   XR6,XL1                                                    59608021
         STC   XR6,DOP3+NX1                                             59616021
         MVI   DOP3,XX34                                                59624021
       BAL   XRSUB,MVC             MVC   TS2(RPTS2D),=PATTERN           59632021
*                                                                       59640021
         CLC   RPLAD(LX2),XC000     WAS DISPL SAVED FOR LA              59648021
       BC    EQ,RPGED              NO (NON-FLT OR NO SIG STRT IN PA     59656021
         MVI   XREGNO,XX01                                              59664021
       BAL   XRSUB,XFREER          FREE REG1                            59672021
         MVI   XREG1,XX01                                               59680021
         MVI   XCNTR1,XX30                                              59688021
         MVC   XCNTR1+NX1(LX2),RPLAD                                    59696021
       BAL   XRSUB,LA              LA    1,C(RPLAD)                     59704021
       BC    UNCOND,RPGED3         CHECK IF SOURCE IN TS                59712021
*                                                                       59720021
RPGED    CLI   RFLTIL+NX1,XX00     IS IT FLOAT                     1    59728021
       BC    EQ,RPGED3             NO, BRANCH                     1     59736021
         MVI   XREGNO,XX01         STORE REG1 WHICH IS USED IN     1    59744021
       BAL   XRSUB,XFREER         EDMK INSTRUCTION                1     59752021
RPGED3 TM    RTSEDS,MSWON         IS SOURCE IN TS                       59760021
       BC    ZERO,RPGED1           NO,SKIP NXT 2 INSTRUCS               59768021
         MVC   XWC2(LX2),RPIDD      YES                                 59776021
       BC    UNCOND,RPGED2         SKIP NXT INSTRUC IF DNM IN TS        59784021
RPGED1   MVC   XOP1(LX4),XAOPE1     NO-SOURCE IS DATA-NAME IN DOP1      59792021
RPGED2   MVI   XCNTR1,XX30                                              59800021
       LH    XR6,RPLINL                                                 59808021
         LA    XR6,DX1(XR6)         DISPL OF FILL CHAR IN IS2 = 1+RP    59816021
         STC   XR6,XCNTR1+NX2                                           59824021
       LH    XR6,RPTS2D                                                 59832021
       SH    XR6,RPLINL                                                 59840021
       SH    XR6,RPRINL                                                 59848021
       STH   XR6,XL1               EDIT LNTH = RPTS2D-RPLINL-RPRINL     59856021
         CLI   RFLTIL+NX1,XX00      IS IT FLOAT                         59864021
       BC    NOTEQ,RPGEDM          GEN ATXT FOR EDMK INSTRUC            59872021
       BAL   XRSUB,EDIT            NO-GENERATE EDIT                     59880021
       BC    UNCOND,RPGBLR         GEN BALR 3,0 AND PROC FURTHER        59888021
RPGEDM BAL   XRSUB,EDMARK          YES-GENERATE EDMARK                  59896021
*                                                                       59904021
RPGBLR LH    XR6,RBWZIL                                                 59912021
       AH    XR6,RSGNIL                                                 59920021
       AH    XR6,RINSIL                                                 59928021
       CH    XR6,XC004             ANY BRANCHES REQUIRING BASE          59936021
       BC    NOTHI,RPGBCT          NO                                   59944021
         MVI   XREGNO,XX03          YES                                 59952021
       BAL   XRSUB,XFREER          FREE REG3 FOR BALR                   59960021
         MVI   XREG1,XX03                                               59968021
       BAL   XRSUB,BALR            BALR  3,0                            59976021
*                                                                       59984021
         CLC   RBWZL1(LX2),XC000                                        59992021
       BC    EQ,RPGBCT             IF EDMK GENED,GEN BCTR ATXT          60000021
         MVC   BDISP1+NX1(LX1),RBWZIL+NX1                               60008021
         MVI   BDISP1,XX30                                              60016021
       MVI   XREG1,NOTZER                                               60024021
       BAL   XRSUB,BRANCH          BC    NOTZER,C(RBWZIL)(3)            60032021
*                                                                       60040021
*                                                                       60048021
* IF RPLINL NOT = 0      MVI  TS2-1,C' '                                60056021
*                        MVC  TS2-2 (RPTS2D-1),TS2-1                    60064021
*                                                                       60072021
* IF RPLINL = 0          MVI  TS2-N,C' '                                60080021
*                        MVC  TS2-N+1(RPTS2D-N),TS2-N                   60088021
*                                                                       60096021
*                             WHERE N = 2+RPEVNL                        60104021
*                                                                       60112021
       SR    XR6,XR6                                                    60120021
         CLC   RPLINL(LX2),XC000                                        60128021
       BC    NOTZER,RPGBW1         CNT OF LFT HND CHARS NOTZER,SKP      60136021
       LH    XR6,RPEVNL                                                 60144021
         LA    XR6,DX1(XR6)                                             60152021
RPGBW1   MVI   XCNTR1,XX30                                              60160021
         LA    XR5,DX1(XR6)                                             60168021
         STC   XR5,XCNTR1+NX2                                           60176021
         MVC   IMM(LX1),RPBCHR                                          60184021
       BAL   XRSUB,MVI             GEN ATXT FOR MVI INSTRUC             60192021
*                                                                       60200021
         CLC   RBWZL2(LX2),XC000    IS MVC REQUIRED                     60208021
       BC    EQ,RPGMVT             NO                                   60216021
         MVI   XCNTR1,XX30          YES                                 60224021
         MVI   XCNTR2,XX30                                              60232021
         STC   XR5,XCNTR2+NX2                                           60240021
       LH    XR4,RPTS2D                                                 60248021
       BCTR  XR4,RW0               SUBTRACT 1 FROM REG4                 60256021
       SR    XR4,XR6                                                    60264021
       STH   XR4,XL1                                                    60272021
         LA    XR5,DX1(XR5)                                             60280021
         STC   XR5,XCNTR1+NX2                                           60288021
       BAL   XRSUB,MVC             GEN ATXT FOR MVC INSTRUC             60296021
         CLC   RBWZL3(LX2),XC000    IS IT * WHEN ZERO WITH DEC. PT.     60304021
       BC    EQ,RPGBW4             NO                                   60312021
         MVI   XCNTR1,XX30          YES                                 60320021
         MVC   XCNTR1+NX2(LX1),RPDECD+NX1                               60328021
         MVC   IMM(LX1),COMMAD+NX1                                      60336021
       BAL   XRSUB,MVI             MVI RPDECD,C'.'                      60344021
*                                                                       60352021
RPGBW4   CLC   RBWZL4(LX2),XC000    IS BR AROUND FOLLOWING INSTRS NE    60360021
       BC    EQ,RPGBCT             NO                                   60368021
         MVC   BDISP1+NX1(LX1),RPTOTL+NX1 YES                           60376021
         MVI   BDISP1,XX30                                              60384021
       MVI   XREG1,UNCOND                                               60392021
       BAL   XRSUB,BRANCH          BC    UNCOND,RPTOTL(3)               60400021
*                                                                       60408021
RPGBCT   CLI   RFLTIL+NX1,XX00      WAS EDMARK GENERATED                60416021
       BC    EQ,RPGSG1             NO-GO CHECK IF SIGN INSTRUCTIONS     60424021
         MVI   XREG1,XX01           YES                                 60432021
       BAL   XRSUB,BCTR            BCTR  1,0                            60440021
*                                                                       60448021
RPGSG1   CLI   RSGNL1+NX1,XX00      IS THERE LEFT HAND + OR -           60456021
       BC    EQ,RPGSG4             NO                                   60464021
         CLI   RFLTIL+NX1,XX00      YES-IS THERE FLOATING STRING        60472021
       BC    EQ,RPGSG2             NO-MUST BE LEFT HAND FIXED SIGN      60480021
         MVI   BDISP1,XX10          YES-MAKE TARGET 0(1)                60488021
       BC    UNCOND,RPGSG3         GEN ATXT FOR MVI INSTRUC             60496021
RPGSG2   MVI   XCNTR1,XX30          LEFT HAND FIXED SIGN                60504021
         MVC   XCNTR1+NX2(LX1),RPSGND+NX1                               60512021
RPGSG3   MVI   IMM,XX60                                                 60520021
       BAL   XRSUB,MVI             MVI   RPSGND,C'-' OR MVI   0(1),     60528021
RPGSG4   CLI   RSGNL2+NX1,XX00      ANY FURTHER SIGN INSTRUCTIONS       60536021
         BE    RPGDOL                  NO, GO CHECK IF CURRENCY SIGN    60544021
         MVI   BDISP1,XX30          YES                                 60552021
       LH    XR6,RBWZIL                                                 60560021
       AH    XR6,RFLTIL                                                 60568021
       AH    XR6,RSGNIL                                                 60576021
         STC   XR6,BDISP1+NX1                                           60584021
       MVI   XREG1,NEG                                                  60592021
       BAL   XRSUB,BRANCH          BC    NEG,RBWZIL+RFLTIL+RSGNIL(3     60600021
         CLI   RFLTIL+NX1,XX00      IS IT FLOAT                         60608021
       BC    EQ,RPGSG5             NO                                   60616021
         CLI   RDOLIL+NX1,XX00          IS IT FLOATING CURRENCY SIGN?   60624021
       BC    NOTEQ,RPGSG5              YES                              60632021
         MVI   BDISP1,XX10           NO MUST BE FLOATING + OR -         60640021
       BC    UNCOND,RPGSG6         GEN MVI WITH + OR BLANK              60648021
RPGSG5   MVI   XCNTR1,XX30                                              60656021
         MVC   XCNTR1+NX2(LX1),RPSGND+NX1                               60664021
RPGSG6   MVI   IMM,XX4E                                                 60672021
         CLI   RPSIGN,XX4E                                              60680021
       BC    EQ,RPGSG7             GEN ATXT FOR MVI INSTRUC             60688021
         MVI   IMM,XX40             IF MINUS, MAKE IMMED. DATA A BLA    60696021
RPGSG7 BAL   XRSUB,MVI             MVI   RPSGND,IMM  OR  MVI   0(1)     60704021
         CLI   RSGNL3+NX1,XX00      IS IT CR OR DB AFTER R.H. INS CH    60712021
       BC    EQ,RPGDOL             NO                                   60720021
         MVI   XCNTR1,XX30          YES-SINCE FOR CR AND DB RPSGND I    60728021
       LH    XR6,RPSGND            SET TO SECOND LETTER, DECREMENT      60736021
       BCTR  XR6,RW0                 BY 1 FOR MVI TO BLANK FIRST LE     60744021
         STC   XR6,XCNTR1+NX2                                           60752021
         MVI   IMM,XX40                                                 60760021
       BAL   XRSUB,MVI             MVI   RPSGND-1,C' '                  60768021
*                                                                       60776021
RPGDOL   CLI   RDOLIL+NX1,XX00          IS CURR SIGN INSERTION REQUIRED 60784021
       BC    EQ,RPGINS             NO                                   60792021
         CLI   RFLTIL+NX1,XX00          IS IT FLOATING CURRENCY SIGN?   60800021
       BC    EQ,RPGDO1             NO                                   60808021
         MVI   BDISP1,XX10          YES-MAKE TARGET 0(1)                60816021
       BC    UNCOND,RPGDO2         GEN MVI FOR $                        60824021
RPGDO1   MVI   XCNTR1,XX30                                              60832021
         MVC   XCNTR1+NX2(LX1),RPDOLD+NX1                               60840021
RPGDO2   MVC   IMM,CURSGN                                               60848021
       BAL   XRSUB,MVI             MVI   RPDOLD,C'$'-OR-MVI   0(1),     60856021
*                                                                       60864021
RPGINS   CLC   RINSIL(LX2),XC000    ANY INSERTION CHARS TO FILL         60872021
       BC    EQ,RPGMVT             NO-GO GENERATE FINAL MOVE(S)         60880021
         MVI   XCNTR1,XX30          YES                                 60888021
         MVC   XCNTR1+NX2(LX1),RPLSTD+NX1                               60896021
         MVI   IMM,XXF0                                                 60904021
       BAL   XRSUB,TM              TM    RPLSTD,X'F0'                   60912021
*                                                                       60920021
         MVI   BDISP1,XX30                                              60928021
         MVC   BDISP1+NX1(LX1),RPTOTL+NX1                               60936021
       MVI   XREG1,ONES                                                 60944021
       BAL   XRSUB,BRANCH          BC    ONES,RPTOTL(3)                 60952021
*                                                                       60960021
         MVI   XCNTR1,XX30                                              60968021
       LH    XR6,RPLSTD                                                 60976021
         LA    XR6,DX1(XR6)                                             60984021
         STC   XR6,XCNTR1+NX2                                           60992021
       LA    XR5,RPPAT                                                  61000021
       AH    XR5,RPLINL                                                 61008021
         MVC   IMM(LX1),DX0(XR5)     FILL CHARACTER IS IMMED. DATA      61016021
       BAL   XRSUB,MVI             MVI   RPLSTD+1,IMM                   61024021
*                                                                       61032021
         CLI   RINSL2+NX1,XX00      WAS THERE MORE THAN 1 BYTE TO FI    61040021
       BC    EQ,RPGMVT             NO                                   61048021
         MVI   XCNTR2,XX30          YES-GENERATE MVC TO PROPAGATE FI    61056021
         STC   XR6,XCNTR2+NX2                                           61064021
         MVI   XCNTR1,XX30                                              61072021
         LA    XR6,DX1(XR6)                                             61080021
         STC   XR6,XCNTR1+NX2                                           61088021
         MVC   XL1+NX1(LX1),RPLM1+NX1                                   61096021
       BAL   XRSUB,MVC             MVC   RPLSTD+2(L-1),RPLSTD+1         61104021
*                                                                       61112021
RPGMVT   CLI   RPLINL+NX1,XX00      ANY LEFT HAND INSERTION CHARS       61120021
       BC    EQ,RPGMT2             NO-ONLY ONE MOVE NEEDED              61128021
         MVC   XOP1(LX4),XAOPE2     YES                                 61136021
         MVC   XL1+NX1(LX1),RPLINL+NX1                                  61144021
         MVI   XCNTR2,XX30                                              61152021
         MVI   XCNTR2+NX2,XX01                                          61160021
       BAL   XRSUB,MVC             MVC   OP2(RPLINL),TS2-1              61168021
*                                                                       61176021
RPGMT2   MVC   XOP1(LX4),XAOPE2                                         61184021
         MVC   XPLUS1+NX2(LX1),RPLINL+NX1                               61192021
       LH    XR6,RPTS2D                                                 61200021
       SH    XR6,RPLINL                                                 61208021
       SH    XR6,RPEVNL                                                 61216021
       BCTR  XR6,RW0               SUBTRACT 1 FROM REG 6                61224021
       STH   XR6,XL1               L = RPTS2D-RPLINL-RPEVNL-1           61232021
         MVI   XCNTR2,XX30                                              61240021
       LH    XR6,RPLINL                                                 61248021
       AH    XR6,RPEVNL                                                 61256021
         LA    XR6,DX2(XR6)                                             61264021
         STC   XR6,XCNTR2+NX2                                           61272021
       BAL   XRSUB,MVC             MVC   OP2+RPLINL(L),RPLINL+2+RPE     61280021
*                                                                       61288021
         CLC   TS2MAX(LX2),RPTS2D   IS TS2MAX LESS THAN RPTS2D          61296021
       BC    NOTLO,RPMXIT          NO-EXIT                              61304021
         MVC   TS2MAX(LX2),RPTS2D   YES-SET TS2MAX = RPTS2D             61312021
*                                                                       61320021
RPMXIT L     XRVERB,ADCN1D                                              61328021
       USING MOVE,XRVERB                                                61336021
       BC    UNCOND,XMEDXT         PROCS UNSINED SNDNG TO SINED REC     61344021
*                                                                       61352021
*                                                                       61360021
       EJECT                                                            61368021
*      STORE   - STORE VERB CHECK FOR ROUND OPTION AND TRANSFERS TO     61376021
*                NUMERIC MOVE FOR ACTUAL STORING OF RESULT.             61384021
       SPACE 5                                                          61392021
       USING *,XRVERB                                                   61400021
STOREE EQU   *                                                          61408021
       BAL   XRSUB,XINTL1          INIT DOP BUFFS SET XOPMOD = 0        61416021
       TM    XGNSW,XADABA                                               61424021
       BC    XZERO,STORED          DO NOT BYPASS STORE                  61432021
       XI    XGNSW,XADABA               BY PASS  STORE - OPERATION      61440021
       BAL   XRSUB,XSETVM          GET 2ND DOP INFO INTO BUFFER         61448021
         MVC   X2LAS(LX8),X2LBS                                         61456021
       L     XRVERB,ADCN1D                                              61464021
       USING MOVE,XRVERB                                                61472021
       BC    UNCON,XBYPST          GO BYPASS ROUTINE                    61480021
       USING STOREE,XRVERB                                              61488021
STORED EQU   *                                                          61496021
*                                                                       61504021
       BAL   XRSUB,XOTSEL          GET DOP INFO INTO BUFFERS            61512021
       TM    XOPMOD,XFLOAT   SENDING   IS FP SKIP ROUNDING              61520021
       BC    XTHRE,XSTEMV          YES                                  61528021
*                                                                       61536021
*                                                                       61544021
       TM    XGSWT,XROUND                                               61552021
       BC    XZERO,XSTEMV               NO ROUND GO TO NUMERIC MOVE     61560021
*                                                                       61568021
         CLC   Y1DBS+NX1(LX1,XR3),Y1DBS+NX1(XR5)                        61576021
       BNH   XSTE08               INTERMED RESULT DEOS NOT HAVE         61584021
*                                 MORE DEC PLACES THAN RESULT.          61592021
*                                 GO TO NUMERIC MOVE                    61600021
         CLI   Y1DBS+NX1(XR5),XX12                                      61608021
       BL    XSTTT1                STORE FIELD LESS THAN 18 DEC         61616021
         MVI   XGDRE+NX1,XX13                                           61624021
XSTTT1   ZAP   XCON(LX16),XIDCNQ                                        61632021
       LH    XR6,Y1DBS(XR3)       CALC: DEC OF SENDING                  61640021
       SH    XR6,XGDRE            MINUS DEC OF RECEIVING                61648021
       AH    XR6,Y1ALP(XR5)       PLUS  SCALING OF RECEIVING = XR6      61656021
       BZ    XSTGUL                NO SCALING NEEDED                    61664021
       CH    XR6,XC029                                                  61672021
       BH    XSTE08               NO ROUNDING CAN BE DONE               61680021
       BL    XSTE01                GENERATE CONSTANT                    61688021
         MVI   XCON,XX05           SET UP ROUNDING CONSTANT OF          61696021
         MVI   XCON+NX15,XX0C      5*10**29                             61704021
       B     XSTGUL                SKIP LOOP                            61712021
XSTE01   MP    XCON(LX16),XIDCNQ   GENERATE 00...500..00 I. E.          61720021
         AP    XCON(LX16),XCON(LX16) 5*10**(XR6)                        61728021
       BCT   XR6,XSTE01            FALL THRU WHEN CONST GENERATED       61736021
XSTGUL EQU   *                                                          61744021
         TM    X1IRX+NX1,XZGNLT                                         61752021
       BC    XZERO,XSTENN          1ST OPERAND NOT A LITERAL            61760021
*                                                                       61768021
         MVN   XCON+NX15(LX1),X1VAL+NX15                                61776021
XSTENN EQU   *                                                          61784021
         AP    DX0(LX16,XR3),XCON(LX16)                                 61792021
       LR    XR5,XR3                                                    61800021
       BAL   XRSUB,XIDSZ                GET SIZE OF ROUNDED RESULT.     61808021
         TM    X1IRX+NX1,XZGNLT                                         61816021
       BC    XZERO,XSTE04          1ST OPERAND NOT A LITERAL            61824021
         MVC   X1LBS(LX6),XIDBY                                         61832021
       BC    UNCON,XSTENM          GO TO NUMERIC MOVE                   61840021
XSTE04 TM    Y1IRX(XR3),XGBINR                                          61848021
       BC    XTHRE,XSTE05          OPERAND IS BINARY                    61856021
         MVC   XYLEN(LX1),XIDBY+NX1                                     61864021
       LA    XRSUB,XSTE06                                               61872021
         CLC   Y1TEL+NX1(LX1,XR3),XIDBY+NX1 GENERATE EITHER             61880021
       BC    XONE,XYOBF            OF THE FOLLOWING TESTS               61888021
*                                                ZAP   TEMP(L),OP(L     61896021
*                                                BC    XONE,5GN1        61904021
*                                                AP    TEMP(6),=005     61912021
         MVI   XCON2+NX15,XX0C                    BC    UNCON,5GN2      61920021
         MVI   XCON2+NX16,XX01            5GN1  SP   TEMP(L),=00...5    61928021
         MVI   XL2+NX1,XX01                                             61936021
*                                       5GN2                            61944021
*                                                                       61952021
       BAL   XRSUB,XEWCL                 OR    CP   TEMP(L),=0          61960021
         MVC   XWC1(LX2),XEREL1                 BC   XONE,5GN1          61968021
         MVC   XL1(LX2),XYTEL               OTHER CODING  SAME AS AB    61976021
*                                                                       61984021
*                                              L   XRN,OP               61992021
         BAL   XRSUB,COMP          C(H) XRN,=0                          62000021
XSTE06 SR    XR0,XR0                         BC   NEG,5GN1              62008021
       MVI   XREG1,XONE                      A(H) XRN,=00..500...       62016021
       BAL   XRSUB,XSTLHN                    BC   UNCON,5GN2            62024021
         MVC   XGTEM2(LX2),XGNTMP        5GN1 S(H) XRN,=00..500...      62032021
       BAL   XRSUB,BC                   5GN2                            62040021
         MVC   X1LBS(LX6),XIDBY                                         62048021
XSTE28 LA    XR6,XZBINB                                                 62056021
         CLI   X1TEL+NX1,XX00                                           62064021
       BC    XZERO,XSTE23          OPERAND NOT IN TEMP STOR             62072021
       LA    XR5,XCON                                                   62080021
       BAL   XRSUB,XIDSZ           GET SIZES OF OPERAND                 62088021
       LA    XR6,XZSIDB                                                 62096021
         MVC   XCONL(LX1),XIDBY+NX1                                     62104021
XSTE23 LH    XR5,XMINON                                                 62112021
       BALR  XRSUB,XR6             GO TO BINARY OR ID ROUTINE           62120021
       LTR   XR0,XR0                    X                               62128021
       BC    XNOEQ,XSTE27          GENERATE SUBTRACT INSTRUCTION        62136021
       BAL   XRSUB,ADD                  X                               62144021
         MVI   XREG1,XX0F                X                              62152021
       BAL   XRSUB,XSTLHN               X                               62160021
       BAL   XRSUB,BC                   X                               62168021
         MVC   PH4GN+NX1(LX2),XGTEM2   MOVE GN #                        62176021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 62184021
       LR    XR0,GXRA                                                   62192021
       BC    UNCON,XSTE28               X                               62200021
XSTE27 BAL   XRSUB,SUB                  X                               62208021
         MVC   PH4GN+NX1(LX2),XGNTMP   MOVE GN #                        62216021
         BAL   XRSUB,WRPH4G            WRITE PH4 GN DEF                 62224021
XSTENM EQU   *                                                          62232021
XSTE08 EQU   *                                                          62240021
XSTEMV EQU   *                                                          62248021
*                                                                       62256021
*                                                                       62264021
*                                                                       62272021
       LA    XR5,X2VAL                                                  62280021
*                                                                       62288021
         L     XRVERB,ADCN1D       GO TO NUMERIC MOVE                   62296021
       USING MOVE,XRVERB                X                               62304021
       BC    UNCON,XNUMOV               X                               62312021
       SPACE 2                                                          62320021
       USING STOREE,XRVERB              X                               62328021
XSTE05   CLI   XBDBY+NX1,XX04                                           62336021
       BC    XTWO,XSTE09           NEED MORE THAN 4 BYTES               62344021
*                                                                       62352021
*                                                                       62360021
*                                       CONVERT ROUNDING CONSTANT T     62368021
*                                       BINARY                          62376021
         CVB   XR6,XCON+NX8              X                              62384021
         ST    XR6,XCON+NX12             X                              62392021
         MVI   XCON+NX16,XX04            X                              62400021
*                                       TEST SIGN OF CALCULATED RES     62408021
*                                       THROUGH A LTR                   62416021
       BAL   XR1,XLTRGN                   LTR  XRN,XRN                  62424021
       BC    UNCON,XSTE06          GENERATE TRANSFER                    62432021
XSTE09 BAL   XRSUB,XBIIDB               CONVERT TO ID.                  62440021
       BC    UNCON,XSTE06          GENERATE TRANSFER                    62448021
       EJECT                                                            62456021
*      XSETVL  - ROUTINE WHICH MOVES CHARACTERISTICS OF OPERANDS FR     62464021
*              - INPUT STRING TO WORK AREA                              62472021
       SPACE 5                                                          62480021
       USING *,XRVAR                                                    62488021
XSETVL   MVI   XSESWT,XX00                                              62496021
       STM   XR0,XR15,XGSAV1                                            62504021
*                                                                       62512021
         L     XR4,XAVAL1          LOAD BASE ADDRESSES OF INPUT         62520021
       L     XR3,XAOPE1                 STRING AND OF WORKING AREA.     62528021
       SPACE 2                                                          62536021
XSETVR   CLI   DX0(XR3),XGIRI            IS THIS OPERAND AN IR.         62544021
       BC    XZERO,XG030                YES                             62552021
         CLI   DX0(XR3),XGDTN            NO,             A DATA-NAME    62560021
       BC    XZERO,XG031                YES                             62568021
         CLI   DX0(XR3),XGNLT            NO,             A NUMERIC L    62576021
       BC    XZERO,XG032                YES                             62584021
         CLI   DX0(XR3),XGFPL            NO,             AN FP LITER    62592021
       BC    XZERO,XG033                YES                             62600021
         CLI   DX0(XR3),XGFCT            NO              A FIGURATIV    62608021
       BC    XZERO,XG034                YES                             62616021
         CLI   DX0(XR3),XGALC                              ALPHAN. L    62624021
       BC    XZERO,XG035           YES                                  62632021
         CLI   DX0(XR3),TEMRES     NO        A TEMPORARY RESULT...      62640021
       BE    XG074                YES                                   62648021
*                                                                       62656021
         CLI   DX0(XR3),XX39       NO        A PLURAL FIGCON            62664021
         BC    XZERO,XG035        YES                                   62672021
*      LOGIC ERROR NUMBER 7.                                            62680021
*                                                                       62688021
XERROR EQU   *                                                          62696021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               62704021
       DC    AL1(ERRN07)                                                62712021
       DC    AL1(8)                                                     62720021
       SPACE 2                                                          62728021
XG030  EQU   *                                                          62736021
         MVC   Y1IRN(LX2,XR4),XGIRNU(XR3)                               62744021
       LH    XR6,Y1IRN(XR4)             SET INTER RES. NUMBER.          62752021
*                                                                       62760021
*                                                                       62768021
*                                                                       62776021
       BAL   XRSUB,XINSCN          SCAN INTERMEDIATE RESULT TBL         62784021
         MVC   DX0(LX16,XR4),DX0(XR6)    MOVE TABLE ENTRY IN WORK ARE   62792021
         MVC   Y1TEL(LX6,XR4),Y1TEL(XR6) X                              62800021
         MVC   Y1LBS(LX8,XR4),Y1LAS(XR6) X                              62808021
         MVC   DX30(LX2,XR6),XMINON                                     62816021
         TM    Y1IRX+NX1(XR4),XINREG     SET FLAGS IN IR TABLE SAYIN    62824021
       BC    XZERO,XG0556               THAT REGISTER IS NOW USED B     62832021
       LR    XR3,XR4                    AN OPRRAND OF THE ACTUAL ST     62840021
       BAL   XRSUB,XZWHIR               X                               62848021
       L     XR4,XLIRP                  X                               62856021
         NC    DX0(LX3,XR4),XREMK6                                      62864021
         XI    Y1IRX+NX1(XR3),XINREG     X                              62872021
       BAL   XRSUB,XZWHIR               X                               62880021
         TM    Y1IRX+NX1(XR3),XG2IRX     X                              62888021
       BC    XZERO,XG0555               X                               62896021
         OI    DX2(XR4),XRDPRE           X                              62904021
         L     XR6,DX4(XR4)              X                              62912021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    62920021
*                                                                       62928021
XG0555 LR    XR4,XR3                                                    62936021
XG0556   DS    0H                                                 41562 62944021
         CLI   DIVREMSW,XX00       DIVIDE REMAINDER               41562 62952021
         BE    XG0557              NO                             41562 62960021
         CLI   HEADER+NX1,XX05     STORE                          41562 62968021
         BE    XG0557              YES                            41562 62976021
         MVI   DIVREMSW,XX00       YES                            41562 62984021
         CLC   XKVAL(XLEVAL),GZERO WAS DIVIDEND SAVED             41562 62992021
         BE    XG0557              NO                             41562 63000021
         MVC   X2VAL(XLEVAL),XKVAL YES                            41562 63008021
         B     XG061               RETURN TO SUBTRACT             41562 63016021
XG0557   DS    0H                                                 41562 63024021
         TM    Y1IRX+NX1(XR4),XFTPT                               41562 63032021
       BC    XZERO,XG044           OPERAND NOT FL PT                    63040021
XG00EF OI    XOPMOD,XFLOAT                                              63048021
       BC    UNCON,XG044           GET NEXT OPERAND                     63056021
       SPACE 2                                                          63064021
XG031  EQU   *                                                          63072021
*                                                                       63080021
       BAL   XRSUB,XLENGH               GET LENGHT OF DATA NAME.        63088021
         CLI   XGTEM2,SETINDI          INDEX DATA ITEM                  63096021
         BNE   XGG31                   NO                               63104021
         MVI   XGTEM2,XGBINR           YES, TREAT AS BI ITEM            63112021
XGG31    EQU   *                                                        63120021
         MVC   Y1IRX(LX1,XR4),XGTEM2     SET TYPE.                      63128021
         CLC   XIDBY(LX6),XC000          IS IT NUMERIC.                 63136021
       BC    XZERO,XGNONU               NO                              63144021
         MVC   Y1LBS(LX6,XR4),XIDBY      MOVE SIZES IN WORK AREA.       63152021
       TM    XGSCAL(XR3),XGSCSG         YES,IS IT A MINUS SCALE .       63160021
       BC    NOTHR,XG049                NO                              63168021
         MVC   Y1ALP+NX1(LX1,XR4),XGSCAL(XR3) YES SET SCALING FACTOR IN 63176021
XG0PMV EQU   *                                                          63184021
         XI    Y1ALP+NX1(XR4),XX80       AREA.(WITHOUT SIGN).           63192021
       BC    UNCON,XG050           GENERATE MAX OPERAND                 63200021
       SPACE 2                                                          63208021
XG049    MVC   Y1DBS+NX1(LX1,XR4),XGSCAL(XR3) MOVE NUMBER OF DEC.PLACES 63216021
XG050  LH    XR6,Y1FBS(XR4)                                             63224021
       LTR   XR6,XR6                                                    63232021
       BZ    XERROR                LENGTH MUST NEVER BE ZERO            63240021
         ZAP   DX0(LX16,XR4),XGNEUF      FIRST GENERATE IN PACK DECI    63248021
         ZAP   XGTEM2(LX16),XGNEUF       A VALUE = TO THE MAX NUMBER    63256021
       BC    UNCON,XG060                REPRESENTED BY THE PICTURE.     63264021
XG051    MP    XGTEM2(LX16),XGTEN(LX2)                                  63272021
         AP    DX0(LX16,XR4),XGTEM2(LX16)                               63280021
XG060  BCT   XR6,XG051             FALL THRU WHEN GENERATION THRU       63288021
       SPACE 5                                                          63296021
*                                                                       63304021
*                                       COMPUTE BINARY SIZE             63312021
*                                        , ID , LENGTH                  63320021
*                                                                       63328021
*                                                                       63336021
XG072  LR    XR5,XR4                                                    63344021
       BAL   XRSUB,XIDSZ           GET SIZES OF OPERAND                 63352021
         MVC   Y1LBS(LX6,XR4),XIDBY                                     63360021
       SPACE 2                                                          63368021
XG044  TM    XSESWT,XS2OP               GET NEW OPERAND                 63376021
       ST    XR3,Y1INPT(XR4)                                            63384021
       BC    XTHRE,XG061           2ND OPERAND ALREADY PROCESSED        63392021
XSETVU   DS    0H                                                 51894 63400021
         L     XR3,XAOPE2          DOP2                           51894 63408021
XSETVP   DS    0H                                                 51894 63416021
         OI    XSESWT,XS2OP        PROCESSING DOP2                51894 63424021
         LA    XR4,X2VAL                                          51894 63432021
         B     XSETVR              GET DOP2 INFO                  51894 63440021
       SPACE 2                                                          63448021
XG061  LM    XR0,XR15,XGSAV1                                            63456021
       BCR   UNCON,XRSUB           RETURN                               63464021
XG032  MVI   Y1IRX(XR4),XGINDC          SET INT.DEC TYPE FLAG ON        63472021
         OI    Y1IRX+NX1(XR4),XGCOLT                                    63480021
         MVC   Y1DBS+NX1(LX1,XR4),XLIDEC(XR3) SET NUMBER OF DEC         63488021
       SPACE 2                                                          63496021
       SR    XR2,XR2                    MOVE   PACK DECIMAL             63504021
       IC    XR2,XGNBYT(XR3)           VALUE.                           63512021
       SH    XR2,XC003                                                  63520021
       EX    XR2,XGZAP                  WORK AREA                       63528021
*                                                                       63536021
*                                                                       63544021
*                                                                       63552021
XG062  EQU   *                                                          63560021
         CP    DX0(LX16,XR4),XINDCZ(LX1) IS IT A ZERO LIT               63568021
       BC    XNOEQ,XG072           NO                                   63576021
         OI    Y1IRX+NX1(XR4),XLITZR     GET OTHER OPERANDS             63584021
       BC    UNCON,XG072           GET SIZES OF OPERAND                 63592021
       SPACE 2                                                          63600021
XG035    OI    Y1IRX(XR4),XXF3                                          63608021
       BC    UNCON,XG044                LITERAL VALUE.                  63616021
       SPACE 2                                                          63624021
XG034  EQU   *                                                          63632021
       TM    XGSWT,XAROPE                                               63640021
       BC    XZERO,XG035           NOT ARITHMETIC OPERATION             63648021
       BAL   XRSUB,XONDGT          SET BUFFER FOR ONE DIGIT             63656021
         MVI   DX15(XR4),XX0F                                           63664021
       BC    UNCON,XG062           CHECK FOR ZERO LITERAL               63672021
       SPACE 2                                                          63680021
XG033  OI    Y1IRX(XR4),XGINFP          SET INT FP FLAG ON.             63688021
         MVI   Y1IRX+NX1(XR4),XX74       XFTPT+XGCOLT+XGDPFP            63696021
         MVC   DX8(LX8,XR4),DX2(XR3)      MOVE DP LITERAL.              63704021
       BC    UNCON,XG00EF          TURN ON FL PT SWITCH                 63712021
       SPACE 2                                                          63720021
XG047    TM    XGDGLG(XR3),XX01         IS IT DP FP.                    63728021
       BC    NOTHR,XG0477          NO                                   63736021
         OI    Y1IRX+NX1(XR4),XGDPFP     YES,SET FLAG ON.               63744021
XG0477 EQU   *                                                          63752021
         OI    Y1IRX+NX1(XR4),XFTPT                                     63760021
       BC    UNCON,XG00EF          TURN ON FL PT SWITCH                 63768021
XG074    CLI   HEADER+NX1,XX05     IS THIS A STORE OPERATION...         63776021
       BE    XG061                YES, RETURN                           63784021
         MVC   DX0(XLEVAL,XR4),XRVAL MOVE TEMP RESULT INFO INTO BUFF    63792021
         TM    XGNSW,DIVREM        IS THIS A DIVIDE REMAINDER      7884 63800021
       BZ    XG075               NO                                     63808021
         XI    XGNSW,DIVREM        YES, TURN OFF SWITCH           41562 63816021
         CLC   XQVAL(XLEVAL),GZERO IS THIS DIVIDE REMAINDER       41562 63824021
         BE    XG044               NO OR DIVISOR WAS LITERAL      41562 63832021
         MVC   X1VAL(XLEVAL),XQVAL                                41562 63840021
         B     XG061               RETURN TO MULTIPLY             41562 63848021
XG075    DS    0H                                                 41562 63856021
         CLI   X1TEL+NX1,XX00      IS OP IN TEMP STOR             41562 63864021
         BE    XG044               GET NEXT OPERAND               41562 63872021
         CLI   X1TEL+NX1,XX00      IS OP IN TEMP STORAGE...             63880021
       BE    XG044                NO, GET NEXT OPERAND                  63888021
         TM    X1IRX+NX1,XFTPT     IS OP  FLOATING POINT...             63896021
       BO    XG00EF               YES, SET SW FOR FL PT OPERATION       63904021
       TM    X1IRX,XGBINR         IS OP BINARY...                       63912021
       BO    XG044                YES                                   63920021
         MVC   XELEN(LX2),X1TEL    OP IS ID, GET NEW TEMPORARY          63928021
       BAL   XRSUB,XTAMPO         STORAGE AND GENERATE...               63936021
         MVC   XL1(LX2),XYTEL        ZAP NEWTEMP,OLDTEMO                63944021
         MVC   XWC1(LX2),XEREL1                                         63952021
         MVC   XL2(LX2),X1TEL                                           63960021
       LH    XR5,X1TEM                                                  63968021
         SLA   XR5,DX3                                                  63976021
       STH   XR5,XWC2                                                   63984021
       BAL   XRSUB,ZAP             GENERATE ZAP                         63992021
         MVC   X1TEM(LX2),XEREL    SAVE PTR TO NEW TEMP STOR IN OP      64000021
       B     XG044                BUFFER                                64008021
       SPACE 2                                                          64016021
*                                                                       64024021
XGNONU CLI   Y1IRX(XR4),XGINFP                                          64032021
       BC    XZERO,XG047           OPERAND IS INT FL PT                 64040021
       CLI   Y1IRX(XR4),XGEXFP                                          64048021
       BC    XZERO,XG00EF          OPERAND IS EXT FL PT                 64056021
         CLI   Y1IRX(XR4),XX0D                                          64064021
       BC    XZERO,XGSTER          OPERAND IS STERLING                  64072021
*  SET NON NUMERIC ITEM SWITCH ON.                                      64080021
         OI    Y1IRX(XR4),XXF0                                          64088021
         CLI   Y1IRX(XR4),XXF5                                          64096021
       BC    XZERO,XGNN12          OPERAND IS REPORT ITEM               64104021
         CLI   Y1IRX(XR4),XXF6                                          64112021
       BC    XNOEQ,XG044           OPERAND IS NOT STERLING REP ITEM     64120021
         MVC   Y1DBS+NX1(LX1,XR4),DX13(XR3)                             64128021
       BC    UNCON,XG044           GET NEXT OPERAND                     64136021
XGNN12 EQU   *                                                          64144021
*  GET CHARACTERISTICS OF A REPORT ITEM---- DIGIT LENGHT AND            64152021
*  SCALING FACTOR                                                       64160021
         MVC   Y1FBS+NX1(LX1,XR4),DX9(XR3)                              64168021
         NI    Y1FBS+NX1(XR4),XX1F                                      64176021
         TM    DX10(XR3),XX80                                           64184021
       BC    XTHRE,XGNN01          GET SCALING FACTOR                   64192021
         MVC   Y1DBS+NX1(LX1,XR4),DX10(XR3)                             64200021
       BC    UNCON,XG050           GENERATE MAX OPERAND                 64208021
XGNN01   MVC   Y1ALP+NX1(LX1,XR4),DX10(XR3)                             64216021
       BC    UNCON,XG0PMV          GENERATE MAX OPERAND                 64224021
       SPACE 2                                                          64232021
*  CONVERT STERLING NON REPORT FIELD TO ID EXEPT IF IT IS USED AS A     64240021
*  TARGET FIELD OF A MOVE.                                              64248021
*      CALL OBJECT TIME SUBROUTINE                                      64256021
*                           LA   0,STERLING-FIELD                       64264021
*                           L    15,V(STTOID)                           64272021
*                           BALR 14,15                                  64280021
*                           DC   AL4(IDRESULTFIELD)                     64288021
*                           DC   XL2  2 BYTES OF INFO.                  64296021
*                                                                       64304021
*                                                                       64312021
XGSTER BAL   XRSUB,XSTOMV          CHECK FOR A STORE OR MOVE OPER       64320021
       BC    UNCON,XG070           YES IT IS                            64328021
XG071  SR    XR6,XR6                    GET  ID LENGHT OF CONVERTED     64336021
*                                       STERLING FIELD OUT OF           64344021
         IC    XR6,DX9(XR3)              ATTRIBUTES.                    64352021
         SRL   XR6,DX3                                                  64360021
*                                       NUMBER OF DIGITS IN ID WILL     64368021
         MVC   Y1DBS+NX1(LX1,XR4),DX8(XR3) M+N+3                        64376021
         NI    Y1DBS+NX1(XR4),XX1F       M DIGITS IN POUND FIELD        64384021
       AH    XR6,Y1DBS(XR4)             N DIGITS IN DECIMAL FIELD       64392021
         LA    XR6,DX3(XR6)                                             64400021
       STH   XR6,Y1FBS(XR4)                                             64408021
*                                                                       64416021
*                                                                       64424021
*                                                                       64432021
*                                                                       64440021
         TM    XSESWT,XX08               IF TARGET FIELD  DO  NOT       64448021
       BC    XTHRE,XG050                CONVERT IT.                     64456021
       MVI   Y1IRX(XR4),XGINDC          SET ID MODE                     64464021
       BAL   XRSUB,XE16D                ASK  A  16 BYTES FIELD TO       64472021
         MVC   Y1TEL(LX4,XR4),XYTEL      STORE  THE CONVERTED RESULT    64480021
       ST    XR3,XOP1                                                   64488021
       BAL   XRSUB,LA                          LA   0, ST.              64496021
       BAL   XRSUB,VBADCE          L   15,V(STI0)                       64504021
       DC    C'STI0'              BALR  14,15                           64512021
       BAL   XR2,SUBST1            GENERATE DC                          64520021
       BAL   XR2,SUBST2            GENERATE DC                          64528021
       BC    UNCON,XG050           GENERATE MAX OPERAND                 64536021
       SPACE 2                                                          64544021
XG070  C     XR4,XAVAL1                                                 64552021
       BC    XZERO,XG073           1ST OPERAND BEING PROCESSED          64560021
         OI    XSESWT,XX08               IT IS A TARGET FIELD.          64568021
       BC    UNCON,XG071           GET ATTRIBUTES                       64576021
XG073    UNPK  XGTEM2(LX1),DOP2+XGMINC  GET MINOR CODE OF DOP2          64584021
         NI    XGTEM2,XX0F                                              64592021
       CLI   XGTEM2,XGALN                   IS OP2 ALPHANUMERIC         64600021
       BC    XZERO,XG044                     YES                        64608021
       CLI   XGTEM2,XGGPFL                  IS OP2 FIXED LEN GROUP      64616021
       BC    XZERO,XG044                     YES                        64624021
       CLI   XGTEM2,XGGPVL                  IS OP2 VAR LEN GROUP        64632021
       BC    XZERO,XG044                     YES                        64640021
       BC    UNCOND,XG071                   NO,RETURN                   64648021
       SPACE  2                                                         64656021
       SPACE 5                                                          64664021
       DS    0H                                                         64672021
XGZAP    ZAP   DX0(LX16,XR4),XGLITV(LX0,XR3)                            64680021
       SPACE 10                                                         64688021
IKF50E CSECT                                                            64696021
FPLLOD EQU   *                                                          64704021
       USING *,XRVAR                                                    64712021
* ROUTINE TO GENERATE PACK INSTRUCTIONS FOR EXT DEC ITEMS               64720021
*                                                                       64728021
XPPACK LA    XR4,X1VAL                                                  64736021
       L     XR3,XAOPE1                                                 64744021
XPPA01 CLI   Y1IRX(XR4),XGEXDC                                          64752021
       BC    XNOEQ,XPPA00          OPERAND NOT EXT DEC                  64760021
         MVC   XELEN+NX1(LX1),Y1LBS+NX1(XR4)                            64768021
       BAL   XRSUB,XTAMPO          GET TEMP STOR                        64776021
       LH    XR6,XEREL1                                                 64784021
       LH    XR2,Y1FBS(XR4)                                             64792021
         CLI   Y1FBS+NX1(XR4),XX10                                      64800021
       BC    XTWO,XG052            OPERAND > 16 DIGITS                  64808021
       STH   XR6,XWC1                                                   64816021
         MVC   XL1+NX1(LX1),XYTEL+NX1                                   64824021
       STH   XR2,XL2                                                    64832021
       ST    XR3,XJOP1                                                  64840021
       BAL   XRSUB,PACK            GENERATE PACK                        64848021
       BC    UNCON,XG053           SET BUFFER ATTRIBUTES                64856021
XG052    MVI   XL1+NX1,XX0F                                             64864021
       SH    XR2,XC002                                                  64872021
       STH   XR2,XL2                                                    64880021
       STH   XR6,XWC1                                                   64888021
       ST    XR3,XJOP1                                                  64896021
       BAL   XRSUB,PACK            GENERATE PACK                        64904021
         MVI   XL1+NX1,XX02                                             64912021
       AH    XR6,XC014                                                  64920021
       STH   XR6,XWC1                                                   64928021
       BCTR  XR2,RW0               SUBTRACT 1 FROM LENGTH               64936021
         STC   XR2,PLUS2+NX2                                            64944021
         MVI   XL2+NX1,XX03                                             64952021
       ST    XR3,XJOP1                                                  64960021
       BAL   XRSUB,PACK            GENERATE PACK                        64968021
XG053  EQU   *                                                          64976021
         MVC   Y1TEL(LX4,XR4),XYTEL                                     64984021
       MVI   Y1IRX(XR4),XGINDC                                          64992021
XPPA00 C     XR4,XAVAL2                                                 65000021
       BC    XZERO,XPPEXT          2ND OPERAND HAS BEEN PROCESSED       65008021
       BAL   XRSUB,XSTOMV          IS OPERATION A STORE OR MOVE         65016021
       BC    UNCON,XPPEXT          YES                                  65024021
       LA    XR4,X2VAL                                                  65032021
       L     XR3,XAOPE2                                                 65040021
       BC    UNCON,XPPA01          CHECK 2ND OPERAND                    65048021
XPPEXT LM    XR0,XR15,XGSAV6                                            65056021
       BCR   UNCON,XRSUB           RETURN                               65064021
       EJECT                                                            65072021
*                                                                       65080021
XBIIDU EQU   *                                                          65088021
         TM    Y1IRX+NX1(XR3),XX09       XG2IRX+XINREG.                 65096021
       BC    XTHRE,XBID01          OPERAND IS DP AND IN 2 REG           65104021
       BC    XNOEQ,XBID11          OPERAND IS NOT DP OR IN 2 REG        65112021
*                                                                       65120021
         CLI   Y1BBS+NX1(XR3),XX04                                      65128021
       BC    XLOEQ,XBID10          OPERAND <= 4 BYTES IN LENGTH         65136021
       BAL   XRSUB,XSLODB          LOAD OPERAND IN 2 REG                65144021
*                                                                       65152021
*                                                                       65160021
XBID01 BAL   XRSUB,XZWHIR          GET REG TBL OF REG USED              65168021
       L     XR4,XLIRP                  XR4 HAS REG. INFORMATION TA     65176021
         CLI   DX3(XR4),XX02                                            65184021
       BC    XTWO,XBID02                CALL  DP  CONVERT ROUTINE B     65192021
       BC    XONE,XBID03                TO ID                           65200021
       BAL   XRSUB,VBADCE          L   15,V(BID2)                       65208021
       DC    CL4'BID2'                     BALR  14,15                  65216021
       BC    UNCON,XBID04               X                               65224021
XBID02 BAL   XRSUB,VBADCE         IN BIDN, N IS THE NUMBER OF           65232021
       DC    C'BID0'              THE EVEN REGISTER                     65240021
       BC    UNCON,XBID04               X                               65248021
XBID03 BAL   XRSUB,VBADCE               X                               65256021
       DC    C'BID1'                                                    65264021
       SPACE 2                                                          65272021
XBID04 EQU   *                                                          65280021
       BAL   XRSUB,WKZAP           GENERATE ZAP OUT OF WORK AREA        65288021
         L     XR6,DX4(XR4)              RELEASE REG. AND RESET FLAG    65296021
         XC    DX0(LX3,XR6),DX0(XR6)                                    65304021
XBID20   XC    DX0(LX3,XR4),DX0(XR4)                                    65312021
         NI    Y1IRX+NX1(XR3),XIN2RX                                    65320021
         MVI   Y1IRX(XR3),XX0C                                          65328021
       LM    XR0,XR15,XGSAV8            EXIT.                           65336021
       BCR   UNCON,XRSUB                X                               65344021
       SPACE 2                                                          65352021
*                                                                       65360021
*                                                                       65368021
XBID10   BAL   XRSUB,XSLOAS        GENERATE LOAD INSTRUCTION            65376021
XBID11 BAL   XRSUB,XZWHIR               X                               65384021
       L     XR4,XLIRP                  3(XR4)  HAS REG NUMBER.         65392021
         MVC   XREG1(LX1),DX3(XR4)          GENERATE                    65400021
         MVI   XELEN+NX1,XX08                   CVD  XRN,TEMP           65408021
       BAL   XRSUB,XTAMPO               X                               65416021
         MVC   XWC1(LX2),XEREL1          X                              65424021
       BAL   XRSUB,CVD                  X                               65432021
         MVC   Y1TEL(LX4,XR3),XYTEL      UPDATE   XIVAL BUFFER          65440021
*                                                                       65448021
*                                                                       65456021
       BC    UNCON,XBID20               GO AND UPDATE TYPE .            65464021
       EJECT                                                            65472021
XIDBIU EQU   *                                                          65480021
         CLI   XGTEM2+NX9,XX04                                          65488021
       BC    XTWO,XID000                DP CONVERSION.                  65496021
       BAL   XRSUB,XRSASG               SINGLE PRECISION CONVERSION     65504021
       L     XR4,XLIRP                                                  65512021
         MVC   XYLEN(LX1),XZLENG+NX1             ZAP  TEMP(8),OP        65520021
       LA    XRSUB,XID002                                               65528021
         CLC   XYLEN(LX1),Y1LAS+NX1(XR3)         CVB  XRN,TEMP          65536021
       BC    XNOEQ,XYOBF           GENERATE ZAP INTO TEMP STOR          65544021
       BC    UNCON,XYOAF           GENERATE ZAP INTO TEMP STOR          65552021
*                                                                       65560021
*                                                                       65568021
XID002 LH    XR6,XEREL1                                                 65576021
         CLI   XYTEL+NX1,XX08                                           65584021
       BC    XLOEQ,XID006          LENGTH IS <= 8 BYTES                 65592021
       AH    XR6,XC008                                                  65600021
XID006 STH   XR6,XWC1                                                   65608021
         MVC   XREG1(LX1),DX3(XR4)                                      65616021
       BAL   XRSUB,CVB                  X                               65624021
XID010   MVI   Y1IRX(XR3),XX0B                                          65632021
       BAL   XRSUB,XZWHIR          GET REG TBL OF REG USED              65640021
         CLI   XGTEM2+NX9,XX04           SET FLAGS IN REG TABLE.        65648021
       BC    XNOGT,XID100               X                               65656021
         OI    DX2(XR4),XRDPRE           X                              65664021
         L     XR6,DX4(XR4)              X                              65672021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    65680021
         OI    Y1IRX+NX1(XR3),XG2IRX     X                              65688021
XID100 EQU   *                          X                               65696021
       LM    XR0,XR15,XGSAV8                                            65704021
       BCR   UNCON,XRSUB           RETURN                               65712021
       SPACE 2                                                          65720021
XID000   MVI   XREGNO,XX00                                              65728021
       BAL   XRSUB,XFREEP               FREE  PAIR  0,1                 65736021
         MVI   BDISP1,XXD0                                              65744021
         MVI   BDISP1+NX1,WORKA          GENERATE    ZAP  WORKA(10,1    65752021
         MVI   XL1+NX1,XX0A                                        O    65760021
       LH    XR5,XMINFV                 X                               65768021
       BAL   XRSUB,XZNIII               X                               65776021
       LH    XR0,XL2                                                    65784021
       SH    XR0,XC010                                                  65792021
       BC    XNOGT,XID003          GENERATE ZAP                         65800021
         STC   XR0,XPLUS2+NX2                                           65808021
         MVI   XL2+NX1,XX0A                                             65816021
XID003 EQU   *                                                          65824021
       BAL   XRSUB,ZAP             GENERATE ZAP                         65832021
       CH    XR6,XC018                                                  65840021
       BC    XNOGT,XID005          OPERAND <= 18 CALL SUBROUTINE        65848021
         MVI   BDISP1+NX1,WORKA                                         65856021
         MVI   BDISP1,XXD0                                              65864021
         MVI   XIMM,XX0F                                                65872021
       BAL   XRSUB,NI              GENERATE NI                          65880021
XID005 EQU   *                                                          65888021
       BAL   XRSUB,VBADCE         L  15,V(IDB0)                         65896021
       DC    C'IDB0'              BALR  14,15                           65904021
       LA    XR4,XRAU14                                                 65912021
         MVI   Y1BBS+NX1(XR3),XX08                                      65920021
         MVI   Y1BAS+NX1(XR3),XX08                                      65928021
       BC    UNCON,XID010          SET FLAGS IN REG TBL                 65936021
       SPACE 10                                                         65944021
XFREEU EQU   *                                                          65952021
       BAL   XRSUB,XLWHIR               GET REG. TABLE ADDRESS.         65960021
       L     XR4,XLIRP                                                  65968021
         TM    DX2(XR4),XRFREE                                          65976021
       BC    XZERO,XFR001          REG IS FREE                          65984021
       BAL   XRSUB,XRSTOR               GENERATE   ST  XRN ,TEMP        65992021
XFR001 EQU   *                          OR,  STM   XR2P,XR2P+1,TEMP     66000021
       LTR   XR0,XR0                       OR      ST  XR2P ,TEMP       66008021
       BC    XZERO,XFR010                          ST  XR2P+1, TEMP     66016021
         L     XR4,DX4(XR4)              X                              66024021
         TM    DX2(XR4),XRFREE           X                              66032021
       BC    XZERO,XFR002               X                               66040021
       BAL   XRSUB,XRSTOR               X                               66048021
XFR002   L     XR4,DX4(XR4)              X                              66056021
       SPACE 2                                                          66064021
XFR010 LM    XR5,XR3,XGSAV3             X  EXIT                         66072021
       BCR   UNCON,XRSUB                X                               66080021
       SPACE 5                                                          66088021
XSSPRO EQU   *                                                          66096021
*                                                                       66104021
         TM    DX7(XR3),XX02             Q BIT ON.                      66112021
       BC    XZERO,XSSP02               NO-                             66120021
LSSPRO SR    XR6,XR6              CALL Q-RTNS                           66128021
         IC    XR6,DX1(XR3)                     L    2,GNREF            66136021
       SH    XR6,XC004                         BALR  2,2                66144021
       AR    XR6,XR3                    AND AS MANY  BALR  2,2 AS       66152021
         MVI   XREG1,XX02                SPECIFIED IN ATTRIBUTE.        66160021
         MVC   XGN1(LX2),DX1(XR6)                                       66168021
       BAL   XRSUB,LOAD            GENERATE A LOAD INSTRUCTION          66176021
       SR    XR1,XR1                                                    66184021
         IC    XR1,DX0(XR6)                                             66192021
         LA    XR1,DX1(XR1)                                             66200021
       BAL   XRSUB,WRKLRG          KILL SUBS                            66208021
XSSP03   MVI   XREG1,XX02                                               66216021
         MVI   XREG2,XX02                                               66224021
       BAL   XRSUB,BRNLNK          GENERATE A BAL INSTRUCTION           66232021
       BCT   XR1,XSSP03            FALL THRU WHEN SUFFIC BALRS GEN      66240021
         B     XSSPXT             BRANCH TO XSSPXT RTN                  66248021
XSSP02 EQU   *                                                          66256021
       BAL   XRSUB,XLENGH          GET LENGTHS OF OPERAND               66264021
         CLC   XIDBY(LX6),XC000                                         66272021
       BC    XZERO,XSSP04          NON ARITHMETIC                       66280021
         CLI   XGSCAL(XR3),XX00                                         66288021
       BC    XZERO,XSSPD1          NO SCALING                           66296021
         TM    XGSCAL(XR3),XX80                                         66304021
       BC    XTHRE,XSSPD1          SCALING                              66312021
XSSP07   TM    DX3(XR3),XX01             REDEFINE FLAG ON.              66320021
       BC    XZERO,XSSPXT               NO-                             66328021
XSSPD1 SR    XR1,XR1                                                    66336021
         IC    XR1,DX1(XR3)                                             66344021
       BCTR  XR1,XR0               SUBTRACT ONE TO GET DICT PTR         66352021
       AR    XR1,XR3                                                    66360021
         MVC   XCON+NX1(LX3),DX0(XR1)    MOVE DICT PTR                  66368021
         MVI   XCON,XX00                                                66376021
*                                                                       66384021
       L     XR1,XASCRP                 FIND BEG.AND DISPLT.OF SUBS     66392021
       BAL   XRSUB,XTBDEB               IN XR2 AND XR3.                 66400021
       LR    XR5,XR2                                                    66408021
       LR    XR0,XR2                                                    66416021
       AR    XR0,XR3                                                    66424021
       CR    XR0,XR2                                                    66432021
       BC    XZERO,XSSPXT          RETURN                               66440021
       SPACE 2                                                          66448021
XSU00    CLC   DX0(LX2,XR5),XC012   ANY SUBS IDKS IN ENTRY...           66456021
       BNE   XSU10                YES, TEST FOR A MATCH                 66464021
       AH    XR5,XC012            NO, SKIP THIS ENTRY                   66472021
       B     XSUTST               TEST FOR END OF TABLE                 66480021
XSU10  EQU   *                                                          66488021
         LH    XR6,DX2(XR5)        PICK UP NUMB OF SUBS                 66496021
       LR    XR4,XR5                    RY.                             66504021
       AH    XR5,XC012                  SET XR5 TO THE FIRST SUBS O     66512021
XSU03    CLC   DX0(LX4,XR5),XCON          TRY. IS THERE A MATCH         66520021
       BC    XZERO,XSU01                YES                             66528021
       SH    XR6,XC001                  NO-TRY NEXT SUBS.               66536021
       BC    XNOEQ,XSU02                NO MORE SUBS.FOR THIS ENTRY     66544021
       AH    XR5,XC004                  NEXT ENTRY .                    66552021
XSUTST CR    XR5,XR0                    NO MORE  ENTRY.                 66560021
       BC    XNOEQ,XSU00                NO                              66568021
       BAL   XRSUB,XUPRET          UPDATE REGISTER TABLE          9     66576021
XSSPXT  LM   XR0,XR15,XGSAV1                                            66584021
       BCR   UNCON,XRSUB           RETURN                               66592021
XSSP04 CLI   XGTEM2,XGGPFL                                              66600021
       BC    XZERO,XSSP06          FIXED LENGTH GROUP                   66608021
       CLI   XGTEM2,XGGPVL                                              66616021
       BC    XNOEQ,XSSP07          NOT A VARIABLE LENGTH GROUP          66624021
XSSP06 BAL   XRSUB,KILSUB               FOR GROUP KILL SUB. TABLE.      66632021
       BC    UNCON,XSSPXT          RETURN                               66640021
*  THIS RTN INSERTED TO FIX P9553.                                      66648021
XUPRET EQU   *                                                          66656021
       LR    XR0,XRSUB             SAVE REG14-LINKAGE REG               66664021
       L     XR1,XASCRP                                                 66672021
       BAL   XRSUB,XTBDEB          GET SUBSCRIPT TBL INFO               66680021
       LR    XR5,XR2               SAVE ADDR OF BEG OF TABLE            66688021
       AR    XR3,XR2               GET ADDR OF END OF TABLE             66696021
XAGAIN   LH    XR6,DX0(XR2)         GET LENGTH OF ENTRY                 66704021
         TM    DX5(XR2),XRRRFL      TEST IF ENTRY IS FLAGGED FOR REG    66712021
       BC    NOTHR,XUPTES          NO,BRANCH                            66720021
         MVC   XREGNO(LX1),DX6(XR2)  YES,MOVE REG= WHERE SUBSCRIPT IS   66728021
       BAL   XRSUB,XLWHIR          GET ADDRESS OF REG TBL               66736021
       L     XR4,XLIRP             GET ADDR OF IRTBL THAT MATCHES X     66744021
         LA    XR1,DX4(XR2)         GET ADDR OF 2ND WD IN ENTRY         66752021
       SR    XR1,XR5               GET DISP OF ENTRY FROM BEG OF TB     66760021
         STH   XR1,DX0(XR4)         ENTER DISP IN IR TABLE              66768021
XUPTES AR    XR2,XR6               ADD LENGTH OF ENTRY TO GET NEXT      66776021
       CR    XR2,XR3               IS IT END OF TABLE                   66784021
       BC    XONE,XAGAIN           NO,BRANCH                            66792021
       LR    XRSUB,XR0             YES,EXIT                             66800021
       BCR   UNCOND,XRSUB          RETURN                               66808021
       SPACE 2                                                          66816021
XSU02  AH    XR5,XC004                  TRY NEXT SUBSCRIPT              66824021
       BC    UNCON,XSU03           LOOP                                 66832021
       SPACE 2                                                          66840021
XSU01    LH    XR6,DX0(XR4)              MATCH HAS BEEN FOUND           66848021
         TM    DX5(XR4),XX30                                            66856021
       BC    NOTHR,XSU09                RELEASE ANY REGISTER USED       66864021
         MVC   XREGNO(LX1),DX6(XR4)        BY THIS PARTICULAR ENTRY.    66872021
       BAL   XRSUB,XLWHIR          GET ADDRESS OF REG TBL               66880021
       L     XR5,XLIRP                                                  66888021
         MVC   DX0(LX3,XR5),XC000                                       66896021
XSU09  EQU   *                                                          66904021
       LR    XR5,XR4                    ERASE THIS ENTRY BY PUSHING     66912021
       AR    XR5,XR6                    BACK TABLE.                     66920021
       LR    XR2,XR4                    X                               66928021
XSU04  CR    XR5,XR0                    X                               66936021
       BC    XZERO,XSU05                X                               66944021
         MVC   DX0(LX4,XR4),DX0(XR5)      X                             66952021
       AH    XR5,XC004                  X                               66960021
       AH    XR4,XC004                  X                               66968021
       BC    UNCON,XSU04                X                               66976021
XSU05  SR    XR3,XR6                    UPDATE DISPLACT.OF TABLE AN     66984021
         STH   XR3,DX4(XR1)              CHECK  IF OTHER ENTRIES CON    66992021
       LR    XR5,XR2                    THIS DATA-NAME SUBSCRIPT.       67000021
       SR    XR0,XR6                    X                               67008021
       BC    UNCON,XSUTST               X                               67016021
       SPACE 10                                                         67024021
       SPACE 5                                                          67032021
LOADEB EQU   *                                                          67040021
         TM    Y1IRX+NX1(XR3),XZGNLT                                    67048021
       BC    XZERO,XL009           OPERAND NOT A LITERAL                67056021
       LR    XR5,XR3                                                    67064021
       BAL   XRSUB,XIDSZ           GET SIZES OF OPERAND                 67072021
         MVC   XZLENG(LX2),XBDBY                                        67080021
XL009  EQU   *                                                          67088021
       LH    XR5,XMINTW                                                 67096021
       TM    XSLSW,XLASRX               SET XRS TO POINTER TO THE       67104021
       BC    XZERO,XL003                GIVEN IR IF IT IS THE CASE.     67112021
       BAL   XRSUB,XLWHIR          GET ADDRESS OF REG TBL               67120021
       L     XR4,XLIRP                                                  67128021
XL003  TM    XSLSW,XL2REG                                               67136021
       BC    XZERO,XL001                SINGLE LOAD WANTED.             67144021
         TM    Y1IRX+NX1(XR3),XG2IRX                                    67152021
       BC    XZERO,XL002           OPERAND NOT DP                       67160021
XL006  TM    XSLSW,XLASRX               IF OP IS ALREADY IN A DOUBL     67168021
       BC    XZERO,XLEXIT               EXIT IF THE IR IS NOT IMPOS     67176021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               67184021
       L     XR1,XLIRP                                                  67192021
       CR    XR4,XR1                                                    67200021
       BC    XZERO,XLEXIT          RETURN                               67208021
       BAL   XRSUB,XLSETA                    LR RGIVEN,R                67216021
       TM    XSLSW,XL2REG                                               67224021
       BC    XZERO,XL005                SINGLE  LOAD - OUT.             67232021
         L     XR1,DX4(XR1)                                             67240021
         MVC   XREG2(LX1),DX3(XR1)        2ND LOAD FOR DOUBLE REG LOA   67248021
         L     XR6,DX4(XR4)                     LR   RGIV,R             67256021
         MVC   XREG1(LX1),DX3(XR6)                                      67264021
       BAL   XRSUB,LOAD            GENERATE A LOAD INSTRUCTION          67272021
*                                                                       67280021
XL004    L     XR6,DX4(XR4)                                             67288021
       BAL   XRSUB,FPLLN                SET FLAGS.                      67296021
         OI    DX2(XR4),XRDPRE            DOUBLE REG. FLAG.             67304021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    67312021
         OI    Y1IRX+NX1(XR3),XG2IRX                                    67320021
       SPACE 2                                                          67328021
XLEXIT LM    XR0,XR15,XGSAV3                                            67336021
       BCR   UNCON,XRSUB           RETURN                               67344021
       SPACE 2                                                          67352021
XL002  TM    XSLSW,XLASRX                                               67360021
       BC    XZERO,XL007           NOT LOADED USING AFTER SCALING L     67368021
XL021    CLI   XZLENG+NX1,XX04                                          67376021
       BC    XTWO,XL008            LENGTH > 4 BYTES                     67384021
XL014  BAL   XRSUB,XLSETA                     L    R,OP                 67392021
XL020    MVI   BDISP1+NX1,XX20                                          67400021
         MVC   XREG1(LX1),DX3(XR4)            SRDA   R,32               67408021
       BAL   XRSUB,SRDA            GENERATE SRDA                        67416021
       BC    UNCON,XL004           SET FLAGS                            67424021
*                                                                       67432021
*   LM  R2P,R2P+1,OP                                                    67440021
*                                                                       67448021
XL008    MVC   XREG1(LX1),DX3(XR4)                                      67456021
         L     XR6,DX4(XR4)                                             67464021
         MVC   XREG2(LX1),DX3(XR6)                                      67472021
       BAL   XRSUB,XZNLB           SET A-TEXT                           67480021
       BAL   XRSUB,LM              GENERATE LM                          67488021
       BC    UNCON,XL004           SET FLAGS                            67496021
       SPACE 2                                                          67504021
XL007    TM    Y1IRX+NX1(XR3),XINREG                                    67512021
       BC    XZERO,XL023           OPERAND NOT IN A REG                 67520021
       SPACE 2                                                          67528021
*                                                                       67536021
*    IS THE OTHER REG OF THE PAIR FREE.                                 67544021
*   YES   GENERATE      SRDA   REVEN,32    OR    LR   REVEN,RODD        67552021
*                                                SRDA   REVEN,32        67560021
*                                                                       67568021
         BAL   XRSUB,XZWHIR        GET ADDRESS OF REG TBL               67576021
       L     XR4,XLIRP                                                  67584021
         L     XR6,DX4(XR4)                                             67592021
         TM    DX2(XR6),XRFREE                                          67600021
         BZ    XL010               REGISTER IS FREE               51355 67608021
         BAL   XRSUB,XRDBIR        ASSIGN AN EVEN-ODD PAIR        51355 67616021
         L     XR4,XLIRP                                          51355 67624021
         B     XL014               GEN  LR  EVENREG,REG           51355 67632021
XL010    DS    0H                                                 51355 67640021
         TM    DX3(XR6),XX01                                            67648021
       BC    XTHRE,XL020           REG ODD                              67656021
       BAL   XRSUB,XZX4X6          SWITCH REG TBL ADDRESSES             67664021
       BC    UNCON,XL014           GENERATE LOAD INSTRUCTION            67672021
       SPACE 2                                                          67680021
XL023  BAL   XRSUB,XRDBIR          ASSIGN AN EVEN-ODD REG PAIR          67688021
       L     XR4,XLIRP                                                  67696021
       BC    UNCON,XL021           GENERATE LOAD INSTRUCTION            67704021
       SPACE 2                                                          67712021
XL001    TM    Y1IRX+NX1(XR3),XINREG                                    67720021
       BC    XTHRE,XL006           OPERAND IN A REG                     67728021
       TM    XSLSW,XLASRX                                               67736021
       BC    XTHRE,XL030           OPER LOADED USING AFTER SCALE LN     67744021
       BAL   XRSUB,XRSASG               L  XR, OP   OR   LR  RGV,R      67752021
       L     XR4,XLIRP                                                  67760021
XL030  BAL   XRSUB,XLSETA          GENERATE LOAD INSTRUCTION            67768021
XL005  BAL   XRSUB,FPLLN           SET FLAGS                            67776021
       BC    UNCON,XLEXIT          RETURN                               67784021
       SPACE 2                                                          67792021
XLSETA ST    XRSUB,XVARS3                                               67800021
         MVC   XREG1(LX1),DX3(XR4)                                      67808021
       BAL   XRSUB,XZNLB           SET A-TEXT                           67816021
       BAL   XRSUB,LOAD            GENERATE LOAD INSTRUCTION            67824021
       L     XRSUB,XVARS3                                               67832021
       BCR   UNCON,XRSUB           RETURN                               67840021
       EJECT                                                            67848021
XZBEG  EQU   *                                                          67856021
       SPACE 2                                                          67864021
         TM    XZCSW,XX01                                               67872021
       BC    XZERO,XZ10FL               NOT SCALING                     67880021
       LH    XR6,Y1ALP(XR3)             GENERATE POWER OF TEN           67888021
       LPR   XR0,XR6                                                    67896021
       BC    XZERO,XZ1EX           RETURN                               67904021
       SPACE 5                                                          67912021
*      XB10PW   -GENERATE POWER OF TEN IN BINARY.                       67920021
       SPACE 5                                                          67928021
         MVI   XCONL,XX02                X                              67936021
       CH    XR0,XC004                                                  67944021
       BC    XLOEQ,XB10P3          GENERATE HALF WORD CONSTANT          67952021
         MVI   XCONL,XX04                                               67960021
XB10P3 EQU   *                                                          67968021
       LH    XR1,XC001                                                  67976021
XB10P1 MH    XR1,XC010                  COMPUTE POWER OF TEN.           67984021
         BCT   XR0,XB10P1              LOOP                             67992021
         MVC   XCON(LX16),XC000          RESET RECEIVING ZONE.          68000021
         ST    XR1,XCON+NX12             SET XCON  ZONE                 68008021
       LTR   XR6,XR6                                                    68016021
       BC    XONE,XZDIV            NEG SCALING                          68024021
*                                                                       68032021
*                                                                       68040021
       TM    XOPMOD,XMUDV               DIVISOR OR OPERAND OF MULTI     68048021
       BC    XNOEQ,XZ10FN               YES                             68056021
       TM    XOPMOD,XDIVFL              DIVIDEND                        68064021
       BC    XTHRE,XZ100                YES                             68072021
XZ10FL   CLI   XFBAS+NX1,XX04            RESULT IS DP                   68080021
       BC    XTWO,XZ100                 YES                             68088021
XZ10FN   OI    XZCSW,XX08                NO-RESULT WANTED IN ONE WOR    68096021
       SPACE 2                                                          68104021
XZ100    TM    Y1IRX+NX1(XR3),XINREG                                    68112021
       BC    XTHRE,XZ102           OPERAND IN REG                       68120021
         TM    XZCSW,XX01                                               68128021
       BC    XTHRE,XZ104           SCALING                              68136021
         TM    Y1IRX+NX1(XR5),XINREG                                    68144021
       BC    XZERO,XZ104           OPERAND NOT IN REG                   68152021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      68160021
XZ102    OI    XZCSW,XX02                1ST OP IN REG.                 68168021
         TM    XZCSW,XX01                                               68176021
       BC    XTHRE,XZ104           SCALING                              68184021
         TM    Y1IRX+NX1(XR5),XINREG                                    68192021
       BC    XZERO,XZ104           OPERAND NOT IN REG                   68200021
         OI    XZCSW,XX04                2OP IN REG.                    68208021
       SPACE 2                                                          68216021
XZ104    TM    XZCSW,XX08                                               68224021
       BC    XZERO,XZ106           RESULT NOT WANTED IN 1 WORD          68232021
*                                                                       68240021
*  RESULT WANTED IN A WORD - TRY TO GENERATE MH.                        68248021
*                                                                       68256021
         TM    XZCSW,XX06                                               68264021
       BC    XZERO,XZ107                NO OP. IN REG.                  68272021
       BC    XTHRE,XZ106           BOTH IN REG                          68280021
XZ114  BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               68288021
       L     XR4,XLIRP                                                  68296021
       LR    XR6,XR4                                                    68304021
       BAL   XRSUB,XZSIZ2          TEST SIZE OF 2ND OPERAND             68312021
       BC    UNCON,XZ106                2ND OP. IS A FULL WORD -NO      68320021
         TM    XZCSW,XX01                MH POSSIBLE.                   68328021
       BC    XTHRE,XZ108           MULTIPLY OPERATION                   68336021
XZ113  BAL   XRSUB,XZBINA               SET A-TEXT                      68344021
       BC    UNCON,XZ123                GO TO MULT. GENERATION.         68352021
XZ108    MVC   XCON1(LX17),XCON                                         68360021
       BC    UNCON,XZ123           GENERATE MULTIPLY INSTRUCTION        68368021
XZ107    TM    XZCSW,XX01                                               68376021
       BC    XTHRE,XZ109           MULTIPLY OPERATION                   68384021
         CLC   Y1BAS+NX1(LX1,XR3),Y1BAS+NX1(XR5)                        68392021
       BC    XTWO,XZ110                 LOAD BIGGER OP IN A REG IF      68400021
*                                       OP IS A HALF WORD.              68408021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      68416021
XZ110    CLI   Y1BAS+NX1(XR5),XX02                                      68424021
       BC    XTWO,XZ106            LENGTH > HALF WORD                   68432021
XZ1100 BAL   XRSUB,XSLOAS          GENERATE LOAD AFTER SCALING          68440021
       BC    UNCON,XZ114           GET ADDRESS OF REG TBL               68448021
*                                                                       68456021
*                                                                       68464021
XZ109    CLI   XCONL,XX02                                               68472021
       BC    XNOGT,XZ1100          LENGTH <= 2 BYTES                    68480021
         CLI   Y1BBS+NX1(XR3),XX02                                      68488021
       BC    XTWO,XZ106            OPERAND > 2 BYTES                    68496021
       BAL   XRSUB,XRSASG          ASSIGN A REG                         68504021
       L     XR4,XLIRP                                                  68512021
       LR    XR6,XR4                                                    68520021
         MVC   XREG1(LX1),DX3(XR4)                                      68528021
         MVC   XCON1(LX17),XCON                                         68536021
       BAL   XRSUB,LOAD            GENERATE A LOAD INSTRUCTION          68544021
       LH    XR5,XMINTW                                                 68552021
       BAL   XRSUB,XZBINB          SET A-TEXT                           68560021
       BAL   XRSUB,XZWHIR               SET FLAF IN OPERANF             68568021
       BC    UNCON,XZ123           GENERATE A MULTIPLY INSTRUCTION      68576021
*                                                                       68584021
*  GENERATE  M  OR  MR                                                  68592021
*                                                                       68600021
XZ106    MVI   XCONL,XX04                                               68608021
         TM    XZCSW,XX06                                               68616021
       BC    XZERO,XZ116           BOTH OPERANDS NOT IN A REG           68624021
       BC    XTHRE,XZ117                BOTH OP IN REG                  68632021
XZ129  BAL   XRSUB,XZWHIR               CHECK IF OTHER REG OF           68640021
       L     XR4,XLIRP                  PAIR IS FREE.                   68648021
         L     XR6,DX4(XR4)                                             68656021
         TM    DX2(XR6),XRFREE                                          68664021
       BC    XTHRE,XZ116           REG NOT FREE                         68672021
*                                                                       68680021
*  THE OTHER REGISTER OF THE PAIR TO WHICH ONE OPERAND                  68688021
*  BELONGS IS INOCCUPIED. - GENERATE                                    68696021
*                            LH   R,OP2  OR  LR   R,R1                  68704021
*                            MR              M                          68712021
*                                                                       68720021
XZ153    TM    DX3(XR6),XX01             MAKE SURE THAT XR4             68728021
       BC    XTHRE,XZ118                POINTS TO THE EVEN REG AND      68736021
       BAL   XRSUB,XZX4X6               XR6 TO THE ODD.                 68744021
XZ118    MVC   XREGNO(LX1),DX3(XR6)                                     68752021
       BAL   XRSUB,XZSIZ2               OTHER OP IS A FULL WORD.        68760021
       BC    UNCON,XZ120                OTHER OP IS A HALF WORD,        68768021
*                                       LOAD IT IN INOCCUPIED           68776021
*                                       REGISTER OF THE PAIR.           68784021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      68792021
         TM    DX2(XR6),XRFREE                                          68800021
       BC    XZERO,XZ126           REG IS FREE                          68808021
         MVC   XREGNO(LX1),DX3(XR4)                                     68816021
XZ126  BAL   XRSUB,XSLGVX          GENERATE A LOAD INSTRUCTION          68824021
XZ125    MVC   XREG2(LX1),DX3(XR4)                                      68832021
XZ123    MVC   XREG1(LX1),DX3(XR4)        GENERATE M  OR  MR.           68840021
         BAL   XRSUB,MULT               GENERATE MULTIPLY               68848021
       SPACE 2                                                          68856021
*                                                                       68864021
*  UPDATE FLAG IN REG TABLE AND IN RESULT BUFFER.                       68872021
*                                                                       68880021
         XI    Y1IRX+NX1(XR3),XINREG    UPDATE FLAG IN OPERANDS AND     68888021
         XC    DX0(LX3,XR4),DX0(XR4)      RESULT BUFFER , AND ALSO      68896021
         TM    XZCSW,XX08                IN REG. INFORMATION TABLE.     68904021
       BC    XZERO,XZ180           RESULT NOT WANTED IN A WORD          68912021
       LR    XR4,XR6                                                    68920021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               68928021
XZFINL   TM    XZCSW,XX01                                               68936021
       BC    XTHRE,XZ1EX           SCALING, EXIT                        68944021
         MVC   XFIRX(LX2),Y1IRX(XR3)     SET RESULT BUFFER.             68952021
XZ1EX  LM    XR0,XR15,XGSAV2                                            68960021
       BCR   UNCON,XRSUB           RETURN                               68968021
XZ180  BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               68976021
         OI    DX2(XR4),XRDPRE                                          68984021
         MVC   DX0(LX3,XR6),DX0(XR4)                                    68992021
         OI    Y1IRX+NX1(XR3),XG2IRX                                    69000021
       BC    UNCON,XZFINL          SET RESULT BUFFER IF MULT            69008021
       SPACE 2                                                          69016021
XZ120    BAL   XRSUB,XSLGVX        MAKE SURE THAT AT LEAST              69024021
         TM    XZCSW,XX01                ONE OF THE OPERAND IS IN       69032021
       BC    XTHRE,XZ108                THE ODD REGISTER OF THE         69040021
       BC    UNCON,XZ113                PAIR.                           69048021
       SPACE 2                                                          69056021
*                                                                       69064021
*  ASK  A  NEW  PAIR  OF  REG.                                          69072021
*                                                                       69080021
XZ116  BAL   XRSUB,XRDBIR               ASK A NEW PAIR                  69088021
       L     XR4,XLIRP                  XR4 HAS EVEN REG. TABLE         69096021
         L     XR6,DX4(XR4)              XR6 HAS ODD --.                69104021
         MVC   XREGNO(LX1),DX3(XR6)                                     69112021
         TM    XZCSW,XX01                LOAD SMALLER OPERAND IN        69120021
       BC    XTHRE,XZ194                THE ODD OF THE                  69128021
         CLC   Y1BAS+NX1(LX1,XR3),Y1BAS+NX1(XR5) PAIR.                  69136021
       BC    XLOEQ,XZ194           LOAD OPERAND ADDRESSED IN XR3        69144021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      69152021
XZ194  BAL   XRSUB,XSLGVX          GENERATE A LOAD INSTRUCTION          69160021
       BC    UNCON,XZ118           CHECK SIZE OF 2ND OPERAND            69168021
       SPACE 2                                                          69176021
XZ117  BAL   XRSUB,XZWHIR               IF BOTH OPERAND ARE             69184021
       L     XR4,XLIRP                  IN REG                          69192021
         L     XR6,DX4(XR4)              A( IF THEY ARE IN THE          69200021
       BAL   XRSUB,XZX3X5               SAME PAIR -MR  REV,REV          69208021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               69216021
       C     XR6,XLIRP                  B) IF ONE OF THEM IS IN         69224021
       BC    XNOEQ,XZ150                A PAIR WITH AN INOCCUPIED       69232021
         TM    DX3(XR6),XX01             REGISTER PROCEED AS            69240021
       BC    XTHRE,XZ125                IN Z106.                        69248021
       BAL   XRSUB,XZX4X6          SWITCH REG TBL ADDRESSES             69256021
       BC    UNCON,XZ125           GENERATE MULTIPLY                    69264021
XZ150    TM    DX2(XR6),XRFREE                                          69272021
       BC    XTHRE,XZ129           CHECK OTHER REG OF PAIR              69280021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      69288021
       BC    UNCON,XZ153           GENERATE MULT                        69296021
       SPACE 2                                                          69304021
       SPACE 2                                                          69312021
XZSIZ2   TM    XZCSW,XX01                TEST SIZE OF 2ND OPERAND.      69320021
       BC    XTHRE,XZSIZ3               IF IT IS A FULL WORD OR         69328021
         TM    Y1IRX+NX1(XR5),XINREG     IF IT IS IN REG RETURN AT      69336021
       BCR   XTHRE,XRSUB                0(XRSUB) - OTHERWISE            69344021
         CLI   Y1BAS+NX1(XR5),XX02       RETURN AT 4(XRSUB).            69352021
XZSIZ4 BCR   XTWO,XRSUB            RETURN                               69360021
         B     DX4(XRSUB)         RETURN TO CALLER                      69368021
XZSIZ3   CLI   XCONL,XX02                                               69376021
       BC    UNCON,XZSIZ4          RETURN                               69384021
       SPACE 5                                                          69392021
XZDIV    BAL   XRSUB,XSLODB        GENERATE A DP LOAD                   69400021
*                                       DIVIDE BY POWER OF              69408021
*                                       TEN IN XCON                     69416021
         MVI   XCONL,XX04                                               69424021
       LH    XR5,XMINON                                                 69432021
       BAL   XRSUB,XZBINB          SET A-TEXT                           69440021
       BAL   XRSUB,DIV             GENERATE A DIVIDE INSTRUCTION        69448021
       BAL   XR1,XODDRG                 GET ODD REGISTER = QUOTIENT     69456021
       BAL   XRSUB,FPLLN           SET FLAGS IN REG TBL                 69464021
         XI    Y1IRX+NX1(XR3),XG2IRX                                    69472021
       BC    UNCON,XZ1EX           RETURN                               69480021
       EJECT                                                            69488021
*                                                                       69496021
*                                                                       69504021
FPLLLB EQU   *                                                          69512021
         TM    XSLSW,XX02                                               69520021
       BC    XZERO,FPL02           SHORT FORM                           69528021
         TM    Y1IRX+NX1(XR3),XG2IRX     OPERAND ALREADY CORRECTLY L    69536021
       BC    XTHRE,FPLLEX               EXIT.                           69544021
*                                                                       69552021
*   LOAD IN A REG LONG FORM                                             69560021
*                                                                       69568021
       BAL   XRSUB,XRSASF               ASK A REG - XR4 WILL POINT      69576021
*                                       CORRESPONDING IR TABLE.         69584021
       L     XR4,XLIRP                                                  69592021
FPL11    TM    Y1IRX+NX1(XR3),XGDPFP                                    69600021
       BC    XZERO,FPL03           NOT DP                               69608021
       BAL   XRSUB,FPLLL           SET A-TEXT BUFFER.                   69616021
       BAL   XRSUB,LDFLL                           LD  XR,OP            69624021
*                                                  LDR  XR,XN           69632021
FPL04  BAL   XRSUB,FPLLN                SET FLAGS IN OPERAND BUFFER     69640021
         OI    DX2(XR4),XRDPRE           IR TABLE.                      69648021
         OI    Y1IRX+NX1(XR3),FP2DP                                     69656021
       SPACE 2                                                          69664021
FPLLEX LM    XR0,XR15,XGSAV3                                            69672021
       BCR   UNCON,XRSUB           RETURN                               69680021
       SPACE 2                                                          69688021
*   LOAD A SHORT OPERAND IN A REG. LONG FORM.                           69696021
*                                             SDR   XR,XR               69704021
*                                             LE    XR,OP  OR  LER      69712021
FPL03  BAL   XRSUB,FPSDR           GENERATE SDR                         69720021
       BAL   XRSUB,FPLLL           SET A-TEXT                           69728021
       BAL   XRSUB,LDFLS           GENERATE A LOAD FL PT                69736021
       BC    UNCON,FPL04           SET FLAGS                            69744021
       SPACE 2                                                          69752021
*   LOAD IN A  REG.- SHORT FORM                                         69760021
*                                                                       69768021
FPL02    TM    XSLSW,XX01                                               69776021
       BC    XZERO,FPL05           LOAD IN 0 LONG FORM                  69784021
         TM    Y1IRX+NX1(XR3),XG2IRX                                    69792021
       BC    XZERO,FPL06                OPERAND IS IN A REG LONG-FO     69800021
         XI    Y1IRX+NX1(XR3),FP2DP      JUST CHANGE FLAG TO SHORT-F    69808021
       BAL   XRSUB,XZWHIR          FLAGS.                               69816021
       L     XR5,XLIRP                  X                               69824021
         XI    DX2(XR5),XRDPRE           X                              69832021
FPL06    TM    Y1IRX+NX1(XR3),XINREG                                    69840021
       BC    XTHRE,FPLLEX          OPERAND IN REG                       69848021
FPL09  BAL   XRSUB,XRSASF          ASSIGN A REG                         69856021
*                                       LE  XR,OP   OR                  69864021
*                                       LER XR,XN                       69872021
       L     XR4,XLIRP                                                  69880021
       BAL   XRSUB,FPLLL           SET A-TEXT                           69888021
       BAL   XRSUB,LDFLS           GENERATE A LOAD FL PT                69896021
       BAL   XRSUB,FPLLN           SET FLAGS                            69904021
         TM    XSLSW,XX80                                               69912021
       BC    XTHRE,FPL05           GENERATE SDR                         69920021
       BC    UNCON,FPLLEX          RETURN                               69928021
       SPACE 2                                                          69936021
*   LOAD IN 0  LONG  FORM                                               69944021
*                                       LDR  0,XN     OR  SDR 0,0       69952021
*                                                        LE(R) 0,OP     69960021
*                                       OR IF OP IS IN 0 SHORT FORM     69968021
*                                               LER  XR,0               69976021
*                                              SDR   0,0                69984021
*                                               LER  0,XR               69992021
FPL05  LA    XR4,FPRTB0                                                 70000021
         TM    DX2(XR4),XRFREE                                          70008021
       BC    XZERO,FPL11           REG 0 IS FREE                        70016021
         TM    Y1IRX+NX1(XR3),XINREG                                    70024021
       BC    XZERO,FPL08           OPERAND NOT IN A REG                 70032021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               70040021
*                                                                       70048021
       C     XR4,XLIRP                                                  70056021
       BC    XNOEQ,FPL08           OPERAND NOT IN REG 0                 70064021
         TM    Y1IRX+NX1(XR3),XG2IRX                                    70072021
       BC    XTHRE,FPLLEX          RETURN                               70080021
         OI    XSLSW,XX80                                               70088021
       BC    UNCON,FPL09           ASSIGN A REG                         70096021
FPL08  EQU   *                                                          70104021
       BAL   XRSUB,XRSTOR          STORE REG 0                          70112021
       BC    UNCON,FPL11           GENERATE A LOAD INSTRUCTION          70120021
       SPACE 2                                                          70128021
*   SET -ATEXT FOR LOAD.                                                70136021
*                                                                       70144021
FPLLL  ST    XRSUB,XVARS5                                               70152021
         MVC   XREG1(LX1),DX3(XR4)                                      70160021
       LH    XR5,XMINTW                                                 70168021
       BAL   XRSUB,FPSETA          SET A-TEXT                           70176021
       L     XRSUB,XVARS5                                               70184021
       BCR   UNCON,XRSUB           RETURN                               70192021
       SPACE 2                                                          70200021
*   UPDATE  FLAG IN REGISTER TABLE.                                     70208021
*                                                                       70216021
FPLLN  ST    XRSUB,XVARS5                                               70224021
         TM    Y1IRX+NX1(XR3),XINREG                                    70232021
       BC    XZERO,FPLLN0          OPERAND NOT IN A REG                 70240021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               70248021
       L     XR5,XLIRP                                                  70256021
         TM    DX2(XR5),XRDPRE                                          70264021
       BC    XZERO,FPLLN1          NOT DP                               70272021
         L     XRSUB,DX4(XR5)                                           70280021
         NC    DX0(LX3,XRSUB),XREMK6                                    70288021
FPLLN1 EQU   *                                                          70296021
         NC    DX0(LX3,XR5),XREMK6                                      70304021
         XI    Y1IRX+NX1(XR3),XINREG                                    70312021
FPLLN0 BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               70320021
       L     XRSUB,XVARS5                                               70328021
       BCR   UNCON,XRSUB           RETURN                               70336021
       SPACE 2                                                          70344021
*   GENERATE   SDR  XR,XR                                               70352021
*                                                                       70360021
FPSDR  ST    XRSUB,XVARS5                                               70368021
         MVC   XREG1(LX1),DX3(XR4)                                      70376021
         MVC   XREG2(LX1),DX3(XR4)                                      70384021
       BAL   XRSUB,SUBNL           GENERATE SDR                         70392021
       L     XRSUB,XVARS5                                               70400021
       BCR   UNCON,XRSUB           RETURN                               70408021
       SPACE 5                                                          70416021
*                                                                       70424021
BIIFPD EQU   *                                                          70432021
*                                                                       70440021
*  BINARY TO IFP  -  XR3 POINTS TO  X(I)VAL  I =1 OR 2                  70448021
*                                                                       70456021
       BAL   XRSUB,FPFRE0          FREE FL PT REG 0                     70464021
         MVI   XREGNO,XX00                                              70472021
         CLI   Y1BBS+NX1(XR3),XX04                                      70480021
       BC    XTWO,BIIFP0           DP                                   70488021
       BAL   XRSUB,XFREER          FREE REG 0                           70496021
         MVI   XREGNO,XX00                                              70504021
         BAL   XRSUB,XSLGVX        L  0,OP  OR  LR  0,XN                70512021
       BAL   XRSUB,VBADCE          CALL CONVERSION SUBROUTINE           70520021
       DC    C'BII0'                                                    70528021
       BC    UNCON,BIIFP1          GENERATE DC                          70536021
*                                                                       70544021
*                                 L  15,V(BII0) OR V(BII1)              70552021
*                                          BALR 14,5                    70560021
BIIFP0 BAL   XRSUB,XFREEP          FREE REG 0 AND 1                     70568021
         MVI   XREGNP,XX00                                              70576021
       BAL   XRSUB,XSLGVB          GENERATE DP LOAD                     70584021
       BAL   XRSUB,VBADCE          CALL CONVERSION SUBROUTINE           70592021
       DC    C'BII1'                                                    70600021
BIIFP1 LH    XR0,Y1ALP(XR3)                                             70608021
       SH    XR0,Y1DBS(XR3)                                             70616021
       STH   XR0,XCON                                                   70624021
         MVC   XCON1+NX1(LX2),XCON                                      70632021
         MVI   XCON1,XX02                                               70640021
       BAL   XRSUB,XDCGEN               GENERATE   DC  DEC'S - P'S      70648021
BIIFP2 EQU   *                                                          70656021
       BAL   XRSUB,FPNFL                SET FP FLAG.                    70664021
       SPACE 2                                                          70672021
FPCEXT LM    XR0,XR15,XGSAV8            GENERAL EXIT.                   70680021
       BCR   UNCON,XRSUB                X                               70688021
       SPACE 5                                                          70696021
FPFRE0 ST    XRSUB,XVARS2                                               70704021
       LA    XR4,FPRTB0                                                 70712021
         TM    DX2(XR4),XRFREE                                          70720021
       BC    XZERO,FPPPP1          REG FREE                             70728021
       BAL   XRSUB,XRSTOR          FREE REG                             70736021
FPPPP1 L     XRSUB,XVARS2                                               70744021
       BCR   UNCON,XRSUB           RETURN                               70752021
       SPACE 2                                                          70760021
IDIFPD EQU   *                                                          70768021
*                                                                       70776021
*  ID TO FP  -  XR3 POINTS TO  X(I)VAL ,I=1 OR 2 .                      70784021
*                                                                       70792021
       BAL   XRSUB,FPFRE0               TAKE CARE OF ZERO LITREAL.      70800021
         TM    Y1IRX+NX1(XR3),XLITZR                                    70808021
       BC    XZERO,IDIFD0          NOT A ZERO LITERAL                   70816021
       BAL   XRSUB,FPSDR           GENERATE SDR                         70824021
       BC    UNCON,BIIFP2          SET FLAGS                            70832021
IDIFD0 EQU   *                                                          70840021
         MVI   BDISP1+NX1,WORKA                                         70848021
         MVI   BDISP1,XXD0                                              70856021
*                                                                       70864021
*  ZAP   WORKA(16,10),OP(L)                                             70872021
*                                                                       70880021
         MVI   XL1+NX1,XX10                                             70888021
       LH    XR5,XMINFV                                                 70896021
       BAL   XRSUB,XZSIDB          SET A-TEXT                           70904021
       BAL   XRSUB,ZAP             GENERATE ZAP INTO WORK AREA          70912021
*                                                                       70920021
* L  15,V(DCI1)                                                         70928021
*  BALR 14,15                                                           70936021
*                                                                       70944021
       BAL   XRSUB,VBADCE          CALL CONVERSION SUBROUTINE           70952021
       DC    C'DCI1'                                                    70960021
       BC    UNCON,BIIFP1          GENERATE DC                          70968021
       SPACE 5                                                          70976021
EFPIFD EQU   *                                                          70984021
*                                                                       70992021
*  EFP   TO  IFP  XR3 POINTS TO  X(I)VAL  I=1 OR 2 .                    71000021
*                                                                       71008021
         MVI   XREGNO,XX03                                              71016021
       BAL   XRSUB,XFREER          FREE REG 3                           71024021
       BAL   XRSUB,FPFRE0          FREE FL PT REG 0                     71032021
         MVC   XOP1(LX4),Y1INPT(XR3)                                    71040021
         MVI   XREG1,XX03                                               71048021
       BAL   XRSUB,LA              GENERATE LA                          71056021
*                                                                       71064021
*   LA    3,A(EFPNUMBER)                                                71072021
*  L  15,V(EFL0)                                                        71080021
*   BALR 14,15                                                          71088021
*   DC   XL1      DEC IN EFP MANTISSA.                                  71096021
*   DC   XL1      TOTAL LENGHT OF EFP                                   71104021
*   DC   XL1      EFP PARAMETER CODE                                    71112021
*   DC   XL1      SLACK BYTE                                            71120021
*                                                                       71128021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      71136021
       DC    C'EFL0'                                                    71144021
       L     XR6,Y1INPT(XR3)                                            71152021
       BAL   XRSUB,EFPDC                GENERATE  DC'S.                 71160021
       BAL   XRSUB,FPNFL                SET FLAGS.                      71168021
       BC    UNCON,FPCEXT          RETURN                               71176021
       SPACE 5                                                          71184021
IFPEFD EQU   *                                                          71192021
*                                                                       71200021
*   IFP  TO  EFP    XR3 POINTS TO XNVAL BUFFER OF IFP OPERAND.          71208021
*                   XR5   -    -    -      -      EFP     -  .          71216021
*   CONVERTED RESULT  WILL BE MOVED IN TARGET FIELD.                    71224021
*                                                                       71232021
       BAL   XRSUB,FPLD0                LOAD  IFP IN 0  LONG FORM.      71240021
         MVI   XIMM,XX18                                                71248021
* CNOP  6,8                                                             71256021
*                                                                       71264021
       BAL   XRSUB,CNOP            GENERATE CNOP                        71272021
       BAL   XRSUB,VBADCE         L  15,V(TEF3)                         71280021
       DC    C'TEF3'                                                    71288021
       L     XR6,Y1INPT(XR5)                                            71296021
       BAL   XRSUB,EFPDC1               GENERATE  DC'S.                 71304021
       STH   XR1,XL1                                                    71312021
       ST    XR6,XOP1                                                   71320021
*  MVC  OP2(L2),WORKL(13)                                               71328021
*                                                                       71336021
         MVI   BDISP2,XXD0                                              71344021
         MVI   BDISP2+NX1,WORKL                                         71352021
       BAL   XRSUB,MVC             GENERATE MVC                         71360021
       BC    UNCON,FPCEXS          SET REG FLAGS                        71368021
       SPACE 5                                                          71376021
IFPBID EQU   *                                                          71384021
*                                                                       71392021
*  IFP TO BINARY    XR3  POINTS TO XNVAL OF FP OPERAND.                 71400021
*                   XR5     -       -       BI    -   .                 71408021
         MVI   XREGNO,XX00                                              71416021
       BAL   XRSUB,XFREEP          FREE REG 0 AND 1                     71424021
       BAL   XRSUB,IFPBIC          LOAD OPERAND INTO REG 0              71432021
       MVI   Y1IRX(XR3),XGBINR                                          71440021
         MVI   Y1IRX+NX1(XR3),XG2IRX                                    71448021
       LA    XR4,XRAU14                                                 71456021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               71464021
         OI    DX2(XR4),XRDPRE                                          71472021
         L     XR6,DX4(XR4)                                             71480021
         OC    DX0(LX3,XR6),DX0(XR4)                                    71488021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      71496021
       DC    C'IFB1'                                                    71504021
       BAL   XRSUB,FPCV10          GENERATE DC                          71512021
*                                                                       71520021
*  SET  CHARACT. OF CONVERTED OPERAND. AND CHECK FOR SIZE ERROR DUR     71528021
*  THE CONVERSION                                                       71536021
*                                                                       71544021
FPCV12 TM    XGSWT,XSIZER                                               71552021
       BC    XZERO,FPCV11          NO SIZE ERROR IN SOURCE              71560021
         MVI   XREG1,XX0F                                               71568021
         MVI   XREG2,XX0F                LTR   15,15                    71576021
       BAL   XRSUB,LTR                  BC    XZERO,ONSIZE ERROR        71584021
       MVI   XREG1,XZERO                                                71592021
       BAL   XR2,XZRDVV            GET SIZE ERROR TRANSFER              71600021
         MVC   XGN1(LX2),XZRTRA                                         71608021
       BAL   XRSUB,BC              GENERATE BC                          71616021
*                                                                       71624021
FPCV11   MVI   Y1FBS+NX1(XR3),XX12                                      71632021
         MVC   Y1DBS(LX4,XR3),Y1DBS(XR5)                                71640021
         MVI   Y1LBS+NX1(XR3),XX0A                                      71648021
         MVI   Y1BBS+NX1(XR3),XX08                                      71656021
         ZAP   DX0(LX16,XR3),XC9999+NX6(LX10)                           71664021
         NI    DX6(XR3),XX0F                                            71672021
FPCEXS LA    XR4,FPRTB0                                                 71680021
         NC    DX0(LX3,XR4),XREMK6                                      71688021
       BC    UNCON,FPCEXT          RETURN                               71696021
       SPACE 5                                                          71704021
IFPIDB EQU   *                                                          71712021
*  IFP TO ID  - SAME  SET-UP AS FOR  IFP TO BINARY.                     71720021
       BAL   XRSUB,IFPBIC               SET  ID FLAG                    71728021
       MVI   Y1IRX(XR3),XGINDC          X                               71736021
         MVI   Y1IRX+NX1(XR3),XX00       X                              71744021
       BAL   XRSUB,VBADCE          CALL SUBROUTINE                      71752021
       DC    C'IFD0'                                                    71760021
       BAL   XRSUB,FPCV10          GENERATE DC                          71768021
       BAL   XRSUB,WKZAP                ZAP  TEMP(16),WORKA(10,13)      71776021
       BC    UNCON,FPCV12          CHECK FOR SIZE ERROR                 71784021
       SPACE 5                                                          71792021
*  GENERATE  A POWER OF TEN IN FLOATING POINT.                          71800021
*                                                                       71808021
FP10PW   XC    XCON(LX16),XCON                                          71816021
         MVI   XCON,XX41                 XCON  HAS   1 IN IFP .         71824021
         MVI   XCON+NX8,XX41             XCON+8 HAS  10 IN IFP.         71832021
         MVI   XCON+NX1,XX10             P                              71840021
         MVI   XCON+NX9,XXA0                                            71848021
       LD    FRW0,XCON                     GENERATE   DC XL8  CONTA     71856021
       LTR   XR0,XR0                    A DBL PREC FLT NO 10** X WH     71864021
       BC    XZERO,FPCV20               X IS VALUE IN XR1= DEC'S -      71872021
       BC    XONE,FPCV21           EXPONENT NEG                         71880021
FPCV22   MD    FRW0,XCON+NX8                                            71888021
       BCT   XR0,FPCV22            FALL THRU WHEN GENERATION THRU       71896021
       BC    UNCON,FPCV23          STORE CONSTANT                       71904021
FPCV21 LCR   XR0,XR0                                                    71912021
FPCV24   MD    FRW0,XCON+NX8                                            71920021
       BCT   XR0,FPCV24            FALL THRU WHEN GENERATION THRU       71928021
         STD   FRW0,XCON+NX8                                            71936021
       LD    FRW0,XCON                                                  71944021
         DD    FRW0,XCON+NX8                                            71952021
FPCV23 STD   FRW0,XCON                                                  71960021
FPCV20 EQU   *                                                          71968021
       BCR   UNCON,XRSUB           RETURN                               71976021
       SPACE 2                                                          71984021
*                                                                       71992021
FPCV10 ST    XRSUB,XVARS3                                               72000021
       LH    XR0,Y1DBS(XR5)             GENERATE                        72008021
       SH    XR0,Y1ALP(XR5)                    DC  XL8    CONTAININ     72016021
       BAL   XRSUB,FP10PW                10 ** X  IN FP LONG FORM       72024021
         MVC   XCON1+NX1(LX8),XCON         WHERE   X = DFC OF TARGET    72032021
         MVI   XCON1,XX08                 OR        = - P'S    -        72040021
       BAL   XRSUB,XDCGEN          GENERATE DC                          72048021
       L     XRSUB,XVARS3                                               72056021
       BCR   UNCON,XRSUB           RETURN                               72064021
       SPACE 2                                                          72072021
*                                                                       72080021
IFPBIC ST    XRSUB,XVARS4                                               72088021
       BAL   XRSUB,FPLD0                       LD  0, OP                72096021
         MVI   XIMM,XX10                      CNOP  2,8                 72104021
       BAL   XRSUB,CNOP            GENERATE CNOP                        72112021
       L     XRSUB,XVARS4                                               72120021
       BCR   UNCON,XRSUB           RETURN                               72128021
       SPACE 2                                                          72136021
*                                                                       72144021
XDCGEN ST    XRSUB,XVARS5                                               72152021
       MVI   XIMM,MDC                                                   72160021
       BAL   XRSUB,MACRO                  GENERATE  DC                  72168021
       L     XRSUB,XVARS5                                               72176021
       BCR   UNCON,XRSUB           RETURN                               72184021
       SPACE 2                                                          72192021
*                                                                       72200021
FPNFL  ST    XRSUB,XVARS4               CHANGE FLAG TO  DP FLT. OPE     72208021
       LA    XR4,FPRTB0                 IN  REG  0 .                    72216021
       BAL   XRSUB,FPLLN                X                               72224021
       MVI   Y1IRX(XR3),XGINFP          X                               72232021
         MVI   Y1IRX+NX1(XR3),XX2D       XFTPT+XGDPFP+XINREG+XG2IRX.    72240021
         OI    DX2(XR4),XRDPRE                                          72248021
       L     XRSUB,XVARS4                                               72256021
       BCR   UNCON,XRSUB           RETURN                               72264021
       SPACE 2                                                          72272021
*                                                                       72280021
EFPDC1   MVI   XSLSW,XX01                                               72288021
       BC    UNCON,EFPDCH          SHORT FORM                           72296021
EFPDC    MVI   XSLSW,XX00                                               72304021
EFPDCH ST    XRSUB,XVARS4                                               72312021
         MVI   XCON1,XX04                                               72320021
       LH    XR0,XMINFV                                                 72328021
         TM    DX7(XR6),XX01                                            72336021
       BC    XTHRE,EFPDC0          PIC CONTAINS PLUS SIGN               72344021
         OI    XCON1+NX3,XX04            SIGN OF MANTISSA IS -  .       72352021
EFPDC0   TM    DX8(XR6),XX80                                            72360021
       BC    XTHRE,EFPDC4          EXPONENT CONTAINS PLUS SIGN          72368021
         OI    XCON1+NX3,XX02            SIGN OF EXP.  IS -  .          72376021
EFPDC4   TM    DX8(XR6),XX40                                            72384021
       BC    XZERO,EFPDC2          IMPLIED DEC POINT                    72392021
         OI    XCON1+NX3,XX01            REAL DEC. POINT .              72400021
       BCTR  XR0,RW0               SET XRO = -6                         72408021
EFPDC2   MVC   XCON1+NX2(LX1),DX9(XR6)    TOTAL LENGHT OF EFP NO.       72416021
       SR    XR1,XR1                                                    72424021
         IC    XR1,XCON1+NX2                                            72432021
         MVC   XCON1+NX1(LX1),DX8(XR6)                                  72440021
         NI    XCON1+NX1,XX3F            DEC. IN EFP MANTISSA.          72448021
         TM    XSLSW,XX01                                               72456021
       BC    XZERO,EFPDC3          LONG INTO REG 0                      72464021
       AR    XR0,XR1                                                    72472021
       BAL   XRSUB,FP10PW          GENERATE A POWER OF 10 IN FL PT      72480021
         MVI   XCON1,XX0C                                               72488021
         MVC   XCON1+NX5(LX8),XCON                                      72496021
EFPDC3 BAL   XRSUB,XDCGEN          GENERATE DC                          72504021
       L     XRSUB,XVARS4                                               72512021
       BCR   UNCON,XRSUB           RETURN                               72520021
       SPACE 5                                                          72528021
*                                                                       72536021
*  CONVERT TO IFP OPERANDS OF A STRING. ENTRY POINT IS FPCVBG-          72544021
*                                                                       72552021
FPCVBH   TM    Y1IRX+NX1(XR3),XFTPT                                     72560021
       BC    XTHRE,FPCV50               ALREADY FP.                     72568021
         MVN   X1TYP(LX1),Y1IRX(XR3)                                    72576021
       LA    XRSUB,FPCV50                                               72584021
       CLI   X1TYP,XGBINR                                               72592021
       BC    XZERO,BIIFP                GO TO BINARY TO IFP .           72600021
       CLI   X1TYP,XGINDC                                               72608021
       BC    XZERO,IDIFP                ID TO IFP.                      72616021
       CLI   X1TYP,XGEXFP                                               72624021
       BC    XZERO,EFPIFP               EFP TO IFP.                     72632021
*                                                                       72640021
*      LOGIC ERROR NUMBER 8.                                            72648021
*                                                                       72656021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               72664021
       DC    AL1(ERRN08)                                                72672021
       DC    AL1(8)                                                     72680021
       SPACE 2                                                          72688021
*  MAKE SURE THAT BOTH FP OPERANDS HAVE THE SAME FORM.                  72696021
*                                                                       72704021
*                                                                       72712021
FPCV51   TM    Y1IRX+NX1(XR3),XGDPFP                                    72720021
       BC    XTHRE,FPCV53          OPERAND IS DP                        72728021
         TM    Y1IRX+NX1(XR5),XGDPFP                                    72736021
       BC    XTHRE,FPCV54          OPERAND IS DP                        72744021
*                                                                       72752021
*  BOTH SHORT FORM -EXIT                                                72760021
*                                                                       72768021
FPCV56 LM    XR0,XR15,XGSAV7                                            72776021
       BCR   UNCON,XRSUB           RETURN                               72784021
       SPACE 2                                                          72792021
FPCV54 TM    XGSWT,XAROPE                                               72800021
       BC    XTHRE,FPCV55          ARITHMETIC OPERATION                 72808021
         TM    Y1IRX+NX1(XR5),XGCOLT                                    72816021
       BC    XTHRE,FPCV57          OPERAND IS A CONSTANT                72824021
FPCV55 BAL   XRSUB,FPLDL           LOAD IN LONG FORM                    72832021
       BC    UNCON,FPCV56          RETURN                               72840021
FPCV53   TM    Y1IRX+NX1(XR5),XGDPFP                                    72848021
       BC    XTHRE,FPCV56          DP, RETURN                           72856021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      72864021
       BC    UNCON,FPCV54          CHECK FOR ARITH OPER                 72872021
       SPACE 2                                                          72880021
FPCV50 BAL   XRSUB,XSTOMV          CHECK FOR STORE OR MOVE              72888021
       BC    UNCON,FPCV56          YES                                  72896021
       C     XR3,XAVAL2                 OTHERWISE  CHECK  2ND OPERA     72904021
       BC    XZERO,FPCV51          CHECK FOR DP                         72912021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      72920021
       BC    UNCON,FPCVBH          CHECK IF BOTH OPNDS THE SAME         72928021
FPCV57   XI    Y1IRX+NX1(XR5),XGDPFP                                    72936021
       BC    UNCON,FPCV56          RETURN                               72944021
       SPACE 5                                                          72952021
IKF50F CSECT                                                            72960021
       USING *,XRVAR                                                    72968021
XSSBG2 EQU   *                                                          72976021
* SET LENGTHS                                                           72984021
XZDB1    TM    XZSWT,XX10                IS LENGHT PRESET.              72992021
       BC    XTHRE,XZ000                YES-                            73000021
         TM    XZSWT,XX08                NO,IS IT AFTER SCALING         73008021
       BC    XTHRE,XZDB2                YES-                            73016021
         MVC   XZLENG(LX2),Y1BBS(XR3)                                   73024021
         TM    XZSWT,XX01                NO,IS BINARY.                  73032021
       BC    XTHRE,XZ000           YES                                  73040021
         MVC   XZLENG(LX2),Y1LBS(XR3)   SET LENGTH                      73048021
       BC    UNCON,XZ000                X                               73056021
XZDB2    MVC   XZLENG(LX2),Y1BAS(XR3)                                   73064021
         TM    XZSWT,XX01                                               73072021
       BC    XTHRE,XZ000           BINARY                               73080021
         MVC   XZLENG(LX2),Y1LAS(XR3)   SET LENGTH                      73088021
       SPACE 2                                                          73096021
XZ000  CH    XR5,XMINFO                 IS FIRST OPERAND A CONSTANT     73104021
       BC    XTWO,XZ00C                 IN IR-NO.                       73112021
         OI    XZSWT,XX80                YES-SET SWITH XR3 IS 2ND OP    73120021
XZ00C    CLI   Y1TEL+NX1(XR3),XX00       IS THAT OP. IN TEMP            73128021
       BC    XZERO,XZ002                NO-                             73136021
       BAL   XRSUB,XEWCL                GET DISPLACEMENT IN TEMP        73144021
       LH    XR6,Y1TEL(XR3)             GET UNUSED LENGTH IN THIS T     73152021
       SH    XR6,XZLENG                 ENTRY                           73160021
       LH    XR4,XEREL1                                                 73168021
         TM    XZSWT,XX04                                               73176021
       BC    XTHRE,XZF01           FL PT OPERATION                      73184021
       AR    XR4,XR6                                                    73192021
XZF01  EQU   *                                                          73200021
         TM    XZSWT,XX01                IS IT A BIN. OP.               73208021
       BC    XZERO,XZ003           NO                                   73216021
         TM    XZSWT,XX80                IS 2ND OPERAND ADDRESS         73224021
       BC    XTHRE,XZ0044               YES-                            73232021
         MVC   XWC1+NX2(LX1),XZLENG+NX1   NO,SET BINARY LENGTH IN WC    73240021
       BC    UNCON,XZ003                X                               73248021
XZ0044   MVC   XWC2+NX2(LX1),XZLENG+NX1   X                             73256021
       SPACE 2                                                          73264021
XZ003    TM    XZSWT,XX80                SET  L1 AND L2 FOR ID OPERA    73272021
       BC    XTHRE,XZ004                OR ONLY L1 FOR LOGICALOPERA     73280021
         TM    XZSWT,XX02                X                              73288021
       BC    XTHRE,XZ007                X                               73296021
         TM    XZSWT,XX05                                               73304021
       BC    XNOEQ,XZ005           FL PT OR BINARY                      73312021
XZ007    MVC   XL1(LX2),XZLENG                                          73320021
XZ005  STH   XR4,XWC1                                                   73328021
         OI    XZSWT,XX80                                               73336021
       BC    UNCON,XZ009           CHECK FOR IMMEDIATE INST             73344021
XZ004    TM    XZSWT,XX07                                               73352021
       BC    XNOEQ,XZ008           FL PT OR BINARY OR LOG OPER          73360021
         MVC   XL2(LX2),XZLENG                                          73368021
XZ008  STH   XR4,XWC2                                                   73376021
       SPACE 2                                                          73384021
XZ009    CLI   XIMM,XX00                 IF IT IS THE 2ND OPERAND EX    73392021
       BC    XNOEQ,XZEXIT               IF NOT START AGAIN FOR          73400021
XZ0098 LTR   XR5,XR5                    2ND OPERAND.                    73408021
       BC    XONE,XZ0100                X                               73416021
         TM    XZSWT,XX20                                               73424021
       BC    XZERO,XZFF1           BOTH OPERANDS NOT FINISHED           73432021
       SPACE 2                                                          73440021
XZEXIT   LM    XR0,XR15,XESAV      EXIT                                 73448021
       BCR   UNCON,XRSUB           RETURN                               73456021
       SPACE 2                                                          73464021
XZFF1  EQU   *                                                          73472021
       LR    XR3,XR5                    X                               73480021
         OI    XZSWT,XX20                X                              73488021
       BC    UNCON,XZDB1                X                               73496021
       SPACE 2                                                          73504021
XZ002    TM    Y1IRX+NX1(XR3),XINREG     IS OP IN IR.                   73512021
       BC    XZERO,XZ011                NO-                             73520021
       BAL   XRSUB,XZWHIR          GET ADDRESS OF REG TBL               73528021
       CH    XR5,XMINTW                 IS FIRST OP A CONST. IN IR      73536021
       BC    XZERO,XZ012                YES-                            73544021
         TM    XZSWT,XX40                IS IT THE 2ND IR OPERAND.      73552021
       BC    XTHRE,XZ012                YES                             73560021
         MVC   XREG1(LX1),XREGNO         NO,SET XREGN1 FOR A-TEXT.      73568021
         OI    XZSWT,XX40                SET SWITCH                     73576021
       BC    UNCON,XZ0098          TEST 2ND OPERAND                     73584021
XZ012    MVC   XREG2(LX1),XREGNO         SET XREG2 (REG. INDICATOR F    73592021
*                                       A-TEXT ROUTINE).                73600021
       BC    UNCON,XZEXIT               X EXIT                          73608021
       SPACE 2                                                          73616021
XZ011    TM    Y1IRX+NX1(XR3),XGNCON     IS IT A GN  CONSTANT.          73624021
       BC    XTHRE,XZ030                YES                             73632021
       L     XR6,Y1INPT(XR3)            NO- SET POINTER TO DATA-NAM     73640021
       SR XR4,XR4                       IN A-TEXT BUFFER.               73648021
         CLC   XJOP1(LX4),XC000                                         73656021
       BC    XZERO,XZ014           OPERAND 1 NOT USED YET IN INST       73664021
       ST    XR6,XJOP2                                                  73672021
       BC    UNCON,XZ003                SET LENGTH.                     73680021
XZ014  ST    XR6,XJOP1                                                  73688021
       BC    UNCON,XZ003           WAS IT 2ND OPERAND                   73696021
       SPACE 2                                                          73704021
XZ030  LA    XR2,XZ06N                                                  73712021
         TM    XZSWT,XX01                                               73720021
       BC    XTHRE,XCONLV          BINARY                               73728021
         MVC   XCON(LX16),DX0(XR3)                                      73736021
XZ06N  EQU   *                                                          73744021
         MVC   XCONL(LX1),XZLENG+NX1      MOVE  IT IN XCON1 OR  XCON2   73752021
         TM    XZSWT,XX04                                               73760021
       BC    XZERO,XZAB20          NOT FL PT                            73768021
         MVI   XCON+NX16,XX08            FP LITERAL                     73776021
         TM    Y1IRX+NX1(XR3),XGDPFP                                    73784021
       BC    XTHRE,XZAB20               LONG FP FORM.                   73792021
         MVI   XCON+NX16,XX04            SHORT FP FORM.                 73800021
         MVC   XCON+NX12(LX4),XCON+NX8                                  73808021
       SPACE 2                                                          73816021
XZAB20 EQU   *                                                          73824021
         TM    XZSWT,XX80                X                              73832021
       BC    XTHRE,XZ031                X                               73840021
         MVC   XCON1(LX17),XCON          X                              73848021
XZEX00   MVC   XZLENG+NX1,XCON+NX16                                     73856021
       SR    XR4,XR4                                                    73864021
       BC    UNCON,XZ003           WAS IT 2ND OPERAND                   73872021
XZ031    MVC   XCON2(LX17),XCON          X                              73880021
       BC    UNCON,XZEX00          SET LENGTH                           73888021
XZ0100 CH    XR5,XMINFO                                                 73896021
       BC    XNOEQ,XZAB10          NOT CONSTANT                         73904021
         MVC   XCON1(LX17),XCON                                         73912021
         MVC   XL1+NX1(LX1),XCONL                                       73920021
       BC    UNCON,XZEXIT          RETURN                               73928021
XZAB10 CH    XR5,XMINON                                                 73936021
       BC    XNOEQ,XZEXIT          RETURN                               73944021
       SR    XR5,XR5                                                    73952021
         OI    XZSWT,XX20                                               73960021
       BC    UNCON,XZAB20          CHECK FOR 2ND OPERAND                73968021
       EJECT                                                            73976021
XSUDB2 EQU   *                                                          73984021
         MVC   XIDBY(LX12),XC000         RESET OUTPUT AREA.             73992021
         MVC   XGTEM2+NX5(LX3),XGSCIN(XR3) PICK LENGHT FOR GROUP ITEM   74000021
*                                      NOT SIGNIFICANT FOR ELEMENTARY   74008021
         UNPK  XGTEM2(LX1),XGMINC(LX1,XR3)                              74016021
         NI    XGTEM2,XX0F                                              74024021
       CLI   XGTEM2,XGGPFL                                              74032021
       BC    XZERO,XLEN00               FIXED LENGHT GROUP              74040021
*                                                                       74048021
*                                                                       74056021
       CLI   XGTEM2,XGALN                                               74064021
       BC    XLOEQ,XLEN01               ALPHA. ITEM.                    74072021
       CLI   XGTEM2,XGGPVL                                              74080021
       BC    XZERO,XLEN02               VARIABLE LENGHT GROUP.          74088021
         CLI   XGTEM2,XX06                                              74096021
       BC    XLOEQ,XLEN06               REPORT ITEM.                    74104021
       CLI   XGTEM2,XGEXFP                                              74112021
       BC    XZERO,XLEN04               EXTERNAL FLOATING POINT ITE     74120021
       CLI   XGTEM2,XGINFP                                              74128021
       BC    XZERO,XLEN05               INTERNAL FLOATING POINT ITE     74136021
         CLI   XGTEM2,XX0D                                              74144021
       BC    XZERO,XLEN07               STERLING NON REPORT.            74152021
         CLI   XGTEM2,XGANE                                             74160021
         BE    XLEN16                  ALPHANUMERIC EDITED              74168021
*       IT IS  NOW A NUMERIC ITEM  - BI,ID,OR,ED.                       74176021
       SPACE 2                                                          74184021
       SR    XR1,XR1                                                    74192021
       IC    XR1,XGDGLG(XR3)            GET NUMBER OF DIGITS.           74200021
         MVI   XBDBY+NX1,XX02                                           74208021
       CH    XR1,XC004                                                  74216021
       BC    XLOEQ,XLEN09               HALF WORD.                      74224021
         MVI   XBDBY+NX1,XX04                                           74232021
       CH    XR1,XC009                                                  74240021
       BC    XLOEQ,XLEN09               WORD.                           74248021
         MVI   XBDBY+NX1,XX08            DOUBLE WORD.                   74256021
*                                                                       74264021
*                                                                       74272021
XLEN09 STH   XR1,XIDDN                  SET NUMBER OF DIGIT CELL.       74280021
         SRA   XR1,DX1                   SET ID LENGHT.                 74288021
         LA    XR1,DX1(XR1)              X                              74296021
       STH   XR1,XIDBY                  X                               74304021
         MVC   XOPLGH+NX2(LX2),XBDBY                                    74312021
       CLI   XGTEM2,XGBINR              BINARY                          74320021
       BC    XZERO,XLEN10          YES                                  74328021
         CLI   XGTEM2,XX07         INDEX DATA ITEM...                   74336021
         BE    XLEN10                  YES, TREAT AS BI                 74344021
*                                                                       74352021
*                                                                       74360021
*                                                                       74368021
         MVC   XOPLGH+NX2(LX2),XIDBY                                    74376021
       CLI   XGTEM2,XGINDC                                              74384021
       BC    XZERO,XLEN10               ID.                             74392021
         MVC   XOPLGH+NX2(LX2),XIDDN      ED.                           74400021
*                                                                       74408021
*                                                                       74416021
XLEN10 LM    XR0,XR15,XGSAV3                                            74424021
       BCR   UNCON,XRSUB                X                               74432021
       SPACE 2                                                          74440021
XLEN00   NC    XGTEM2+NX4(LX2),XC001      FIXED LENGHT GROUP LENGHT.    74448021
XLEN14   MVC   XOPLGH(LX4),XGTEM2+NX4     X                             74456021
       BC    UNCON,XLEN10               X                               74464021
       SPACE 2                                                          74472021
XLEN01   NC    XGTEM2+NX4(LX2),XC000                                    74480021
       BC    UNCON,XLEN14               ALPHA. ITEM LENGHT.             74488021
       SPACE 2                                                          74496021
XLEN02   NC    XGTEM2+NX4(LX3),XSUMK5                                   74504021
         MVC   XOPVLC(LX2),XGTEM2+NX6     VARIABLE LENGHT GROUP.        74512021
       BC    UNCON,XLEN10          RETURN                               74520021
       SPACE 2                                                          74528021
XLEN04   NC    XGTEM2+NX4(LX3),XC000      EXTERNAL FLOATING-POINT.      74536021
       BC    UNCON,XLEN14          SET LENGTH                           74544021
       SPACE 2                                                          74552021
XLEN05   MVI   XOPLGH+NX3,XX04           INTERNAL FLOAT. POINT.         74560021
         TM    XGDGLG(XR3),XX01                                         74568021
       BC    XZERO,XLEN10          RETURN                               74576021
*                                                                       74584021
         MVI   XOPLGH+NX3,XX08                                          74592021
       BC    UNCON,XLEN10               X                               74600021
       SPACE 2                                                          74608021
XLEN06   MVC   XOPLGH+NX3(LX1),DX11(XR3)                                74616021
*                                       REPORT ITEM.                    74624021
       BC    UNCON,XLEN10               X                               74632021
       SPACE 2                                                          74640021
XLEN07 EQU   *                                                          74648021
         MVC   XOPLGH+NX3(LX1),DX10(XR3)                                74656021
*                                       STERLING NON REPORT             74664021
         NI    XOPLGH+NX3,XX1F                                          74672021
       BC    UNCON,XLEN10          RETURN                               74680021
XLEN16   MVC   XOPLGH+NX2(LX2),DX9(XR3)  ALPHANUM. EDIT. PICK UP LENGTH 74688021
         B     XLEN10                  EXIT                             74696021
       SPACE 10                                                         74704021
XSUDB3 EQU   *                                                          74712021
       LR    XR5,RW4                                                    74720021
         CLI   DX0(XR5),XSTDTN                                          74728021
         BNE   XIS306              NOT TALLY                            74736021
         MVC   DX0(LX25,XR5),XTALLV                                     74744021
XIS306 EQU   *                                                          74752021
         CLI   HEADER+NX1,XX39           IS IT A SUBSCRIPT COMPUTATI    74760021
       BC    XZERO,XISEXT               YES EXIT.                       74768021
         CLI   HEADER+NX1,XX15           EVAL STRING .                  74776021
       BC    XZERO,XISEXT               X                               74784021
         CLI   DX0(XR5),MSFN        IS THIS OP A FILE NAME REF...       74792021
       BE    XISFN                 YES, PUT OUT PROC-A TEXT             74800021
         CLI   DX0(XR5),XX31             IS THIS OPERAND A SUBSC. DT    74808021
         BNE   XIS305              NO - CHECK REC'D NAME                74816021
       L     XR1,XASNT                  YES- GET CHAR.OF TABLE CONT     74824021
       BAL   XRSUB,XTBDEB               SUBSC. COMBINATION  NUMBER.     74832021
*                                                                       74840021
       LR    XR0,XR3                                                    74848021
       AR    XR3,XR2                    INITIALIZE SCAN  OF TABLE.      74856021
XISTST CR    XR2,XR3                                                    74864021
       BC    XZERO,XIS3LG               LOGIC ERROR.                    74872021
         CLC   DX0(LX2,XR2),XDIDK+NX1(XR5)                              74880021
       BC    XZERO,XIS300               MATCH FOUND                     74888021
         LA    XR2,DX4(XR2)                                             74896021
       BC    UNCON,XISTST               KEEP SCANING                    74904021
       SPACE 2                                                          74912021
XIS300   LH    XR6,DX2(XR2)              XR6 HAS POINTER TO UPDATED     74920021
         LA    XR4,DX4(XR2)              KILL THIS ENTRY IN SUBS.COM    74928021
XIS302 CR    XR4,XR3                    NUMBER TABLE                    74936021
       BC    XZERO,XIS301               X                               74944021
         MVC   DX0(LX4,XR2),DX0(XR4)      X                             74952021
         LA    XR2,DX4(XR2)              X                              74960021
         LA    XR4,DX4(XR4)                                             74968021
       BC    UNCON,XIS302               X                               74976021
       SPACE 2                                                          74984021
XIS301 SH    XR0,XC004                  UPDATE LENGHT OF TABLE.         74992021
         STH   XR0,DX4(XR1)              X                              75000021
       L     XR1,XASCRP                 GET CHAR. OF SUBSC. TABLE       75008021
       BAL   XRSUB,XTBDEB               X                               75016021
       AR    XR2,XR6                    XR2 HAS ABSOLUTE POINTER TO     75024021
         MVC   XDIDK(LX3,XR5),DX1(XR2)    UPDATED I,D,K- UPDATE INPUT   75032021
         MVI   DX0(XR5),XX30             ELEMENT.                       75040021
       LA    XR1,XSID1                  SET TABLE CONTAINING ADDRES     75048021
       LA    XR2,XSIEND                                                 75056021
XIS304   CLC   DX0(LX4,XR1),XC000         OF SUBCRIPTED ELEMENT ACTUA   75064021
       BC    XZERO,XIS303               USED                            75072021
         LA    XR1,DX4(XR1)              X                              75080021
       CR    XR1,XR2                    X                               75088021
       BC    XZERO,XIS1LG               X                               75096021
       BC    UNCON,XIS304               X                               75104021
       SPACE 2                                                          75112021
XIS303   STH   XR6,DX0(XR1)              SET POINT TO UPDATED I,D,K     75120021
       S     XR5,XAOPE1                 SET DISPLT. OF INPUT ELEMEN     75128021
         STH   XR5,DX2(XR1)              WITHIN INPUT STRING.           75136021
       SPACE 2                                                          75144021
XISEXT LM    XR0,XR15,XGSAV1            EXIT                            75152021
       BCR   UNCON,XRSUB                X                               75160021
XIS305   DS    0H                                                       75168021
         CLI   HEADER+1,XX23       IS OP'D FROM WRITE...                75176021
         BE    XIS307              YES                            59733 75184021
         CLI   HEADER+NX1,XX24          OPRND FROM REWRITE...     59733 75192021
         BNE   XISEXT              NO                             59733 75200021
XIS307   DS    0H                                                 59733 75208021
         TM    WRITSW,XX01         SECOND WRIT/REWRIT STRING...   59733 75216021
         BO    XISEXT              YES                            59733 75224021
         CLI   DX0(XR5),MDN        REC'D NAME XREF...                   75232021
         BNE   XISEXT              NO                                   75240021
XISFN  TM    PHZSW1,XREF          FILE REF SWITCH ON...                 75248021
       BZ    XISEXT               NO                                    75256021
       MVI   GMCTYP,MADCON                                              75264021
         MVI   RELAD1,XX80         INDICATE XREF ELE                    75272021
         MVI   RELAD1+NX1,XX02     INDICATE DICT PTR                    75280021
       SR    XR1,XR1                                                    75288021
       IC    XR1,XGNBYT(XR5)                                            75296021
       SH    XR1,XC001                                                  75304021
       AR    XR5,XR1                                                    75312021
         MVC   RELAD1+NX2(LX3),DX0(XR5) PICK UP DICT PTR                75320021
       BAL   RETRG,MACRO           GENERATE ADCON                       75328021
       B     XISEXT                RETURN                               75336021
*                                                                       75344021
*      LOGIC ERROR NUMBER 9.                                            75352021
*                                                                       75360021
XIS3LG EQU   *                                                          75368021
XIS1LG EQU   *                                                          75376021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               75384021
       DC    AL1(ERRN09)                                                75392021
       DC    AL1(8)                                                     75400021
       SPACE 10                                                         75408021
XSUDB4 EQU   *                                                          75416021
         TM    DX2(XR4),XRSUBS           IS THIS REG USED BY THE RES    75424021
       BC    XTHRE,XRS004               OF ADDRESS COMPUTATION DUE      75432021
       SPACE 2                                                          75440021
       BAL   XRSUB,XE8DB                NO-ASK 8 BYTES IN TEMP.         75448021
         TM    DX2(XR4),XRVAL1     WAS IT OP1 IN THE REGISTER           75456021
       LA    XR3,XVAL1                                                  75464021
       BC    XTHRE,XRS011               YES                             75472021
       SPACE 2                                                          75480021
         LA    XR3,XVAL2                                                75488021
         TM    DX2(XR4),XRVAL2                                          75496021
       BC    XTHRE,XRS011          2ND OPERAND IN THIS REG              75504021
*                                                                       75512021
       SPACE 2                                                          75520021
         LH    XR6,DX0(XR4)                                             75528021
       BAL   XRSUB,XINSCN          FIND INTR RESULT                     75536021
       LR    XR3,XR6                                                    75544021
XRS011   NI    XNIRX(XR3),XX0F           UPDATE INFO IN                 75552021
         NI    XNIRX+NX1(XR3),XIN2RX     INTER. RES. TABLE              75560021
         MVC   XNTEL(LX4,XR3),XYTEL                                     75568021
*                                                                       75576021
       SPACE 2                                                          75584021
         TM    DX2(XR4),XRDPRE     WAS IT A DP REG                      75592021
       BC    XTHRE,XRS020               YES. GENERATE STM               75600021
       LH    XR3,XEREL1      NO GENERATE ST.                            75608021
         MVC   XREG1(LX1),DX3(XR4)                                      75616021
         NC    DX0(LX3,XR4),XREMK6                                      75624021
         TM    DX2(XR4),XX80                                            75632021
       BC    XZERO,XRSF01          NOT FL PT                            75640021
       STH   XR3,XWC1                                                   75648021
       BAL   XRSUB,STORFS          GENERATE STORE FL PT                 75656021
       BC    UNCON,XSTEXI          RETURN                               75664021
XRSF01 EQU   *                                                          75672021
       AH    XR3,XC004                  SET                             75680021
       STH   XR3,XWC1                   PARAMETERS                      75688021
         MVI   XWC1+NX2,XX04             FOR  A-TEXT GENERATOR.         75696021
*                                       REG.                            75704021
*      GENERATE    ST    AND  EXIT.                                     75712021
XRS006 EQU   *                                                          75720021
       BAL   XRSUB,ST              GENERATE ST                          75728021
XSTEXI LM    XR0,XR15,XGSAV5            RETURN.                         75736021
       BCR   UNCON,XRSUB           RETURN                               75744021
       SPACE 3                                                          75752021
XRS020   MVC   XWC1(LX2),XEREL1         COMPILE                         75760021
         TM    DX2(XR4),XX80                                            75768021
       BC    XZERO,XRSF02          NOT FL PT                            75776021
         MVC   XREG1(LX1),DX3(XR4)                                      75784021
       BAL   XRSUB,STORFL          GENERATE STORE FL PT                 75792021
       BC    UNCON,XRSF03          SET FLAGS                            75800021
XRSF02 EQU   *                                                          75808021
*                                        STM  XREVEN,XRODD,TEMP         75816021
         TM    DX3(XR4),XX01             X                              75824021
       BC    XTHRE,XRS022               X                               75832021
XRS024   MVC   XREG1(LX1),DX3(XR4)        X                             75840021
         L     XR4,DX4(XR4)              X                              75848021
         MVC   XREG2(LX1),DX3(XR4)        X                             75856021
       BAL   XRSUB,STM                  X                               75864021
*                                                                       75872021
         NC    DX0(LX3,XR4),XREMK6 RESET SWITCHES IN THOSE NEWLY        75880021
*                                       ASSIGNED IR                     75888021
         L     XR4,DX4(XR4)              X                              75896021
XRSF03 EQU   *                                                          75904021
         NC    DX0(LX3,XR4),XREMK6        X                             75912021
       BC    UNCON,XSTEXI          RETURN                               75920021
XRS022   L     XR4,DX4(XR4)                                             75928021
       BC    UNCON,XRS024          GENERATE STM                         75936021
*                                       SUBSCRIPTING - YES - XRS004     75944021
XRS004 EQU   *                                                          75952021
       L     XR1,XASCRP                                                 75960021
       BAL   XRSUB,XTBDEB               XR2 HAS BEGINING OF             75968021
         LH    XR3,DX0(XR4)                                             75976021
       AR    XR2,XR3                    TABLE-XR3 HAS ADDRESS OF        75984021
*                                       UPDATED I,D,K FIELD FOR THI     75992021
         LA    XR2,DX1(XR2)                                             76000021
*                                       SUBSCRIPT COMBINATION.          76008021
       LH    XR0,XCSCEL                 TAKE NUMBER OF LAST CURRENT     76016021
       AH    XR0,XC001                  CELL. INCREASE IT BY ONE.       76024021
       STH   XR0,XCSCEL                 IS IT THE NAXIMUM.              76032021
         CH    XR0,SUBCTR          NUMBER OF SS CELLS AT THAT           76040021
       BC    XNOGT,XRS005               POINT.                          76048021
         STH   XR0,SUBCTR          YES, UPDATE MAX NUMBER OF            76056021
XRS005 EQU   *                                                          76064021
*                                       CELL.                           76072021
         MVC   XREG1,DX3(XR4)            SET A-TEXT  FOR                76080021
         MVI   XCNTR1,XX2C               STORE.                         76088021
         MVC   XCNTR1+NX1(LX2),XCSCEL     X                             76096021
         MVC   DX1(LX2,XR2),XCSCEL        UPDATE I,D,K FIELD.           76104021
         NI    DX0(XR2),XX8F             X                              76112021
         OI    DX0(XR2),XSUCFL           X                              76120021
         MVC   DX0(LX3,XR4),XC000         RESET REGISTER FLAGS.         76128021
       LA    XR5,XSID1                  UPDATE ALSO I,D,K FIELD OF      76136021
         LA    XR1,DOP1                                                 76144021
       LA    XR6,XSIEND                 ACTUAL OPERAND OF THE STRIN     76152021
XRS008   LH    XR0,DX0(XR5)              IN PROCESS WHICH WERE USING    76160021
       CH    XR0,XC000                  THE SAME REGISTER IN THEIR      76168021
       BC    XZERO,XRS006               K FIELD.                        76176021
       CR    XR0,XR3                    X                               76184021
       BC    XNOEQ,XRS007               X                               76192021
         LH    XR0,DX2(XR5)              X                              76200021
         LA    XR1,DOP1            RESET TO BEGINNING OF OPERANDS       76208021
       AR    XR1,XR0                    X                               76216021
         MVC   XDIDK(LX3,XR1),DX0(XR2)    X                             76224021
XRS007 AH    XR5,XC004                  X                               76232021
       CR    XR5,XR6                    X                               76240021
       BC    XZERO,XRS006               X                               76248021
       BC    UNCON,XRS008               X                               76256021
       EJECT                                                            76264021
XX000    TM    Y1IRX+NX1(XR3),XZGNLT     IS FIRST OP. A NUM. LITERAL    76272021
       BC    XZERO,XXM00                NO,                             76280021
       LTR   XR5,XR5                    YES,IS 2ND OP A CONSTANT.       76288021
       BC    XONE,XXM01                 YES                             76296021
         TM    Y1IRX+NX1(XR5),XZGNLT     IS 2ND   OP. A NUM. LITERAL    76304021
       BC    XZERO,XXM00           NO                                   76312021
       MVI   XFIRX,XGINDC                                               76320021
       LA    XR3,XFVAL                                                  76328021
       SPACE 2                                                          76336021
XXM01    OI    Y1IRX+NX1(XR3),XGNCON     FOR SCALING IF OP. IS A CON    76344021
         CP    DX0(LX16,XR3),XINDCZ      DO NOT GENERATE OBJECT CODE    76352021
       BC    XNOEQ,XXEXIT               BUT SET FLAG INDICATING THA     76360021
         OI    Y1IRX+NX1(XR3),XLITZR     THIS CONSTANT WILL HAVE TO     76368021
XXEXIT LM    XR0,XR15,XGSAV2            GENERATED AT OBJECT TIME.       76376021
       BCR   UNCON,XRSUB           RETURN                               76384021
       SPACE 2                                                          76392021
*                                                                       76400021
*                                                                       76408021
XXM00  LTR   XR5,XR5                                                    76416021
       BC    XONE,XXM04                 SCALING.                        76424021
         LA    XRSUB,XXM07                                              76432021
         CLI   Y1LAS+NX1(XR5),XX08                                      76440021
       BC    XTWO,XZX3X5           DP, SWITCH OPERANDS                  76448021
         CLI   Y1LAS+NX1(XR3),XX08                                      76456021
       BC    XTWO,XXM07            DP, DO NOT TEMP STOR SIZES           76464021
         CLC   Y1TEL+NX1(LX1,XR3),Y1TEL+NX1(XR5)                        76472021
       BC    XONE,XZX3X5           SWITCH OPERANDS                      76480021
XXM07  LH    XR1,Y1LAS(XR5)             COMPUTE SIZE OF PRODUCT.        76488021
       LH    XR2,Y1FAS(XR3)                                             76496021
       BAL   XRSUB,XWLDZ           SET MULT LENGTH                      76504021
         MVC   XYLEN(LX1),XMPLEN+NX1                                    76512021
       BAL   XRSUB,XYOAF                GENERATE  ZAP TEMP,OP1 IF N     76520021
       LH    XR6,Y1LAS(XR3)                                             76528021
         MVC   Y1LAS(LX2,XR3),XMPLEN     SET LENGHT OF OP1 TO LENGHT    76536021
       BAL   XRSUB,XZSIDA          SET A-TEXT                           76544021
       BAL   XRSUB,MP                   PRODUCT(MAKE SURE TO HAVE       76552021
       STH   XR6,Y1LAS(XR3)             LEADING 0)  AND  GEN            76560021
         MVC   XFTEL(LX5),Y1TEL(XR3)                                    76568021
       BC    UNCON,XXEXIT          RETURN                               76576021
       SPACE 2                                                          76584021
*                                                                       76592021
*                                                                       76600021
       SPACE 2                                                          76608021
XXM04    CLI   Y1FAS+NX1(XR3),XX1D                                      76616021
       BC    XGTEQ,XXM0P           DP MULT                              76624021
         CLI   XCONL,XX08                                               76632021
       BC    XTWO,XXM012                YES-                            76640021
       LH    XR5,XMINON                                                 76648021
       SR    XR1,XR1                                                    76656021
       IC    XR1,XCONL                                                  76664021
       LH    XR2,Y1FBS(XR3)                                             76672021
       BAL   XRSUB,XWLDZ           SET MULT LENGTH                      76680021
         MVC   XYLEN(LX1),XMPLEN+NX1       GENERATE ZAP TEMP,OP1 IF N   76688021
       BAL   XRSUB,XYOBF                SSARY.                          76696021
       LH    XR6,Y1LBS(XR3)             SET LENGHT TO LENGHT+ONE        76704021
         MVC   Y1LBS(LX2,XR3),XMPLEN     LEADING ZERO.                  76712021
       BC    UNCON,XXM013          SET A-TEXT                           76720021
       SPACE 2                                                          76728021
XXM012 LH    XR1,Y1LBS(XR3)                                             76736021
       LH    XR2,Y1ALP(XR3)                                             76744021
         LA    XR2,DX1(XR2)                                             76752021
       BAL   XRSUB,XWLDZ           SET MULT LENGTH                      76760021
         MVC   XELEN+NX1(LX1),XMPLEN+NX1                                76768021
       BAL   XRSUB,XTAMPO          GET TEMP STOR                        76776021
         MVC   XWC1(LX2),XEREL1                                         76784021
         MVC   XL1+NX1(LX1),XYTEL+NX1                                   76792021
         MVC   XL2+NX1(LX1),XCONL                                       76800021
         MVC   XCON2(LX17),XCON                                         76808021
       BAL   XRSUB,ZAP             GENERATE ZAP                         76816021
       LH    XR6,XEREL1                                                 76824021
       AH    XR6,XYTEL                                                  76832021
       SH    XR6,XMPLEN                 SET  A-TEXT BUFFER FOR CONS     76840021
       STH   XR6,XWC1                   IN TEMP.                        76848021
         MVC   XL1(LX2),XMPLEN           X                              76856021
       LH    XR5,XMINFV                  X                              76864021
         MVC   XGTEM2(LX6),XYTEL                                        76872021
       SPACE 2                                                          76880021
XXM013 BAL   XRSUB,XZSIDB               SET-UP A-TEXT BUFFER.           76888021
       BAL   XRSUB,MP                   GENERATE  MP.                   76896021
       CH    XR5,XMINON                 IF FIRST OPERAND WAS THE CO     76904021
       BC    XZERO,XXM014               UPDATE  INFORMATION BUFFER      76912021
         MVC   XYTEL(LX6),XGTEM2                                        76920021
       BAL   XRSUB,XUPDT                OTHER OPERAND.                  76928021
       BC    UNCON,XXEXIT               X                               76936021
XXM014 STH   XR6,Y1LBS(XR3)             RESET LENGTH WITHOUT  LEADI     76944021
       BC    UNCON,XXEXIT               ZERO.                           76952021
XXM0P    LA    XR0,DX16                                                 76960021
       BAL   XRSUB,XDP10M          DP MULT                              76968021
       BC    UNCON,XXEXIT          RETURN                               76976021
       EJECT                                                            76984021
XWW00  LA    XR3,XVAL1                  XR3 HAS FIRST OPERAND.          76992021
       SPACE 2                                                          77000021
XW004  TM    Y1IRX(XR3),XGBINR          IF ONE OPERAND IS               77008021
       BC    NOTHR,XW005                BINARY- CONVERT TO              77016021
         TM    Y1IRX+NX1(XR3),XGOVFL     ID FIRST OR SCALE IN BI AND    77024021
       BC    XTHRE,XW007                CONVERT TO ID AFTER.            77032021
       BAL   XRSUB,XSCBOA               WOULD SCALING BE POSSIBLE I     77040021
       BC    UNCON,XW007                NO                              77048021
         CLI   Y1BAS+NX1(XR3),XX04       YES, BUT IS SCALED OP A SIN    77056021
       BC    XTWO,XW007                 WORD - NO                       77064021
       LH    XR6,XFBAS                  YES, SCALE IN BINARY            77072021
         MVC   XFBAS(LX2),Y1BAS(XR3)                                    77080021
       BAL   XRSUB,XZSCL           GENERATE CODING FOR SCALING          77088021
       STH   XR6,XFBAS                                                  77096021
         BAL   XRSUB,XBIIDB        CONVERT BINARY TO ID                 77104021
       BC    UNCON,XWINCR          CHECK FOR STORE OR MOVE              77112021
XW007  EQU   *                                                          77120021
       BAL   XRSUB,XBIIDB          CONVERT BINARY TO ID                 77128021
       SPACE 2                                                          77136021
XW005    TM    Y1IRX+NX1(XR3),XGOVFL     OVERFLOW-- TRUNCATE FIRST      77144021
       BC    XTHRE,XW003           YES                                  77152021
XW006  LH    XR5,Y1ALP(XR3)                                             77160021
       LTR   XR5,XR5                                                    77168021
       BC    XONE,XW002                 DIVIDE  ( MVO'S )               77176021
       BC    XZERO,XWINCR          CHECK FOR STORE OR MOVE              77184021
       SPACE 2                                                          77192021
*                                                                       77200021
         ZAP   XCON(LX16),XIDONE(LX1)                                   77208021
XN10P1   MP    XCON(LX16),XIDCNQ(LX1)    MULTIPLY BY TEN.               77216021
         AP    XCON(LX16),XCON(LX16)                                    77224021
         BCT   XR5,XN10P1               DECREASE XR5                    77232021
       SPACE 2                                                          77240021
       LA    XR5,XCON                                                   77248021
       BAL   XRSUB,XIDSZ           GET SIZES OF OPERAND                 77256021
         MVC   XCONL(LX1),XIDBY+NX1                                     77264021
       LH    XR5,XMINON                 GENERATE     MP OP,10**S        77272021
*                                                                       77280021
       BAL   XRSUB,XXMPL                X                               77288021
*                                                                       77296021
       SPACE 2                                                          77304021
XWINCR BAL   XRSUB,XSTOMV          CHECK FOR STORE OR MOVE              77312021
       BC    UNCON,XWEXIT          YES                                  77320021
       C     XR3,XAVAL1                 IS IT 2ND OP.                   77328021
       BC    XZERO,XW0044               NO-                             77336021
XWEXIT LM    XR0,XR15,XGSAV1            YES- EXIT.                      77344021
       BCR   UNCON,XRSUB                X                               77352021
       SPACE 2                                                          77360021
XW0044 LA    XR3,XVAL2                  XR3 HAS 2ND OP.                 77368021
       BC    UNCON,XW004                SCALE IT.                       77376021
       SPACE 2                                                          77384021
       SPACE 2                                                          77392021
XW003  EQU   *                                                          77400021
         CLI   Y1IND+NX1(XR3),XX00       ANY INTEGER TO TRUNCATE.       77408021
       BC    XZERO,XW013           NO                                   77416021
         TM    Y1IRX+NX1(XR3),XZGNLT                                    77424021
       BC    XZERO,XW0PR           OPERAND NOT A LITERAL                77432021
*                                                                       77440021
*      ERROR NUMBER 10.                                                 77448021
*                                                                       77456021
       BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               77464021
       DC    AL1(ERRN10)                                                77472021
       DC    AL1(1)                                                     77480021
       LH    XR6,Y1ALP(XR3)                                             77488021
       AH    XR6,Y1FBS(XR3)                                             77496021
       CH    XR6,XC030                                                  77504021
       BC    XTWO,XW0PR2           MORE THAN 30 DIGITS                  77512021
       LH    XR6,Y1ALP(XR3)                                             77520021
       LCR   XR2,XR6                                                    77528021
       STH   XR2,Y1ALP(XR3)                                             77536021
       LR    XR5,XR3                                                    77544021
       BAL   XRSUB,XSCAL           SCALE OPERAND                        77552021
       STH   XR6,Y1ALP(XR3)                                             77560021
XW0PR2   MVI   XYLEN,XX10                                               77568021
       BAL   XRSUB,XYOBF           GENERATE ZAP                         77576021
         NI    Y1IRX+NX1(XR3),XX0F                                      77584021
       BC    UNCON,XW0PR1          CHECK TRUNC VALUE                    77592021
*-------------------------------------        GIVE A MESSAGE            77600021
XW0PR  BAL   XRSUB,ERRPRO          GENERATE ERROR MESSAGE               77608021
       DC    AL1(ERRN11)                                                77616021
       DC    AL1(0)                                                     77624021
XW0PR1 EQU   *                                                          77632021
       LH    XR6,Y1FBS(XR3)                                             77640021
       SH    XR6,Y1IND(XR3)                                             77648021
         BH    XW0X01              MAKE SURE DIGITS >= 0                77656021
       SR    XR6,XR6                                                    77664021
XW0X01 EQU   *                                                          77672021
       STH   XR6,Y1FBS(XR3)                                             77680021
         SRA   XR6,DX1                                                  77688021
         LA    XR6,DX1(XR6)                                             77696021
         MVC   XYLEN(LX1),Y1LBS+NX1(XR3)                                77704021
       BAL   XRSUB,XYOBF           GENERATE ZAP                         77712021
       LH    XR1,XYTEL                                                  77720021
       SR    XR1,XR6                                                    77728021
       BC    XZERO,XW010           NO XC NEEDED                         77736021
       STH   XR1,XL1                                                    77744021
         MVC   XWC1(LX2),XEREL1                                         77752021
         MVC   XWC2(LX2),XEREL1                                         77760021
       BAL   XRSUB,EXORLG          GENERATE XC                          77768021
XW010  STH   XR6,Y1LBS(XR3)                                             77776021
         TM    Y1FBS+NX1(XR3),XX01                                      77784021
       BC    XTHRE,XW013           NUMBER OF DIGITS ODD                 77792021
         STC   XR1,XPLUS1+NX2                                           77800021
         MVC   XWC1(LX2),XEREL1                                         77808021
         MVI   XIMM,XX0F                                                77816021
       BAL   XRSUB,NI              GENERATE NI                          77824021
       SPACE 2                                                          77832021
XW013  EQU   *                          SCALE TRUNCATED RESULT.         77840021
         CLI   Y1FAS+NX1(XR3),XX1E                                      77848021
       BC    XLOEQ,XW006           NUMBER OF DIGITS NOT > 30            77856021
         LA    XR0,DX32                                                 77864021
       BAL   XRSUB,XDP10M          DP MULT                              77872021
       BC    UNCON,XWINCR          CHECK FOR STORE OR MOVE              77880021
       SPACE 2                                                          77888021
       SPACE 2                                                          77896021
XW002    TM    Y1IRX+NX1(XR3),XZGNLT    DROP DECIMAL.                   77904021
       BC    XZERO,XW0PQ     IF LITERAL DO IT AT COMPILE TIME.          77912021
       BAL   XRSUB,XSTOMV          CHECK FOR STORE OR MOVE              77920021
       BC    UNCON,XWEXIT          YES                                  77928021
       C     XR3,XAVAL2          IS THIS THE 2ND OPERAND                77936021
       BNE   XW008               NO                                     77944021
       CLI   DOP2,TEMRES         YES, IS IT A TEMP RESULT               77952021
       BE    XWEXIT              YES, RETURN                            77960021
XW008  EQU   *                                                          77968021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      77976021
       BAL   XRSUB,XSCAL           SCALE OPERAND                        77984021
       BAL   XRSUB,XZX3X5          SWITCH OPERANDS                      77992021
       BC    UNCON,XWINCR          CHECK FOR STORE OR MOVE              78000021
XW0PQ  EQU   *                                                          78008021
         MVC   XYLEN(LX1),Y1LBS+NX1(XR3)                                78016021
       BAL   XRSUB,XYOBF                      GENERATE  MVO'S.          78024021
       LH    XR4,XEREL1                                                 78032021
       LH    XR5,Y1ALP(XR3)             DECIMAL IS TO BE LOST. ONE      78040021
       LCR   XR5,XR5                    WILL DO IT. IF NOT TWO ARE      78048021
       CH    XR5,Y1FBS(XR3)                                             78056021
       BC    XONE,XW0022           SCALING < DIGITS                     78064021
       STH   XR4,XWC1                                                   78072021
         ZAP   XCON2(LX16),XINDCZ(LX1)                                  78080021
         MVI   XCON2+NX16,XX01                                          78088021
         MVI   XL2+NX1,XX01                                             78096021
         MVC   XL1+NX1(LX1),XYTEL+NX1                                   78104021
       BAL   XRSUB,ZAP             GENERATE ZAP                         78112021
       BC    UNCON,XWINCR          CHECK FOR STORE OR MOVE              78120021
XW0022 EQU   *                                                          78128021
       SR    XR0,XR0                                                    78136021
         TM    Y1ALP+NX1(XR3),XX01                                      78144021
       BC    XZERO,XW020           SCALING NOT ODD                      78152021
         LA    XR5,DX1(XR5)                                             78160021
XW020    SRA   XR5,DX1                                                  78168021
XW0025 STH   XR4,XWC1                                                   78176021
       STH   XR4,XWC2                                                   78184021
       LH    XR2,XYTEL                                                  78192021
       STH   XR2,XL1                                                    78200021
       SR    XR2,XR5                                                    78208021
       STH   XR2,XL2                                                    78216021
       BAL   XRSUB,MVO            MVO  TEMP(L),TEMP(L-A)                78224021
*                            WHERE  A= XIALP/2, OR = XIALP+1/2          78232021
*                            DEPENDING ON XIALP BEIING EVEN OR ODD.     78240021
       LTR   XR0,XR0                                                    78248021
       BC    XNOEQ,XWINCR          CHECK FOR STORE OR MOVE              78256021
         TM    Y1ALP+NX1(XR3),XX01                                      78264021
       BC    XTHRE,XWINCR          SCALING ODD                          78272021
       LH    XR0,XC001                                                  78280021
         LA    XR5,DX1        IF XIALP IS EVEN GENERATE AN AXTRA MVO    78288021
       BC    UNCON,XW0025            MVO   TEMP(L),TEMP(L-1)  .         78296021
       SPACE 5                                                          78304021
* DOUBLE PRECISION MULITPLY. 30 DIGITS BY 30 DIGITS.                    78312021
* PRODUCT TRUNCATED TO 30 DIGITS.                                       78320021
XDP10M STM   XR0,XR15,XGSAV7                                            78328021
       CH    XR0,XC016                                                  78336021
       BC    XNOGT,XDP10A          <= 16 BYTES NEEDED                   78344021
       BAL   XRSUB,XBDSET          SET A-TEXT                           78352021
         MVI   BDISP1+NX1,WORKA                                         78360021
         MVI   BDISP2+NX1,WORKA                                         78368021
       BC    UNCON,XDP10B          SET LENGTH                           78376021
XDP10A BAL   XRSUB,XE16D           GET 16 BYTES OF TEMP STOR            78384021
         MVC   XWC1(LX2),XEREL1                                         78392021
         MVC   XWC2(LX2),XEREL1                                         78400021
XDP10B STH   XR0,XL1                                                    78408021
       BAL   XRSUB,EXORLG          GENERATE XC                          78416021
         MVI   XZCSW,XXF0                                               78424021
       SR    XR2,XR2                                                    78432021
       LH    XR1,Y1ALP(XR3)                                             78440021
         TM    Y1ALP+NX1(XR3),XX01                                      78448021
       BC    XZERO,XDP300          SCALING EVEN                         78456021
         MVI   XZCSW,XX0F                                               78464021
         TM    Y1FBS+NX1(XR3),XX01                                      78472021
       BC    XZERO,XDP30A          NUMBER OF DIGITS EVEN                78480021
         LA    XR2,DX1                                                  78488021
XDP30A EQU   *                                                          78496021
       BCTR  XR1,RW0               SET LENGTH AND DISP                  78504021
XDP300   SRA   XR1,DX1                                                  78512021
       LR    XR4,XR0                                                    78520021
       SR    XR4,XR1                                                    78528021
       LR    XR6,XR4                                                    78536021
       SR    XR6,XR2                                                    78544021
       LH    XR5,Y1LBS(XR3)                                             78552021
       SR    XR6,XR5                                                    78560021
       AR    XR5,XR2                                                    78568021
         STC   XR6,XPLUS1+NX2                                           78576021
       STH   XR5,XL1                                                    78584021
       BAL   XRSUB,XDP30Q          SET LOCATION                         78592021
         MVC   XGTEM2(LX6),XYTEL                                        78600021
       LH    XR5,XMINFV                                                 78608021
       BAL   XRSUB,XZSIDB          SET A-TEXT                           78616021
         TM    Y1ALP+NX1(XR3),XX01                                      78624021
       BC    XZERO,XDP305          SCALING EVEN                         78632021
       BAL   XRSUB,MVO             GENERATE MVO                         78640021
       BC    UNCON,XDP30R          GENERATE MVN                         78648021
XDP305   MVI   XL2+NX1,XX00                                             78656021
       BAL   XRSUB,MVC             GENERATE MVC                         78664021
XDP30R EQU   *                                                          78672021
       LH    XR5,XMINFV                                                 78680021
       BAL   XRSUB,XZSIDB          SET A-TEXT                           78688021
       LH    XR5,XL2                                                    78696021
       BCTR  XR5,RW0               SET DISP                             78704021
         STC   XR5,XPLUS2+NX2                                           78712021
         MVI   XL2+NX1,XX00                                             78720021
         MVI   XL1+NX1,XX01                                             78728021
       LR    XR5,XR0                                                    78736021
       BCTR  XR5,RW0               SET DISP                             78744021
         STC   XR5,XPLUS1+NX2                                           78752021
       CH    XR0,XC016                                                  78760021
       BC    XTWO,XDP306           SIZE > 16 BYTES                      78768021
         MVC   XYTEL(LX6),XGTEM2                                        78776021
       BAL   XRSUB,XUPDT           UPDATE TEMP STOP PTRS                78784021
XDP306 BAL   XRSUB,XDP30Q          SET LOCATION                         78792021
       BAL   XRSUB,MVN             GENERATE MVN                         78800021
       BCTR  XR4,RW0               SET DISP                             78808021
         STC   XR4,XPLUS1+NX2                                           78816021
         MVC   XIMM(LX1),XZCSW                                          78824021
       BAL   XRSUB,XDP30Q          SET LOCATION                         78832021
       BAL   XRSUB,NI              GENERATE NI                          78840021
       LM    XR0,XR15,XGSAV7                                            78848021
       BCR   UNCON,XRSUB           RETURN                               78856021
       SPACE 5                                                          78864021
       SPACE 5                                                          78872021
XDP30Q CH    XR0,XC016                                                  78880021
       BC    XTWO,XDPQQ1           SIZE > 16 BYTES                      78888021
         MVC   XWC1(LX2),XEREL1                                         78896021
       BCR   UNCON,XRSUB           RETURN                               78904021
XDPQQ1   MVI   BDISP1,XXD0                                              78912021
         MVI   BDISP1+NX1,WORKA                                         78920021
       BCR   UNCON,XRSUB           RETURN                               78928021
       EJECT                                                            78936021
*      XHSMD    - ROUTINE WHICH DETERMINES THE MODE(ID OR BINARY) I     78944021
*               - WHICH THE ARITHMETIC OPERATIONS WILL BE PERFORMED     78952021
*               - THE INPUT TO THIS ROUTINE  IS MAINLY '                78960021
*               -     A)  SIZE OF THE RESULT OF THIS OPERATION.         78968021
*               -     B)  MODE OF BOTH OPERANDS.                        78976021
*               -     C)  CONTEXT IN WHICH THE RESULT WILL BE USED      78984021
*               -         LATER ON.                                     78992021
*               -     D)  NATURE OF THIS OPERATION (ADD,MULT.,DIV,E     79000021
*               - THE OUTPUT IS  A  FLAG SET IN THE GENERAL SWITCH      79008021
       SPACE 5                                                          79016021
XHSMD  EQU   *                                                          79024021
         MVI   XHINTS,XX00                                              79032021
       IC    XR3,X1IRX                  XR3 AND XR4                     79040021
         SLL   XR3,DX28                  WILL HAVE THE TYPE             79048021
       IC    XR4,X2IRX                  OF VAL1 AND                     79056021
         SLL   XR4,DX28                  VAL2.                          79064021
       CLR   XR3,XR4                    DO BOTH OPERANDS HAVE THE S     79072021
       BC    XNOEQ,XH001                TYPE - NO,                      79080021
       X     XR3,XHMK1                  YES,ARE THEY BOTH BINARY.       79088021
       BC    XNOEQ,XH025                NO,THEY ARE BOTH ID -SET ID     79096021
XH002  TM    XGSWT,XAROPE               YES,IS IT AN ARITH. OPERATI     79104021
       BC    NOTHR,XH008                NO ,IT IS A RELATIONAL- SET     79112021
*                                       BINARY MODE.                    79120021
       SPACE 2                                                          79128021
         CLI   XFBAS+NX1,XX08      YES, IS RESULT > 8 BYTES             79136021
       BC    XLOEQ,XH020                NO,                             79144021
XH025  OI    XGSWT,XIDMOD               YES- SET ID MODE.               79152021
       SPACE 2                                                          79160021
XHEXI  LM    XR0,XR15,XGSAV1            RETURN                          79168021
       BCR   UNCON,XRSUB                X                               79176021
       SPACE 2                                                          79184021
XH020    CLI   XFBAS+NX1,XX04            IS RESULT = 4 BYTES.           79192021
         BNH   XH003               NO, SET BINARY MODE                  79200021
         LA    XR2,XH022                LOAD TRANSFER                   79208021
       LA    XR1,XH026                  INDEXES.                        79216021
XH027    CLI   X1BAS+NX1,XX04            CHECK IF BOTH OP.ARE LESS T    79224021
       BCR   XTWO,XR2                   4 BYTES-   NO                   79232021
         CLI   X2BAS+NX1,XX04                                           79240021
       BCR   XTWO,XR2                   NO                              79248021
XH023  BAL   XRSUB,XH016                GET INTERSTRING INFORMATION     79256021
       BCR   UNCON,XR1             TRANSFER                             79264021
XH026  TM    XHINTS,XHCLUE              IS RESULT USED WITH A BINAR     79272021
       BC    XTHRE,XH008                OPERAND IN AN ADD,RELATIONA     79280021
       BC    UNCON,XH025                OR STORE - IF YES SET BINAR     79288021
*                                       MODE. ID OTHERWISE.             79296021
XH022  TM    XOPMOD,XMUDVF                                              79304021
       BC    XZERO,XH023                PRECISION AND IF OPERATION      79312021
       BC    UNCON,XH025                NOT ADD OR SUB SET ID MODE.     79320021
*                                       OTHERWISE TAKE TEST AT XH02     79328021
XH001    TM    X1IRX+NX1,XZGNLT          IF ONE OPERAND IS A LITERAL    79336021
       BC    XNOEQ,XH002                OR A FIGCON ASSUME              79344021
*                                       IT HAS THE TYPE OF FIRST OP     79352021
         TM    X2IRX+NX1,XZGNLT                                         79360021
       BC    XNOEQ,XH002                X                               79368021
         TM    XGSWT,XAROPE                                             79376021
       BC    XTHRE,XH006                MIXED TYPE AND ARITH OPERAT     79384021
*                                       MIXED TYPE AND RELATIONAL       79392021
       X     XR3,XHMK1                  YES,ARE THEY BOTH BINARY.       79400021
       BC    XNOEQ,XH007                OP1 IS NOT BINARY               79408021
         CLI   X2BAS+NX1,XX04            IS THE ID OPERAND SINGLE       79416021
*                                       PRECISION IN BINARY             79424021
XH009  BC    XLOEQ,XH008               YES,SET BINARY MODE.             79432021
       BC    UNCON,XH025                NO                              79440021
*                                                                       79448021
       SPACE 1                                                          79456021
XH007    CLI   X1BAS+NX1,XX04            OP1 IS THE ID OPERAND.         79464021
       BC    UNCON,XH009           TEST CONDITION CODE                  79472021
       SPACE 2                                                          79480021
*                              MIXED MODE AND ARITH.OPERATION.          79488021
XH006    CLI   XFBAS+NX1,XX08            IF RESULT = 2 WORDS            79496021
       BC    XTWO,XH025                 SET ID MODE.                    79504021
       TM    XOPMOD,XMUDVF             IS IT A MULT.OR A DIVISION.      79512021
       BC    XZERO,XH030                NO,                             79520021
       LA    XR2,XH025                  YES,LOAD TRANSFER               79528021
       LA    XR1,XH032                  INDEXES.                        79536021
       BC    UNCON,XH027                IF BOTH OPERAND ARE NOT SIN     79544021
*                                       PRECISION -SET ID MODE-AND      79552021
*                                       THEY ARE AND IF THE RESULT      79560021
XH032    CLI   XFBAS+NX1,XX04            ALSO SINGLE PRECISION TAKE     79568021
       BC    XTWO,XH026                 AT XH033,IFNOT TAKE TEST XH     79576021
       SPACE 2                                                          79584021
XH033  TM    XHINTS,XHDNBI              IF RESULT  USED WITH BINARY     79592021
       BC    XZERO,XH025                OPERAND IN ANY OPERATION SE     79600021
       BC    UNCON,XH008                BINARY MODE - ID OTHERWISE      79608021
       SPACE 2                                                          79616021
XH030  LA    XR1,XH033                  RELOAD TRANSFER INDEX.          79624021
         CLI   XFBAS+NX1,XX04            IF RESULT SINGLE PRECISION     79632021
       BC    XNOGT,XH023           CHECK FUTURE USE                     79640021
       LA    XR2,XH034                  IF RESULT DOUBLE PRECISION      79648021
       BC    UNCON,XH027                BOTH OPERANDS SINGLE TAKE X     79656021
XH034  X     XR3,XHMK1                  IF RES. DP AND                  79664021
       BC    XZERO,XH035                IF THE ID OPERAND IS DOUBLE     79672021
         CLI   X1BBS+NX1,XX04            PRECISON IN ID SET ID          79680021
XH036  BC    XTWO,XH025                 MODE. BINARY OTHERWISE          79688021
         LA    XR1,XH026                                                79696021
       BC    UNCON,XH023                X                               79704021
XH035    CLI   X2BBS+NX1,XX04                                           79712021
       BC    UNCON,XH036                X                               79720021
       SPACE 3                                                          79728021
*      XH016   -ROUTINE WHICH COLLECTS INFORMATION RELATIVE  TO THE     79736021
*               FUTURE  USE OF THE RESULT OF THE PRESENT OPERATION.     79744021
       SPACE 3                                                          79752021
XH016  EQU   *                                                          79760021
*                                                                       79768021
*                                                                       79776021
*                                       SET PROPER SWITSH ON IF RES     79784021
         CLI   DOP4+NX2,XX01       WILL BE USED IN AN ADD, SUBTRACT     79792021
       BC    XLOEQ,XH011                A RELATIONAL                    79800021
         CLI   DOP4+NX2,XX04                                            79808021
       BC    XLOEQ,XH012                X                               79816021
         CLI   DOP4+NX2,XX0B                                            79824021
       BC    XTWO,XH012                 X                               79832021
XH011  OI    XHINTS,XHADST              X                               79840021
XH012  EQU   *                          SET OTHER SWITCH ON IF RESU     79848021
         CLI   DOP5,XGDTN          WILL BE USED WITH A BINARY           79856021
       BC    XZERO,XH013                DATA NAME ,OR A FIGURATIVE      79864021
         CLI   DOP5,XGNLT          CONSTANT OR A LITERAL                79872021
       BC    XZERO,XH014                X                               79880021
         CLI   DOP5,XGFCT                                               79888021
       BC    XZERO,XH014                X                               79896021
       BCR   UNCON,XRSUB           RETURN                               79904021
XH013    TM    DOP5+XGMINC,XXB0                                         79912021
       BCR   NOTHR,XRSUB           NOT BINARY, RETURN                   79920021
*                                                                       79928021
*                                                                       79936021
XH014  OI    XHINTS,XHDNBI              X                               79944021
       BCR   UNCON,XRSUB                X                               79952021
XH003    DS    0H                                                       79960021
         TM    XOPMOD,XDIVFL       IS THIS A DIVISION OPERATION         79968021
         BO    XH007               YES                                  79976021
XH008    CLI   X1BBS+NX1,XX04            CHECK IF ONE OF THE OPERAND    79984021
       BC    XTWO,XHZ00                 WILL NEED A SCALING IN DP.      79992021
         CLI   X1ALP+NX1,XX09            IF YES,GO TO ID MODE. IF NO    80000021
       BC    XTWO,XH025                 SET BINARY MODE                 80008021
XHZ02    CLI   X2BBS+NX1,XX04            X                              80016021
       BC    XTWO,XHZ01                 X                               80024021
         CLI   X2ALP+NX1,XX09            X                              80032021
       BC    XTWO,XH025                 X                               80040021
XHZ03    CLI   XFFAS+NX1,XX12                                           80048021
       BC    XTWO,XH025            RESULT > 18 DIGITS                   80056021
*                                                                       80064021
       BC    UNCON,XHEXI                X                               80072021
XHZ00    CLI   X1ALP+NX1,XX00                                           80080021
       BC    XNOGT,XHZ02                X                               80088021
       BC    UNCON,XH025                X                               80096021
XHZ01    CLI   X2ALP+NX1,XX00                                           80104021
       BC    XNOGT,XHZ03                X                               80112021
       BC    UNCON,XH025                X                               80120021
         EJECT                                                          80128021
       USING   *,HCOMSR                                                 80136021
DICNOQ ST      RETRG,SVDIS6                                             80144021
         MVI   IMM,XX08             CODE FOR '2,4' FOR CNOP             80152021
       BAL     RETRG,CNOP              GEN...   CNOP    2,4             80160021
       L       RETRG,SVDIS6                                             80168021
       L     XRVAR,SVWJH7          DICNOP                               80176021
       BCR   UNCOND,RETRG          RETURN TO CALLER                     80184021
       USING   *,HCOMSR                                                 80192021
DIBALQ ST      RETRG,SVDIS6                                             80200021
*  UPON ENTRY, RW3 POINTS TO LAST 4 CHAR OF VIRT. XREG1 ALREADY SET     80208021
         CLC   GVIRT1(LX8),GZERO    VIRT ALREADY SET UP...              80216021
       BC    NOTEQ,DIBA01           YES, USE IT                         80224021
         MVC   GVIRT1(LX4),VIRTHD   FIRST 4 CHAR OF VIRT                80232021
         MVC   GVIRT1+NX4(LX4),DX0(RW3) LAST 4 CHAR OF VIRT             80240021
DIBA01 EQU   *                                                          80248021
         MVC   VIRTC1+NX2(LX2),VIRCTR SET VIRTUAL NUMBER                80256021
       IC    RW3,XREG1             SAVE XREG1 FOR BALR                  80264021
         CLI   XREG1,XX0D                                               80272021
       BC    HI,DIBAQ1             REG 14 OR 15 ...                     80280021
       ST    RW4,SVWJHP            PRESERVE REG'S OVER XFREER           80288021
       STC   RW3,XREGNO             NO, FREE UP REG                     80296021
       BAL   RETRG,XFREER          FREE REGISTERS                       80304021
       L     RW4,SVWJHP            PRESERVE REG'S OVER XFREER           80312021
DIBAQ2 EQU   *                                                          80320021
         MVI   XREG1,XX0F                                               80328021
       BAL   RETRG,LOAD            *    L    15,VIRTUAL                 80336021
       STC   RW3,XREG1             RESTORE XREG1 FOR BALR               80344021
         MVI   XREG2,XX0F                                               80352021
       BAL   RETRG,BAL             *    BALR X,15  WHERE X = 1 OR 1     80360021
         BAL   RETRG,GDES15        DESTROY REGISTERS                    80368021
       L       RETRG,SVDIS6                                             80376021
       L     XRVAR,SVWJH8           DIBALR                              80384021
       BCR     UNCOND,RETRG        RETURN TO CALLER                     80392021
DIBAQ1 STC   RW3,A48CH1                                                 80400021
       MVI   A48CH2,MDESTR                                              80408021
       BAL   RETRG,GATXTV          *                                    80416021
       DC    AL2(ATXT48-ATXTBV)    *MACRO CODING GENERATION             80424021
       DC    AL2(ZTXT48-ATXT48)    *                                    80432021
       BC    UNCOND,DIBAQ2         GENERATE LOAD AND BALR               80440021
         TITLE 'CONSTANTS FOR PH5CTL AND ARITHMETIC VERBS'              80448021
*=1   CONSTANT AREA.                                                    80456021
*                                                                       80464021
*                                                                       80472021
IKF504 CSECT                                                            80480021
COMON4 EQU     *                                                        80488021
       USING *,XRCONS                                                   80496021
ZAPZAP DS    100F     ************ USE FOR SUPERZAP ************        80504021
COSADR DC    A(0)                                                       80512021
******** VERB TRANSFER VECTOR TABLE ** KEEP TOGETHER ****************** 80520021
ADCN00   DC    A(XOTADD)           ADCN00                               80528021
         DC    A(XOTSUB)           ADCN01                               80536021
ADCN02   DC    A(XOTMUL)           ADCN02                               80544021
ADCN03   DC    A(XOTDIV)           ADCN03                               80552021
         DC    A(EXPONE)           ADCN04                               80560021
         DC    A(STOREE)           ADCN05                               80568021
         DC    A(PEQNUM)           ADCN06                               80576021
         DC    A(NEQNUM)           ADCN07                               80584021
         DC    A(PGTNUM)           ADCN08                               80592021
         DC    A(NGTNUM)           ADCN09                               80600021
         DC    A(PLTNUM)           ADCN0A                               80608021
         DC    A(NLTNUM)           ADCN0B                               80616021
         DC    A(PALFA)            ADCN0C                               80624021
         DC    A(NALFA)            ADCN0D                               80632021
         DC    A(PNUMRC)           ADCN0E                               80640021
ADCN0F   DC    A(NNUMRC)           ADCN0F                               80648021
         DC    A(STOP)             ADCN10                               80656021
         DC    A(GO)               ADCN11                               80664021
         DC    A(GODEP1)           ADCN12                               80672021
         DC    A(GODEPM)           ADCN13                               80680021
         DC    A(GODEPL)           ADCN14                               80688021
         DC    A(XEVAL)            ADCN15                               80696021
         DC    A(PEQNNU)           ADCN16                               80704021
         DC    A(NEQNNU)           ADCN17                               80712021
         DC    A(PGTNNU)           ADCN18                               80720021
         DC    A(NGTNNU)           ADCN19                               80728021
         DC    A(PLTNNU)           ADCN1A                               80736021
         DC    A(NLTNNU)           ADCN1B                               80744021
         DC    A(MOVE4)            ADCN1C                               80752021
ADCN1D   DC    A(MOVE)             ADCN1D                               80760021
         DC    A(EXAMIN)           ADCN1E                               80768021
         DC    A(TRANSF)           ADCN1F                               80776021
ADCN20   DC    A(READ)             ADCN20                               80784021
ADCN21   DC    A(OPEN)             ADCN21                               80792021
         DC    A(CLOSE)            ADCN22                               80800021
ADCN23   DC    A(WRITE)            ADCN23                               80808021
         DC    A(REWRIT)           ADCN24                               80816021
         DC    A(ACCEPT)           ADCN25                               80824021
         DC    A(DISPLA)           ADCN26                               80832021
         DC    A(EXHIBI)           ADCN27                               80840021
         DC    A(RESET)            ADCN28                               80848021
         DC    A(READY)            ADCN29                               80856021
         DC    A(RETURN)           ADCN2A                               80864021
         DC    A(ON)               ADCN2B                               80872021
         DC    A(ENTRY)            ADCN2C                               80880021
ADCN2D   DC    A(CALL)             ADCN2D                               80888021
         DC    A(ENTER)            ADCN2E                               80896021
         DC    A(PH5CTL)           ADCN2F                               80904021
         DC    A(PH5CTL)           ADCN30                               80912021
         DC    A(USE)              ADCN31                               80920021
         DC    A(EXIT)             ADCN32                               80928021
         DC    A(RPTNOP)           ADCN33                               80936021
         DC    A(PH5CTL)           ADCN34                               80944021
         DC    A(PH5CTL)           ADCN35                               80952021
         DC    A(SORT)             ADCN36                               80960021
         DC    A(RELEES)           ADCN37                               80968021
         DC    A(PERFOR)           ADCN38                               80976021
ADCN39   DC    A(SSCRPT)           ADCN39                               80984021
         DC    A(LINKK)            ADCN3A                               80992021
         DC    A(ADEBUG)           ADCN3B                               81000021
         DC    A(PH5CTL)           ADCN3C                               81008021
         DC    A(TRACE)            ADCN3D                               81016021
         DC    A(EQUATE)           ADCN3E                               81024021
         DC    A(PH5CTL)           ADCN3F MOVE1(RPT WRITER)             81032021
         DC    A(QINITV)           ADCN40                               81040021
         DC    A(QINCRA)           ADCN41                               81048021
         DC    A(QSTEPV)           ADCN42                               81056021
ADCN43   DC    A(QUPDAT)           ADCN43                               81064021
         DC    A(USE5)             ADCN44                               81072021
         DC    A(ENDUS5)           ADCN45                               81080021
         DC    A(USE1)             ADCN46                               81088021
         DC    A(ENDUS1)           ADCN47                               81096021
         DC    A(PH5CTL)           ADCN48                               81104021
         DC    A(PH5CTL)           ADCN49                               81112021
         DC    A(PH5CTL)           ADCN4A USE4(RPT DECL)                81120021
         DC    A(ENDUS4)           ADCN4B END USE BEFORE REPTING        81128021
         DC    A(QCALLV)           ADCN4C                               81136021
         DC    A(QRET2V)           ADCN4D                               81144021
         DC    A(QRETUV)           ADCN4E                               81152021
         DC    A(RPTCAL)           ADCN4F                               81160021
         DC    A(RPTSV)            ADCN50                               81168021
         DC    A(RPTSV)            ADCN51                               81176021
         DC    A(RPTSV)            ADCN52                               81184021
         DC    A(RPTSV)            ADCN53                               81192021
         DC    A(RPTSV)            ADCN54                               81200021
         DC    A(RPTSV)            ADCN55                               81208021
         DC    A(RPTRET)           ADCN56                               81216021
         DC    A(RPTRET)           ADCN57                               81224021
         DC    A(RPTRET)           ADCN58                               81232021
         DC    A(RPTRET)           ADCN59                               81240021
         DC    A(RPTRET)           ADCN5A                               81248021
         DC    A(RPTRET)           ADCN5B                               81256021
         DC    A(RPTORG)           ADCN5C                               81264021
         DC    A(RPTRRG)           ADCN5D                               81272021
*                                                                       81280021
         DC    A(SEARCHAL)         ADCN5E                               81288021
         DC    A(ENDSCHAL)         ADCN5F                               81296021
         DC    A(SET1)             ADCN60                               81304021
         DC    A(SET2UP)           ADCN61                               81312021
         DC    A(PH5CTL)           ADCN62                               81320021
         DC    A(PH5CTL)           ADCN63                               81328021
         DC    A(START)            ADCN64                               81336021
         DC    A(PH5CTL)           ADCN65                               81344021
         DC    A(IFINEQUA)         ADCN66                               81352021
         DC    A(IFINNEQU)         ADCN67                               81360021
         DC    A(IFINGREA)         ADCN68                               81368021
         DC    A(IFINNGRE)         ADCN69                               81376021
         DC    A(IFINLESS)         ADCN6A                               81384021
         DC    A(IFINNLES)         ADCN6B                               81392021
         DC    A(VIRTDEF)          ADCN6C                               81400021
         DC    A(EQUSCHR)          ADCN6D                               81408021
         DC    A(SET2DOWN)         ADCN6E                               81416021
         DC    A(SEGCAL)           ADCN6F                               81424021
         DC    A(PH5CTL)           ADCN70                               81432021
         DC    A(READCHCK)         ADCN71                               81440021
ADCN72   DC    A(WRITCHCK)         ADCN72                               81448021
ADCN73   DC    A(GOBACK)           ADCN73                               81456021
       DC    A(EXITPGM)                 ADCN74                          81464021
         DC    A(PH5CTL)           ADCN75                               81472021
*                                                                       81480021
*                                                                       81488021
ARPMOV DC    A(RPMOVE)                                                  81496021
*                                                                       81504021
       DS    0F                                                         81512021
GZERO  DC    XL15'0'                                                    81520021
       DC    XL15'0'                                                    81528021
       DC      XL15'0'                                                  81536021
       DC    XL15'0'                                                    81544021
FW001    DC    F'1'                FULL WORD CONSTANT = 1               81552021
FW002    DC    F'2'                FULL WORD CONSTANT = 2               81560021
FW4096 DC    F'4096'                                                    81568021
*                                                                       81576021
*                                                                       81584021
GFOUR  DC    F'4'                                                       81592021
G20    DC      XL2'14'                                                  81600021
*                                                                       81608021
       DS      0F                                                       81616021
GHFHI  DC    X'000032767C'   MAXIMUM BINARY HALFWORD VALUE              81624021
GHFLO  DC    X'000032768D'   MINIMUM BINARY HALFWORD VALUE              81632021
GFLHI  DC    X'0000000002147483647C'  MAXIMUM BINARY FULLWORD VALUE     81640021
GFLLO  DC    X'0000000002147483648D'  MINIMUM BINARY FULLWORD VALUE     81648021
TENPW9 DC    F'1000000000'   10 TO THE NINTH POWER                      81656021
G4420  DC    X'4420'                                                    81664021
G4206  DC    X'4206'                                                    81672021
*                                                                       81680021
*        SAVE AREAS - PRESERVE INDEXES FOR SUBROUTINES                  81688021
**********************************                                      81696021
SVWJHE DS    4D                   USED BY MUTUALLY EXCLUSIVE IO SR'     81704021
XGSAV1 DS    16F                   X                                    81712021
XGSAV2 DS    16F                   X                                    81720021
XGSAV3 DS    16F                   X                                    81728021
XGSAV4 DS    16F                   X                                    81736021
XGSAV5 DS    16F                   X                                    81744021
XGSAV6 DS    16F                   X                                    81752021
XGSAV7 DS    16F                   X                                    81760021
XGSAV8 DS    16F                   X                                    81768021
XESAV DS     16F                   X                                    81776021
XVARS1 DS    1F                    X                                    81784021
XVARS2 DS    1F                    X                                    81792021
XVARS3 DS    1F                    X                                    81800021
XVARS4 DS    1F                    X                                    81808021
XVARS5 DS    1F                    X                                    81816021
**********************************                                      81824021
*                                                                       81832021
*          REGISTER SAVERS                                              81840021
SVDIS1 DS    7F                    X                                    81848021
SVDIS2 DS    6F                    X                                    81856021
SVDIS3 DS    4F                    X                                    81864021
SVDIS4 DS    1F                    X                                    81872021
SVDIS5 DS    6F                    X                                    81880021
SVDIS6 DS    1F                    X                                    81888021
SVGETD DS    16F                  GETDOP SAVER                          81896021
SVGETS DS    1F                   SAVE GETSW RW2                        81904021
SVWJH1 DS    1F                    X                                    81912021
SVWJH2 DS    1F                    X                                    81920021
SVWJH3 DS    1F                    X                                    81928021
SVWJH4 DS    1F                    X                                    81936021
SVWJH5 DS    1F                    X                                    81944021
SVWJH6 DS    1F                    X                                    81952021
SVWJH7 DS    1F                    X                                    81960021
SVWJH8 DS    1F                    X                                    81968021
SVWJH9 DS    1F                    X                                    81976021
SVWJHA DS    1F                    X                                    81984021
SVWJHB DS    1F                    X                                    81992021
SVWJHC DS    1F                    X                                    82000021
SVWJHD DS    1F                    X                                    82008021
SVWJHG DS    1F                    X                                    82016021
SVWJHH DS    1F                    X                                    82024021
SVWJHI DS    7F                   SAVER FOR ADETER                      82032021
SVWJHJ DS    1F                    X                                    82040021
SVWJHK DS    1F                    X                                    82048021
SVWJHL DS    2F                    X                                    82056021
SVWJHM DS    1F                    X                                    82064021
SVWJHN DS    1F                    X                                    82072021
SVWJHO DS    1F                    X                                    82080021
SVWJHP DS    7F                   SAVE REG'S OVER XFREER                82088021
SVWJHQ DS    3F                    X                                    82096021
SVWJHR   DS    8F                                                       82104021
SVWJHS DS    2F                    X                                    82112021
SVWJHT DS    1F                    X                                    82120021
SVWJHU DS    1F                   SAVER FRO REGMAC RTN                  82128021
SVSO14 DS    6F                   CALCLG SAVER                          82136021
SVGATX DS  6F                      X                                    82144021
DWB      DS    1D                      I/O SAVE AREA                    82152021
CLSSV  DS    1F                    X                                    82160021
       EJECT                                                            82168021
*=1  CONSTANT AREA FOR ARITHMETIC.                                      82176021
XGNEUF DC    X'9F'            9 IN PACK DECIMAL .                       82184021
XGTEN  DC    X'010F'          10 INPACK DECIMAL .                       82192021
XINDCZ DC    X'0F'            0  INPACK DECIMAL .                       82200021
XIDCNQ DC    X'5F'           5 IN PACK DECIMAL.                         82208021
XIDONE DC    X'1C'                 1 IN PACKED DEC                      82216021
*                                                                       82224021
XIHAF  EQU   GHFHI+2                                                    82232021
XI1WO  EQU   GFLHI+4                                                    82240021
XI2WO  DC    X'9223372036854775807F'          - DOUBLE WORD  -          82248021
XC9999 DC    X'0999999999999999999999999999999F'   MAX. IR PERMITED     82256021
XTALLV DC    X'300B00B0300D4C040005FFFFFF'                              82264021
REG      DC    X'00'                                              51894 82272021
XRESTGSW DC    X'00'                                              51894 82280021
SCHLITX  DC    X'320607'                                          51894 82288021
       SPACE 2                                                          82296021
XITAB  DC    X'00'            TRT TABLE  FOR XIDSZ ROUTINE.             82304021
       DC    X'01'            X                                         82312021
       DC    X'02'            X                                         82320021
       DC    X'03'            X                                         82328021
       DC    X'04'            X                                         82336021
       DC    X'05'            X                                         82344021
       DC    X'06'            X                                         82352021
       DC    X'07'            X                                         82360021
       DC    X'08'            X                                         82368021
       DC    X'09'            X                                         82376021
       DC    X'0A'            X                                         82384021
       DC    X'0B'            X                                         82392021
       DC    X'0C'            X                                         82400021
       DC    X'0D'            X                                         82408021
       DC    X'0E'            X                                         82416021
       DC    X'0F'            X                                         82424021
*******************************                                         82432021
*      INTEGER  CONSTANTS                                               82440021
*DEL                                                               5189 82448021
XC000  DC    4F'0'                 FOUR FULL WORDS OF 0                 82456021
XC001  EQU   FW001+2               HALF WD = 1                          82464021
XC002  EQU   FW002+2               HALF WD = 2                          82472021
XC003  DC    1H'3'                 HALF WD = 3                          82480021
XC004  EQU   GFOUR+2               HALF WD = 4                          82488021
XC005  DC    1H'5'                                                      82496021
XC006  DC    1H'6'                                                      82504021
XC007  DC    1H'7'                                                      82512021
XC008  DC    1H'8'                                                      82520021
XC009  DC    1H'9'                                                      82528021
XC010  DC    1H'10'                                                     82536021
XC011  DC    1H'11'                                                     82544021
XC012  DC    1H'12'                                                     82552021
XC014  DC    1H'14'                                                     82560021
XC015  DC    1H'15'                                                     82568021
XC016  DC    1H'16'                                                     82576021
XC018  DC    1H'18'                                                     82584021
XC028  DC    H'0028'                                                    82592021
XC029  DC    1H'29'                                                     82600021
XC030  DC    1H'30'                                                     82608021
XC032  DC    1H'32'                                                     82616021
XC060  DC    1H'60'                                                     82624021
XC0122   DC    1H'122'                                                  82632021
XC0255   DC    1H'255'                                                  82640021
XC4095 DC    1H'4095'                                                   82648021
XC4096 EQU   FW4096+2              HALF WD = 4096                       82656021
******************************                                          82664021
GTWO   EQU   XC002                                                      82672021
GTHREE EQU   XC003                                                      82680021
GFIVE  EQU   XC005                                                      82688021
GSEVEN EQU   XC007                                                      82696021
GSXTEN EQU   XC016                                                      82704021
       SPACE 2                                                          82712021
XMINON DC    1H'-1'                HALF WD                              82720021
XMINTW DC    1H'-2'                NEGATIVE                             82728021
XMINTH DC    1H'-3'                CONSTANTS                            82736021
XMINFO DC    1H'-4'                                                     82744021
XMINFV DC    1H'-5'                                                     82752021
XLEN1    DS    1H                                                       82760021
XLEN2    DS    1H                  LGTH RECEIV FLD IN ALPHA MVE         82768021
SAVTYP   DC    X'00'               RECEIV FLD DATA TYPE-ALPHA MVE       82776021
       SPACE 2                                                          82784021
******************************                                          82792021
*      VARIOUS MASKS                                                    82800021
       DS    0F                                                         82808021
XEMK1  DC    X'00FFFFFF'                                                82816021
XIMK1  DC    X'000000F0'                                                82824021
XHMK1  DC    X'B0000000'      BINARY MASK.                              82832021
*                                                                       82840021
*                                                                       82848021
XSUMK1 DC    1X'80000000'                                               82856021
*DEL                                                               4430 82864021
XSUMK3 DC    1X'00F00000'                                               82872021
XSUMK4 DC    1X'00800000'                                               82880021
XSUMK5 DC    1X'00000F'                                                 82888021
XREMK6 DC    X'000080'                                                  82896021
       SPACE 10                                                         82904021
*      VARIOUS  ADCON .                                                 82912021
*                                                                       82920021
*                                                                       82928021
XSSDB2 DC    A(XSSBG2)                                                  82936021
XAVAL1 DC    A(XVAL1)         ADDRESSES OF OPERAND INFOR. BUFFERS.      82944021
XAVAL2 DC    A(XVAL2)         X                                         82952021
XAOPE1   DC    A(DOP1)             INPUT BUFFER ADDRESSES               82960021
XAOPE2   DC    A(DOP2)                                                  82968021
XAOPE3   DC    A(DOP3)                                                  82976021
XAOPE4   DC    A(DOP4)                                                  82984021
XAOPE5   DC    A(DOP5)                                                  82992021
AIMINIT0 DC    A(IMINIT0)                                               83000021
       SPACE 2                                                          83008021
XATADD DC    A(XOTDDD)                                                  83016021
FPALOD DC    A(FPLLOD)                                                  83024021
XASETV DC    A(XSETVL)                                                  83032021
*                                                                       83040021
*                                                                       83048021
*                                                                       83056021
XALAMA   DC    A(PH5BVB)               ADCON                            83064021
XCAMPR DC    A(XCOMBG)                                                  83072021
*                                                                       83080021
       SPACE 2                                                          83088021
*      TAMER PARAMETER LIST                                             83096021
*                                                                       83104021
       DS    0F                                                         83112021
XAAVAL EQU   *                                                          83120021
PARAV  DC    X'02'            AVAIL. TABLE  PARAM.LIST FOR PRIME.       83128021
       DC    AL3(XAVAL)       X                                         83136021
       DC    X'0190'          X                                         83144021
       DC    X'0028'          X                                         83152021
       SPACE 2                                                          83160021
XAINTR EQU   *                                                          83168021
PARAM  DC    X'20'            INT. RES. TABLE PARAM.LIST FOR PRIME.     83176021
       DC    AL3(XINTR)       X                                         83184021
       DC    X'0C80'          X                                         83192021
       DC    X'0280'          X                                         83200021
       SPACE  2                                                         83208021
XASCRP EQU   *                                                          83216021
XLPSUB DC    X'00'                      SUBSCRIPT TABLE.                83224021
       DC    AL3(XSCRPT)           TIB NUMBER                           83232021
       DC    1H'2000'              LENGTH FOR PRIMING TBL               83240021
       DC    1H'1000'              GROWTH FACTOR                        83248021
       SPACE  2                                                         83256021
XASNT  EQU   *                                                          83264021
XLSSPT DC    X'04'                      SUBS ID-TABLE.                  83272021
       DC    AL3(XSSNT)            X                                    83280021
       DC    1H'400'               X                                    83288021
       DC    1H'200'               X                                    83296021
       EJECT                                                            83304021
*        NON-ARITHMETIC CONSTANT AREA                                   83312021
*                                                                       83320021
VIRTHD DC    C'ILBO'              FIRST 4 CHAR OF ALL SUBROUTINES       83328021
DIA1C1 DC    C'DSP0'              DISPLAY   VIRTUAL  NAME               83336021
DIFPVI DC    C'TEF3'              IFP TO EFP     -    -                 83344021
SORTC1 DC    C'SRT0'              SORT INTERFACE -    -                 83352021
ACCPVI DC    C'ACP0'              ACCEPT         -    -                 83360021
BSAMREAD DC    C'SAMR'                  BSAM SPANNED READ ROUTINE       83368021
ADCON7 DC      A(DICNOQ)           THE                                  83376021
ADCON8 DC      A(DIBALQ)           PHASE                                83384021
IMWORK   DS    25C                     WORK AREA                        83392021
IMLSAV   DS    2F                      SAVE AREA                        83400021
HWDONE DC    XL4'00000001'         FULL WORD CONSTANT OF ONE            83408021
EXHIC1 DC    XL4'80000000'         FULL WD CONSTANT FOR EXHIBIT         83416021
FWDTHR DC    XL4'3'                FULL WORD CONSTANT OF 3              83424021
HW4096 EQU   FW4096+2                                                   83432021
LBLSW    DC    X'00'                   NONSTANDARD LABEL SWITCH         83440021
       DS      0H                                                       83448021
GETDC1 DC      AL2(4*LDOP)              DISPLACEMENT OF LAST OF 5 O     83456021
GETDC2   DC    AL2(3*LDOP)                                              83464021
STOPRU DC      XL2'3408'      **   DUMMY AN LIT FOR STOP RUN    **      83472021
       DC      CL8'STOP RUN'  **        KEEP TWO DC'S TOGETHER  **      83480021
DILGC1   DC    XL2'1C00'                                                83488021
DILGC2   DC    XL2'2000'                                                83496021
DITYTB DC      1H'00'              THIS TABLE                           83504021
       DC      XL2'00'               MUST REMAIN                        83512021
       DC      XL2'00'                INTACT.                           83520021
       DC      XL2'00'                 . ....                           83528021
       DC      XL2'20'                  .                               83536021
       DC      XL2'0F'                   .                              83544021
       DC      XL2'0F'                  .                               83552021
       DC      XL2'00'                                                  83560021
       DC      XL2'0F'                 .                                83568021
       DC      XL2'0F'                .                                 83576021
       DC      XL2'08'                 .                                83584021
       DC      XL2'01'                  .                               83592021
       DC      XL2'02'                   .                              83600021
       DC      XL2'0F'                  .                               83608021
       DC    XL2'00'                    .                               83616021
DISPC1 DC      XL3'02FFFF'                                              83624021
ENTRC1 DC    XL4'00040000'                                              83632021
VIRDEFI  DC    XL2'0000'           USED BY 'STOP' VERB                  83640021
VIRTNO   DC    XL2'0000'           HOLDS VIRTUAL ID NUMBER              83648021
         DC    CL8'ILBOSTP1'       'STOP' SUBR                          83656021
*        COBOL WORDS NEEDED BY PHASE 5                                  83664021
       DS      0H                                                       83672021
CBASCD DC      XL2'548D'           ASCENDING                            83680021
CBCHGD DC      XL2'548F'           CHANGED                              83688021
CBCNSL DC      XL2'5478'           CONSOLE C.W.                         83696021
CBDSCD DC      XL2'548C'           DESCENDING                           83704021
CBEND  DC      XL2'54A1'           END                                  83712021
CBFRST DC    XL2'5496'             'FIRST'  USED AS AN ID FOR CONT      83720021
CBGIVG DC      XL2'5481'           GIVING                               83728021
CBNAMD DC      XL2'5490'           NAMED                                83736021
CBRUN  DC      XL2'5485'           RUN                                  83744021
CBSYSP DC      XL2'5477'           SYSPCH C.W.                          83752021
CBUSIN DC      XL2'5489'           USING                                83760021
ONZERO DC      XL2'75F0'           F.C. ZERO                            83768021
*                                                                       83776021
* NON-ALLIGNED CONSTANTS                                                83784021
SORBZD DC    CL2'ZD'               SORT KEY TYPE CODES                  83792021
SORBCH DC    CL2'CH'               SORT KEY TYPE CODES                  83800021
SORBFL DC    CL2'FL'               SORT KEY TYPE CODES                  83808021
SORBPD DC    CL2'PD'               SORT KEY TYPE CODES                  83816021
SORBBI DC    CL2'FI'               SIGNED BINARY                        83824021
SEGBRK DC    X'4444'              PROC ATXT FOR SEGM CONTROL BREAK      83832021
DIWTC1 DC    XL2'3418'                 *** KEEP TOGETHER ***            83840021
       DC    CL8'IKF990D,'        *** KEEP TOGETHER ***                 83848021
       DC    CL16' AWAITING REPLY.'    *** KEEP TOGETHER ***            83856021
STOPC1 DC    CL9'IKF000A, '        STOP 'LIT' MESSAGE CODE              83864021
RECLIT EQU   *                                                          83872021
       DC    C' RECORD TYPE=F,LENGTH=('                                 83880021
SORLIT DC    XL2'3400'             SORT CONTROL                         83888021
       DC    C' SORT FIELDS=('     CARD                                 83896021
SORCL3 DC    C') '                 LITERALS                             83904021
SCHKPT DC    C'),CKPT '            X                                    83912021
SORCL4 DC    C',,,'                X                                    83920021
SORLG2 DS    XL5'0'                MINIMUM RECORD LENGTH-SORT           83928021
WRISC1 DC    CL4'1 0-'             CARR CONTROL CHAR SET                83936021
PR35C1 DC      XL3'35014D'                                              83944021
PR35C2 DC      XL3'35015D'                                              83952021
       DS    0D                                   *** KEEP TOGETHER     83960021
DIFPC2 DS    0D                                                         83968021
       DC    X'475F5E1000000000'                                        83976021
       DC    X'4F16345785D8A000'                                        83984021
DIFPC1 DC    X'080E0700'             *****  KEEP TOGETHER ***           83992021
       DC    X'11170700'             *****  KEEP TOGETHER ***           84000021
PR35CB DC    XL2'3502'                        ****     KEEP TOGETHE     84008021
       DC    CL2', '                          ****     KEEP TOGETHE     84016021
* KEEP NEXT 6 CARDS TOGETHER                                            84024021
SPREGC DC    X'D05E'              BASE & DISPL FOR SORT-RETURN          84032021
       DC    X'D058'               -      -    -   SORT-CORE-SIZE       84040021
       DC    X'D190'               -      -    -   SORT-FILE-SIZE       84048021
       DC    X'D194'               -      -    -   SORT-MODE-SIZE       84056021
       DC    X'D1A6'              BASE & DISPL FOR LABEL-RETURN         84064021
       DC    X'D05C'               -      -    -   RETURN-CODE          84072021
* KEEP ABOVE SIX CARDS TOGETHER.                                        84080021
CODE     DC    X'00'               CODE FOR EOV AND EOF                 84088021
I3927    DC    X'0000'                                            40317 84096021
XX3927   DC    X'3927'                                            40317 84104021
       SPACE 2                                                          84112021
         TITLE 'DIRECT A-TEXT CONSTANT TEXT    C  O  N  S  T  A  N  T'  84120021
* DIRECT A-TEXT WRITE OUT CONSTANTS. THOSE DIRECT A-TEXT STRINGS        84128021
*   REQUIRING CHANGES ARE IN VARIABLE DATA AREA.                        84136021
*                                                                       84144021
ATXTBC EQU   *                     START OF CONSTANT DIRECT A-TEXT      84152021
ARPPTM DC    A(RPPATM)                                                  84160021
*                                                                       84168021
* CONSTANTS FOR SPECIAL REPORT WRITER VERBS                             84176021
*                                                                       84184021
*                         PHASE INITIALIZATION                          84192021
*                                                                       84200021
PHASE50  EQU   *                                                        84208021
         STM   R14,R12,DX12(R13)    SAVE REG'S IN PHO SAVE AREA         84216021
         BALR  RW6,RW0            PICK UP LOCA-CTR INTO REG6            84224021
       USING *,RW6                                                      84232021
         LR    RW2,R13                                                  84240021
         L     R13,PHAS5X SET UP REG 13 AS BASE FOR PH5SAV              84248021
         ST    R14,DX12(R13) SAVE SYSTEM RETURN ADR IN PHASE SV AREA    84256021
         ST    RW2,DX4(R13) PUT PTR TO PH0 SV AREA IN PHASE SV AREA     84264021
         ST    R13,DX8(RW2) PUT PTR TO PHASE SV AREA IN PH0 SV AREA     84272021
       LM      XRBAS1,RB1,ACOMN1                                        84280021
       LM      GBRG1,XRDATA,ACOMN3                                      84288021
       LR    RW3,RW1                                                    84296021
         L     RW1,DX0(RW1)                                             84304021
       ST    RW1,COSADR                                                 84312021
       L     RW1,SEGSAV(RW3)      SAVE ADDR OF AREA IN PH0 WHICH        84320021
       ST    RW1,ADSEGSV          WILL HAVE DISKADR FOR SEGTBL          84328021
       L     XRBAS2,COSADR                                              84336021
       L     RW1,ACOMN1                                                 84344021
         BALR  RW0,XRBAS2         PERFORM PH0                           84352021
       DC    X'06'                                                      84360021
         MVC   XCSCEL(LX2),XC000                                        84368021
         MVI   XGNSW,XX00                                               84376021
*  PRIME TABLES USED BY PHASE5                                          84384021
         L     RW1,COSADR          'RELOCATE' TIB ADDRESS               84392021
         L     RW2,ARNTBL              FOR RUNTBL.                      84400021
         AR    RW2,RW1                                                  84408021
         ST    RW2,ARNTBL                                               84416021
       LA    RW1,XLPSUB                                                 84424021
       L     XRVAR,XPRIM                                                84432021
         BALR  RETRG,XRVAR        PERFORM SUB PRIM IN PH0               84440021
       LA    RW1,XLSSPT                                                 84448021
       L     XRVAR,XPRIM                                                84456021
         BALR  RETRG,XRVAR        PERFORM SUB PRIM IN PH0               84464021
       LA    RW1,PARAV                                                  84472021
       L     XRVAR,XPRIM                                                84480021
         BALR  RETRG,XRVAR        PERFORM SUB PRIM IN PH0               84488021
       LA    RW1,PARAM                                                  84496021
       L     XRVAR,XPRIM                                                84504021
         BALR  RETRG,XRVAR        PERFORM SUB PRIM IN PH0               84512021
         BAL   XRSUB,XINITM       INITIALIZE REGISTERS                  84520021
         BAL   XRSUB,XINITF       INITIALIZE FLOATING POINT REG         84528021
       LA    RW3,ELEMTB      SET REG  EQ TO BASE OF OUTPUT AREA         84536021
         MVI   WCMAX,XX03                                               84544021
       L     RW1,COSADR                                                 84552021
         BALR  RW0,RW1            PERFORM PHASE 0 TO READ               84560021
         DC    X'01'                   READ P2 TEXT FROM FILE 1         84568021
       ST    RW0,PNTIN                                                  84576021
       LH    RETRG,VIRCTR             INITIALLY UP VIRCTR BY ONE        84584021
         LA    RETRG,DX1(RETRG)                                         84592021
       STH   RETRG,VIRCTR                                               84600021
         B     PH5CTL             RETURN TO PHASE 5 CONTROL             84608021
       SPACE   4                                                        84616021
ACOMN1 DC      A(COMON1)           BEGIN OF FIRST CSECT                 84624021
       DC      A(COMON2)           BEGIN OF SECOND CSECT                84632021
ACOMN3 DC      A(COMON3)           BEGIN OF THIRD CSECT                 84640021
       DC      A(COMON4)           BEG OF CONSTANTS CSECT               84648021
       DC      A(COMON5)           BEG OF DATA AREA CSECT               84656021
PHAS5X DC      A(PH5SAV)           BEG OF DATA AREA CSECT               84664021
ARNTBL   DC    A(RUNTBL)                                                84672021
         TITLE 'A-TEXT GENERATOR AND ARITHMETIC CONSTANTS'              84680021
       DS    0F                                                         84688021
IKF505 CSECT                                                            84696021
COMON5 EQU     *                                                        84704021
       USING *,XRDATA                                                   84712021
******************************   DATA  AREA *********************       84720021
*=1  DATA AREA.                                                         84728021
PH5SAV DS    18F                   USED BY PHASE0 TO SAVE PH5 REGS      84736021
ZAPZAP2 DS   25F      ************ USE FOR SUPERZAP ************        84744021
       EJECT                                                            84752021
       DS      0H                                                       84760021
BYTCNT DC    XL2'0'           BYTE COUNT OF CURRENT ENTITY              84768021
CARDNO   EQU CURCRD               CURRENT CARD NUMBER                   84776021
PNTIN  DC    A(0)                  PTR TO NXT ELEM OF P2 TEXT           84784021
BYTES  DC    XL2'0'                LNGTH OF CURRENT ELEM                84792021
GANLNO DC    X'00'                 CODE OF VERB BEING PROCESSED         84800021
ADSEGSV  DC  A(0)                 ADDR OF AREA IN PH0 WHICH WILL        84808021
*                                 WILL CONTAIN RESULT OF 'NOTE'         84816021
SEGSW  DC    X'0'                 ******************************        84824021
*******************************************************************     84832021
*       RESERVE  STORAGE  AREAS                                         84840021
AXTLENG  DC    H'0'                LGTH ALL KEYS IN SEARCH ALL          84848021
AXTKEYN  DC    H'0'                NUMB OF KEYS IN SEARCH ALL           84856021
AXTCKEY  DC    H'0'                                                     84864021
AXTDISP  DC    H'0'                                                     84872021
AXTC01   DC    X'64300000'         PROC-A CODE FOR TEMPSTOR 2           84880021
AXTC02   DC    X'64240000'         PROC-A CODE FOR TEMP STORAGE         84888021
         DS    0F                                                       84896021
HEADER DS    1F                    HOLDS VERB STRING HEADER             84904021
CONSTS DS    F                                                          84912021
GSVR1  DS    F                    ERRPRO SAVES R3 HERE                  84920021
       DS    1C                   ***** KEEP WITH GSVR1*******          84928021
GSVRG  DS    16F                                                        84936021
GCOSAV DS    6F                                                         84944021
* PARAMETERS USED AS INPUT TO THE A-TEXT GENERATOR                      84952021
*                                                                       84960021
OP1    DC    F'0'                  FIRST DATA OPERAND                   84968021
OP2    DC    F'0'                  SECOND DATA OPERAND                  84976021
OP3    DC    A(GADPAR)             ADDR OF OUTPUT AREA                  84984021
       DS    0D                                                         84992021
XL1    DC    H'0'                  LENGTH IN INSTR WHICH REQUIRE        85000021
* A-TXT GEN WILL SUBTRACT 1 FROM THIS LENGTH FOR YOU                    85008021
XWC1   DC    XL3'0'                TEMP STORAGE REFERENCE               85016021
TALLY1 DC    X'00'                 TALLY REF                            85024021
BDISP1 DC    XL2'0'                BASE AND DISPL                       85032021
RELAD1 DC    F'0'                  RELATIVE ADDR                        85040021
VIRTC1 DC    F'0'                  VIRTUAL ID NUMBER                    85048021
GVIRT1 DC    2F'0'                 VIRTUAL NAME IN BCD                  85056021
XCON1  DC    XL14'0'               LITERALS AND                         85064021
       DC    XL3'0'                DC'S                                 85072021
XGN1   DC    H'0'                  GN REF                               85080021
XPN1     DC    F'0'                     HOLDS PN PRIORITY AND NUMBE     85088021
XCNTR1 DC    XL3'0'                GLOBAL TBL-VARIABLE PORTION          85096021
PLUS1  DC    XL3'0'                ADDRESS INCREMENT                    85104021
XVN1   DC    F'0'                  VN REF                               85112021
GDEBG1 DC    XL2'0'                GLOBAL TBL-FIXED PORTION             85120021
BLREF1 DC    XL2'0'                BASE LOCATOR                         85128021
XREG1  DC    XL1'0'                REGISTER NUMBER                      85136021
IMM    DC    X'00'                 'IMMEDIATE' FLD IN INSTR             85144021
XXREG  DC    X'00'                 INDEX REG                            85152021
       DS    0D                                                         85160021
XL2    DC    H'0'                  SAME                                 85168021
XWC2   DC    XL3'0'                 AS                                  85176021
TALLY2 DC    X'00'                   XL1                                85184021
BDISP2 DC    XL2'0'                   THRU                              85192021
RELAD2 DC    F'0'                      XREG1                            85200021
VIRTC2 DC    F'0'                       BUT                             85208021
GVIRT2 DC    2F'0'                       FOR                            85216021
XCON2  DC    XL14'0'                      SECOND                        85224021
       DC    XL3'0'                        OPERAND                      85232021
XGN2   DC    H'0'                  X                                    85240021
XPN2   DC    F'0'                  X                                    85248021
XCNTR2 DC    XL3'0'                X                                    85256021
PLUS2  DC    XL3'0'                X                                    85264021
XVN2   DC    F'0'                  X                                    85272021
GDEBG2 DC    XL2'0'                X                                    85280021
BLREF2 DC    XL2'0'                X                                    85288021
XREG2  DC    X'00'                 X                                    85296021
GFLWD  DC    F'0'            FOR INTERMEDIATE RESULTS                   85304021
GBIT1  DC    X'00'   THE BITS OF GBIT1 HAVE THE FOLLOWING MEANING       85312021
*   BIT0 HALFWORD TEST WANTED                                           85320021
*   BIT1 SS TYPE INSTR   (2ADDRESSES WANTED)                            85328021
*   BIT2 BINARY INSTR  (IF NUMLIT CONVERT TO BINARY)                    85336021
*   BIT3 DOUBLE FLOATING POINT INSTR                                    85344021
*   BIT4 FLOATING POINT INSTR                                           85352021
*   BIT5 DECIMAL MODE WANTED                                            85360021
*   BIT7 ADDRESS 1 COMPLETED                                            85368021
GBIT2  DC    X'00'           BIT 0 ON MEANS REL ADR                     85376021
*                            BIT1 ON MEANS MACRO                        85384021
*                            BIT 6 ON MEANS FULL WD ALIGNMENT           85392021
*                            BIT 7 ON MEANS DEFINITE HALFWD INSTR       85400021
COUNT  DC    H'5'  COUNT THRU GADPAR IS WHERE A TEXT FORMS OUTPUT       85408021
       DC    X'48'  OPCODE                                              85416021
OPCOD  DS    CL1                                                        85424021
GABS   DC    X'00'                                                      85432021
GADPAR DS    CL256                                                      85440021
GLTSAV DC    F'0'                                                       85448021
GHFWD  DC    H'0'            FOR INTERMEDIATE RESULTS                   85456021
MSKMORLB DC    X'5463'                  COBOL WORD 'MORE-LABELS'        85464021
PUTIOSRA DC    X'1810'                 * LR 1,0                         85472021
PUTIOCN  DC    X'45E0F004'             *  BAL  14,4(15)                 85480021
PUTOUTCN DC    X'05EF'                 *  BALR  14,15                   85488021
         DC    X'0700'                 * BCR 0,0                        85496021
GLGNCN DC    X'0005340000'                                              85504021
GCNGBR DC    X'00004858F000000048000F'                                  85512021
GCPNVNBR DC    X'00004858F00000000048070F' 'BCR' WITH PN OR VN REF      85520021
PNOUT  DS    F                                                          85528021
SCHOLD DS    F                    SAVE XRVERB FROM SEARCHAL             85536021
SCHLD2 DS    F                    SAVE R14 FROM SEARCHAL TO SSCRPT      85544021
GNHOLD DC    XL3'0'                                                     85552021
SCHLIT DC    X'320301001C'        P2 TXT FOR LIT=1                      85560021
       DS    0D                                                         85568021
GTEMP  DC    XL8'0'          FOR CONVERSIONS                            85576021
       DS    0F                                                         85584021
FILEREF DC    X'28064418B8000000'  SPECIAL FILE REF TEXT                85592021
FILEREF1 EQU   FILEREF+5                                                85600021
SYNCHRO  EQU   X'40'                                                    85608021
AXTE00   DS    1F                                                       85616021
AXTC00   DC    X'64540001'         PROC-A TXT FOR TEMP STOR 3 #1        85624021
AXSTORE  EQU   X'20'                                                    85632021
AXSTMLM  EQU   X'10'                                                    85640021
DFPXXX   EQU   X'10'                                                    85648021
SFPXXX   EQU   X'08'                                                    85656021
         DS    0F                                                       85664021
OTPT   DS    24F                   ATXT GEN OUTPUT AREA                 85672021
*=1  DATA AREA FOR ARITHMETIC.                                          85680021
WRITES DS    F                                                          85688021
       DS    0H                                                         85696021
PUTSAV DS    6F                    REG SAVER                            85704021
PUTH1  DC    H'1'                                                       85712021
GNCNT  DC    H'0'                  NO. GN'S IN EQUATE STRING TBL        85720021
       DS    0F                                                         85728021
       DC    H'0'                  HOLDS CODE FOR EQUATE STRINGS        85736021
GNLIST DS    6F                    PN GN EQUATE STRINGS BUILT HERE      85744021
GETSAV DS    F                                                          85752021
SAVEOP   DS    F'0'                USED BY SEARCH EQU VERB        45693 85760021
ALIGN    DS    F                   WORK AREA                      45693 85768021
       SPACE 2                                                          85776021
       DS    0F                         FP.REG INFO. TABLE              85784021
FPRTB2 DS    1H                    INTERMED RESULT PTR                  85792021
       DC    X'80'                 FLAG TO INDICATE FLOAT PT            85800021
       DC    X'02'                 REG NUMB                             85808021
       DC    A(FPRTBD)             PTR TO OTHER REG OF PAIR             85816021
FPRTB4 DS    1H                         SEE                             85824021
       DC    X'80'                      ABOVE                           85832021
       DC    X'04'                         X                            85840021
       DC    A(FPRTBD)                     X                            85848021
FPRTB6 DS    1H                         SEE                             85856021
       DC    X'80'                      ABOVE                           85864021
       DC    X'06'                         X                            85872021
       DC    A(FPRTBD)                     X                            85880021
FPRTB0 DS    1H                         SEE                             85888021
       DC    X'80'                      ABOVE                           85896021
       DC    X'00'                         X                            85904021
       DC    A(FPRTBD)                     X                            85912021
FPRTBD DC    1F'0'                                                      85920021
       SPACE 2                                                          85928021
*      COMPILE TIME WORK AREA.                                          85936021
*                                                                       85944021
*                                                                       85952021
XGTEM2 DS    2D               16 BYTES FIELD.                           85960021
XUTEL  DS    1H               SAVE AREA.                                85968021
XUTEM  DS    1H               X                                         85976021
XCON   DS    2D               USED BY GENERATED CONSTANTS.              85984021
XCONL  DS    1C               X                                         85992021
XZLENG DS    1H               SAVE AREA FOR LENGHT OF ITEM.             86000021
XEEMN  DS    1H               SAVE AREA FOR POINTER TO TS.              86008021
*                                                                       86016021
       SPACE 2                                                          86024021
******************************                                          86032021
*      GENERAL COMMUNICATION CELLS.                                     86040021
*                                                                       86048021
XRDMX  DS    1H               MAX.NUMBER OF DECIMAL PLACES.             86056021
XGDRE  DS    1H               NUMBER OF DECIMAL PLACES IN RESULT.       86064021
*                                                                       86072021
*                                                                       86080021
XYTEL  DS    1H               LENGHT       OF A    -       -      -     86088021
XEREL  DS    1H               REL. POINTER TO A WORKING STORAGE ENT     86096021
XEREL1 DS    1H               DISPLACEMENT OF A    -       -      -     86104021
XMPLEN DS    1H               LENGHT OF PRODUCT FOR ID MULTIPLY.        86112021
       DS    0F                                                         86120021
XTDDD  DS    1H               OUTPUT OF TRUNCATE ROUTINE.               86128021
XTIII  DS    1H                  -          -        -                  86136021
XIDBY  DS    1H               OUTPUT OF XIDSZ ROUTINE (SIZES).          86144021
XBDBY  DS    1H                 -         -      -      -    .          86152021
XIDDN  DS    1H                 -         -      -       -   .          86160021
XOPVLC DS    1H              VARIABLE LENGHT CELL NUMBER.               86168021
XOPLGH DS    1F              FIXED LENGH VALUE.                         86176021
XTDEC  DS    1H               INPUT OF TRUNCATE ROUTINE .               86184021
XTINI  DS    1H                 -         -        -    .               86192021
XGNTMP DS    1H               SAVE  VALUE OF GENERATED NAME.            86200021
XLIRP  DS    1F                                                         86208021
XELEN  DS    1H               LENGHT REQUIRED IN TEMP.                  86216021
       SPACE 2                                                          86224021
XCSCEL DS    1H                                                         86232021
       SPACE 2                                                          86240021
       DS    0F                                                         86248021
XSID1  DS    1H               POINTER OT UPDATED I,D,K.                 86256021
       DS    1H               DISPLACT. TO OP1                          86264021
XSID2  DS    1H                                                         86272021
       DS    1H                    DISPL TO OP2                         86280021
XSID3  DS    1H                                                         86288021
       DS    1H                    DISPL TO OP3                         86296021
XSID4  DS    1H                                                         86304021
       DS    1H                    DISPL TO OP4                         86312021
XSID5  DS    1H                                                         86320021
       DS    1H                    DISPL TO OP5                         86328021
XSIEND EQU   *                                                          86336021
******************************                                          86344021
*      SWITCHES                                                         86352021
*                                                                       86360021
XXXYY  DS    1C                                                         86368021
XGSWT  DS    1C               GENERAL SWITCH FOR THE COMPUTE STAT.      86376021
XOPMOD DS    1C               GENERAL SWITCH FOR ONE OPERATION   .      86384021
XSESWT DS    1C               SWITCH FOR SETVAL ROUTINE.                86392021
*                                                                       86400021
XHINTS DS    1C               SWITCH FOR SETMODE ROUTINE.               86408021
XYLEN  DS    1C               LENGHT OF TS.WANTED.                      86416021
XSLSW  DS    1C               SWITCH FOR LOAD REGISTER ROUTINE.         86424021
XZCSW  DS    1C               SWITCH FOR BINARY MULTIPLY ROUTINE.       86432021
XZSWT  DS    1C               SWITCH FOR A-TEXT SET-UP XZBINA ROUTI     86440021
XSTRSW   DS    1C           SW TO INDICATE BEG OF STRING IN CALL        86448021
XREGNO DS    1C               REG NUMBER NEWLY ASSIGNED.                86456021
XREGNP DS    1C               EVEN REG NUMBER OF A PAIR NEWLY ASSIG     86464021
XMONDD DS    1C                         DIVIDE  STATEMENT ALL BY IT     86472021
*                                                                       86480021
XGNSW  DC    X'00'                                                      86488021
RJSW     DC    X'00'                                                    86496021
PADSW    DC    X'00'                                                    86504021
SCHSW  DC    X'00'                USED IN SSCRPT TO TELL IF CONTROL     86512021
*                                 HAS COME FROMSEARCHAL                 86520021
INDXSW DC    X'0'                 INDEXNAME FOLLOWED BY LITERAL SW      86528021
X1TYP  DC    X'00'                                                      86536021
X2TYP  DC    X'00'                                                      86544021
XSZTRA DS    1H              ON SIZE TRANSFER VALUE.                    86552021
XZRTRA DS    1H                                                         86560021
IFINCODE DC X'00'                  HOLDS BRANCHING CODE FOR             86568021
IFINCOD2 DC    X'00'               'IF INDEX-NM'                        86576021
XT3    DS    1C                                                         86584021
XCPSW  DS    1C                                                         86592021
XSPSW  DS    1C                                                         86600021
*                                                                       86608021
*      ERROR MESSAGES BUFFER.                                           86616021
XMSGDF DC    X'000600'             CODE FOR ERROR MSG                   86624021
       DC    X'0000'                    MESSAGE NUMBER.                 86632021
       DC    X'0000'                    CARD NUMBER.                    86640021
       DC    X'05'                      SEVERITY,PHASE NUMBER.          86648021
XSTORE   DS    2F                                                       86656021
**************************                                              86664021
*                                                                       86672021
INCODE   EQU   X'5C'                                                    86680021
TS4DATA  EQU   X'38'                                                    86688021
TS2CODE  EQU   X'30'                                                    86696021
TS3CODE  EQU   X'54'                                                    86704021
TS4CODE  EQU   X'58'                                                    86712021
SCHASCN  EQU   X'10'                                                    86720021
         DS    0F                                                       86728021
AXTIDK   DC    X'00'               IDK OF TABLE IN                      86736021
         DC    X'000000'           SEARCH ALL                           86744021
KEYDC  DS    12F                 USED BY SEARCH ALL PROCESSING          86752021
       SPACE 2                                                          86760021
*      OPERAND  INFORMATION BUFFERS.                                    86768021
*                                                                       86776021
       DS    0D                                                         86784021
XBSW1  EQU   *                                                          86792021
X1VAL  DS    2D               COMPILE-TIME VALUE IN ID.                 86800021
X1LAS  DS    1H               LENGHT AFTER SCALING IN ID.               86808021
X1BAS  DS    1H                 -      -      -    IN BINARY.           86816021
X1FAS  DS    1H               NUMBER OF DIGITS AFTER SCALING.           86824021
X1DAS  DS    1H               NUMBER OF DECIMAL PLACES AFTER SCALIN     86832021
X1TEL  DS    1H               LENGHT OCCUPIED IN WORKING STORAGE.       86840021
X1TEM  DS    1H               RELATIVE POINTER IN WORKING STORAGE.      86848021
X1IRX  DS    1H               RX NUMBER - FLAGS CONCERNING OPERAND.     86856021
X1LBS  DS    1H               LENGHT BEFORE SCALING IN ID.              86864021
X1BBS  DS    1H                 -      -      -     IN BINARY.          86872021
X1FBS  DS    1H               NUMBER OF DIGIT BEFORE SCALING.           86880021
X1DBS  DS    1H                 -    -  DECIMAL  -     -                86888021
X1ALP  DS    1H               SCALING FACTOR .                          86896021
X1IRN  DS    1H                                                         86904021
X1NPS  DS    1H                                                         86912021
X1DDP  DS    1H               NUMBER OF DECIMAL TO BE DROPPED AFTER     86920021
X1IND  DS    1H                   -  -  INTEGERS -  -    -      -       86928021
*                                                                       86936021
*                                                                       86944021
X1INPT DS    1F                                                         86952021
XBSW2  EQU   *                                                          86960021
XLEVAL EQU   XBSW2-XBSW1                                                86968021
       SPACE 2                                                          86976021
X2VAL  DS    2D               **  2ND OPERAND BUFFER  **                86984021
X2LAS  DS    1H                                                         86992021
X2BAS  DS    1H                                                         87000021
X2FAS  DS    1H                                                         87008021
X2DAS  DS    1H                    SEE                                  87016021
X2TEL  DS    1H                     FIRST                               87024021
X2TEM  DS    1H                       OPERAND                           87032021
X2IRX  DS    1H                        BUFFER                           87040021
X2LBS  DS    1H                                                         87048021
X2BBS  DS    1H                                                         87056021
X2FBS  DS    1H                                                         87064021
X2DBS  DS    1H                                                         87072021
X2ALP  DS    1H                                                         87080021
X2IRN  DS    1H                                                         87088021
X2NPS  DS    1H                                                         87096021
X2DDP  DS    1H                                                         87104021
X2IND  DS    1H                                                         87112021
*                                                                       87120021
*                                                                       87128021
X2INPT DS    1F                                                         87136021
       DS    0D                                                         87144021
       SPACE 2                                                          87152021
XBSW3  EQU   *                                                          87160021
XFVAL  DS    2D               **  RESULT FIELD BUFFER  **               87168021
XFLAS  DS    1H                                                         87176021
XFBAS  DS    1H                                                         87184021
XFFAS  DS    1H                    SEE                                  87192021
XFDAS  DS    1H                     FIRST                               87200021
XFTEL  DS    1H                      OPERAND                            87208021
XFTEM  DS    1H                       BUFFER                            87216021
XFIRX  DS    1H                                                         87224021
XFIRN  DS    1H                                                         87232021
XFDDP  DS    1H                                                         87240021
XFIND  DS    1H                                                         87248021
XEBSW1 EQU   *                                                          87256021
XFLVAL EQU   XEBSW1-XBSW3                                               87264021
XLSW1  EQU   XEBSW1-XBSW1                                               87272021
*                                                                       87280021
       DS    0D                                                         87288021
XRVAL  DS    2D                   ** TEMPORARY RESULT BUFFER **         87296021
XRLAS  DS    1H                                                         87304021
XRBAS  DS    1H                                                         87312021
XRFAS  DS    1H                                                         87320021
XRDAS  DS    1H                    SEE                                  87328021
XRTEL  DC    H'0'                   FIRST                               87336021
XRTEM  DS    1H                      OPERAND                            87344021
XRIRX  DS    1H                       BUFFER                            87352021
XRLBS  DS    1H                                                         87360021
XRBBS  DS    1H                                                         87368021
XRFBS  DS    1H                                                         87376021
XRDBS  DS    1H                                                         87384021
XRALP  DS    1H                                                         87392021
XRIRN  DS    1H                                                         87400021
XRNPS  DS    1H                                                         87408021
XRDDP  DS    1H                                                         87416021
XRIND  DS    1H                                                         87424021
XRINPT DS    1F                                                         87432021
         SPACE 2                                                  41562 87440021
XQSW     DS    0D                                                 41562 87448021
XQVAL    DS    2D        TEMPORARY RESULT FOR DIVIDE REMAINDER    41562 87456021
XQLAS    DS    H                       DIVISOR                    41562 87464021
XQBAS    DS    H                                                  41562 87472021
XQFAS    DS    H                                                  41562 87480021
XQDAS    DS    H                                                  41562 87488021
XQTEL    DS    H                                                  41562 87496021
XQTEM    DS    H                                                  41562 87504021
XQIRX    DS    H                                                  41562 87512021
XQLBS    DS    H                                                  41562 87520021
XQBBS    DS    H                                                  41562 87528021
XQFBS    DS    H                                                  41562 87536021
XQDBS    DS    H                                                  41562 87544021
XQALP    DS    H                                                  41562 87552021
XQIRN    DS    H                                                  41562 87560021
XQNPS    DS    H                                                  41562 87568021
XQDDP    DS    H                                                  41562 87576021
XQIND    DS    H                                                  41562 87584021
XQINPT   DS    F                                                  41562 87592021
         SPACE 2                                                  41562 87600021
XKVAL    DS    2D        TEMPORARY RESULT FOR DIVIDE REMAINDER    41562 87608021
XKLAS    DS    H                      DIVIDEND                    41562 87616021
XKBAS    DS    H                                                  41562 87624021
XKFAS    DS    H                                                  41562 87632021
XKDAS    DS    H                                                  41562 87640021
XKTEL    DS    H                                                  41562 87648021
XKTEM    DS    H                                                  41562 87656021
XKIRX    DS    H                                                  41562 87664021
XKLBS    DS    H                                                  41562 87672021
XKBBS    DS    H                                                  41562 87680021
XKFBS    DS    H                                                  41562 87688021
XKDBS    DS    H                                                  41562 87696021
XKALP    DS    H                                                  41562 87704021
XKIRN    DS    H                                                  41562 87712021
XKNPS    DS    H                                                  41562 87720021
XKDDP    DS    H                                                  41562 87728021
XKIND    DS    H                                                  41562 87736021
XKINPT   DS    F                                                  41562 87744021
XKSW     EQU   *                                                  41562 87752021
XQKLEN   EQU   XKSW-XQSW                                          41562 87760021
DIVREMSW DC    X'00'                                              41562 87768021
XEBSW4 EQU   *                                                          87776021
         EJECT                                                    44300 87784021
         ORG   XBSW1              OVERLAY ARITH BUF FOR SUBSCRIPTS      87792021
****************************************************************  44300 87800021
XSL1   DS    1F               LENGTH FOR 1ST LEVEL SUBSCRIPT      44300 87808021
XSL2   DS    1F               LENGTH FOR 2ND LEVEL SUBSCRIPT      44300 87816021
XSL3   DS    1F               LENGTH FOR 3RD LEVEL SUBSCRIPT      44300 87824021
****************************************************************  44300 87832021
XSVLC1 DS    1H               VLC    FOR FIRST LEVEL SUBSCRIPT.         87840021
XSVLC2 DS    1H               VLC    FOR SECOND LEVEL SUBSCRIPT.        87848021
XSVLC3 DS    1H               VLC    FOR THIRD LEVEL SUBSCRIPT.         87856021
****************************************************************  44300 87864021
IXLIT1 DS    1H          IF RELATIVE INDEXING IS BEING USED       44300 87872021
IXLIT2 DS    1H               E.G.  A (INDEX + 4)                 44300 87880021
IXLIT3 DS    1H          THE LITERALS ARE SAVED IN THIS TABLE     44300 87888021
****************************************************************        87896021
*  SUBSCRIPT AND INDEX TABLE  (XSCRPT)                                  87904021
*                                                                       87912021
*DEL                                                               4430 87920021
XSSUBN DS    1F                   BYTE 0-1  ENTRY LENGTH                87928021
*                                      2-3  NUMB OF SS OR INDEXES       87936021
XSNIDK DS    1F                   UPDATED I,D,K                         87944021
*                                 IF COMPUTAT IS IN A REG-              87952021
*                                           BYTE 1 - 30                 87960021
*                                                2 - REG NUMB           87968021
*                                 IF COMPUTAT IS IN A SS CELL           87976021
*                                           BYTE 1 - 60                 87984021
*                                           BTS 2,3 - SBS NUMB          87992021
XSOIDK DS    1F                   OLD DICT PTR                          88000021
* FOR NEXT THREE ENTRIES-IF DATA-NAME SUBS OR INDEX-NAME -              88008021
*                                      DICT PTR                         88016021
*                        IF LITERAL SUBS -                              88024021
*                                      BINARY VALUE, BYTE0- '80'        88032021
XSSKK  DS    1F                   FIRST LEVEL SS OR INDEX               88040021
XSSJJ  DS    1F                   SECOND  -   -  -    -                 88048021
XSSII  DS    1F                   THIRD   -   -  -    -                 88056021
****************************************************************        88064021
*DEL                                                               4430 88072021
XSUCNT DS    1H               SUBSCRIPT COUNT.                          88080021
XSENPT DS    1F                                                         88088021
****************************************************************        88096021
*  SUBSCRIPT AND INDEX ID TABLE  (XSSNT)                                88104021
*                                                                       88112021
XSIDNB DS    1H                   ID NUMB OF SUBS OR INDEX COMP         88120021
XSNPT  DS    1H                   PTR TO OLD DICT PTR ENTRY IN          88128021
*                                 XSCRPT TABLE                          88136021
****************************************************************        88144021
XSOPT  DS    1H               POINTER  TO  OLD  I,D,K                   88152021
XSUTMP DS    2D                                                         88160021
****************************************************************  44300 88168021
SAVER0 DS    1F                                                   44300 88176021
SAVER1 DS    1F                                                   44300 88184021
****************************************************************  44300 88192021
*DEL                                                               4430 88200021
         ORG   XEBSW4             REPOSITION AFTER ARITH BUFFER         88208021
         EJECT                                                    44300 88216021
*      REGISTER  TABLES .                                               88224021
*                                                                       88232021
       DS    0F                                                         88240021
XRAUR2 DS    1H               INTER. RESULT POINTER IF USED BY AN I     88248021
         DS    1CL1                FLAG WORD FOR THIS REGISTER          88256021
         DC    X'3'                REGISTER NUMBER                      88264021
         DC    A(XRAU22)           POINTER TO OTHER REGISTER OF PAIR    88272021
       SPACE 1                                                          88280021
XRAUR1 DS    1H                    SEE ABOVE                            88288021
         DS    1CL1                                                     88296021
         DC    X'5'                                                     88304021
         DC    A(XRAUR4)                                                88312021
       SPACE 1                                                          88320021
XRAUR3 DS    1H                    SEE ABOVE                            88328021
         DS    1CL1                                                     88336021
         DC    X'1'                                                     88344021
         DC    A(XRAU14)                                                88352021
       SPACE 1                                                          88360021
XRAU22 DS    1H                    SEE ABOVE                            88368021
         DS    1CL1                                                     88376021
         DC    X'2'                                                     88384021
         DC    A(XRAUR2)                                                88392021
       SPACE 1                                                          88400021
XRAUR4 DS    1H                    SEE ABOVE                            88408021
         DS    1CL1                                                     88416021
         DC    X'4'                                                     88424021
         DC    A(XRAUR1)                                                88432021
       SPACE 1                                                          88440021
XRAU14 DS    1H                    SEE ABOVE                            88448021
         DS    1CL1                                                     88456021
         DC    X'0'                                                     88464021
         DC    A(XRAUR3)                                                88472021
       SPACE 2                                                          88480021
*=1  DATA AREA FOR NON ARITHMETIC (BILL).                               88488021
       DS      0F                                                       88496021
LENGTH DC      1F'00000004'       *** DUMMY *** DUMMY *** DUMMY ***     88504021
DISPNN DS      1F                    TOTAL OPERAND COUNTER              88512021
EXHIBP DS    1F                    BIT PATTERN BUILD CELL               88520021
DIFPNN DC    XL2'0000'                                                  88528021
DIPARE DC    1H'0000'                                                   88536021
MASKOP   DC    F'56'                   MASK                             88544021
*    NON-ALIGNED WORK CELLS                                             88552021
       DS    0F                                                         88560021
SORSFN DS    5C                    SAVES FRON OF SFN - KEEP WD BOUN     88568021
DNMINR DC    XL1'00'               CALCLG SAVES MINOR OF DN'S HERE      88576021
SORDN1 DC    XL6'00'               SORT RECORD DN THRU BL NUMBER        88584021
ASRLAS DC    XL1'87'               LAST HEADER                          88592021
PR35M  DS      1H                                                       88600021
CDNOSW DC      XL1'0'              CARD NUMBER PRECEEDS STRING SW.      88608021
FLAGSW DC    XL1'00'                                                    88616021
LOOKAH DC      XL1'00'             LOOK AHEAD SW                        88624021
MADCSW DC    X'00'     DSPLTP SW                                        88632021
QRTNSW DC    XL1'00'               Q-ROUTINES IN EFFECT WHEN SW SWT     88640021
WRITSW   DC    XL1'00'             WRITE/REWRITE FLAGS            59733 88648021
         TITLE 'DIRECT A-TEXT VARIABLE TEXT    V  A  R  I  A  B  L  E'  88656021
*                                                                       88664021
*                                                                       88672021
* DIRECT A-TEXT WRITE OUT STRINGS REQUIRING CHANGES. THOSE STRINGS      88680021
*   NOT REQUIRING CHANGES ARE IN THE CONSTANT AREA                      88688021
*                                                                       88696021
*   TO ADD NEW DIRECT A-TEXT STRINGS, USE THE NEXT HIGHEST NUMBER,      88704021
*            BEYOND THE HIGHEST PREVIOUS NUMBER USED, =MM.              88712021
*      A)    SET UP TEXT IN THE... CONSTANT AREA IF NO BYTE IS CHAN     88720021
*                              ... DATA AREA IF ONE OR MORE BYTES C     88728021
*            FORMAT...                                                  88736021
*            ATXTNN  EQU  *                                             88744021
*                    DC    XL'...       ONE DC PER INSTRUCTION...       88752021
*            ZTXTNN  EQU  *                                             88760021
*                      (IF ANY BYTE IS CHANGABLE, LABEL IT ANNCH1,      88768021
*      B)    THE CALLING SEQUENCE IS...                                 88776021
*                                  BAL  RETRG,GATXTC       (OR, GAT     88784021
*                                  DC   AL2(ATXTNN-ATXTBC) (OR, GAT     88792021
*                                  DC   AL2(ZTXTNN-ATXTNN)              88800021
*...... THE FOLLOWING ARE POINTERS TO AREAS OF CHANGES...               88808021
*                                  CONSTANT A-TEXT STARTING POINT       88816021
*                                  VARIABLE A-TEXT FOLLOWS...           88824021
*                                                                       88832021
ATXTBV EQU   *                                                          88840021
ATXT48 EQU   *                                                          88848021
       DC    XL1'44'               FREE, RESERVE, DESTROY               88856021
A48CH2 DC    XL1'00'                                                    88864021
       DC    XL1'A0'               REGISTER REF                         88872021
A48CH1 DC    XL1'00'          FREE, RESERVE OR DESTROY MACRO, ANY R     88880021
ZTXT48 EQU   *                                                          88888021
ATXT49   EQU   *                                                        88896021
         DC    X'4858F0'               L  15,GN                         88904021
         DC    X'50'                   GN                               88912021
A49CH1   DC    X'0000'                 CODE                             88920021
         DC    X'48051F'               BALR 1,15                        88928021
         DC    X'4430'                 DESTROY 15                       88936021
         DC    X'A00F'                 CODE FOR R15                     88944021
         DC    X'48D20A70E00C70D000'   MVC 12(11,14),0(13)              88952021
         DC    X'4430'                 MACRO CODE                       88960021
         DC    X'A00E'                 DESTROY 14                       88968021
         DC    X'34'                   GN DEF   SVC                     88976021
A49CH2   DC    X'0000'                 ENTER GN HERE                    88984021
         DC    X'480A05'               VERB CODE                        88992021
ZTXT49   EQU   *                                                        89000021
ATXT50   EQU   *                                                        89008021
         DC    X'485810700014'         L  1,20                          89016021
         DC    X'480A21'               SVC                              89024021
ZTXT50   EQU   *                                                        89032021
PR35SV DC      1F'00000000'                                             89040021
REMLGH   DS    1F                                                       89048021
MYSAVE DS    1F                   TSTRPD RTN SAVES R14 HERE             89056021
       DS    0F                                                         89064021
ELEMTB DS    620C                  DOPS 1 THRU 5 HERE                   89072021
RPEQU  EQU   *                                                          89080021
*                                                                       89088021
*=1    DATA AREAS FOR REPORT MOVE ANALYZER                              89096021
*                                                                       89104021
*                                                                       89112021
*                                                                       89120021
       ORG   *-230            ALLOWS FOR EDIT PATTERN > DOP3 AREA       89128021
       DS    0F                                                         89136021
RPDATA EQU   *                                                          89144021
*                                                                       89152021
* GENERATION SWITCHES.  IF OFF, = 0.                                    89160021
*                       IF ON,  = LENGTH OF ASSOC. INSTRUCTION(S).      89168021
*                       FOR SPECIFIC INSTRUCTIONS, SEE COMMENTS TO      89176021
*                       RPGEN.                                          89184021
*                                                                       89192021
RBWZL1 DS    1H                                                         89200021
RBWZL2 DS    1H                                                         89208021
RBWZL3 DS    1H                                                         89216021
RBWZL4 DS    1H                                                         89224021
RSGNL1 DS    1H                                                         89232021
RSGNL2 DS    1H                                                         89240021
RSGNL3 DS    1H                                                         89248021
RINSL1 DS    1H                                                         89256021
RINSL2 DS    1H                                                         89264021
*                                                                       89272021
RBWZIL DS    1H                                                         89280021
RFLTIL DS    1H                                                         89288021
RSGNIL DS    1H                                                         89296021
RDOLIL DS    1H                                                         89304021
RINSIL DS    1H                                                         89312021
RPTOTL DS    1H                                                         89320021
*                                                                       89328021
* DISPLACEMENTS IN TEMPORARY STORAGE                                    89336021
*                                                                       89344021
RPIDD  DS    1H                    SOURCE FIELD (IN TS1)                89352021
RPTS2D DS    1H                    PATTERN                              89360021
RPSGND DS    1H                    SIGN                                 89368021
RPDECD DS    1H                    DECIMAL POINT                        89376021
RPDOLD DS    1H                    DOLLAR SIGN                          89384021
RPLAD  DS    1H                    ADDR FOR INITIALIZING LA IF PRES     89392021
RPLSTD DS    1H                    LAST NUM POS AT GIVEN TIME IN SC     89400021
* LENGTHS AND COUNTS                                                    89408021
*                                                                       89416021
RPLM1  DS    1H                    NO. INS. CHARS. TO OVERLAY W. FI     89424021
RPLINL DS    1H                    COUNT OF LEFT HAND INS. CHARS.       89432021
RPRINL DS    1H                    COUNT OF RIGHT HAND INS. CHARS.      89440021
RPEVNL DS    1H                    = 1 IF NO. SRC DIGITS IS EVEN        89448021
RPNMCT DS    1H                    COUNT OF NUMERIC POSITIONS           89456021
*                                                                       89464021
* SWITCHES                                                              89472021
*                                                                       89480021
RPNUMS DS    1C                    TURNED ON BY 1ST NUM. CHAR.          89488021
RPSTRS DS    1C                    ON IF FLT. OR SUPP. STRING GOING     89496021
RPCHAR DS    1C                    CHAR TO BE PROPAGATED BY RPPROP      89504021
RPSIGN DS    1C                    + OR -                               89512021
RPBCHR DS    1C                    SUPPRESSION CHAR. (BLANK OR *)       89520021
RTSEDS DS    1C                    IF ON, SOURCE IS IN TS1              89528021
*                                                                       89536021
* SAVED ADDRESSES                                                       89544021
*                                                                       89552021
RPLAST DS    1F                    ADDR OF FINAL RPT PICTURE CHAR       89560021
RPLSTN DS    1F                    ADDR OF LAST NUM CHAR SCANNED        89568021
RPSNSV DS    1F                    TO SAVE XRSUB ON ENTRY TO RPSNM      89576021
         ORG   RPEQU              REPOSITION AFTER ALL DC AND DS        89584021
*                                                                       89592021
         TITLE 'E  Q  U  A  T  E  S'                                    89600021
RW0    EQU   0                                                          89608021
R0     EQU     0     'ACCUMULATOR'                                      89616021
RW1    EQU     1      INDEX AND WORK REGISTERS                          89624021
RW2    EQU     2      *                                                 89632021
RW3    EQU     3      *                                                 89640021
RW4    EQU     4      *                                                 89648021
RW5    EQU     5      *                                                 89656021
RW6    EQU     6      *                                                 89664021
RB1    EQU   8                                                          89672021
STNGR  EQU   9                                                          89680021
MCARD  EQU     X'81'   CARD NUMBER CODE                                 89688021
MATEXT   EQU   X'37'                                                    89696021
OPSIZ  EQU   124   MAX SIZE NEEDED FOR ENTRIES IN ELEMTB                89704021
ANALNO EQU     HEADER+1 ANALYZER NUMBER                                 89712021
ELEMCT EQU     HEADER+2 ELEMENT COUNT                                   89720021
*        EQUATES FOR EXAMINE ANALYZER AND A TEXT GENERATOR              89728021
OPD1   EQU   4                                                          89736021
OPD2   EQU   5                                                          89744021
OPD3   EQU   6                                                          89752021
GR1    EQU   0                                                          89760021
GR15   EQU     15                                                       89768021
GRX    EQU   0                                                          89776021
GRX1   EQU   1                                                          89784021
GRY    EQU   2                                                          89792021
GRY1   EQU   3                                                          89800021
GXRA   EQU   9                                                          89808021
HFWORD EQU     X'80'         1 IF HALFWORD WANTED                       89816021
TWOADR EQU     X'40'         1 IF SS TYPE INSTRUCTION                   89824021
GAD1DN EQU   1        1 IF ADR 1 DONE                                   89832021
DECBIN EQU   X'20'           1 IF WANT DEC TO BIN CONVERSION            89840021
DBLFPT EQU   X'10'           1 IF DOUBLE FLOATING POINT                 89848021
DECOP  EQU   X'04'           1 IF DECIMAL OP                            89856021
SPREG  EQU   X'FF'                'I' FLD IN SPEC REG IDK               89864021
RETRG  EQU   14                                                         89872021
XRA    EQU   1                                                          89880021
XRB    EQU   2                                                          89888021
XRC    EQU   1                                                          89896021
GBRG1  EQU   11              BASE REGISTER FOR EXAMINE AND A TEXT       89904021
GR14   EQU   3                                                          89912021
QR     EQU   1                     Q ROUTINE REGISTER ASSIGNMENTS       89920021
QR2    EQU   2                                                          89928021
QR3    EQU   3                                                          89936021
         EJECT                                                          89944021
*   STANDARD EQUATES FOR BC INSTRUCTIONS                                89952021
UNCOND EQU   15                                                         89960021
HI     EQU   2                                                          89968021
LO     EQU   4                                                          89976021
EQ     EQU   8                                                          89984021
NOTHI  EQU   13                                                         89992021
NOTLO  EQU   11                                                         90000021
NOTEQ  EQU   7                                                          90008021
NEG    EQU   4                                                          90016021
ZERO   EQU   8                                                          90024021
NOTNEG EQU   11                                                         90032021
NOTZER EQU   7                                                          90040021
ONE      EQU   1                                                        90048021
ONES   EQU   1                                                          90056021
MIXED  EQU   4                                                          90064021
NOTONE EQU   14                                                         90072021
NOTMXD EQU   11                                                         90080021
NOP    EQU   0                                                          90088021
GMCTYP EQU   IMM                                                        90096021
DOP1   EQU   ELEMTB                                                     90104021
DOP2   EQU   ELEMTB+OPSIZ*1                                             90112021
DOP3   EQU   ELEMTB+OPSIZ*2                                             90120021
DOP4   EQU   ELEMTB+OPSIZ*3                                             90128021
DOP5   EQU   ELEMTB+OPSIZ*4                                             90136021
SBEGIN EQU   ELEMTB+OPSIZ*3       BEG OF SORT WORK BUFFER               90144021
RPPAT  EQU   DOP3+2                                                     90152021
RPPATM EQU   DOP3+1                                                     90160021
FIVEGN EQU   GNCTR                                                      90168021
GCNLGN EQU   COUNT-XL1+1     LENGTH FOR CLEARING WORK AREA              90176021
DON    EQU   PH5CTL                                                     90184021
SIGNED EQU   1                                                          90192021
POSI   EQU   X'0F'                                                      90200021
HIBITS EQU   X'0F'               TURN OFF HIGH ORDER 4 BITS             90208021
       EJECT                                                            90216021
*=1  EQU'S FOR ARITHMETIC.                                              90224021
*      TAMER  DEFINITION  OF TIB  -                                     90232021
*                                                                       90240021
XSEGM  EQU   TIB15-COS                                                  90248021
XINTR  EQU   TIB1-COS              INTERMEDIATE RESULT TABLE            90256021
XAVAL  EQU   TIB2-COS              TEMP. STORAGE AVAL. TABLE            90264021
XSCRPT EQU   TIB3-COS              SUBSCRIPT-INDEX TABLE                90272021
XSSNT  EQU   TIB4-COS              SUBSCRIPT-INDEX ID TABLE             90280021
PNUTBL EQU   TIB6-COS              PN USE TABLE                         90288021
RUNTBL   EQU   TIB35-COS                                                90296021
*                                                                       90304021
*  TAMER ADCONS                                                         90312021
XPRIM  EQU   APRIME                                                     90320021
XINST EQU   AINSRT                                                      90328021
XTABL  EQU   RELADD                                                     90336021
******************************                                          90344021
*                                                                       90352021
*                                                                       90360021
*      ERROR MESSAGES NUMBER.                                           90368021
*                                                                       90376021
ERRN01 EQU   1                                                          90384021
*               ERROR NO  1.LOGIC ERROR IN XRDBIR ROUTINE.              90392021
ERRN02 EQU   2                                                          90400021
*               ERROR NO  2.LOGIC ERROR IN SSCRPT ROUTINE.              90408021
ERRN03 EQU   3                                                          90416021
*               ERROR NO  3.LEVEL 1 - DIVISOR IS 0.                     90424021
ERRN04 EQU   4                                                          90432021
*                 ERROR NO. 4. TRUNCATION OF AN. SENDING FIELD          90440021
ERRN05 EQU   5                                                          90448021
*               ERROR NO  5.LOGIC ERROR IN MOVE PROCESSOR.              90456021
ERRN06 EQU   6                                                          90464021
*               ERROR NO  6.LOGIC ERROR IN MOVE OR STORE PROCESSOR.     90472021
ERRN07 EQU   7                                                          90480021
*               ERROR NO 7.LOGIC ERROR IN XSETVL ROUTINE.               90488021
ERRN08 EQU   8                                                          90496021
*               ERROR NO  8.LOGIC ERROR IN FPCVBH ROUTINE.              90504021
ERRN09 EQU   9                                                          90512021
*               ERROR NO  9.LOGIC ERROR IN XSUDB3 ROUTINE.              90520021
ERRN10 EQU   10                                                         90528021
*               ERROR NO 10.LEVEL 1.TRUNCATION OF A LIT INT. RES.       90536021
ERRN11 EQU   11                                                         90544021
*               ERROR NO 11.LEVEL 0. POSSIBLE TRUNCATION OF AN IN.      90552021
*                                                                       90560021
ERRN12 EQU   12                                                         90568021
*               ERROR NO 12.LOGIC ERROR.LOST IR IN XINTR TABLE(XINS     90576021
ERRN13 EQU   13                                                         90584021
*            ERROR NUMB.13 COMPARISON OF TWO LITERALS  LEVEL 1          90592021
ERRN14   EQU   14                                                       90600021
*              ERROR NO 14. KEY IN SEARCH ALL AT INVALID OFFSET         90608021
ERRN15 EQU   15                                                         90616021
*              ERROR NO 15. INVALID USE OF SPECIAL REGISTER             90624021
ERRN16 EQU   16                                                         90632021
*              ERROR NO. 16. MORE THAN 255 SUBSCRIPT CELLS USED.        90640021
ERRN17 EQU   17                                                         90648021
*              ERROR NO. 17. EXHIBIT CHANGED OPERAND GR                 90656021
*                  THAN 256 BYTES. ASSUME 256.                          90664021
ERRN18 EQU   18                                                         90672021
*            NAME OF IDENTIFIER IN EXHIBIT EXCEEDS MAXIMUM.             90680021
*            TRUNCATED TO 120.                                          90688021
       SPACE 2                                                          90696021
*      REG.DEFINITION-                                                  90704021
*      WORK REGISTERS-                                                  90712021
XR0    EQU   0                                                          90720021
XR1    EQU   1                                                          90728021
XR2    EQU   2                                                          90736021
XR3    EQU   3                                                          90744021
XR4    EQU   4                                                          90752021
XR5    EQU   5                                                          90760021
XR6    EQU   6                                                          90768021
R1       EQU   1                                                  45693 90776021
R2       EQU   2                                                  45693 90784021
R3       EQU   3                                                  45693 90792021
R4       EQU   4                                                  45693 90800021
R5       EQU   5                                                  45693 90808021
R6       EQU   6                                                  45693 90816021
R13    EQU   13                                                         90824021
FRW0   EQU   0                                                          90832021
XR15   EQU   15                                                         90840021
       SPACE 2                                                          90848021
*      BASE REGISTERS-                                                  90856021
XRBAS1 EQU   7                BASE REG FOR ARITH.                       90864021
XRBAS2 EQU   10                 -   -    -   -  .                       90872021
XRDATA EQU   13                                                         90880021
XRCONS EQU   12                 -   -    - CONSTANTS.                   90888021
XRVAR  EQU   15               VARIABLE BASE REG.                        90896021
XRVERB EQU   STNGR            VERBE REGISTER.                           90904021
XRSUB  EQU   14               LINKAGE REGISTER.                         90912021
R15      EQU   15                                                       90920021
WORKAB   EQU   96                                                       90928021
       SPACE 2                                                          90936021
*************************                                               90944021
*      TRANSFER CODES                                                   90952021
       SPACE 2                                                          90960021
UNCON  EQU   15                                                         90968021
NOTHR  EQU   X'E'                                                       90976021
XZERO  EQU   8                                                          90984021
XONE   EQU   4                                                          90992021
XTWO   EQU   2                                                          91000021
XTHRE  EQU   1                                                          91008021
XNOEQ  EQU   7                                                          91016021
XNOGT  EQU   X'D'                                                       91024021
XLOEQ  EQU   X'C'                                                       91032021
XGTEQ  EQU   X'A'                                                       91040021
       SPACE                                                            91048021
*      FLAG IN XGSWT                                                    91056021
*                     1) FLAGS ATTACHED TO THE WHOLE COMPUTE OR IF      91064021
XROUND EQU   1                ROUND OPTION                              91072021
XSIZER EQU   2                ON SIZE ERROR OPTION.                     91080021
XADDCR EQU   4                         ADD CORRESPONDING (END OF).      91088021
XRFLPT EQU   8                         STORE FIELD IS FLOATING POIN     91096021
*                     2) FLAGS ATTACHED TO AN OPERATION.                91104021
XSNONU EQU   X'10'           USED FOR SIZE ERROR IN FP CONVERSION       91112021
XIDMOD EQU   X'20'            ID MODE.                                  91120021
XAROPE EQU   X'40'            ARITH. OPERATION.                         91128021
XBIMOD EQU   X'80'            BINARY MODE.                              91136021
*                                                                       91144021
*                                                                       91152021
*               FLAGS IN XGNSW                                          91160021
*      EQU   1                          USED BY XOTSEM ROUTINE.         91168021
XZRDIV EQU   2                                                          91176021
*      EQU   4                          USED FOR ADD CORRESPONDING.     91184021
XADABA EQU   8                                                          91192021
XDIVON EQU   X'10'                      FLAG FOR MINUS EXPONENT         91200021
*      EQU   X'20'           MESSAGE 11 ALREADY PRINTED.                91208021
DIVREM EQU   X'40'               THIS IS DIVIDE ROUNDED REMAINDER       91216021
ADDONE EQU   X'80'               ONE HAS BEEN ADDED TO # OF DEC         91224021
       SPACE 2                                                          91232021
*      FLAGS IN XOPMOD.                                                 91240021
*                                                                       91248021
*      EQU   1                          NOT USED.                       91256021
XFLOAT EQU   2                FLOATING-POINT MODE OPERAND.              91264021
XADDFL EQU   4                ADD OR SUB OPERATION.                     91272021
XMULFL EQU   8                MULTIPLY OP.                              91280021
XDIVOR EQU   X'10'            DIVISOR.                                  91288021
XDIVFL EQU   X'20'            DIVISION OP.                              91296021
XXSUB  EQU   X'40'            SUBSTRACTION FLAG.                        91304021
XALLSN EQU   X'80'                      ALL  SUBSCRIPTS ARE NUMERIC     91312021
       SPACE 2                                                          91320021
XMUDV  EQU   XMULFL+XDIVOR                                              91328021
XMUDVF EQU   XMULFL+XDIVFL                                              91336021
       SPACE 2                                                          91344021
*      FLAGS  IN  X1IRX+1 IN OPERAND INFOR. BUFFER.                     91352021
*                                                                       91360021
XG2IRX EQU   1                REG USED IN DP MODE.                      91368021
XGOVFL EQU   2                OVERFLOW MIGHT OCCUR IN THE OPERATION     91376021
*                             PROCESS ON THIS OPERAND.                  91384021
XGDPFP EQU   4                DP FLOATING POINT.                        91392021
XINREG EQU   8                OPERAND IS IN A REG.                      91400021
XLITER EQU   X'10'            OP. IS A LITERAL.                         91408021
XFTPT  EQU   X'20'                      OP. IS FP.                      91416021
XGNCON EQU   X'40'            OP. IS A GENERATED CONSTANT.              91424021
XLITZR EQU   X'80'            OP. IS A ZERO LITERAL.                    91432021
       SPACE 2                                                          91440021
XIN2RE EQU   XINREG+XG2IRX                                              91448021
XGCOLT EQU   XGNCON+XLITER                                              91456021
XZGNLT EQU   XGCOLT+XLITZR                                              91464021
*                                                                       91472021
FP2DP  EQU   XG2IRX+XGDPFP                                              91480021
       SPACE 2                                                          91488021
       SPACE 2                                                          91496021
*      TYPES                                                            91504021
*                                                                       91512021
XGGPFL EQU   1                FIXED LENGHT GROUP.                       91520021
XGALB  EQU   2                ALPHABETIC.                               91528021
XGALN  EQU   3                ALPHANUMERIC.                             91536021
XGGPVL EQU   4                VARIABLE LENGHT GROUP.                    91544021
XGEXDC EQU   8                EXTERNAL DECIMAL.                         91552021
XGEXFP EQU   9                   -     FLOATING POINT.                  91560021
XGINFP EQU   X'0A'            INTERNAL   -       -   .                  91568021
XGBINR EQU   X'0B'            BINARY.                                   91576021
XGINDC EQU   X'0C'            INTERNAL DECIMAL.                         91584021
XGANE    EQU   X'0E'                                                    91592021
       SPACE 2                                                          91600021
*      INPUT CODES DEFINITION.                                          91608021
*                                                                       91616021
XGIRI  EQU   X'BA'                                                      91624021
TEMRES EQU   X'BC'                P2 TEXT FOR TEMPORARY RESULT          91632021
XGDTN  EQU   X'30'            DATA NAME.                                91640021
XGFPL  EQU   X'33'            FLOATIND-POINT LITERAL.                   91648021
INDXNM EQU   X'36'                P-2 TEXT FOR INDEX-NAME               91656021
XGFCT  EQU   X'75'            FIGURATIVE CONSTANT.                      91664021
PLFCON EQU   X'39'                P2 TXT PLURAL FIGCON                  91672021
XSTDTN EQU   X'79'            STANDART DATA-NAME.                       91680021
XGALC  EQU   X'34'            ALPHA NUMERIC CONSTANT.                   91688021
XGNLT  EQU   X'32'            NUMERIC LITERAL.                          91696021
PNDEF    EQU   X'C7'                    P-2 TEXT CODE FOR PN DEF        91704021
*                                                                       91712021
GNDEF    EQU   X'88'                     -   -    -    -  GN   -        91720021
VNDEF    EQU   X'C9'                      -  -    -    -  VN   -        91728021
DUMMYPN  EQU   X'D4'         P2 TEXT CODE FOR DUMMY PN REF         2962 91736021
VNREF  EQU   X'DB'                   P-2TEXT CODE FOR VN REFERENCE      91744021
GNREF  EQU   X'AA'                                                      91752021
PFMSAV EQU   X'FA'                                                      91760021
PAPNDEF  EQU   X'30'                    PROC-A TEXT CODE FOR PN DEF     91768021
PAGNDEF  EQU   X'34'                     -   -   -    -   -  GN   -     91776021
PAVNDEF  EQU   X'38'                     -   -   -    -   -  VN   -     91784021
PAPNREF  EQU   X'4C'                   PROC-A TEXT CODE FOR PN REFE     91792021
PAVNREF EQU  X'54'                   PROC-A TEXT CODE FOR VN REF.       91800021
SETINDI  EQU   7                                                        91808021
       SPACE 2                                                          91816021
*      VALUE  OF DISPLACEMENTS IN INPUT STRING                          91824021
*                                                                       91832021
XGIRNU EQU   1                DISPLACT. TO GET IR NUMBER.               91840021
XGMINC EQU   3                      -       -     MINOR CODE.           91848021
XDIDK  EQU   4                DISPLACT.OF ADDRESSING PARAMETERS .       91856021
XGSCIN EQU   7                      -       -     SCALE INDICATOR.      91864021
XGSCAL EQU   8                      -       -     SCALE VALUE    .      91872021
XGDGLG EQU   9                      -       -     DIGIT LENGHT .        91880021
XGLITV EQU   4                      -       -     LITERAL VALUE.        91888021
XGNBYT EQU   1                      -       -     NUMBER OF BYTES       91896021
XLIDEC EQU   3                      -       -     DEC.  -    -          91904021
XIRNLG EQU   32                                                         91912021
       SPACE 2                                                          91920021
XGSCSG EQU   X'80'            SCALE SIGN.                               91928021
XS2OP  EQU   1                                                          91936021
       SPACE 2                                                          91944021
*                                                                       91952021
*      DISPLACT. IN OPERAND INFORMATION BUFFER.                         91960021
*                                                                       91968021
Y1LAS  EQU   X1LAS-X1VAL                                                91976021
Y1BAS  EQU   X1BAS-X1VAL                                                91984021
Y1FAS  EQU   X1FAS-X1VAL                                                91992021
Y1DAS  EQU   X1DAS-X1VAL                                                92000021
Y1TEL  EQU   X1TEL-X1VAL                                                92008021
Y1TEM  EQU   X1TEM-X1VAL                                                92016021
Y1IRX  EQU   X1IRX-X1VAL                                                92024021
Y1LBS  EQU   X1LBS-X1VAL                                                92032021
Y1BBS  EQU   X1BBS-X1VAL                                                92040021
Y1FBS  EQU   X1FBS-X1VAL                                                92048021
Y1DBS  EQU   X1DBS-X1VAL                                                92056021
Y1ALP  EQU   X1ALP-X1VAL                                                92064021
Y1IRN  EQU   X1IRN-X1VAL                                                92072021
Y1NPS  EQU   X1NPS-X1VAL                                                92080021
Y1DDP  EQU   X1DDP-X1VAL                                                92088021
Y1IND  EQU   X1IND-X1VAL                                                92096021
*                                                                       92104021
*                                                                       92112021
Y1INPT EQU   X1INPT-X1VAL                                               92120021
       SPACE 2                                                          92128021
*                                                                       92136021
*      DISPLACT. IN INTERMEDIATE RESULT TABLE.                          92144021
*                                                                       92152021
XNTEL  EQU   Y1TEL                                                      92160021
XNIRX  EQU   Y1IRX                                                      92168021
       SPACE 2                                                          92176021
       SPACE 2                                                          92184021
*                                                                       92192021
*      FLAGS FOR REGISTER ASSIGNATOR.                                   92200021
*                                                                       92208021
XRVAL1 EQU   1                OP1 IS IN THIS REGISTER.                  92216021
XRVAL2 EQU   2                OP2  -  -  -      -    .                  92224021
XRFREE EQU   4                THIS REGISTER IS NOT AVAILABLE.           92232021
XRDPRE EQU   8                THIS REGISTER IS USED IN DP MODE.         92240021
XRIRNT EQU   X'10'            THIS REGISTER IS USED BY AN INTER.RES     92248021
XRSUBS EQU   X'20'            REGISTER USED BY A SUBSCRIPT COMPUTAT     92256021
XSUBAC EQU   X'40'            SUBS BEEING COMPUTED.                     92264021
FPREGF EQU   X'80'            PERMANENT FLAG FOR FLOATING POINT REG     92272021
       SPACE 2                                                          92280021
XRFSUB EQU   XRFREE+XRSUBS                                              92288021
XRVA12 EQU   XRVAL1+XRVAL2                                              92296021
XRVADP EQU   XRVA12+XRDPRE                                              92304021
XIN2RX EQU   X'F6'                                                      92312021
XRVADS EQU   XRVADP+XSUBAC                                              92320021
XSVA12 EQU   XRVA12+XSUBAC                                              92328021
XRNEXI EQU   XRAUR1-XRAUR2                                              92336021
       SPACE 2                                                          92344021
XFIVE  EQU   5                                                          92352021
WORKA  EQU   96              DISPLACT. IN TGT OF PARAM AREA.            92360021
WORKB  EQU   112                                                        92368021
WORKC  EQU   144                                                        92376021
WORKD  EQU   160                                                        92384021
WORKE  EQU   176                                                        92392021
WORKF  EQU   128                                                        92400021
WORKL  EQU   120                                                        92408021
WORKP  EQU   WORKA+8                                                    92416021
       SPACE 2                                                          92424021
*      FLAGS FOR SET-MODE ROUTINE.                                      92432021
*                                                                       92440021
XHDNBI EQU   2                                                          92448021
XHADST EQU   4                                                          92456021
       SPACE 1                                                          92464021
XHCLUE EQU   XHDNBI+XHADST                                              92472021
       SPACE 2                                                          92480021
       SPACE 2                                                          92488021
*      LOAD  REGISTER ROUTINES FLAGS.                                   92496021
*                                                                       92504021
XLASRX EQU   2                                                          92512021
XL2REG EQU   1                                                          92520021
XL2RSX EQU   3                                                          92528021
       SPACE  2                                                         92536021
XRRRFL EQU   X'30'            2ND BYTE OF I,D,K FIELD IS A REG NUMB     92544021
XSUCFL EQU   X'60'            TWO LAST BYTES OF I,D,K = SUBCRIPT CE     92552021
       SPACE 5                                                          92560021
XOP1   EQU   OP1                                                        92568021
XOP2   EQU   OP2                                                        92576021
XVAL1  EQU   X1VAL                                                      92584021
XVAL2  EQU   X2VAL                                                      92592021
LPR    EQU   LPRBI                                                      92600021
XT1    EQU   XCPSW                                                      92608021
XT2    EQU   XSPSW                                                      92616021
       SPACE 3                                                          92624021
******************************                                          92632021
*      A-TEXT  ENTRY POINTS.                                            92640021
*                                                                       92648021
A      EQU   ADD                                                        92656021
AP     EQU   ADD                                                        92664021
AR     EQU   ADD                                                        92672021
AL     EQU   ADDLBI                                                     92680021
BALR   EQU   BRNLNK                                                     92688021
BCTR   EQU   BRNCNT                                                     92696021
SR     EQU   SUB                                                        92704021
M      EQU   MULT                                                       92712021
MR     EQU   MULT                                                       92720021
MH     EQU   MULT                                                       92728021
MP     EQU   MULT                                                       92736021
D      EQU   DIV                                                        92744021
DP     EQU   DIV                                                        92752021
L      EQU   LOAD                                                       92760021
LR     EQU   LOAD                                                       92768021
LH     EQU   LOAD                                                       92776021
LCR    EQU   LCRBI                                                      92784021
ZAP    EQU   LOAD                                                       92792021
MVO    EQU   LNRBI                                                      92800021
CVB    EQU   CVBBI                                                      92808021
CVD    EQU   CVDBI                                                      92816021
ST     EQU   STORE                                                      92824021
STH    EQU   STORE                                                      92832021
BC     EQU   BRANCH                                                     92840021
CLC    EQU   COMPLG                                                     92848021
LTR    EQU   LTRBI                                                      92856021
PACK   EQU   LTRBI                                                      92864021
XJOP1  EQU   OP1                                                        92872021
XJOP2  EQU   OP2                                                        92880021
XIMM   EQU   IMM                                                        92888021
XPLUS1 EQU   PLUS1                                                      92896021
XPLUS2 EQU   PLUS2                                                      92904021
*                                                                       92912021
*                                                                       92920021
******************************                                          92928021
SEGSAV EQU   28                                                         92936021
GONE     EQU   XC001                                                    92944021
BAL    EQU     BRNLNK                                                   92952021
GVERB  EQU     XRVERB                                                   92960021
HCOMSR EQU     XRVAR                                                    92968021
FREF   EQU   X'B8'                 PROC-A FILE REF CODE                 92976021
MSWON  EQU     1                                                        92984021
MSWOFF EQU     254                                                      92992021
SSWON  EQU   X'02'            SECONDARY BIT SWITCH MASTER - SETTING     93000021
SSWOFF EQU   X'FD'            SECONDARY BIT SWITCH MASTER - RESETTI     93008021
MDN    EQU     X'30'                                                    93016021
MNLIT  EQU     X'32'                                                    93024021
MFPLIT EQU     X'33'                                                    93032021
MANLIT EQU     X'34'                                                    93040021
MFIGC  EQU     X'75'                                                    93048021
MSFN   EQU     X'21'                                                    93056021
LDOP   EQU     OPSIZ               SIZE OF THE DOP AREAS                93064021
HTERM  EQU     CBEND                                                    93072021
G1       EQU   GONE                                                     93080021
G2       EQU   GTWO                                                     93088021
GMACDC EQU     XCON1                                                    93096021
GMADCN EQU     RELAD1                                                   93104021
MADCON EQU     X'18'                                                    93112021
MDC    EQU     X'24'                                                    93120021
MENTRY EQU     X'04'                                                    93128021
MBLCHG EQU   X'08'                 BLCHNG MACRO TYPE                    93136021
MFLIT  EQU     X'33'                                                    93144021
MALIT  EQU     X'34'                                                    93152021
MFGCON EQU     X'75'                                                    93160021
MDNNM  EQU   X'35'                 DN NAME FOR EXHIBIT NAMED            93168021
MRGN   EQU   X'AA'                 RIGHT HAND GN REF                    93176021
SWCOUN EQU   XSWCTR                                                     93184021
       SPACE 5                                                          93192021
       EJECT                                                            93200021
GCNLN2 EQU   XREG1-XWC1      LENGTH FOR CHANGING ADR TWOS TO ADR ON     93208021
ONCTRN EQU   ONCTR           COMMON CELL                                93216021
MSDN   EQU   MDN                                                        93224021
MFN    EQU     X'21'                                                    93232021
SORTVI EQU   SORTC1                                                     93240021
DIMINR EQU   DNMINR                                                     93248021
ADCALL EQU   ADCN2D                CALL                                 93256021
SORCC1 EQU   ELEMTB+450  SORT CONTROL CARD  ELEMTB+620-12*14-2          93264021
SORCC2 EQU   SORCC1+1               IMAGE BUILD-UP AREA                 93272021
MBDAM  EQU   X'80'                                                      93280021
MBSAM  EQU   X'40'                                                      93288021
MBISAM EQU   X'20'                                                      93296021
MQISAM EQU   X'10'                                                      93304021
MNOQQI EQU   X'E0'                                                      93312021
MSYSOU EQU   1  DEVICE CODE FOR    SYSOUT                               93320021
MCNSLE EQU   2  DEVICE CODE FOR    CONSOLE                              93328021
MSYSPH EQU   3  DEVICE CODE FOR    SYSPCH                               93336021
MSYSIN EQU   4  DEVICE CODE FOR    SYSIN                                93344021
FPLENS EQU   14                    SHORT FP LEN AFTER CONV IN PARAM     93352021
FPLENL EQU   23                     LONG FP LEN AFTER CONV IN PARAM     93360021
MWORKA EQU   120                   DISPLACEMENT OF OTSR WORK AREA       93368021
MCLREL EQU   X'80'                 CLOSE REEL (INFO BYTE)               93376021
MCLCLR EQU   MSWON+SSWON                                                93384021
MAWO   EQU   X'02'                 APPLY WRITE ONLY BIT IN DOP(FN)+     93392021
MPARMA EQU   X'FA'                 PARAM HEADER FROM IC TEXT            93400021
MDESTR EQU   X'30'                 MACRO CODE...    DESTROY REGISTE     93408021
MRESRV EQU   X'28'                 MACRO CODE...   RESERVE REGISTER     93416021
MFREE  EQU   X'2C'                 MACRO CODE... FREE RESERVED REGS     93424021
ADRPLX EQU   PLUS1-XWC1                                                 93432021
ADRPLY EQU   XREG1-XVN1                                                 93440021
RUNSAV   EQU   SVWJHE                  CHECKPOINT SAVE AREA             93448021
END    EQU   *                                                          93456021
R7       EQU   7                                                        93464021
R8       EQU   8                                                        93472021
R12      EQU   12                                                       93480021
DX0      EQU   0                                                        93488021
LX0      EQU   0                                                        93496021
DX1      EQU   1                                                        93504021
NX1      EQU   1                                                        93512021
LX1      EQU   1                                                        93520021
DX2      EQU   2                                                        93528021
NX2      EQU   2                                                        93536021
LX2      EQU   2                                                        93544021
DX3      EQU   3                                                        93552021
NX3      EQU   3                                                        93560021
LX3      EQU   3                                                        93568021
DX4      EQU   4                                                        93576021
NX4      EQU   4                                                        93584021
LX4      EQU   4                                                        93592021
DX5      EQU   5                                                        93600021
NX5      EQU   5                                                        93608021
LX5      EQU   5                                                        93616021
DX6      EQU   6                                                        93624021
NX6      EQU   6                                                        93632021
LX6      EQU   6                                                        93640021
DX7      EQU   7                                                        93648021
NX7      EQU   7                                                        93656021
LX7      EQU   7                                                        93664021
DX8      EQU   8                                                        93672021
NX8      EQU   8                                                        93680021
LX8      EQU   8                                                        93688021
DX9      EQU   9                                                        93696021
NX9      EQU   9                                                        93704021
LX9      EQU   9                                                        93712021
DX10     EQU   10                                                       93720021
NX10     EQU   10                                                       93728021
LX10     EQU   10                                                       93736021
DX11     EQU   11                                                       93744021
NX11     EQU   11                                                       93752021
DX12     EQU   12                                                       93760021
NX12     EQU   12                                                       93768021
DX13     EQU   13                                                       93776021
NX13     EQU   13                                                       93784021
DX14     EQU   14                                                       93792021
NX14     EQU   14                                                       93800021
DX15     EQU   15                                                       93808021
NX15     EQU   15                                                       93816021
LX15     EQU   15                                                       93824021
DX16     EQU   16                                                       93832021
NX16     EQU   16                                                       93840021
LX16     EQU   16                                                       93848021
DX18     EQU   18                                                       93856021
LX19     EQU   19                                                       93864021
DX20     EQU   20                                                       93872021
DX21     EQU   21                                                       93880021
DX22     EQU   22                                                       93888021
DX23     EQU   23                                                       93896021
DX24     EQU   24                                                       93904021
DX26     EQU   26                                                       93912021
LX26     EQU   26                                                       93920021
DX27     EQU   27                                                 49550 93928021
DX28     EQU   28                                                       93936021
DX29     EQU   29                                                       93944021
DX30     EQU   30                                                       93952021
LX30     EQU   30                                                       93960021
NX30     EQU   30                                                       93968021
DX32     EQU   32                                                       93976021
LX32     EQU   32                                                       93984021
DX33     EQU   33                                                       93992021
DX35     EQU   35                                                       94000021
DX39     EQU   39                                                       94008021
DX42     EQU   42                                                       94016021
LX50     EQU   50                                                       94024021
NX56   EQU   56                                                         94032021
NX120    EQU   120                                                      94040021
NX121    EQU   121                                                      94048021
NX122    EQU   122                                                      94056021
NX123    EQU   123                                                      94064021
LX124    EQU   124                                                      94072021
DX256    EQU   256                                                      94080021
XX00     EQU   X'00'                                                    94088021
XX84     EQU   X'84'                                                    94096021
XX70     EQU   X'70'                                                    94104021
XX03     EQU   X'03'                                                    94112021
XX44     EQU   X'44'                                                    94120021
XX4C     EQU   X'4C'                                                    94128021
XXC0     EQU   X'C0'                                                    94136021
XXFF     EQU   X'FF'                                                    94144021
XX81     EQU   X'81'                                                    94152021
XX42     EQU   X'42'                                                    94160021
XX07     EQU   X'07'                                                    94168021
XX08     EQU   X'08'                                                    94176021
XX0A     EQU   X'0A'                                                    94184021
XX40     EQU   X'40'                                                    94192021
XX0D     EQU   X'0D'                                                    94200021
XX01     EQU   X'01'                                                    94208021
XX2C     EQU   X'2C'                                                    94216021
XX48     EQU   X'48'                                                    94224021
XX14     EQU   X'14'                                                    94232021
XX7F     EQU   X'7F'                                                    94240021
XX0C     EQU   X'0C'                                                    94248021
XX0F     EQU   X'0F'                                                    94256021
XX02     EQU   X'02'                                                    94264021
XX04     EQU   X'04'                                                    94272021
XX0B     EQU   X'0B'                                                    94280021
XX09     EQU   X'09'                                                    94288021
XX11     EQU   X'11'                                                    94296021
XX10     EQU   X'10'                                                    94304021
XXFE     EQU   X'FE'                                                    94312021
XX05     EQU   X'05'                                                    94320021
XX20     EQU   X'20'                                                    94328021
XX80     EQU   X'80'                                                    94336021
XXEF     EQU   X'EF'                                                    94344021
XXFD     EQU   X'FD'                                                    94352021
XX2F     EQU   X'2F'                                                    94360021
XX1D     EQU   X'1D'                                                    94368021
XX6D     EQU   X'6D'                                                    94376021
XX64     EQU   X'64'                                                    94384021
XX1E     EQU   X'1E'                                                    94392021
XXD0     EQU   X'D0'                                                    94400021
XX60     EQU   X'60'                                                    94408021
XXD2     EQU   X'D2'                                                    94416021
XX0E     EQU   X'0E'                                                    94424021
XX18     EQU   X'18'                                                    94432021
XX21     EQU   X'21'                                                    94440021
XX22     EQU   X'22'                                                    94448021
XX4E     EQU   X'4E'                                                    94456021
XXFC     EQU   X'FC'                                                    94464021
XX30     EQU   X'30'                                                    94472021
XX1C     EQU   X'1C'                                                    94480021
XX23     EQU   X'23'                                                    94488021
XXA0     EQU   X'A0'                                                    94496021
XX1B     EQU   X'1B'                                                    94504021
XX36     EQU   X'36'                                                    94512021
XX34     EQU   X'34'                                                    94520021
XX32     EQU   X'32'                                                    94528021
XX33     EQU   X'33'                                                    94536021
XX75     EQU   X'75'                                                    94544021
XXFA     EQU   X'FA'                                                    94552021
XXF9     EQU   X'F9'                                                    94560021
XX15     EQU   X'15'                                                    94568021
XX12     EQU   X'12'                                                    94576021
XX50     EQU   X'50'                                                    94584021
XX78     EQU   X'78'                                                    94592021
XXA4     EQU   X'A4'                                                    94600021
XXF0     EQU   X'F0'                                                    94608021
XX6C     EQU   X'6C'                                                    94616021
XX38     EQU   X'38'                                                    94624021
XX58     EQU   X'58'                                                    94632021
XX5C     EQU   X'5C'                                                    94640021
XX7C     EQU   X'7C'                                                    94648021
XXB0     EQU   X'B0'                                                    94656021
XXB4     EQU   X'B4'                                                    94664021
XX24     EQU   X'24'                                                    94672021
XX41     EQU   X'41'                                                    94680021
XXC1     EQU   X'C1'                                                    94688021
XXB8     EQU   X'B8'                                                    94696021
XX06     EQU   X'06'                                                    94704021
XXE0     EQU   X'E0'                                                    94712021
XX88     EQU   X'88'                                                    94720021
XX68     EQU   X'68'                                                    94728021
XXC8     EQU   X'C8'                                                    94736021
XX90     EQU   X'90'                                                    94744021
XX1A     EQU   X'1A'                                                    94752021
XX1F     EQU   X'1F'                                                    94760021
XX19     EQU   X'19'                                                    94768021
XX13     EQU   X'13'                                                    94776021
XX4F     EQU   X'4F'                                                    94784021
XX16     EQU   X'16'                                                    94792021
XX17     EQU   X'17'                                                    94800021
XX92     EQU   X'92'                                                    94808021
XX95     EQU   X'95'                                                    94816021
XX96     EQU   X'96'                                                    94824021
XX97     EQU   X'97'                                                    94832021
XX94     EQU   X'94'                                                    94840021
XX91     EQU   X'91'                                                    94848021
XX43     EQU   X'43'                                                    94856021
XX8E     EQU   X'8E'                                                    94864021
XX98     EQU   X'98'                                                    94872021
XX28     EQU   X'28'                                                    94880021
XX3A     EQU   X'3A'                                                    94888021
XX2A     EQU   X'2A'                                                    94896021
XX3B     EQU   X'3B'                                                    94904021
XX2B     EQU   X'2B'                                                    94912021
XX3F     EQU   X'3F'                                                    94920021
XX39     EQU   X'39'                                                    94928021
XX29     EQU   X'29'                                                    94936021
XX3C     EQU   X'3C'                                                    94944021
XX3D     EQU   X'3D'                                                    94952021
XX2D     EQU   X'2D'                                                    94960021
XX31     EQU   X'31'                                                    94968021
XXDF     EQU   X'DF'                                                    94976021
XXF6     EQU   X'F6'                                                    94984021
XXF5     EQU   X'F5'                                                    94992021
XXF3     EQU   X'F3'                                                    95000021
XX74     EQU   X'74'                                                    95008021
XX8F     EQU   X'8F'                                                    95016021
XXC5     EQU   X'C5'                                                    95024021
XX35     EQU   X'35'                                                    95032021
XXBF     EQU   X'BF'                                                    95040021
XX25     EQU   X'25'                                                    95048021
XX6B     EQU   X'6B'                                                    95056021
XXCE     EQU   X'CE'                                                    95064021
XX82     EQU   X'82'                                                    95072021
XX6E     EQU   X'6E'                                                    95080021
XX51     EQU   X'51'                                                    95088021
XX55     EQU   X'55'                                                    95096021
XXBB     EQU   X'BB'                                                    95104021
XX7A     EQU   X'7A'                                                    95112021
XX4B     EQU   X'4B'                                                    95120021
XX6F     EQU   X'6F'                                                    95128021
XX73     EQU   X'73'                                                    95136021
XX27     EQU   X'27'                                                    95144021
XX72     EQU   X'72'                                                    95152021
XXAA     EQU   X'AA'                                                    95160021
XC0      EQU   C'0'                                                     95168021
XC9      EQU   C'9'                                                     95176021
XCZ      EQU   C'Z'                                                     95184021
XCM      EQU   C'M'                                                     95192021
XCE      EQU   C'E'                                                     95200021
XCW      EQU   C'W'                                                     95208021
XCI      EQU   C'I'                                                     95216021
XCU      EQU   C'U'                                                     95224021
XCF      EQU   C'F'                                                     95232021
XCV      EQU   C'V'                                                     95240021
XCA      EQU   C'A'                                                     95248021
XCD      EQU   C'D'                                                     95256021
LX11     EQU   11                                                       95264021
LX12     EQU   12                                                       95272021
LX14     EQU   14                                                       95280021
LX17     EQU   17                                                       95288021
LX18     EQU   18                                                       95296021
LX20     EQU   20                                                       95304021
LX23     EQU   23                                                       95312021
LX25     EQU   25                                                       95320021
LX31     EQU   31                                                       95328021
LX70     EQU   70                                                       95336021
LX90     EQU   90                                                       95344021
LX120    EQU   120                                                      95352021
XX52     EQU   X'52'                                                    95360021
         END   PHASE50                                                  95368021
