*$MODULE       PHASE7                                                   00010021
*      START OF ERRMSG LOAD                                             00020021
       ENTRY IEQCOB70                                                   00030021
       ENTRY PH7                                                        00040021
       PRINT  ON,GEN,DATA                                               00050021
       IHBCOB                                                           00060021
*=3                                                                     00070021
*                                                                       00080021
*                                                                       00090021
*TITLE:                                                                 00100021
*                                                                       00110021
*   'IEQCBL70'                                                          00120021
*                                                                       00130021
*STATUS:                                                                00140021
*                                                                       00150021
*   CHANGE LEVEL 000                                                    00160021
*                                                                       00170021
*FUNCTION/OPERATION:                                                    00180021
*                                                                       00190021
*   PROCESS E-TEXT AND PRINTS OUT ERROR MESSAGES.                       00200021
*                                                                       00210021
*ENTRY POINT:                                                           00220021
*                                                                       00230021
*        PHASE7                                                         00240021
*                                                                       00250021
*INPUT:                                                                 00260021
*                                                                       00270021
*        SYSUT4   E-TEXT   GENERATED BY PHASES 1,2,3,4 AND 5            00280021
*                                                                       00290021
*OUTPUT:                                                                00300021
*                                                                       00310021
*        SYSPRINT    ERROR MESSAGES                                     00320021
*                                                                       00330021
*EXTERNAL ROUTINE:                                                      00340021
*                                                                       00350021
*   NONE                                                                00360021
*                                                                       00370021
*EXIT-NORMAL:                                                           00380021
*                                                                       00390021
*   RETURN TO PHASE 00                                                  00400021
*                                                                       00410021
*EXITS-ERROR:                                                           00420021
*                                                                       00430021
*   NONE                                                                00440021
*                                                                       00450021
*TABLE/WORK AREAS:                                                      00460021
*                                                                       00470021
*   ERRTBL, PARTBL, EACTBL, ETC.                                        00480021
*   WORK AREAS START AT ACCESW                                          00490021
*   TABLES ARE DESCRIBED IN DETAIL IN PLM AND PHASES 6 AND 7 LISTIN     00500021
*                                                                       00510021
*ATTRIBUTES:                                                            00520021
*                                                                       00530021
*   NOT REUSABLE                                                        00540021
*                                                                       00550021
*NOTES:                                                                 00560021
*                                                                       00570021
*   GENERAL ORGANIZATION:                                               00580021
*                                                                       00590021
*   1.   STANDARD EQUATES                                               00600021
*   2.   SYSTEM BASED MASKS AND REGISTERS EQUATES                       00610021
*   3.   LENGTHS OF A-TEXT ELEMENTS                                     00620021
*   4.   HEX REPRESENTATIONS OF A-TEXT ELEMENTS                         00630021
*   5.   REGISTERS ASSIGNMENT STATUS CODES                              00640021
*   6.   EQUATES FOR TAMER                                              00650021
*   7.   OTHER EQUATES                                                  00660021
*   8.   PHAS 7 INITIALIZATION                                          00670021
*   9.   PROCESS E-TEXT                                                 00680021
*   10.  END OF ERROR MESSAGE PROCESSING                                00690021
*   11.  DATA AND CONSTANTS                                             00700021
*   12.  OUTPUT AREA - SYSOU LISTING                                    00710021
*   13.  SUBROUTINES - PROCESS A-TEXT ELEMENT                           00720021
*   14.  ERROR MESSAGE TABLE                                            00730021
*   15.  ERROR ACTION TABLE                                             00740021
*   16.  ERROR PARAMETER TABLE                                          00750021
*   17.  SYMBOLIC OPERAND TABLE                                         00760021
*   18.  DEFINITION OF PHASE 7 TABLES                                   00770021
*   19.  COMMON AREA DEFINITION                                         00780021
*   20.  INPUT AREA - A-TEXT ELEMENT DEFINITION                         00790021
PH70     TITLE 'IKFCBL70'                                               00800021
*                                                                       00810021
*   GENERAL CONSIDERATION:                                              00820021
*                                                                       00830021
*   E-TEXT IS GENERATED FROM ERROR CONDITION.   THERE ARE TWO TYPES     00840021
*   E-TEXT ELEMENT: MESSAGE DEFINITION AND MESSAGE PARAMETER.           00850021
*   THE LATTER REFERRING TO VARIABLE ITEMS IN THE MESSAGES.             00860021
*                                                                       00870021
*   ERROR ROUTINES PROCESS E-TEXT AND PRINT OUT ERROR MESSAGES          00880021
*   CONSISTING OF THE FOLLOWING:                                        00890021
*   1. COMPILER GENERATED CARD NO. FOR INSTRUCTION IN ERROR             00900021
*   2. MESSAGE NUMBER                                                   00910021
*   3. SEVERITY INDICATION                                              00920021
*   4. ERROR MESSAGE                                                    00930021
*                                                                       00940021
       EJECT                                                            00950021
*=1    PHASE 7 START                                                    00960021
*   STANDARD EQUATES FOR BC INSTRUCTIONS                                00970021
*                                                                       00980021
IKF701 CSECT                                                            00990021
IFKCBL70 EQU IKF701                                                     01000021
UNCOND EQU   15                                                         01010021
HI     EQU   2                                                          01020021
LO     EQU   4                                                          01030021
LOW    EQU   4                                                          01040021
EQ     EQU   8                                                          01050021
NOTHI  EQU   13                                                         01060021
NOTLO  EQU   11                                                         01070021
NOTEQ  EQU   7                                                          01080021
OV     EQU   1                                                          01090021
POS    EQU   2                                                          01100021
NEG    EQU   4                                                          01110021
ZERO   EQU   8                                                          01120021
NOTOV  EQU   14                                                         01130021
NOTPOS EQU   13                                                         01140021
NOTNEG EQU   11                                                         01150021
NOTZER EQU   7                                                          01160021
ONES   EQU   1                                                          01170021
MIXED  EQU   4                                                          01180021
NOTONE EQU   14                                                         01190021
NOTMXD EQU   11                                                         01200021
NOP    EQU   0                                                          01210021
EOF    EQU   8                                                          01220021
*                                                                       01230021
R0  EQU   0                                                             01240021
R1  EQU   1                                                             01250021
R2  EQU   2                                                             01260021
R3  EQU   3                                                             01270021
RW1    EQU   6                          PHASE 6 WORKING REGISTER        01280021
RW2    EQU   7                          PHASE 6 WORKING REGISTER        01290021
*-----NOTE RW1,RW2 MUST BE AN EVEN-ODD PAIR                             01300021
RW3    EQU   5                          PHASE 6 WORKING REGISTER        01310021
RB1    EQU   8                                                          01320021
RB2    EQU   9                                                          01330021
RB3    EQU   10                                                         01340021
RB4    EQU   12                                                         01350021
R13 EQU   13                                                            01360021
RS1    EQU   14                         SUBROUTINE LINK REGISTER        01370021
R15 EQU   15                                                            01380021
INPUTR EQU   4                                                          01390021
F2REG  EQU   INPUTR                                                     01400021
F4REG  EQU   11                                                         01410021
*                                                                       01420021
*                                                                       01430021
* LENGTHS OF A-TEXT ELEMENTS                                            01440021
*                                                                       01450021
LPNDEF EQU   3                                                          01460021
LGNDEF EQU   3                                                          01470021
LVNDEF EQU   3                                                          01480021
LRPDEF EQU   3                                                          01490021
LMACRO EQU   2                                                          01500021
LOP    EQU   3                                                          01510021
LPNREF EQU   3                                                          01520021
LGNREF EQU   3                                                          01530021
LVNREF EQU   3                                                          01540021
LVIRRF EQU   3                                                          01550021
LBLREF EQU   3                                                          01560021
LGTRF1 EQU   3                                                          01570021
LGTRF2 EQU   4                                                          01580021
LRELAD EQU   5                                                          01590021
LDC    EQU   2                PLUS CONTENTS BYTE 2                      01600021
LLTLRF EQU   1                                                          01610021
LBDISP EQU   3                                                          01620021
LRPREF EQU   3                                                          01630021
LADR   EQU   7                                                          01640021
LBCD   EQU   2      PLUS CONTENTS BYTE 2                                01650021
LPLUS  EQU   4                                                          01660021
LVIRDF EQU   12                                                         01670021
LLTLDF EQU   3      PLUS CONTENTS BYTE 3                                01680021
LDCB   EQU   5                                                          01690021
LDECB  EQU   9                                                          01700021
LBLK   EQU   9                                                          01710021
LSA    EQU   9                                                          01720021
LWS    EQU   8                                                          01730021
LCON   EQU   7      PLUS CONTENTS BYTES 6-7                             01740021
LACON  EQU   8                                                          01750021
LIACON EQU   8                                                          01760021
LSBL   EQU   4                                                          01770021
LMSGDF EQU   7                                                          01780021
LMSGPM EQU   2      PLUS CONTENTS BYTE 2                                01790021
LCRDNO EQU   3                                                          01800021
*                                                                       01810021
*      HEX REPRESENTATIONS OF  A-TEXT ELEMENTS                          01820021
*                                                                       01830021
*      OP DESCRIPTIVES                                                  01840021
ADRPLU EQU   X'20'            ADR FOLLOWED BY PLUS                      01850021
UPLUS  EQU   X'1C'                                                      01860021
ULNG   EQU   X'18'                                                      01870021
YINIT2 EQU   X'24'                                                      01880021
PNREF  EQU   X'28'                                                      01890021
GNREF  EQU   X'2C'                                                      01900021
VNREF  EQU   X'30'                                                      01910021
VIRREF EQU   X'34'                                                      01920021
BLREF  EQU   X'38'                                                      01930021
GTREF1 EQU   X'3C'                                                      01940021
GTREF2 EQU   X'40'                                                      01950021
LTLREF EQU   X'44'                                                      01960021
BDISP  EQU   X'48'                                                      01970021
ADR    EQU   X'4C'                                                      01980021
PLUS   EQU   X'50'                                                      01990021
ZINIT2 EQU   X'54'                                                      02000021
XINIT2 EQU   X'58'                                                      02010021
YHOLDA EQU   X'5C'                                                      02020021
*      OP                                                               02030021
OP     EQU   X'60'                                                      02040021
*      NON-OP ASSOCIATED ELTS                                           02050021
PNDEF  EQU   X'64'                                                      02060021
GNDEF  EQU   X'68'                                                      02070021
VNDEF  EQU   X'6C'                                                      02080021
PNBCD  EQU   X'70'                                                      02090021
*      EQU   X'74'  NOT ASSIGNED                                        02100021
RPDBCD EQU   X'78'                                                      02110021
RPDDEF EQU   X'7C'                                                      02120021
MACRO  EQU   X'80'                                                      02130021
CRDNO  EQU   X'84'                                                      02140021
IDBCD  EQU   X'88'                                                      02150021
*      SUBSEQUENT ELTS                                                  02160021
REGNO  EQU   X'EC'                                                      02170021
RPDREF EQU   X'F0'                                                      02180021
BCDREF EQU   X'F4'                                                      02190021
RELADR EQU   X'F8'                                                      02200021
DCDEF  EQU   X'FC'                                                      02210021
*      OTHER A-TEXT ELTS                                                02220021
VIRDEF EQU   X'00'                                                      02230021
LTLDEF EQU   X'04'                                                      02240021
DCBDF  EQU   X'04'                                                      02250021
DECBDF EQU   X'08'                                                      02260021
BLKDF  EQU   X'0C'                                                      02270021
SADF   EQU   X'20'                                                      02280021
WSDF   EQU   X'24'                                                      02290021
CONDF  EQU   X'28'                                                      02300021
ACONDF EQU   X'2C'                                                      02310021
ICONDF EQU   X'30'                                                      02320021
SBLDF  EQU   X'34'                                                      02330021
CKPTDF EQU   X'38'                                                      02340021
MSGDF  EQU   X'00'                                                      02350021
*      GTREF2 EQUS                                                      02360021
DCB    EQU   X'00'                                                      02370021
PFMCT  EQU   X'0C'                                                      02380021
PSVCT  EQU   X'10'                                                      02390021
DECB   EQU   X'14'                                                      02400021
PARAM  EQU   X'1C'                                                      02410021
XSA    EQU   X'18'                                                      02420021
WC     EQU   X'20'                                                      02430021
TS     EQU   X'24'                                                      02440021
XSASW  EQU   X'28'                                                      02450021
VLC    EQU   X'04'                                                      02460021
ONCTL  EQU   X'08'                                                      02470021
SUBS   EQU     X'2C'                                                    02480021
TS2    EQU   X'30'                                                      02490021
RPI    EQU   X'34'                                                      02500021
VLCO   EQU   X'38'                                                      02510021
SA2    EQU   X'3C'                                                      02520021
SA3    EQU   X'40'                                                      02530021
*      MACRO CODES                                                      02540021
EQUATE EQU   X'00'          MACRO CODES                                 02550021
ENTRY  EQU   X'04'          MACRO CODES                                 02560021
BLCHNG EQU   X'08'          MACRO CODES                                 02570021
ENDOPT EQU   X'0C'          MACRO CODES                                 02580021
PROCSS EQU   X'10'          MACRO CODES                                 02590021
HOLDD  EQU   X'14'          MACRO CODES                                 02600021
ADCON  EQU   X'18'       MACRO CODES                                    02610021
IDENFY EQU   X'1C'       MACRO CODES                                    02620021
STARTT EQU   X'20'       MACRO CODES                                    02630021
DEECEE EQU   X'24'                                                      02640021
RSRVE  EQU   X'28'                                                      02650021
FREE   EQU   X'2C'                                                      02660021
DESTRY EQU   X'30'                                                      02670021
INIT   EQU   X'34'                                                      02680021
*                                                                       02690021
*      REGISTER ASSIGNMENT STATUS CODES                                 02700021
*                                                                       02710021
IBLSLT EQU   X'02'                                                      02720021
IBLELT EQU   X'00'                                                      02730021
OBLSLT EQU   X'02'                                                      02740021
OBLELT EQU   X'08'                                                      02750021
LAVAIL EQU   X'80'                                                      02760021
AVAIL5 EQU   X'01'                                                      02770021
AVAIL6 EQU   X'02'                                                      02780021
AVL56  EQU   AVAIL5+AVAIL6                                              02790021
YAVAL5 EQU   X'FE'                                                      02800021
YAVAL6 EQU   X'FD'                                                      02810021
LASIGN EQU   X'20'                                                      02820021
PGTOVF EQU   X'10'                                                      02830021
PGTOFF EQU   X'EF'            TURN OFF PGTOVF                           02840021
* EQUATES FOR TAMER                                                     02850021
*                                                                       02860021
ERRTBL EQU   TIB10-COS                                                  02870021
* OTHER EQUATES                                                         02880021
CBRST  EQU   X'01B0'                                                    02890021
LVLST    EQU   X'1CF'                                                   02900021
VRBST  EQU   X'0100'                                                    02910021
RELST  EQU   X'0180'                                                    02920021
PARST  EQU   X'0190'                                                    02930021
ARIST  EQU   X'01A0'                                                    02940021
FCOST  EQU   X'01D0'                                                    02950021
SDNST  EQU   X'01F8'                                                    02960021
PARCAR   EQU   X'0183'                                                  02970021
ZEROE    EQU   0                                                        02980021
PNNDEF   EQU   X'4C'                                                    02990021
DNDEF    EQU   X'48'                                                    03000021
EPARAM EQU   X'2F'                                                      03010021
ACTION EQU   X'4F'                                                      03020021
ENTEX  EQU   X'8F'                                                      03030021
C6CNST EQU   0                                                          03040021
NOREAD4  EQU   X'FE'                                                    03050021
READFILE EQU   X'05'                                                    03060021
PHASE7 DS    0H                                                         03070021
         DC    C'IKFCBL70'                                              03080021
         DC    C'B'                                                     03090021
         DC    X'1C'                                                    03100021
       CNOP  0,4                                                        03110021
PH7    EQU   *                                                          03120021
IEQCOB70 EQU   *                                                        03130021
       STM   RS1,RB4,TWELVE(R13)                                        03140021
      LR    R2,R13                                                      03150021
         BALR  R15,R0              ESTABLISH ADDRESSABILITY             03160021
       B     EIGHT(R15)            ESTABLISH ADDRESSABILITY             03170021
       DC    A(PH7SAV)                                                  03180021
       L     R13,FOUR(R15)                                              03190021
       ST    RS1,TWELVE(R13)                                            03200021
       ST    R2,FOUR(R13)                                               03210021
       ST    R13,EIGHT(R2)                                              03220021
ERRLOD BALR  RB1,R0                LOCATE PH7                           03230021
          USING *,RB1                                                   03240021
          USING EDATA,RB3                                               03250021
       L     RB3,AEDATA                                                 03260021
       L     R2,ZER0(R1)           COS ADDR                             03270021
       ST    R2,XH7COS    RELOCATE ERRTBL ADCON                         03280021
       L     R1,ABGPH7                                                  03290021
       BALR  R0,R2                 GO TO COS                            03300021
       DC    X'06'                                                      03310021
       L     RW1,XERRTB                                                 03320021
       ALR   RW1,R2                                                     03330021
       ST    RW1,XERRTB                                                 03340021
       SPACE 5                                                          03350021
       L     RB2,XH7COS                                                 03360021
       USING COS,RB2                                                    03370021
       CLC   PROGID(EIGHT),XERRID  ERRMSG SPECIFIED                     03380021
       BC    NOTEQ,XNORML          NO                                   03390021
       BALR  R0,RB2                BRANCH                               03400021
       DC    X'D6'                                                      03410021
* INITIALIZATION                                                        03420021
       MVI   PHASE,ONE                                                  03430021
       LA    RW1,XU6R15                                                 03440021
       ST    RW1,XEGSTR                                                 03450021
       MVI   XU6REC,BLANK                                               03460021
       MVC   XU6RC1(TOTAL),XU6REC                                       03470021
*                                                                       03480021
       L     INPUTR,ATRTBL                                              03490021
       LA    RW2,PHMESS                                                 03500021
EML009 ST    RW2,XAPTXT                                                 03510021
EML010 MVC   XU6RC1(SIXTEEN),EMLHDG                                     03520021
       MVC   XU6RC7(ONE1),PHASE                                         03530021
       L     R15,XPUT                                                   03540021
         BALR  RS1,R15             HEADING                              03550021
         BALR  RS1,R15             AND BLANK LINE                       03560021
       SR    RW1,RW1                                                    03570021
       STH   RW1,MESNUM                                                 03580021
       L     RW1,ZER0(RW2)         THIS PHASE TEXT                      03590021
       ST    RW1,MSSPTR                                                 03600021
       L     RW3,TWELVE(RW2)       NEXT PHASE TEXT                      03610021
EML020 L     RW1,MSSPTR                                                 03620021
       CR    RW1,RW3                                                    03630021
       BC    NOTLO,EML100     DO NEXT PHASE                             03640021
       MVC   XU6RC2(THREE),CCIKF                                        03650021
       MVC   XU6RC9(ONE1),CCIKF                                         03660021
       MVC   XU6RC5(ONE1),PHASE                                         03670021
       LR    R2,RW1                                                     03680021
       LH    RW1,MESNUM                                                 03690021
       CVD   RW1,X6WRK1                                                 03700021
       UNPK  XU6RC6(THREE),X6WRK7(TWO)                                  03710021
       OI    XU6RC8,MASKF0                                              03720021
       LR    RW1,R2                                                     03730021
       L     R1,XEGSTR                                                  03740021
       ST    R1,XTRPTR                                                  03750021
       SR    R1,R1                                                      03760021
       STH   R1,XTRTOT                                                  03770021
       NI    SWITC1,NOREAD4        PURGE                                03780021
EML030 TRT   ZER0(MAX,RW1),ZER0(INPUTR)                                 03790021
       ST    R1,XXADDR                                                  03800021
       STC   R2,SEPAR                                                   03810021
       L     R15,XSTRNG                                                 03820021
       BALR  RS1,R15               GO TO STRING ROUTINE                 03830021
       CLI   SEPAR,ACTION                                               03840021
       BC    HI,EML040             END OF TEXT                          03850021
       BC    LO,EML035             SEE IF PARAM                         03860021
       L     RW1,XXADDR                                                 03870021
       LA    RW1,TWO(RW1)          FOR NEXT MESSAGE                     03880021
       ST    RW1,MSSPTR                                                 03890021
       OI    SWITC1,RDERRFIL       PURGE                                03900021
       L     RW1,XTRPTR                                                 03910021
       LA    RW1,ONE1(RW1)                                              03920021
       ST    RW1,XTRPTR                                                 03930021
       L     RW1,AEACTB                                                 03940021
       SR    RW2,RW2                                                    03950021
       L     R1,XXADDR                                                  03960021
       TM    ONE1(R1),MASKFF                                            03970021
       BC    ONES,EML032           TEXT IS IN BUFFER                    03980021
         IC    RW2,DX1(R1)                                              03990021
       MH    RW2,X63                                                    04000021
EML032 LA    RW1,ZER0(RW1,RW2)     POINTER                              04010021
       MVC   XXADD1(THREE),ZER0(RW1)                                    04020021
       L     RW1,XXADDR                                                 04030021
       B     EML030                GO SCAN ERROR ACTION                 04040021
EML035 CLI   SEPAR,EPARAM                                               04050021
       BC    EQ,EML037             IT IS PARAMETER                      04060021
       L     RW1,XTRPTR                                                 04070021
       LA    RW1,ONE1(RW1)                                              04080021
       ST    RW1,XTRPTR                                                 04090021
       B     EML038                ESTABLISH POINTER                    04100021
EML037 LA    RW1,BLQUOT                                                 04110021
       LA    R1,FOUR(RW1)                                               04120021
       L     R15,XSTRNG                                                 04130021
       BALR  RS1,R15               GO TO STRING ROUTINE                 04140021
EML038 DS    0H                                                         04150021
       L     RW1,XXADDR                                                 04160021
       LA    RW1,ONE1(RW1)                                              04170021
       B     EML030                GO SCAN TEXT                         04180021
* END OF MESSAGE REACHED                                                04190021
EML040 LH    R1,MESNUM                                                  04200021
       LTR   R1,R1                                                      04210021
       BC    ZERO,EML050           GO TO CLEAR OUTLINE                  04220021
       LH    R1,XTRTOT                                                  04230021
       LTR   R1,R1                                                      04240021
       BC    ZERO,EML050           GO TO CLEAR OUT LINE                 04250021
       L     RW1,XTRPTR       NO NEED TO CALL STRING ROUTINE,           04260021
       MVI   ZER0(RW1),PERIOD      SINCE THIS IS END OF MESSAGE         04270021
EML042 DS    0H                                                         04280021
       L     R15,XPUT                                                   04290021
         BALR  RS1,R15             GO TO PUT OUT LINE                   04300021
EML045 LH    RW1,MESNUM                                                 04310021
       LA    RW1,ONE1(RW1)                                              04320021
       STH   RW1,MESNUM                                                 04330021
       TM    SWITC1,RDERRFIL                                            04340021
         BNE   EML020              GO PROCESS NEXT MESSAGE              04350021
       L     RW1,XXADDR                                                 04360021
       LA    RW1,ONE1(RW1)                                              04370021
       ST    RW1,MSSPTR                                                 04380021
       B     EML020                GO PROCESS NEXT MESSAGE              04390021
EML050 MVI   XU6REC,BLANK                                               04400021
       MVC   XU6RC1(TOTAL),XU6REC                                       04410021
       B     EML045                SET UP TO PROCESS NEXT FIELD         04420021
* DO NEXT PHASE                                                         04430021
EML100 C     RW3,APHXER                                                 04440021
       BC    NOTLO,XCLOSE     END OF RUN                                04450021
       L     R15,XPUT                                                   04460021
         BALR  RS1,R15             GO TO PUT OUT LINE                   04470021
       IC    R1,PHASE                                                   04480021
       LA    R1,ONE1(R1)                                                04490021
       STC   R1,PHASE                                                   04500021
       L     RW2,XAPTXT                                                 04510021
       LA    RW2,TWELVE(RW2)                                            04520021
       B     EML009                 GO DO NEXT PHASE                    04530021
ABGPH7 DC    A(PHASE7)                                                  04540021
XNORML DS    0H                                                         04550021
       EJECT                                                            04560021
PLS005   DS    0H                                                       04570021
       NI    PERSW,ZER0                                                 04580021
       MVI   XU6REC,BLANK                                               04590021
       MVC   XU6RC1(TOTAL),XU6REC                                       04600021
       MVC   XU6RC1(TWENTY),MSSHDG HEADING FOR ERRORS                   04610021
       L     R15,XPUT                                                   04620021
         BALR  RS1,R15             HEADING                              04630021
         BALR  RS1,R15             AND BLANK LINE                       04640021
       LA    RW1,XU6R23                                                 04650021
       ST    RW1,XEGSTR                                                 04660021
       SR    RW2,RW2                                                    04670021
       CH    RW2,SEQERR           ANY SEQUENCE ERRORS                   04680021
       BC    EQ,PLS250              NO                                  04690021
         TM    PHZSW,FLAGW                                              04700021
         BC    ZERO,PLS250         NOT FLAGW                            04710021
       MVC   XU6RC8(THREE),CCIKF                                        04720021
       MVC   XU6R11(SEVEN),CCNIDW                                       04730021
       L     RW3,XEGSTR                                                 04740021
       LH    RW1,SEQERR           NUMBER OF SEQUENCE ERRORS             04750021
       USING S6200,R15                                                  04760021
       L     R15,XS6200            C                                    04770021
       BAL   RS1,S6210             CONVERT NUMBER                       04780021
       MVC   ZER0(ONE1,RW3),X6WRK4                                      04790021
       DROP  R15                                                        04800021
       LA    RW3,TWO(RW3)          FOR STRING ROUTINE                   04810021
       ST    RW3,XTRPTR                                                 04820021
       LA    RW1,CCSEQ                                                  04830021
       LA     R1,THIRTY4(RW1)                                           04840021
       L     R15,XSTRNG                                                 04850021
       BALR  RS1,R15               GO TO STRING ROUTINE                 04860021
       LH    RW1,SEQERR                                                 04870021
       BCT   RW1,PLPLUR            IT IS PLVRAL                         04880021
       MVC   XU6R39(TWENTY),XU6R40  ELIMINATE PLURAL                    04890021
PLPLUR EQU   *                                                          04900021
       L     R15,XPUT                                                   04910021
         BALR  RS1,R15             GO TO PUT OUT LINE                   04920021
PLS250 TM    ERF4SW,MASKFF         ANY OTHER ERRORS                     04930021
       BC    ZERO,XCLOSE      NO                                        04940021
         SPACE 2                                                        04950021
         SPACE 2                                                        04960021
       TM    SWITC1,READFILE                                            04970021
         BC    NOTZER,PLS008       GO TO SKIP LISTING & EXT             04980021
*  ERROR MESSAGES IN TABLE                                              04990021
       OI    TESTSW,MASKFF    FOR GTF4B TO RECOGNIZE 77 AS EOF          05000021
       L     R1,XERRTB                                                  05010021
       L     R15,XTABLE                                                 05020021
       BALR  RS1,R15               GO TO TABLE ROUTINE                  05030021
       LR    INPUTR,R1                                                  05040021
       XC    X4LEN,X4LEN      TREAT TABLE AS BUFFER                     05050021
       B     PLS020                GO TO PROCESS                        05060021
* SKIP LISTING TEXT                                                     05070021
PLS008 DS    0H                                                         05080021
       MVI   X4SW,XXC0        NEW BLOCK,NOLIST TEXT, FILE 3             05090021
       TM    SWITC1,NOFITSW                                             05100021
         BC    ONES,PLS009        FILE 3                                05110021
       MVI   X4SW,XF0      NEW BLOCK, INPUTR, IN LIST POSITION TO 01    05120021
PLS009   DS    0H                                                       05130021
       L     R15,XGETF4                                                 05140021
       LA    RW2,F4FIN        EOF RETURN                                05150021
       BALR  RS1,R15                 GET A RECORD                       05160021
       MVI   X4SW,X40                                                   05170021
         B     PER015              GO TO SCAN TEXT                      05180021
* END OF LISTING ELEMENTS                                               05190021
PLS020 MVI   X4SW,X40              USE INPUTR, NON-LIST                 05200021
       BC    UNCOND,PER010         GO TO SCAN TEXT AND LOCATE REC       05210021
*                                                                       05220021
       EJECT                                                            05230021
*=1    PROCESS E-TEXT                                                   05240021
       USING A6TEXT,INPUTR                                              05250021
PER010 TM    PERSW,MASKFF                                               05260021
       BC    NOTZER,PER015    RECORD ALREADY LOCATED                    05270021
       L     R15,XGETF4                                                 05280021
       LA    RW2,F4FIN        EOF RETURN                                05290021
       BALR  RS1,R15               GET RECORD                           05300021
PER015 NI    PERSW,ZER0            RESET SW                             05310021
         CLI   DX0(INPUTR),XX00     IS THIS E-TEXT                      05320021
       BC    EQ,PER030             YES                                  05330021
         CLI   DX0(INPUTR),CONDF    IS IT CONDEF                        05340021
         BC    NOTEQ,PER027                                             05350021
         TM    A6CONT,XXFF          ALL TYPE                            05360021
       BC    ONES,PER020      YES, ADD 1 TO G4LEN                       05370021
         MVC   X6WRK0(LX2),A6CONS   NO, ADD VARIABLE FIELD SIZE         05380021
       LH    RW1,X4LEN        TO G4LEN                                  05390021
       AH    RW1,X6WRK0                                                 05400021
       BC    UNCOND,PER025         GO TO STORE LENGTH                   05410021
PER020   SR    RW1,RW1                                                  05420021
         IC    RW1,A6CONLV         LENGTH OF VALUE                      05430021
PER022   AH    RW1,X4LEN           ADJUST LENGTH                        05440021
         LA    RW1,DX1(RW1)         ADD COUNT BYTE                      05450021
PER025 STH   RW1,X4LEN                                                  05460021
       BC    UNCOND,PER010         GO TO PROCESS NEXT                   05470021
PER027   EQU   *                                                        05480021
         CLI   ZEROE(INPUTR),DNDEF      IS IT DNDEF?                    05490021
         BC    NOTEQ,PER029        NO - CHECK FOR PNDEF                 05500021
         IC    RW1,A7DNLN          YES - GET LENGTH OF DATANAME         05510021
         BC    UNCOND,PER022       FINISH PROCESSING                    05520021
PER029   EQU   *                                                        05530021
         CLI   ZEROE(INPUTR),PNNDEF     IS IT XREF PNDEF?               05540021
         BC    NOTEQ,PER010             NO - GET NEXT ELEMENT           05550021
         IC    RW1,A7PNLN               YES - GET LENGTH OF PN          05560021
         BC    UNCOND,PER022                                            05570021
* E-TEXT ELEMENT                                                        05580021
PER030   TM    A6MSGZ,XXFF          MESSAGE                             05590021
       BC    NOTZER,PER040         NO, PARAM                            05600021
         TM    PHZSW,XX04                                               05610021
       BC    NOTZER,FLAG           FLAG AS ERROR                        05620021
         TM    DX7(INPUTR),XXF0                                         05630021
       BC    ZERO,PER010      WARNING ONLY - DON'T PROCESS AS ERROR     05640021
FLAG   EQU   *      FLAG                                                05650021
         MVC   XU6REC+NX8(LX3),CCIKF                                    05660021
         MVC   XU6REC+NX15(LX1),CCIKF                                   05670021
         MVI   XU6REC+NX16,XX60                                         05680021
         LA    RW2,XU6REC+NX23                                          05690021
       ST    RW2,XTRPTR                                                 05700021
         MVC   X6WRK0(LX2),A6MSGC   CARD NUM TO WORK AREA               05710021
         NI    X6WRK0,XX7F              TURN OFF HIGH ORDER BIT         05720021
       LH    RW1,X6WRK0                                                 05730021
       LTR   RW1,RW1                                                    05740021
       BC    ZERO,CARD00           DON'T NEED TO CONVERT                05750021
       USING S6200,R15                                                  05760021
       L     R15,XS6200            C                                    05770021
       BAL   RS1,S6210             GO CONVERT NUMBER                    05780021
         MVC   XU6REC+NX1(LX1),X6WRK4 EXECUTED BY SUBROUTINE            05790021
       DROP  R15                                                        05800021
CARD00 EQU   *                                                          05810021
         MVC   X6WRK0(LX2),A6MSGM                                       05820021
       LH    RW1,X6WRK0                                                 05830021
       CVD   RW1,X6WRK1                                                 05840021
         UNPK  XU6REC+NX12(LX3),X6WRK7(LX2)                             05850021
         OI    XU6REC+NX14,XXF0                                         05860021
         MVC   X6WRK0(LX1),A6MSGS   SEVERITY AND PHASE                  05870021
       L     R15,XS6010                                                 05880021
       BALR  RS1,R15                 CONVERT TO DEC                     05890021
         MVC   XU6REC+NX11(LX1),X6WRK2 PHASE TO OUTPUT                  05900021
       IC    RW1,X6WRK1                                                 05910021
       N     RW1,X6M2                                                   05920021
       LA    RW1,ESEVS(RW1)                                             05930021
         MVC   XU6REC+NX17(LX1),DX0(RW1) SEVERITY CODE LETTER           05940021
* LOCATE MESSAGE                                                        05950021
       IC    RW1,A6MSGS                                                 05960021
       N     RW1,X6M2         PHASE                                     05970021
       CH    RW1,X6H5         BAD PHASE NUMBER                          05980021
         BC    HI,PER035           NO TEXT                              05990021
       BCTR  RW1,R0                DECREMENT FOR TABLE                  06000021
       MH    RW1,X6H12                                                  06010021
         LA    RW3,PHMESS+NX4(RW1)                                      06020021
         L     RW1,DX0(RW3)                                             06030021
         MVC   X6WRK0(LX2),A6MSGM                                       06040021
         LA    RW2,DX3                                                  06050021
       MH    RW2,X6WRK0                                                 06060021
         CH    RW2,DX4(RW3)                                             06070021
         BC    NOTLO,PER035       NO TEXT                               06080021
         AR    RW1,RW2                                                  06090021
         NI    MSSPTR,XX00                                              06100021
         MVC   MSSPTR+NX1(LX3),DX0(RW1)                                 06110021
       L     RW1,MSSPTR                                                 06120021
* REPOSITION STRPTR IF PARAMETER FIRST                                  06130021
         CLI   DX0(RW1),XX5B                                            06140021
       BC    NOTEQ,PER033          NOT PARAMETER                        06150021
         LA    RW3,XU6REC+NX22                                          06160021
       ST    RW3,XTRPTR                                                 06170021
* SCAN TEXT FOR PARAMETERS                                              06180021
PER033 L     RW2,ATRTBL                                                 06190021
         TRT   DX0(LX256,RW1),DX0(RW2)                                  06200021
       ST    R1,XXADDR         TO                                       06210021
       STC   R2,SEPAR                                                   06220021
       L     R15,XSTRNG                                                 06230021
       BALR  RS1,R15               GO TO STRING ROUTINE                 06240021
       CLI   SEPAR,ACTION                                               06250021
       BC    HI,PER034        /                                         06260021
       CLI   SEPAR,EPARAM                                               06270021
       BC    LO,PER339        BLANK                                     06280021
       BC    EQ,XPR030       PARAM                                      06290021
* ACTION CODE - NUMBER FOLLOWS ( AT 1(1) )                              06300021
         CLI   DX1(R1),XXFF                                             06310021
       BC    NOTEQ,XPR023          GO DETERMINE ACTION                  06320021
*  ACTION = MUST BE LOCATED IN E-TEXT FILE                              06330021
         TM    PERSW,XXFF                                               06340021
       BC    NOTZER,XPR020     RECORD ALREADY LOCATED                   06350021
       L     R15,XGETF4                                                 06360021
       LA    RW2,F4FIN        EOF RETURN                                06370021
       BALR  RS1,R15            GET A RECORD                            06380021
XPR020   NI    PERSW,XX00                                               06390021
       SR    RW1,RW1                                                    06400021
       IC    RW1,A6PARN                                                 06410021
         LA    RW1,DX2(RW1)                                             06420021
       STH   RW1,X4LEN                                                  06430021
         CLC   DX0(LX3,INPUTR),ETXACT                                   06440021
       BC    NOTEQ,XPR022          SET RECORD LOCATED SW ON             06450021
         LA    R1,DX2(INPUTR)    POINT TO BYTE BEFORE ACTION CODE       06460021
       ST    R1,XXADDR                                                  06470021
         B     XPR023              GO DETERMINE ACTION                  06480021
XPR022   OI    PERSW,XXFF     NEXT RECORD ALREADY LOCATED               06490021
         B     PER035                MESSAGE                            06500021
XPR023 L     RW1,XTRPTR                                                 06510021
         LA    RW1,DX1(RW1)    BLANK                                    06520021
       ST    RW1,XTRPTR                                                 06530021
       L     RW1,AEACTB                                                 06540021
       SR    RW3,RW3                                                    06550021
       L     R1,XXADDR                                                  06560021
         IC    RW3,DX1(R1)                                              06570021
       MH    RW3,X63                                                    06580021
       LA    R1,AEACTB                                                  06590021
         CH    RW3,DX4(R1)                                              06600021
       BC    NOTLO,XPR025      BAD ACTION CODE                          06610021
         AR    RW1,RW3                                                  06620021
XPR025   NI    MSSPTR,XX00                                              06630021
         MVC   MSSPTR+NX1(LX3),DX0(RW1)                                 06640021
       L     RW1,MSSPTR                                                 06650021
         B     PER033              GO SCAN FOR PARAMS                   06660021
* PARAMETER REQUIRED, GET NEXT RECORD                                   06670021
XPR030 DS    0H                                                         06680021
         TM    PERSW,XXFF                                               06690021
       BC    NOTZER,XPR032     RECORD ALREADY LOCATED                   06700021
       L     R15,XGETF4                                                 06710021
       LA    RW2,F4FIN                                                  06720021
       BALR  RS1,R15               GET NEXT RECORD                      06730021
XPR032   NI    PERSW,XX00                                               06740021
         TM    DX0(INPUTR),XXFF E-TEXT?                                 06750021
       BC    NOTZER,PER070    NO                                        06760021
         TM    DX2(INPUTR),XXFF PARAM?                                  06770021
       BC    NOTZER,PER080    YES                                       06780021
PER070   OI    PERSW,XXFF      SET RECORD LOCATED                       06790021
         B     PER339          BYPASS PARAM PROCESSING                  06800021
PER080 DS    0H                                                         06810021
       L     RW1,XTRPTR                                                 06820021
         LA    RW1,DX1(RW1)                                             06830021
       ST    RW1,XTRPTR                                                 06840021
       SR    RW1,RW1                                                    06850021
       IC    RW1,A6PARN                                                 06860021
         LA    RW1,DX2(RW1)    RECORD LENGTH                            06870021
       STH   RW1,X4LEN                                                  06880021
         CLI   A6PAR,XX05                                               06890021
       BC    EQ,PRANLT             BCD TEXT                             06900021
         CLI   A6PAR,XX22                                               06910021
       BC    EQ,PRANLT             BCD TEXT                             06920021
         CLI   A6PAR,XX23                                               06930021
       BC    EQ,PRANLT        ALPHANUMERIC LITERAL                      06940021
         CLI   A6PAR,XX34                                               06950021
       BC    EQ,PRANLT        ALPHANUMERIC LITERAL                      06960021
         CLI   A6PAR,XX42                                               06970021
       BC    EQ,PRCBRK        CRITICAL PROGRAM BREAK                    06980021
         CLI   A6PAR,XX43                                               06990021
       BC    EQ,PRLVLN        LEVEL NUMBER                              07000021
         CLI   A6PAR,XX44                                               07010021
       BC    EQ,PRVERB        VERB                                      07020021
         CLI   A6PAR,XX50                                               07030021
       BC    EQ,PRRELA        RELATIONAL                                07040021
         CLI   A6PAR,XX52                                               07050021
       BC    EQ,PRPREN        PARENTHESIS                               07060021
         CLI   A6PAR,XX53                                               07070021
       BC    EQ,PRARIT        ARITHMETIC OPERATOR                       07080021
         CLI   A6PAR,XX54                                               07090021
       BC    EQ,PRCWRD        COBOL WORD                                07100021
         CLI   A6PAR,XX55                CARRIAGE CONTROL               07110021
         BE    PRCARR              YES                                  07120021
         CLI   A6PAR,XX75                                               07130021
       BC    EQ,PRFCON        FIGURATIVE CONSTANT                       07140021
         CLI   A6PAR,XX79                                               07150021
       BC    EQ,PRSDNM        STANDARD DATA-NAME                        07160021
         CLI   A6PAR,XXF9                                               07170021
       BC    EQ,PRGTR1        GTREF1                                    07180021
         CLI   A6PAR,XXFA                                               07190021
       BC    EQ,PRGTR2        GTREF2                                    07200021
         CLI   A6PAR,XXFE                                               07210021
       BC    EQ,PRDICT        DICTIONARY POINTER                        07220021
* INVALID PARAMETER CODE                                                07230021
PRBAD  LA    RW1,CASTRS                                                 07240021
         LA    R1,DX2(RW1)                                              07250021
       L     R15,XSTRNG      STRING ASTERISKS                           07260021
       BALR  RS1,R15               GO STRING                            07270021
         B     PER333   3      CONTINUE                                 07280021
* BCD TEXT FOLLOWS (22, 23 OR 34)                                       07290021
PRANLT   LA    RW1,DX4(INPUTR) ADDRESS                                  07300021
       SR    RW2,RW2                                                    07310021
         IC    RW2,DX3(INPUTR) LENGTH                                   07320021
         LA    R1,DX0(RW1,RW2)                                          07330021
       L     R15,XSTRNG      STRING BCD                                 07340021
       BALR  RS1,R15                   ROUTINE                          07350021
         B     PER333              PUT BALNKS IN                        07360021
* CRITICAL PROGRAM BREAK (42)                                           07370021
PRCBRK LA    RW2,CBRST                                                  07380021
       L     RW3,C6LOW5                                                 07390021
         B     PRSD20              GO TO ACCESS TABLE                   07400021
* LEVEL NUMBER                                                          07410021
PRLVLN SR    RW1,RW1                                                    07420021
         IC    RW1,DX3(INPUTR)                                          07430021
       CH    RW1,CH49                                                   07440021
       BC    HI,PRLV10             GREATER THAN 49                      07450021
       CVD   RW1,X6WRK1                                                 07460021
         UNPK  X6WRK1(LX2),X6WRK7(LX2)                                  07470021
         OI    X6WRK2,XXF0                                              07480021
       LA    RW1,X6WRK1                                                 07490021
         LA    R1,DX2(RW1)                                              07500021
       L     R15,XSTRNG                                                 07510021
       BALR  RS1,R15               GO TO STRING ROUTINE                 07520021
         B     PER333              PUT IN BLANKS                        07530021
PRLV10 N     RW1,X6M2                                                   07540021
       LA    RW2,LVLST                                                  07550021
         B     PRSD30              GO TO ACCESS PARM TABLE              07560021
* VERB (44)                                                             07570021
PRVERB LA    RW2,VRBST                                                  07580021
       L     RW3,X6MA                                                   07590021
         B     PRSD20              GO TO ACCESS PARM TABLE              07600021
* RELATIONAL (50)                                                       07610021
PRRELA LA    RW2,RELST                                                  07620021
         B     PRSD10              GO TO ACCESS PARM TABLE              07630021
* PARENTHESIS (52)                                                      07640021
PRPREN LA    RW2,PARST                                                  07650021
         B     PRSD10              GO TO ACCESS PARM TABLE              07660021
* ARITHMETIC OPERATOR (53)                                              07670021
PRARIT LA    RW2,ARIST                                                  07680021
         B     PRSD10              GO TO ACCESS PARM TABLE              07690021
* COBOL WORD (54)                                                       07700021
PRCWRD SR    RW2,RW2                                                    07710021
       L     RW3,X6M3                                                   07720021
         B     PRSD20              GO TO ACCESS PARM TABLE              07730021
* FIGURATIVE CONSTANT (75)                                              07740021
PRFCON   IC    RW1,DX3(INPUTR)                                          07750021
         SRL   RW1,DX3                                                  07760021
       N     RW1,C6LOW5                                                 07770021
       LA    RW2,FCOST                                                  07780021
         B     PRSD30              GO TO ACCESS PARM TABLE              07790021
* STANDARD DATA-NAME (79)                                               07800021
* CARRIAGE CONTROL CHARACTER                                            07810021
PRCARR   LA    RW2,PARCAR                                               07820021
         L     RW3,X6M4                                                 07830021
         B     PRSD20              GO ACCESS PARM TABLE                 07840021
PRSDNM LA    RW2,SDNST                                                  07850021
PRSD10 L     RW3,X6M2                                                   07860021
PRSD20   IC    RW1,DX3(INPUTR)                                          07870021
       NR    RW1,RW3                                                    07880021
PRSD30 AR    RW1,RW2                                                    07890021
         LA    RW2,DX0(RW1,RW1)                                         07900021
       AR    RW1,RW2          RELATIVE TABLE POSITION                   07910021
       L     R1,APARTB                                                  07920021
         LA    RW1,DX0(RW1,R1)  LOCATION OF POINTER                     07930021
         MVC   MSSPTR+NX1(LX3),DX0(RW1)                                 07940021
       L     RW1,MSSPTR                                                 07950021
PRSD40 L     RW2,ATRTBL                                                 07960021
         TRT   DX0(LX256,RW1),DX0(RW2) SCAN FOR END (/)                 07970021
       STC   R2,SEPAR                                                   07980021
       L     R15,XSTRNG                                                 07990021
       BALR  RS1,R15            STRING TEXT                             08000021
         LA    RW1,DX1(R1)      NEXT SCAN LOC                           08010021
       L     RW3,XTRPTR                                                 08020021
         LA    RW3,DX1(RW3)                                             08030021
       ST    RW3,XTRPTR                                                 08040021
       CLI   SEPAR,ENTEX                                                08050021
       BC    NOTEQ,PRSD40          GO SCAN FOR /                        08060021
         B     PER335              CONTINUE SCAN                        08070021
PRGTR1 DS    0H                                                         08080021
       SR    RW2,RW2                                                    08090021
         IC    RW2,DX3(INPUTR) TYPE OF CELL                             08100021
         SLL   RW2,DX1                                                  08110021
       A     RW2,XXGT1C                                                 08120021
       SR    RW3,RW3                                                    08130021
         IC    RW3,DX4(INPUTR) DISPLACEMENT                             08140021
         B     PRGTR3          TO COMMON PROCESSOR                      08150021
PRGTR2 DS    0H                                                         08160021
       SR    RW2,RW2                                                    08170021
         IC    RW2,DX3(INPUTR) TYPE OF CELL                             08180021
       A     RW2,XXGT2C                                                 08190021
         MVC   X6WRK0(LX2),DX4(INPUTR)                                  08200021
       LH    RW3,X6WRK0                                                 08210021
PRGTR3 LR    RW1,RW2                                                    08220021
         LA    R1,DX4(RW1)      FOR SYMBOLICS                           08230021
       L     R15,XSTRNG                                                 08240021
       BALR  RS1,R15               GO STRING                            08250021
       LR    RW1,RW3          NUMBER OR DISP                            08260021
       L     RW3,XTRPTR                                                 08270021
       L     R15,XS6200                                                 08280021
       USING S6200,R15                                                  08290021
       BAL   RS1,S6210             GO CONVERT                           08300021
         MVC   DX0(LX1,RW3),X6WRK4                                      08310021
       DROP  R15                                                        08320021
         LA    RW3,DX2(RW3)                                             08330021
       ST    RW3,XTRPTR                                                 08340021
         B     PER335              GO CONTINUE SCAN                     08350021
PRDICT DS    0H                                                         08360021
       L     RW1,XXSYMC                                                 08370021
         LA    R1,DX4(RW1)                                              08380021
       L     R15,XSTRNG                                                 08390021
       BALR  RS1,R15               GO STRING                            08400021
         MVC   X6WRK0(LX2),DX3(INPUTR)                                  08410021
       LH    RW1,X6WRK0                                                 08420021
         SRL   RW1,DX1                                                  08430021
       N     RW1,X6M13                                                  08440021
       L     RW3,XTRPTR                                                 08450021
       L     R15,XS6200                                                 08460021
       USING S6200,R15                                                  08470021
       BAL   RS1,S6210         CONVERT AND MOVE SECTION =               08480021
         MVC   DX0(LX1,RW3),X6WRK4                                      08490021
         MVI   DX1(RW3),XX60   INSERT HYPHEN                            08500021
         MVC   X6WRK0(LX2),DX4(INPUTR)                                  08510021
       LH    RW1,X6WRK0                                                 08520021
       N     RW1,X6M9                                                   08530021
       BAL   RS1,S6210             GO CONVERT                           08540021
         MVC   DX2(LX0,RW3),X6WRK4                                      08550021
       DROP  R15                                                        08560021
         LA    RW3,DX3(RW3)                                             08570021
       ST    RW3,XTRPTR                                                 08580021
PER333 DS    0H                                                         08590021
         B     PER339           NO QUOTES                               08600021
* CONTINUE SCAN                                                         08610021
PER335 DS    0H                                                         08620021
       L     RW1,XXADDR                                                 08630021
         LA    RW1,DX1(RW1)                                             08640021
         B     PER033              GO SCAN FOR PARMS                    08650021
PER339 L     RW1,XTRPTR                                                 08660021
         LA    RW1,DX1(RW1)    BLANK                                    08670021
       ST    RW1,XTRPTR                                                 08680021
         B     PER335              GO CONTINUE SCAN                     08690021
* END OF MESSAGE TEXT                                                   08700021
PER034 L     RW1,XTRPTR       NO NEED TO CALL STRING ROUTINE,           08710021
         MVI   DX0(RW1),XX4B    SINCE THIS IS END OF MESSAGE.           08720021
PER035 DS    0H                                                         08730021
       L     R15,XPUT                                                   08740021
         BALR  RS1,R15             GO PUT                               08750021
* BACK TO GET NEXT                                                      08760021
         B     PER010              GO PROCESS NEXT                      08770021
*                                                                       08780021
* MISPLACED PARAMETER RECORD - SKIP                                     08790021
PER040 SR    RW1,RW1                                                    08800021
       IC    RW1,A6PARN            PARAMETER LENGTH                     08810021
         LA    RW1,DX2(RW1)         + 2 IS                              08820021
       STH   RW1,X4LEN                                                  08830021
         B     PER010              GO PROCESS NEXT                      08840021
       EJECT                                                            08850021
*=1   ERROR MESSAGE PROCESSING FINISHED                                 08860021
*                                                                       08870021
F4FIN  DS    0H                                                         08880021
F4DONE EQU   *                                                          08890021
XCLOSE DS    0H                                                         08900021
         L     R15,XPUT                                                 08910021
         BALR  RS1,R15             MAKE SURE NOTHING LEFT               08920021
*=1    END OF ERROR NSG PROCESSING                                      08930021
         BALR  R0,RB2              CALL PH00                            08940021
       DC    X'B0'                                                      08950021
       EJECT                                                            08960021
*                                                                       08970021
AEDATA DC    A(EDATA)                                                   08980021
XERRID DC    C'ERRMSG  '                                                08990021
X6M2   DC    F'15'                                                      09000021
X6M4     DC    X'00'                                                    09010021
X6MA   DC    F'255'                                                     09020021
C69    DC    F'249'      F9 MASK                                        09030021
C6M1   DC    A(7)                                                       09040021
FW127  DC    F'127'                                                     09050021
X6M9   DC    F'511'                                                     09060021
X6M13  DC    F'8191'                                                    09070021
X63    DC    H'3'                                                       09080021
X6H5   DC    H'5'                                                       09090021
CHX40  DC    H'64'                                                      09100021
CH49   DC    H'49'                                                      09110021
X6H12  DC    H'12'                                                      09120021
X6256  DC    H'256'                                                     09130021
GPNC   DC    C'PN=0'                                                    09140021
GGNC   DC    C'GN=0'                                                    09150021
GVNC   DC    C'VN=0'                                                    09160021
XRPD   DC    C'RPD='                                                    09170021
X6M3   DC    F'255'                                                     09180021
C6M3   EQU   X6M3                                                       09190021
C6M2   EQU   X6M2                                                       09200021
MAXPRM DC    H'32512'                                                   09210021
X6M7   DC    F'65535'                                                   09220021
C6X40  DC    H'64'                                                      09230021
C6M7   EQU   X6M7                                                       09240021
CCNIDW DC    C'1100I-W'                                                 09250021
MSSHDG DC    C'CARD   '                                                 09260021
       DC    C'ERROR MESSAGE'                                           09270021
CCSEQ  DC    C'SEQUENCE ERRORS '                                        09280021
       DC    C'IN SOURCE PROGRA'                                        09290021
       DC    C'M.'                                                      09300021
EMLHDG DC    C'PHASE   MESSAGES'                                        09310021
CCIKF  DC    C'IKF'                                                     09320021
ESEVS  DC    C'WCEEEEEED'                                               09330021
*            BLQUOT AND QUOTBL MUST BE TOGETHER                         09340021
BLQUOT DC    C' '''                                                     09350021
QUOTBL DC    C''' '                                                     09360021
ETXACT DC    X'0002CC'        SPECIAL ACTION CODE                       09370021
CASTRS DC    C'**'                                                      09380021
C6LOW5 DC    F'31'                                                      09390021
XTREND DC    A(XU6REC+105)                                              09400021
XS6010 DC    A(S6010)                                                   09410021
XXSYMC DC    A(XSYMC)                                                   09420021
XPUT   DC    A(PUT)                                                     09430021
XSTRNG DC    A(STRING)                                                  09440021
XGETF4 DC    A(GETF4)                                                   09450021
XS6200 DC    A(S6200)                                                   09460021
XTABLE DC    A(TABLES)                                                  09470021
XXGT2C DC    A(XDCBC)                                                   09480021
XXGT1C DC    A(XSAVC-4)                                                 09490021
APARAM DC    A(PAR000)                                                  09500021
APREND DC    A(PAREND)                                                  09510021
ATRTBL DC    A(TRTABL)                                                  09520021
AEACAD DC    A(EACT00)                                                  09530021
AENDEA DC    A(ENDEAC)                                                  09540021
XERRTB DC    X'00'                                                      09550021
       DC    AL3(ERRTBL)                                                09560021
       DC    H'1500'                                                    09570021
       DC    H'0'                                                       09580021
AERRTB EQU   XERRTB                                                     09590021
***  BEGINNING OF BLOCK WHICH MUST STAY TOGETHER  ***                   09600021
PHMESS   DS    0F                                                       09610021
         DC    A(TX1000)           PH1 MESSAGES                         09620021
       DC    A(PH1ERR)                                                  09630021
       DC    H'573'                    HIGHEST = 191              9321  09640021
         DC    H'0'                                                     09650021
         DC    A(TX2000)           PH2 MESSAGES                         09660021
       DC    A(PH2ERR)                                                  09670021
         DC    H'693'             HIGHEST = 230                   51873 09680021
         DC    H'0'                                                     09690021
         DC    A(TX3000)           PH3 MESSAGES                         09700021
       DC    A(PH3ERR)                                                  09710021
         DC    H'93'                HIGHEST = 30                        09720021
         DC    H'0'                                                     09730021
         DC    A(TX4000)           PH4 MESSAGES                         09740021
       DC    A(PH4ERR)                                                  09750021
         DC    H'453'          HIGHEST = 150                      43536 09760021
         DC    H'0'                                                     09770021
       DC    A(TX5000)            PH5 MESSAGES                          09780021
       DC    A(PH5ERR)                                                  09790021
       DC    H'57'                 HIGHEST = 18                         09800021
       DC    H'0'                                                       09810021
APHXER   DC    A(TXTEND)           END OF MESSAGE TEXT                  09820021
***  END OF BLOCK WHICH MUST STAY TOGETHER  ***                         09830021
***  BEGINNING OF BLOCK WHICH MUST STAY TOGETHER ***                    09840021
ADRTAB DC    AL4(TX1064)                                                09850021
       DC    AL4(TX1129)                                                09860021
       DC    AL4(TX2064)                                                09870021
       DC    AL4(TX2129)                                                09880021
       DC    AL4(TX4064)                                                09890021
***  END OF BLOCK WHICH MUST STAY TOGETHER  ***                         09900021
AADRTB DC    A(ADRTAB)                                                  09910021
ADRSAV DS    F                                                          09920021
SAVR1  DS    F                                                          09930021
SAVEXT DS    F                                                          09940021
APARTB DC    A(PARTAB)                                                  09950021
       DC    H'1536'                                                    09960021
       DC    H'0'                                                       09970021
AEACTB DC    A(EACTAB)                                                  09980021
       DC    H'147'               HIGHEST = 48                          09990021
EDATA  EQU   *                                                          10000021
PH7SAV DS    18F                                                        10010021
PATCH7 DS    25F                       PATCH AREA FOR PH7 CODING        10020021
XH7COS DS    F                                                          10030021
SVREG  DS    16F                                                        10040021
XAPTXT DS    F                                                          10050021
XEGSTR DS    F                                                          10060021
XTRPTR DS    F                                                          10070021
XXADDR DS    F                                                          10080021
X6RW2  DS    F                                                          10090021
X6WRK0 DS    F                                                          10100021
       DS    0D                                                         10110021
X6WRK1 DS    C                                                          10120021
X6WRK2 DS    C                                                          10130021
X6WRK3 DS    C                                                          10140021
X6WRK4 DS    C                                                          10150021
X6WRK5 DS    C                                                          10160021
X6WRK6 DS    C                                                          10170021
X6WRK7 DS    C                                                          10180021
X6WRK8 DS    C                                                          10190021
       DS    C                                                          10200021
X4LEN  DS    H                                                          10210021
G4LEN  EQU   X4LEN                                                      10220021
XTRTOT DS    H                                                          10230021
X4SW   DS    C                                                          10240021
F4SW   EQU   X4SW                                                       10250021
TESTSW DC X'00'                                                         10260021
MSSPTR DS    F                                                          10270021
MESNUM DS    H                                                          10280021
PHASE  DS    C                                                          10290021
SEPAR  DS    C                                                          10300021
PERSW  DS    C                                                          10310021
*=1    7.  OUTPUT AREA--SYSOU LISTING                                   10320021
*                                                                       10330021
OU6REC DS    0CL120                                                     10340021
       DS    C                                                          10350021
OU6CDN DS    CL5              CARD NUMBER                               10360021
       DS    CL2                                                        10370021
OU6STR DS      CL1          ASTERISK                                    10380021
OU6LST DS      CL10         LISTING TEXT (PN OR VERB)                   10390021
       DS      CL1                                                      10400021
OU6LC  DS    CL6                        LOCATION COUNTER                10410021
       DS    CL2                                                        10420021
OU6OP  DS    CL2                        OP CODE                         10430021
       DS    CL1                                                        10440021
OU6R1  DS    CL1                        REGISTER 1                      10450021
OU6R2  DS    CL1                        REGISTER 2                      10460021
       DS    CL1                                                        10470021
OU6B1  DS    CL1                        BASE 1                          10480021
       DS    CL1                                                        10490021
OU6D1  DS    CL3                        DISPLACEMENT 1                  10500021
       DS    CL1                                                        10510021
OU6B2  DS    CL1                        BASE 2                          10520021
       DS    CL1                                                        10530021
OU6D2  DS    CL3                        DISPLACEMENT 2                  10540021
       DS      CL2                                                      10550021
OU6NAM DS      CL8          NAME                                        10560021
       DS    CL1                                                        10570021
OU6OPN DS    CL5                        OPERATION                       10580021
       DS    CL1                                                        10590021
OU6OPD DS      CL21         OPERANDS(ACTUAL)                            10600021
       DS      CL1                                                      10610021
OU6SO1 EQU    *                                                         10620021
OU6S1  DS      CL15         OPERAND 1 (SYMBOLIC)                        10630021
       DS      CL1                                                      10640021
OU6SO2 EQU    *                                                         10650021
OU6S2  DS      CL15         OPERAND 2 (SYMBOLIC)                        10660021
       DS      CL5                                                      10670021
XU6REC EQU   OU6REC                                                     10680021
*=1    2.  PROCESS A-TEXT ELEMENTS--SUBROUTINES                         10690021
*                                                                       10700021
*      SUBROUTINES   LINK BY L  15,ADCON FOR BASE                       10710021
*     BALR  RS1,R15                                                     10720021
*                                                                       10730021
*                                                                       10740021
*                                                                       10750021
*=1          CONVERT HEXADECIMAL WORD TO DECIMAL CHARACTERS             10760021
*            WORD FOR CONVERSION IS IN C6WRK0 BEFORE LINK               10770021
*            DECIMAL CHARACTERS IN C6WRK1-8 WHEN RETURN                 10780021
         DS    0H                                                       10790021
      USING *,R15                                                       10800021
S6010 STM   R0,R15,SVREG                                                10810021
*                                                                       10820021
         UNPK  X6WRK1(LX9),X6WRK0(LX5)                                  10830021
         LA    RW2,DX8                   INIT CTR                       10840021
       SR    RW1,RW1                    CLEAR REGISTER                  10850021
S6020    IC    RW1,X6WRK1-NX1(RW2)                                      10860021
       CL    RW1,C69                    IS A-F                          10870021
       BC    HI,S6040                     YES                           10880021
S6030  BCT   RW2,S6020                  GET NEXT CHARACTER              10890021
      LM    R0,R15,SVREG                                                10900021
         BCR   UNCOND,RS1      EXIT                                     10910021
*                                                                       10920021
S6040  N     RW1,C6M1                   CLEAR ALL BUT LOW-ORD 3 BIT     10930021
       IC    RW1,S6060(RW1)        LOAD APPROPRIATE CHAR                10940021
         STC   RW1,X6WRK1-NX1(RW2)                                      10950021
       BC    UNCOND,S6030          GO TO EXIT                           10960021
S6060  DC    CL8'00ABCDEF'                                              10970021
    DROP  R15                                                           10980021
*                                                                       10990021
*=1          CONVERT MAX 255 BINARY TO DECIMAL,COUNT SIGNIFICANT CH     11000021
*            VALUE IS IN RW1 BEFORE LINK                                11010021
*            SIGNIFICANT CHARACTERS IN C6WRK6-8 WHEN RETURN             11020021
*            NUMBER-1 OF SIGNIFICANT CHARS IN RW2 WHEN RETURN           11030021
*            OU6OPD+RW2 IN RW3 WHEN RETURN                              11040021
      USING *,R15                                                       11050021
S6200  N     RW1,C6M3                   CLEAR ALL BUT LOW-ORD 8 BIT     11060021
S6210  N     RW1,C6M7              CLEAR FIRST 2 BYTES                  11070021
       BC    UNCOND,S6240          GO CONVERT                           11080021
S6260    SRL   RW1,DX4              RIGHT-JUSTIFY                       11090021
S6250  N     RW1,C6M2              USE 4 BITS                           11100021
S6240 STM   R0,R15,V6210                                                11110021
       CVD   RW1,X6WRK1                                                 11120021
       L     RW1,X6WRK5         XXXXX+                                  11130021
         SRL   RW1,DX4                   DROP SIGN BITS                 11140021
       ST    RW1,X6WRK0                                                 11150021
      L     R15,XS6010          CONVERT                                 11160021
      BALR  RS1,R15                      ROUTINE                        11170021
      L     R15,XS6200                                                  11180021
         LA    RW2,DX4              INIT RW2 COUNT                      11190021
S6230    CLI   X6WRK4,XC0    SIGNIFICANT                                11200021
       BC    NOTEQ,S6220                  YES                           11210021
         MVC   X6WRK4(LX4),X6WRK5                                       11220021
       BCT   RW2,S6230             MODIFY COUNT AND TEST                11230021
S6220  EQU   *                                                          11240021
       ST    RW2,X6RW2                                                  11250021
      LM    R0,R15,V6210                                                11260021
       L     RW2,X6RW2                                                  11270021
         EX    RW2,DX0(RS1)    EXECUTE MVC INSTR FOR FIELD              11280021
       AR    RW3,RW2                    TO STEP OPERAND ADDR            11290021
         LA    RS1,DX6(RS1)     EXIT                                    11300021
         BCR   UNCOND,RS1             EXIT                              11310021
V6210  DS    16F                                                        11320021
    DROP  R15                                                           11330021
       EJECT                                                            11340021
IKF702 CSECT                                                            11350021
*=1        GETF4         PROCESS FILE F4                                11360021
*                                                                       11370021
*            CALLED BY  L   15,AGETF4 ... BALR  14,15                   11380021
*            NORMAL RETURN   BCR  15,14                                 11390021
*            EOF RETURN      BCR  15,RW2                                11400021
*            AT EXIT                                                    11410021
*              INPUTR  OR  F4REG (AS SPECIFIED) HAS LOCATION            11420021
*              OF DESIRED RECORD, G4LEN HAS RECORD LENGTH.              11430021
*            F4SW USED TO DETERMINE PROPER RECORD HANDLING              11440021
*                                                                       11450021
      USING GETF4,R15                                                   11460021
GETF4  DS    0H                                                         11470021
         TM    F4SW,XX08                                                11480021
       BCR   NOTZER,RW2       EOF EXIT                                  11490021
         TM    F4SW,XX10                                                11500021
       BC    NOTZER,GT405     POSITION TO 01                            11510021
         TM    F4SW,XX04                                                11520021
       BCR   NOTZER,RW2       TAKE EOF UNTIL REQUEST                    11530021
GT405    NI    F4SW,XXFB        TO POSITION TO 01                       11540021
      STM   R0,R15,SGETF4                                               11550021
         TM    F4SW,XX80                                                11560021
       BC    NOTZER,GT4C      GET INITIAL BLOCK                         11570021
       LR    RW3,F4REG                                                  11580021
         TM    F4SW,XX40                                                11590021
       BC    ZERO,GT4A             DON'T USE INPUTR                     11600021
       LR    RW3,INPUTR       USE INPUTR                                11610021
GT4A   AH    RW3,G4LEN                                                  11620021
         CLI   DX0(RW3),XX77                                            11630021
       BC    EQ,G4EOFX             GO TO EOFEXIT                        11640021
GT4B     CLI   DX0(RW3),XXFF                                            11650021
       BC    NOTEQ,GT4E       NO NEW BLOCK NEEDED                       11660021
GT4C   EQU   *                                                          11670021
         TM    SWITCH+NX1,RDERRFIL                                      11680021
         BC    NOTONE,GT4D         GO READ F4                           11690021
         BALR  R0,RB2              READ F4                              11700021
       DC    X'04'                                                      11710021
         BC    UNCOND,GT4J         SEE IF EOF                           11720021
GT4D     DS    0H                                                       11730021
         BALR  R0,RB2              READ F3                              11740021
         DC    X'03'                                                    11750021
GT4J     DS    0H                                                       11760021
       BC    EOF,G4EOF             IF EOF RETURN                        11770021
      LR    RW3,R0                                                      11780021
         B     GT4B            CHECK FOR FF                             11790021
GT4E   ST    RW3,G4FND                                                  11800021
         NI    F4SW,XX7F       TURN OFF NEW BLOCK BIT                   11810021
         TM    F4SW,XX20                                                11820021
       BC    ZERO,GT4I        NOT IN LISTING TEXT                       11830021
         IC    RW1,DX0(RW3)                                             11840021
       N     RW1,FW127        LAST 7 BITS FOR LENGTH                    11850021
       STH   RW1,G4LEN                                                  11860021
         CLI   DX0(RW3),XX01                                            11870021
       BC    LO,G4ER1              ERROR                                11880021
       BC    HI,GT4F               SEE IF RETURN                        11890021
         TM    F4SW,XX10       END OF LISTING                           11900021
       BC    ZERO,G4ER2       NOT EXPECTED                              11910021
         B     GT4G                GO RESTORE REGS                      11920021
GT4F     TM    F4SW,XX10                                                11930021
       BC    NOTZER,GT4A      SKIP TO 01                                11940021
GT4G  LM    R0,R15,SGETF4                                               11950021
GT4G5  DS    0H                                                         11960021
         TM    F4SW,XX40                                                11970021
       BC    ZERO,GT4H        USE F4REG                                 11980021
       L     INPUTR,G4FND                                               11990021
         BCR   UNCOND,RS1          RERTURN                              12000021
GT4H   L     F4REG,G4FND                                                12010021
         BCR   UNCOND,RS1      RETURN                                   12020021
*                                                                       12030021
GT4I   SR    RW1,RW1                                                    12040021
         CLI   DX0(RW3),CKPTDF                                          12050021
       BC    HI,G4ER3         BAD CODE                                  12060021
         TM    DX0(RW3),XX03                                            12070021
       BC    NOTZER,G4ER3     BAD CODE                                  12080021
         IC    RW1,DX0(RW3)                                             12090021
         SRL   RW1,DX1                                                  12100021
       LH    RW1,LTLB2(RW1)   GET LENGTH FROM TABLE                     12110021
       STH   RW1,X4LEN                                                  12120021
         B     GT4G                GO CHECK                             12130021
*                                                                       12140021
G4EOF    TM    F4SW,XX20                                                12150021
       BC    NOTZER,G4ER4     EOF WHILE DOING LISTING                   12160021
G4EOFX LM R0,R15,SGETF4                                                 12170021
      LR    RS1,RW2             LOAD RETURN REGISTER                    12180021
         B     GT4G5               GO TO EXIT                           12190021
*                                                                       12200021
G4ER1    MVC   XU6REC+NX38(LX23),G4ER01                                 12210021
         B     G4ERC               EOF RETURN                           12220021
G4ER2    OI    F4SW,XX04       EOF EXIT UNTIL POSITION REQUEST          12230021
       XC    G4LEN,G4LEN                                                12240021
         MVC   XU6REC+NX38(LX27),G4ER02                                 12250021
         B     G4ERD               RETURN                               12260021
G4ER3    MVC   XU6REC+NX38(LX24),G4ER03                                 12270021
         B     G4ERC               EOF RETURN                           12280021
G4ER4    MVC   XU6REC+NX38(LX41),G4ER04                                 12290021
G4ERC    OI    F4SW,XX08       EOF RETURN                               12300021
G4ERD    MVC   XU6REC+NX1(LX36),G4ERE                                   12310021
      L     R15,XPUT                                                    12320021
      BALR  RS1,R15                GO PUT MSG OUT                       12330021
      L     R15,XGETF4                                                  12340021
         B     G4EOFX          RETURN                                   12350021
*                                                                       12360021
SGETF4 DS    16F                                                        12370021
G4FND  DS    F                                                          12380021
*                                                                       12390021
G4ERE  DC    C'** ERROR FOUND P'                                        12400021
       DC    C'ROCESSING F4 TEX'                                        12410021
       DC    C'T **'                                                    12420021
G4ER01 DC    C'00 CODE IN LISTI'                                        12430021
       DC    C'NG TEXT'                                                 12440021
G4ER02 DC    C'END OF LISTING T'                                        12450021
       DC    C'EXT REACHED'                                             12460021
G4ER03 DC    C'UNKNOWN DATA A-T'                                        12470021
       DC    C'EXT CODE'                                                12480021
G4ER04 DC    C'EOF REACHED WHIL'                                        12490021
       DC    C'E PROCESSING LIS'                                        12500021
       DC    C'TING TEXT'                                               12510021
*                                                                       12520021
*  TABLE OF LENGTHS BY RECORD TYPE                                      12530021
*                                                                       12540021
*            LENGTH    CODE   RECORD                                    12550021
*                                                                       12560021
LTLB2  DC    H'8'        0    MESSAGE   VARIABLE IF PARAM               12570021
       DC    H'5'        4    DCBADEF                                   12580021
       DC    H'9'        8    DECBADEF                                  12590021
       DC    H'9'        C    BLKADEF                                   12600021
       DC    H'0'        10                                             12610021
       DC    H'0'        14                                             12620021
       DC    H'0'        18                                             12630021
       DC    H'0'        1C                                             12640021
       DC    H'9'        20   SAADEF                                    12650021
       DC    H'8'        24   WSADEF                                    12660021
       DC    H'7'        28   CONDEF    PLUS VF SIZE                    12670021
       DC    H'8'        2C   ACONDEF                                   12680021
       DC    H'8'        30   INDADEF                                   12690021
       DC    H'3'        34   QDEF                                      12700021
       DC    H'3'        38   CKPTDEF                                   12710021
         DC    H'0'           3C                                        12720021
         DC    H'0'           40                                        12730021
         DC    H'0'           44                                        12740021
         DC    H'7'           48                                        12750021
         DC    H'6'           4C                                        12760021
    DROP  R15                                                           12770021
       EJECT                                                            12780021
*=1  PUT ROUTINE                                                        12790021
*                                                                       12800021
*      ENTRY POINTS      PUT--WRITE LINE IF LIST MODE                   12810021
       DS    0H                                                         12820021
      USING *,R15                                                       12830021
PUT    EQU   *                                                          12840021
      STM   R0,R15,SVREG                                                12850021
      LA    R2,OU6REC                                                   12860021
         LA    R3,DX120                                                 12870021
      BALR  R0,RB2                 PUT MSG OUT                          12880021
         DC    X'16'                                                    12890021
         BALR  R0,RB2              CALL PH00                            12900021
         DC    X'86'                                                    12910021
         MVI   OU6REC,XX40     BLANK OUTPUT AREA                        12920021
         MVC   OU6REC+NX1(LX119),OU6REC                                 12930021
      LM    R0,R15,SVREG                                                12940021
         BCR   UNCOND,RS1          RETURN                               12950021
    DROP  R15                                                           12960021
*=1    STRING            THIS ROUTINE STRINGS MESSAGE TEXT              12970021
*                        INTO THE OUTPUT AREA. IT ALSO CALLS            12980021
*                        'PUT' WHEN IT NEEDS A NEW LINE.                12990021
*            INPUT  REG RW1 HAS BEGINNING ADDRESS OF TEXT.              13000021
*                   REG 1 HAS END ADDRESS PLUS 1.                       13010021
*                                                                       13020021
      USING STRING,R15                                                  13030021
STRING DS    0H                                                         13040021
      STM   R0,R15,VSTRIN      SAVE REGS                                13050021
      SR    R1,RW1            LENGTH OF TEXT                            13060021
      LTR   R1,R1                                                       13070021
       BC    ZERO,STR015           GO TO RETURN                         13080021
      LH    R2,XTRTOT                                                   13090021
      AR    R2,R1                                                       13100021
      STH   R2,XTRTOT                                                   13110021
      CH    R1,CHX40                                                    13120021
       BC    NOTHI,STR005     USE MAX 64 CHARACTERS                     13130021
      LH    R1,CHX40                                                    13140021
STR005 DS    0H                                                         13150021
       L     RW2,XTRPTR                                                 13160021
STR010 LR    RW3,RW2                                                    13170021
      AR    RW3,R1                                                      13180021
       C     RW3,XTREND                                                 13190021
       BC    HI,STR020        NO, PUT OUT PREVIOUS LINE                 13200021
      BCTR  R1,R0              MOVE CHARACTERS                          13210021
      EX    R1,MOVING                                                   13220021
      AR    RW2,R1                                                      13230021
         LA    RW2,DX1(RW2)    NEXT RECEIVING FIELD                     13240021
       ST    RW2,XTRPTR                                                 13250021
STR015 DS    0H                                                         13260021
      LM    R0,R15,VSTRIN      RESTORE REGS                             13270021
         BCR   UNCOND,RS1      EXIT                                     13280021
*                                                                       13290021
STR020 DS    0H                                                         13300021
      USING PUT,R15                                                     13310021
      L     R15,XPUT                                                    13320021
         BALR  RS1,R15             GO TO PUT OUT LINE                   13330021
      USING STRING,R15                                                  13340021
      L     R15,XSTRNG                                                  13350021
       L     RW2,XEGSTR                                                 13360021
       ST    RW2,XTRPTR                                                 13370021
         B     STR010              CHECK FOR NEXT                       13380021
*                                                                       13390021
MOVING   MVC   DX0(LX1,RW2),DX0(RW1) EXEC BY STRING                     13400021
VSTRIN DS    16F                                                        13410021
    DROP  R15                                                           13420021
       EJECT                                                            13430021
       SPACE 2                                                          13440021
*=1    TABLES            FIND CURRENT START AND LENGTH OF A TABLE       13450021
*                        INPUT - R1 HAS TIB ADDRESS                     13460021
*                        OUTPUT - R1 HAS START                          13470021
*                               - R2 HAS LENGTH                         13480021
*      NO BASE REGISTER NEEDED                                          13490021
TABLES DS    0H                                                         13500021
         LA    R1,DX0(R1)       ELIMINATE HIGH BYTE                     13510021
      SR    R2,R2              ZERO LENGTH                              13520021
      C     R1,XH7COS                                                   13530021
      BCR   NOTHI,RS1         NO TABLE                                  13540021
         L     R1,DX0(R1)                                               13550021
         LH    R2,DX4(R1)       LENGTH                                  13560021
         L     R1,DX0(R1)                                               13570021
         LA    R1,DX0(R1)       TABLE START                             13580021
         BCR   UNCOND,RS1          RETURN                               13590021
       EJECT                                                            13600021
       EJECT                                                            13610021
*=1    ERROR MESSAGE TABLE                                              13620021
*=                                                                      13630021
TX1000 DC    C'/'                                                       13640021
TX1001 DC    C'NUMERIC LITERAL '                                        13650021
       DC    C'NOT RECOGNIZED A'                                        13660021
       DC    C'S LEVEL NUMBER B'                                        13670021
       DC    C'ECAUSE$ILLEGAL A'                                        13680021
       DC    C'S USED.='                                                13690021
       DC    FL1'34'                                                    13700021
TX1002   DC    C'$SECTION HEADER '                                      13710021
       DC    C'MISSING.='                                               13720021
       DC    FL1'28'                                                    13730021
TX1003   DC    C'$PARAGRAPH NAME '                                      13740021
       DC    C'MISSING.='                                               13750021
       DC    FL1'28'                                                    13760021
TX1004 DC    C'INVALID WORD$.='                                         13770021
       DC    FL1'48'                                                    13780021
TX1005   DC    C'INVALID ORDER IN'                                      13790021
         DC    C' ENVIRONMENT DIV'                                      13800021
         DC    C'ISION. SKIPPING '                                      13810021
         DC    C'TO NEXT DIVISION'                                      13820021
         DC    C'/'                                                     13830021
TX1006 DC    C'DECLARATIVES SEC'                                        13840021
       DC    C'TION WITHOUT USE'                                        13850021
         DC    C' SENTENCE. SECTION CAN NEVER '                         13860021
         DC    C'BE EXECUTED/'                                          13870021
TX1007 DC    C'$NOT PRECEDED BY'                                        13880021
       DC    C' A SPACE.='                                              13890021
       DC    FL1'41'                                                    13900021
TX1008 DC    C'RIGHT PAREN SHOU'                                        13910021
       DC    C'LD NOT BE PRECED'                                        13920021
       DC    C'ED BY SPACE/'                                            13930021
TX1009   DC    C'COPY MUST BE PRE'                                      13940021
         DC    C'CEDED BY PROCEDU'                                      13950021
         DC    C'RE-NAME.='                                             13960021
         DC    FL1'2'                                                   13970021
TX1010 DC    C'LEFT PAREN SHOUL'                                        13980021
       DC    C'D NOT BE FOLLOWE'                                        13990021
       DC    C'D BY SPACE/'                                             14000021
TX1011 DC    C'RECORDING MODE S'                                        14010021
       DC    C'PECIFICATION IS '                                        14020021
       DC    C'INVALID. ASSUMED'                                        14030021
       DC    C' VARIABLE/'                                              14040021
TX1012   DC    C'FILE-NAME NOT UN'                                      14050021
         DC    C'IQUE. USING FIRS'                                      14060021
         DC    C'T DEFINITION/'                                         14070021
TX1013 DC    C'CHARACTER LENGTH'                                        14080021
       DC    C' IN SPECIAL-NAME'                                        14090021
         DC    C'S MUST BE ONE/'                                        14100021
TX1014   DC    C'''FILE'' NOT PRE'                                      14110021
         DC    C'SENT IN MULTIPLE'                                      14120021
         DC    C' FILE CLAUSE.='                                        14130021
         DC    FL1'28'                                                  14140021
TX1015   DC    C'EXTERNAL NAME$IN PROGRAM-ID, '                         14150021
         DC    C'LIBRARY REFERENCE OR SYSTEM NAME INVALID. '            14160021
         DC    C'EXTERNAL NAME='                                        14170021
       DC    FL1'2'                                                     14180021
TX1016   DC    C'MORE THAN ONE$CL'                                      14190021
       DC    C'AUSE.='                                                  14200021
       DC    FL1'30'                                                    14210021
TX1017 DC    C'$INVALID IN$'                                            14220021
       DC    C'CLAUSE.='                                                14230021
       DC    FL1'30'                                                    14240021
TX1018 DC    C'COPY CLAUSE INVA'                                        14250021
       DC    C'LID IN A COPY LI'                                        14260021
         DC    C'BRARY OR LIB OPT'                                      14270021
         DC    C'ION NOT SPECIFIE'                                      14280021
         DC    C'D.='                                                   14290021
       DC    FL1'2'                                                     14300021
TX1019 DC    C'NO LIBRARY NAME.'                                        14310021
       DC    C' COPY='                                                  14320021
       DC    FL1'19'                                                    14330021
TX1020   DC    C'$MUST BE PROCEDU'                                      14340021
         DC    C'RE-NAME FOLLOWIN'                                      14350021
         DC    C'G DEBUG.$/'                                            14360021
       DC    XL1'FF'                                                    14370021
TX1021 DC    C'$DOES NOT BELONG'                                        14380021
       DC    C' ON DEBUG CARD.'                                         14390021
       DC    C'='                                                       14400021
       DC    FL1'31'                                                    14410021
TX1022 DC    C'PERIOD DOES NOT '                                        14420021
       DC    C'BELONG ON DEBUG'                                         14430021
       DC    C' CARD. DELETED/'                                         14440021
TX1023 DC    C'INVALID='                                                14450021
       DC    FL1'47'                                                    14460021
TX1024 DC    C'UNDEFINED='                                              14470021
       DC    FL1'47'                                                    14480021
TX1025 DC    C'REDEFINES CLAUSE'                                        14490021
       DC    C' NOT FIRST CLAUS'                                        14500021
       DC    C'E FOLLOWING DATA'                                        14510021
       DC    C'-NAME. ASSUMED F'                                        14520021
       DC    C'IRST/'                                                   14530021
TX1026   DC    C'TOTALED AND TOTA'                                      14540021
         DC    C'LING AREA CLAUSE'                                      14550021
         DC    C'S MUST BOTH BE S'                                      14560021
         DC    C'PECIFIED/'                                             14570021
TX1027   DC    C'FILE WITH TOTALE'                                      14580021
         DC    C'D AREA CLAUSE AN'                                      14590021
         DC    C'D NON-STANDARD L'                                      14600021
         DC    C'ABELS MAY NOT BE'                                      14610021
         DC    C' OPENED OUTPUT/'                                       14620021
TX1028   DC    C'$SENTENCE IMPROP'                                      14630021
       DC    C'ERLY WRITTEN.='                                          14640021
       DC    FL1'32'                                                    14650021
TX1029   DC    C'$IN$SENTENCE NOT'                                      14660021
         DC    C' DEFINED AS FILE-'                                     14670021
       DC    C'NAME. NAME='                                             14680021
         DC    FL1'2'                                                   14690021
TX1030   DC    C'$IN$SENTENCE IS '                                      14700021
       DC    C'INVALID. WORD='                                          14710021
       DC    FL1'2'                                                     14720021
TX1031   DC    C'USE SENTENCE NOT'                                      14730021
       DC    C' PRECEDED BY SE'                                         14740021
         DC    C'CTION-NAME. SECT'                                      14750021
       DC    C'ION-NAME='                                               14760021
       DC    FL1'1'                                                     14770021
TX1032   DC    C'$INCORRECTLY USE'                                      14780021
         DC    C'D IN USE SENTENC'                                      14790021
       DC    C'E.='                                                     14800021
       DC    FL1'32'                                                    14810021
TX1033   DC    C'$FILE-NAME ALREA'                                      14820021
         DC    C'DY ASSIGNED THIS'                                      14830021
         DC    C' ''SAME'' CLAUSE OPT'                                  14840021
         DC    C'ION. USING FIRST'                                      14850021
         DC    C' ONE/'                                                 14860021
TX1034 DC    C'$CLAUSE IN$LEVEL'                                        14870021
       DC    C' IS TREATED AS C'                                        14880021
       DC    C'OMMENTS IN OS. N'                                        14890021
       DC    C'EXT CLAUSE/'                                             14900021
TX1035   DC    C'INTEGER NOT PRES'                                      14910021
          DC    C'ENT IN MULTIPLE '                                     14920021
         DC    C'FILE CLAUSE/'                                          14930021
TX1036   DC    C'QUALIFIED NAME I'                                      14940021
         DC    C'NVALID AFTER LEV'                                      14950021
       DC    C'EL NUMBER.='                                             14960021
       DC    FL1'33'                                                    14970021
TX1037   DC    C'$INVALID IN DATA'                                      14980021
       DC    C' DESCRIPTION.='                                          14990021
       DC    FL1'30'                                                    15000021
TX1038   DC    C'$INVALID AFTER L'                                      15010021
         DC    C'EVEL NUMBER. SKI'                                      15020021
         DC    C'PPING TO NEXT LE'                                      15030021
         DC    C'VEL/'                                                  15040021
TX1039   DC    C'DATA-NAME IN$CLA'                                      15050021
       DC    C'USE NEED NOT BE '                                        15060021
       DC    C'QUALIFIED.='                                             15070021
       DC    FL1'33'                                                    15080021
TX1040   DC    C'IMPROPER LEVEL N'                                      15090021
         DC    C'UMBER FOR FILE-S'                                      15100021
         DC    C'ECTION/'                                               15110021
TX1041 DC    C'$INVALID AS USED'                                        15120021
       DC    C' IN$SECTION.='                                           15130021
       DC    FL1'34'                                                    15140021
TX1042 DC    C'ASSIGN CLAUSE MI'                                        15150021
       DC    C'SSING IN SELECT.'                                        15160021
       DC    C'='                                                       15170021
       DC    FL1'29'                                                    15180021
TX1043   DC    C'END OF SENTENCE '                                      15190021
         DC    C'SHOULD PRECEDE$.'                                      15200021
       DC    C'='                                                       15210021
       DC    FL1'28'                                                    15220021
TX1044   DC    C'INVALID WORD$.='                                       15230021
         DC    FL1'34'                                                  15240021
TX1045 DC    C'INVALID ORDER IN'                                        15250021
       DC    C'$SECTION/'                                               15260021
TX1046 DC    C'MEMBER NOT FOUND'                                        15270021
       DC    C' IN LIBRARY.='                                           15280021
       DC    FL1'35'                                                    15290021
TX1047 DC    C'LIBRARY NOT FOUN'                                        15300021
       DC    C'D ON SYSTEM.='                                           15310021
       DC    FL1'35'                                                    15320021
TX1048 DC    C'LIBRARY MEMBER H'                                        15330021
       DC    C'AS BAD TRACK. IG'                                        15340021
       DC    C'NORING REST OF C'                                        15350021
       DC    C'OPY/'                                                    15360021
TX1049   DC    C'$FILE-NAME ALREA'                                      15370021
         DC    C'DY ASSIGNED THIS'                                      15380021
         DC    C' MULTIPLE FILE C'                                      15390021
         DC    C'LAUSE OPTION.'                                         15400021
         DC    C' USING FIRST ONE/'                                     15410021
TX1050 DC    C'$FILE ALREADY AS'                                        15420021
       DC    C'SIGNED THIS APPL'                                        15430021
       DC    C'Y OPTION. FILE-N'                                        15440021
       DC    C'AME='                                                    15450021
       DC    FL1'2'                                                     15460021
TX1051 DC    C'NO DATA-NAME IN '                                        15470021
       DC    C'USE SENTENCE.='                                          15480021
       DC    FL1'32'                                                    15490021
TX1052 DC    C'$ILLEGALLY USED '                                        15500021
       DC    C'IN USE SENTENCE.'                                        15510021
       DC    C' END SENTENCE, R'                                        15520021
       DC    C'ESCANNING AT NEX'                                        15530021
       DC    C'T RECOGNIZABLE W'                                        15540021
       DC    C'ORD/'                                                    15550021
TX1053 DC    C'$CLAUSE'                                                 15560021
       DC    C' INVALID.='                                              15570021
       DC    FL1'19'                                                    15580021
TX1054   DC    C'OPERAND FOR INIT'                                      15590021
         DC    C'IATE NOT FOUND O'                                      15600021
         DC    C'R ILLEGAL. OPERA'                                      15610021
         DC    C'ND DROPPED/'                                           15620021
TX1055 DC    C'VALID FILE-NAME '                                        15630021
       DC    C'NOT PRESENT. DES'                                        15640021
       DC    C'CRIPTION='                                               15650021
       DC    FL1'2'                                                     15660021
TX1056 DC    C'FILE-NAME NOT DE'                                        15670021
       DC    C'FINED IN A SELEC'                                        15680021
       DC    C'T. DESCRIPTION='                                         15690021
       DC    FL1'2'                                                     15700021
TX1057 DC    C'FIRST WORD IN RE'                                        15710021
       DC    C'PORT SECTION NOT'                                        15720021
       DC    C' RD.='                                                   15730021
       DC    FL1'2'                                                     15740021
TX1058 DC    C'NO REPORTS CLAUS'                                        15750021
       DC    C'E IN FILE SECTIO'                                        15760021
       DC    C'N. REPORT SECTIO'                                        15770021
       DC    C'N='                                                      15780021
       DC    FL1'2'                                                     15790021
TX1059 DC    C'NO REPORT CLAUSE'                                        15800021
       DC    C' FOR RD. RD='                                            15810021
       DC    FL1'2'                                                     15820021
TX1060 DC    C'INVALID WORD IN '                                        15830021
         DC    C'REPORT WRITER STATEMENT.='                             15840021
       DC    FL1'2'                                                     15850021
TX1061 DC    C'DUPLICATE CLAUSE'                                        15860021
         DC    C'='                                                     15870021
       DC    FL1'36'                                                    15880021
TX1062   DC    C'$IN COPY REPLACING STATEMENT '                         15890021
         DC    C'INVALID AS BCD NAME/'                                  15900021
TX1063 DC    C'DUPLICATE ENTRY '                                        15910021
       DC    C'IN PAGE CLAUSE.='                                        15920021
       DC    FL1'36'                                                    15930021
IKF703 CSECT                                                            15940021
TX1064 DC    C'NO TYPE CLAUSE S'                                        15950021
       DC    C'PECIFIED.='                                              15960021
       DC    FL1'27'                                                    15970021
TX1065 DC    C'INTEGER MISSING '                                        15980021
       DC    C'IN PAGE CLAUSE. '                                        15990021
       DC    C'ENTRY='                                                  16000021
       DC    FL1'2'                                                     16010021
TX1066 DC    C'INVALID WORD IN '                                        16020021
       DC    C'PAGE CLAUSE.='                                           16030021
       DC    FL1'48'                                                    16040021
TX1067 DC    C'INVALID HEADER.='                                        16050021
       DC    FL1'48'                                                    16060021
TX1068 DC    C'OPERAND FOR GENE'                                        16070021
       DC    C'RATE NOT FOUND. '                                        16080021
       DC    C'CLAUSE='                                                 16090021
       DC    FL1'36'                                                    16100021
TX1069 DC    C'INVALID TYPE CLA'                                        16110021
       DC    C'USE.='                                                   16120021
       DC    FL1'27'                                                    16130021
TX1070   DC    C'FLT-PT LIT MANTI'                                      16140021
         DC    C'SSA EXCEEDS 16 D'                                      16150021
         DC    C'IGITS. TRUNCATED'                                      16160021
       DC    C' '                                                       16170021
         DC    C'TO 16/'                                                16180021
TX1071   DC    C'FLT-PT LIT EXPON'                                      16190021
         DC    C'ENT EXCEEDS 2 DI'                                      16200021
         DC    C'GITS. TRUNCATED '                                      16210021
         DC    C'TO 2. RESCANNING'                                      16220021
         DC    C'/'                                                     16230021
TX1072   DC    C'FLT-PT LIT EXPON'                                      16240021
         DC    C'ENT FOLLOWED BY '                                      16250021
         DC    C'NON-BLANK. RESCA'                                      16260021
         DC    C'NNING AT NON-BLA'                                      16270021
         DC    C'NK/'                                                   16280021
TX1073   DC    C'FLT-PT LIT E FOL'                                      16290021
         DC    C'LOWED BY INVALID'                                      16300021
       DC    C' CHARACTER.='                                            16310021
       DC    FL1'37'                                                    16320021
TX1074   DC    C'FLT-PT LIT SIGN '                                      16330021
         DC    C'FOLLOWED BY INVA'                                      16340021
       DC    C'LID CHARACTER.='                                         16350021
       DC    FL1'37'                                                    16360021
TX1075   DC    C'FLT-PT LIT EXCEE'                                      16370021
         DC    C'DS LIMIT. ASSUME'                                      16380021
         DC    C' MAX OR MIN PER '                                      16390021
         DC    C'SIGN OF EXPONENT'                                      16400021
         DC    C'/'                                                     16410021
TX1076   DC    C'ALPHANUMERIC LIT'                                      16420021
         DC    C' EXCEEDS 120 CHA'                                      16430021
         DC    C'RACTERS. TRUNCAT'                                      16440021
         DC    C'ED TO 120/'                                            16450021
TX1077   DC    C'ALPHANUMERIC LIT'                                      16460021
         DC    C' CONTINUES IN A-'                                      16470021
         DC    C'MARGIN. ASSUME B'                                      16480021
         DC    C'-MARGIN/'                                              16490021
TX1078 DC    C'ALPHA-LITERAL CO'                                        16500021
       DC    C'NTINUED WITH MIS'                                        16510021
       DC    C'SING HYPHEN OR Q'                                        16520021
       DC    C'UOTE.='                                                  16530021
       DC    FL1'1'                                                     16540021
TX1079   DC    C'ALPHANUMERIC LIT'                                      16550021
         DC    C' HAS ZERO LENGTH'                                      16560021
         DC    C'. ASSUME ONE SPA'                                      16570021
         DC    C'CE/'                                                   16580021
TX1080 DC    C'PERIOD PRECEDED'                                         16590021
       DC    C' BY SPACE.='                                             16600021
       DC    FL1'38'                                                    16610021
TX1081   DC    C'PERIOD NOT FOLLO'                                      16620021
         DC    C'WED BY SPACE.='                                        16630021
       DC    FL1'38'                                                    16640021
TX1082   DC    C'NUMERIC LIT EXCE'                                      16650021
         DC    C'EDS 18 DIGITS. T'                                      16660021
         DC    C'RUNCATED TO 18/'                                       16670021
*                                                                       16680021
TX1083   DC    C'ILLEGAL CHARACTE'                                      16690021
         DC    C'R. SCAN RESUMED '                                      16700021
         DC    C'AT NEXT VALID CH'                                      16710021
         DC    C'ARACTER/'                                              16720021
TX1084   DC    C'COMMA SHOULD NOT'                                      16730021
       DC    C' BE PRECEDED BY'                                         16740021
         DC    C' SPACE/'                                               16750021
TX1085 DC    C'WORD OR PICTURE '                                        16760021
       DC    C'EXCEEDS'                                                 16770021
       DC    C' 30 CHARACTERS. '                                        16780021
         DC    C'TRUNCATED TO 30 '                                      16790021
         DC    C'CHARACTERS/'                                           16800021
TX1086 DC    C'$SHOULD BEGIN A-'                                        16810021
         DC    C'MARGIN/'                                               16820021
TX1087 DC    C'''$'' SHOULD NOT'                                        16830021
       DC    C' BEGIN A-MARGIN/'                                        16840021
TX1088 DC    C'MISSING FIRST IN'                                        16850021
       DC    C'SERT OR DELETE C'                                        16860021
       DC    C'ARD. PASS CARDS '                                        16870021
       DC    C'UNTIL FOUND.$/'                                          16880021
TX1089 DC    C'INSERT OR DELETE'                                        16890021
       DC    C' NUMBER OUT OF S'                                        16900021
       DC    C'EQUENCE.='                                               16910021
       DC    FL1'39'                                                    16920021
TX1090 DC    C'DELETE THRU NUMB'                                        16930021
       DC    C'ER OUT OF SEQUEN'                                        16940021
       DC    C'CE. PASS CARDS U'                                        16950021
       DC    C'NTIL NEXT INSERT'                                        16960021
       DC    C' OR DELETE.$/'                                           16970021
TX1091   DC    C'$IN A-MARGIN NOT'                                      16980021
         DC    C' VALID AS PROC-N'                                      16990021
         DC    C'M. ASSUME B-MARG'                                      17000021
         DC    C'IN/'                                                   17010021
TX1092   DC    C'DECLARATIVES DO '                                      17020021
         DC    C'NOT FOLLOW PROCE'                                      17030021
       DC    C'DURE DIVISION.='                                         17040021
       DC    FL1'2'                                                     17050021
TX1093   DC    C'NO DECLARATIVES '                                      17060021
         DC    C'SECTION. END DEC'                                      17070021
       DC    C'LARATIVES='                                              17080021
       DC    FL1'2'                                                     17090021
TX1094   DC    C'INTEGER IN ''NEXT GROUP'''                             17100021
         DC    C' CLAUSE DOES NOT CONF'                                 17110021
         DC    C'ORM TO PAGE CLAU'                                      17120021
         DC    C'SE SPECIFICATION'                                      17130021
         DC    C'S.='                                                   17140021
         DC    FL1'29'                                                  17150021
TX1095 DC    C'WORD ''SECTION'''                                        17160021
       DC    C' OR ''DIVISION'''                                        17170021
       DC    C' MISSING'                                                17180021
       DC    C'.='                                                      17190021
       DC    FL1'28'                                                    17200021
TX1096   DC    C'DATANAME IN UPON'                                      17210021
         DC    C' CLAUSE NOT SPEC'                                      17220021
         DC    C'IFIED AS A DATA-'                                      17230021
         DC    C'NAME FOR A TYPE D'                                     17240021
         DC    C'ETAIL REPORT GRO'                                      17250021
         DC    C'UP IN THIS REPOR'                                      17260021
         DC    C'T. UPON OPTION'                                        17270021
         DC    C'='                                                     17280021
         DC    FL1'2'                                                   17290021
TX1097 DC    C'PROGRAM-ID MISSI'                                        17300021
       DC    C'NG OR MISPLACED.'                                        17310021
       DC    C' IF PROGRAM-ID D'                                        17320021
       DC    C'OES NOT IMMEDIAT'                                        17330021
       DC    C'ELY FOLLOW IDENT'                                        17340021
       DC    C'IFICATION DIVISI'                                        17350021
       DC    C'ON, IT WILL BE I'                                        17360021
       DC    C'GNORED/'                                                 17370021
TX1098 DC    C'ALPHA LITERAL NO'                                        17380021
       DC    C'T CONTINUED WITH'                                        17390021
       DC    C' HYPHEN AND QUOT'                                        17400021
       DC    C'E. END LITERAL O'                                        17410021
       DC    C'N LAST CARD/'                                            17420021
TX1099   DC    C'$IS INVALID AS U'                                      17430021
       DC    C'SED. IGNORED/'                                           17440021
TX1100 DC    C'$SEQUENCE ERRORS'                                        17450021
       DC    C' IN SOURCE PROGR'                                        17460021
       DC    C'AM/'                                                     17470021
TX1101 DC    C'NEXT PAGE NOT IN'                                        17480021
       DC    C' FIRST LINE CLAU'                                        17490021
       DC    C'SE.='                                                    17500021
       DC    FL1'2'                                                     17510021
TX1102   DC    C'INCOMPLETE ELEMENTARY '                                17520021
         DC    C'ITEM. ASSUME VALU'                                     17530021
       DC    C'E SPACES/'                                               17540021
TX1103 DC    C'GROUP TYPE ALLOW'                                        17550021
       DC    C'ED ONCE FOR RD.='                                        17560021
       DC    FL1'2'                                                     17570021
TX1104 DC    C'CONTROL NAME NOT'                                        17580021
       DC    C' SPECIFIED IN RD'                                        17590021
       DC    C'.='                                                      17600021
       DC    FL1'27'                                                    17610021
TX1105   DC    C'ELEMENTARY ITEM EXPECTE'                               17620021
       DC    C'D.='                                                     17630021
       DC    FL1'1'                                                     17640021
TX1106 DC    C'OPERAND FOR TERM'                                        17650021
       DC    C'INATE NOT FOUND '                                        17660021
       DC    C'OR ILLEGAL. OPER'                                        17670021
       DC    C'AND='                                                    17680021
       DC    FL1'36'                                                    17690021
TX1107   DC    C'''NEXT GROUP'' C'                                      17700021
         DC    C'LAUSE IS ILLEGAL'                                      17710021
         DC    C' FOR THIS REPORT'                                      17720021
         DC    C' GROUP.='                                              17730021
         DC    FL1'2'                                                   17740021
TX1108 DC    C'$IS NOT A POSITI'                                        17750021
       DC    C'VE INTEGRAL NUMB'                                        17760021
       DC    C'ER.='                                                    17770021
       DC    FL1'46'                                                    17780021
TX1109 DC    C'DUPLICATE USE OF'                                        17790021
       DC    C' CONTROL NAME.='                                         17800021
       DC    FL1'27'                                                    17810021
TX1110 DC    C'INVALID USE OF S'                                        17820021
       DC    C'UM CLAUSE.='                                             17830021
         DC    FL1'19'                                                  17840021
TX1111 DC    C'ELEMENTARY LEVEL'                                        17850021
       DC    C' WITHOUT COLUMN '                                        17860021
       DC    C'OR SUM CLAUSE/'                                          17870021
TX1112 DC    C'''$'' ALREADY SP'                                        17880021
       DC    C'ECIFIED IN 2 FIL'                                        17890021
       DC    C'E DESCRIPTION EN'                                        17900021
       DC    C'TRIES.='                                                 17910021
       DC    FL1'2'                                                     17920021
TX1113 DC    C'EXPECTING 6-DIGI'                                        17930021
       DC    C'T SEQUENCE NUMBE'                                        17940021
       DC    C'R.='                                                     17950021
       DC    FL1'39'                                                    17960021
TX1114 DC    C'EXTRANEOUS COMMA'                                        17970021
       DC    C' OR HYPHEN ON DE'                                        17980021
       DC    C'LETE CARD.='                                             17990021
       DC    FL1'2'                                                     18000021
TX1115 DC    C'NO BLANK, COMMA '                                        18010021
       DC    C'OR HYPHEN FOLLOW'                                        18020021
       DC    C'ING SEQUENCE NUM'                                        18030021
       DC    C'BER. ASSUME BLAN'                                        18040021
       DC    C'K.$/'                                                    18050021
TX1116 DC    C'EXPECTING 6-DIGI'                                        18060021
       DC    C'T SEQUENCE NUMBE'                                        18070021
       DC    C'R AFTER HYPHEN. '                                        18080021
       DC    C'IGNORING DELETE '                                        18090021
       DC    C'FROM THRU NUMBER'                                        18100021
       DC    C'.$/'                                                     18110021
TX1117 DC    C'DELETE NUMBER GR'                                        18120021
       DC    C'EATER THAN LAST '                                        18130021
       DC    C'SEQUENCE NUMBER.'                                        18140021
       DC    C'='                                                       18150021
       DC    FL1'40'                                                    18160021
TX1118 DC    C'INSERT NUMBER GR'                                        18170021
       DC    C'EATER THAN LAST '                                        18180021
       DC    C'SEQUENCE NUMBER.'                                        18190021
       DC    C'='                                                       18200021
       DC    FL1'40'                                                    18210021
TX1119   DC    C'INTEGER IN ''LINE'' '                                  18220021
         DC    C'CLAUSE DOES NOT '                                      18230021
         DC    C'CONFORM TO PAGE '                                      18240021
         DC    C'CLAUSE SPECIFICA'                                      18250021
         DC    C'TIONS.='                                               18260021
         DC    FL1'11'                                                  18270021
TX1120 DC    C'COMMA NOT FOLLOW'                                        18280021
         DC    C'ED BY SPACE.='                                         18290021
         DC    FL1'01'                                                  18300021
TX1121 DC    C'PERIOD OR COMMA '                                        18310021
       DC    C'INVALID AS USED '                                        18320021
       DC    C'IN PICTURE CLAUS'                                        18330021
       DC    C'E/'                                                      18340021
TX1122   DC    C'EXTERNAL-NAME IN RERUN CLAUSE MUST'                    18350021
         DC    C' NOT BE THE SAME AS SYSTEM-NAME '                      18360021
         DC    C'USED IN ASSIGN CLAUSE.='                               18370021
         DC    FL1'32'                                                  18380021
TX1123   DC    C'NUMBER IS ZERO'                                        18390021
         DC    C' O'                                                    18400021
         DC    C'R NEGATIVE.='                                          18410021
         DC    FL1'32'                                                  18420021
TX1124   DC    C'NUMBER TOO LARGE'                                      18430021
         DC    C' FOR RERUN.='                                          18440021
         DC    FL1'32'                                                  18450021
TX1125   DC    C'$FILE-NAME USED '                                      18460021
         DC    C'IN PREVIOUS RERU'                                      18470021
         DC    C'N. USING FIRST O'                                      18480021
         DC    C'NE/'                                                   18490021
TX1126   DC    C'$FILE-NAME SPECI'                                      18500021
         DC    C'FIED IN BOTH RER'                                      18510021
         DC    C'UN AND USING OR '                                      18520021
         DC    C'GIVING OPTION. R'                                      18530021
         DC    C'ERUN='                                                 18540021
         DC    FL1'2'                                                   18550021
TX1127   DC    C'$INVALID IN$SENTENCE.'                                 18560021
         DC    C' REST OF SENTENCE='                                    18570021
         DC    FL1'02'                                                  18580021
TX1128   DC    C'FOUND$. EXPECTIN'                                      18590021
         DC    C'G ENVIRONMENT.  '                                      18600021
         DC    C'ALL ENV. DIV. ST'                                      18610021
         DC    C'ATEMENTS='                                             18620021
         DC    FL1'2'                                                   18630021
IKF705 CSECT                                                            18640021
TX1129   DC    C'ID DIV. HEADER E'                                8930  18650021
         DC    C'XTRANEOUS, MISSI'                                8930  18660021
         DC    C'NG OR MISPLACED.'                                8930  18670021
         DC    C' ONE='                                           8930  18680021
         DC    FL1'28'                                                  18690021
TX1130   DC    C'$DIV. HEADER MIS'                                      18700021
         DC    C'SING.  WORDS IN '                                      18710021
         DC    C'$STATEMENTS ARE '                                      18720021
         DC    C'INVALID/'                                              18730021
TX1131   DC    C'INVALID PRIORITY'                                      18740021
         DC    C' NUMBER. ZERO='                                        18750021
         DC    FL1'1'                                                   18760021
TX1132   DC    C'INVALID SYSTEM-N'                                      18770021
         DC    C'AME.='                                                 18780021
         DC    FL1'30'                                                  18790021
TX1133 DC    C'MORE THAN 1 USE '                                        18800021
       DC    C'ON STANDARD ERRO'                                        18810021
       DC    C'R SPECIFIED FOR '                                        18820021
       DC    C'SAME FILE ON OPE'                                        18830021
       DC    C'N OPTION. USE='                                          18840021
       DC    FL1'02'                                                    18850021
TX1134 DC    C'USE SPECIFIED FO'                                        18860021
       DC    C'R$WITH LABE'                                             18870021
       DC    C'L RECORDS OMITTE'                                        18880021
       DC    C'D OR STANDARD.='                                         18890021
       DC    FL1'32'                                                    18900021
TX1135   DC    C'INTEGER-1 OUTSID'                                      18910021
         DC    C'E OF ALLOWABLE L'                                      18920021
         DC    C'IMITS.='                                               18930021
         DC    FL1'46'                                                  18940021
TX1136   DC    C'DATA-NAME ALREADY'                                     18950021
         DC    C' SPECIFIED FOR A'                                      18960021
         DC    C' TYPE DETAIL REP'                                      18970021
         DC    C'ORT GROUP. SKIPP'                                      18980021
         DC    C'ING TO NEXT 01, '                                      18990021
         DC    C'RD OR SECTION/'                                        19000021
TX1137   DC    C'MINIMUM NUMBER O'                                      19010021
         DC    C'F OCCURRENCES IN '                                     19020021
         DC    C'OCCURS CLAUSE NO'                                      19030021
         DC    C'T LESS THAN MAXI'                                      19040021
         DC    C'MUM NUMBER.='                                          19050021
         DC    FL1'29'                                                  19060021
TX1138   DC    C'APPLY$ IS A FUNC'                                      19070021
         DC    C'TION OF JCL IN O'                                      19080021
         DC    C'S/'                                                    19090021
TX1139   DC    C'$DUPLICATELY DEF'                                      19100021
         DC    C'INED SECTION. SE'                                      19110021
         DC    C'CTION NAME IGNOR'                                      19120021
         DC    C'ED/'                                                   19130021
TX1140 DC    C'NUMERIC LITERAL E'                                       19140021
       DC    C'XCEEDS MAXIMUM FO'                                       19150021
       DC    C'R ITS USE. SUBSTI'                                       19160021
       DC    C'TUTING 32768/'                                           19170021
TX1141 DC    C'FILE ORGANIZATIO'                                        19180021
       DC    C'N FIELD INVALID '                                        19190021
         DC    C'IN SYSTEM-NAME. '                                      19200021
         DC    C' SEQUENTIAL='                                          19210021
       DC    FL1'1'                                                     19220021
TX1142 DC    C'USE FOR STANDARD'                                        19230021
       DC    C' '                                                       19240021
       DC    C'ERROR OR LABEL P'                                        19250021
       DC    C'ROCEDURE SPECIFI'                                        19260021
       DC    C'ED FOR FILE AND '                                        19270021
       DC    C'FOR OPEN OPTION.'                                        19280021
       DC    C' '                                                       19290021
       DC    C'USE FOR OPEN OPT'                                        19300021
         DC    C'ION='                                                  19310021
       DC    FL1'02'                                                    19320021
TX1143 DC    C'USE STATEMENTS I'                                        19330021
       DC    C'MPLY BOTH STANDA'                                        19340021
       DC    C'RD AND NON-STAND'                                        19350021
       DC    C'ARD LABELS. USE='                                        19360021
       DC    FL1'02'                                                    19370021
TX1144 DC    C'WRITE AFTER POSI'                                        19380021
       DC    C'TIONING AND WRIT'                                        19390021
       DC    C'E BEFORE ADVANCI'                                        19400021
       DC    C'NG ILLEGALLY USE'                                        19410021
       DC    C'D FOR 1 FILE/'                                           19420021
TX1145 DC    C'$DUPLICATELY DEF'                                        19430021
         DC    C'INED IN SPECIAL-'                                      19440021
       DC    C'NAMES PARAGRAPH.'                                        19450021
       DC    C'='                                                       19460021
       DC    FL1'32'                                                    19470021
TX1146   DC    C'/'                                                     19480021
TX1147   DC    C'SD FILE ILLEGALL'                                      19490021
         DC    C'Y SPECIFIED IN S'                                      19500021
         DC    C'AME AREA CLAUSE.'                                      19510021
         DC    C' CLAUSE FOR SD='                                       19520021
         DC    FL1'2'                                                   19530021
TX1148   DC    C'INVALID SEGMENT-'                                      19540021
       DC    C'LIMIT. FIFTY='                                           19550021
       DC    FL1'01'                                                    19560021
TX1149 DC    C'FILES IN SAME AR'                                        19570021
       DC    C'EA CLAUSE DO NOT'                                        19580021
       DC    C' ALL APPEAR IN T'                                        19590021
       DC    C'HE SAME SORT-REC'                                        19600021
       DC    C'ORD AREA CLAUSE.'                                        19610021
       DC    C'$NOT GIVEN '                                             19620021
       DC    C'SAME AREA NUMBER'                                        19630021
       DC    C'/'                                                       19640021
TX1150   DC    C'ILLEGAL CHARACTE'                                7075  19650021
         DC    C'R IN COL. 7 PREC'                                7075  19660021
         DC    C'EDING$PARAGRAPH '                                7075  19670021
         DC    C'NAME/'                                           7075  19680021
TX1151 DC    C'ILLEGAL CHARACTE'                                        19690021
       DC    C'R USE IN CURRENC'                                        19700021
       DC    C'Y SIGN CLAUSE. C'                                        19710021
       DC    C'LAUSE='                                                  19720021
       DC    FL1'02'                                                    19730021
TX1152   DC    C'/'                                                     19740021
TX1153 DC    C'TOTALED AREA ILL'                                        19750021
       DC    C'EGALLY SPECIFIED'                                        19760021
       DC    C' FOR$WITH N'                                             19770021
       DC    C'ON-STANDARD LABE'                                        19780021
       DC    C'LS. USE='                                                19790021
       DC    FL1'02'                                                    19800021
TX1154 DC    C'2 DIFFERENT LABE'                                        19810021
       DC    C'L PROCEDURES FOR'                                        19820021
       DC    C' EOF AND EOV WIT'                                        19830021
       DC    C'H BEFORE OPTION.'                                        19840021
       DC    C' EOV LABEL PROCE'                                        19850021
       DC    C'DURE='                                                   19860021
       DC    FL1'2'                                                     19870021
TX1155 DC    C'DEVICE CLASS INV'                                        19880021
         DC    C'ALID IN SYSTEM-N'                                      19890021
         DC    C'AME. SKIPPING TO'                                      19900021
         DC    C' NEXT FIELD/'                                          19910021
TX1156 DC    C'DEVICE NUMBER IN'                                        19920021
         DC    C'VALID IN SYSTEM-'                                      19930021
         DC    C'NAME.''$''='                                           19940021
       DC    FL1'1'                                                     19950021
TX1157   DC    C'EXTERNAL-NAME NO'                                      19960021
         DC    C'T PRESENT IN SYS'                                      19970021
         DC    C'TEM-NAME/'                                             19980021
TX1158   DC    C'''$'' IN ENTRY STATEM'                                 19990021
       DC    C'ENT IS SAME AS P'                                        20000021
         DC    C'ROGRAM-ID. ''$'' IGNOR'                                20010021
       DC    C'ED FOR ENTRY VER'                                        20020021
       DC    C'B/'                                                      20030021
TX1159   DC    C'PAGE LIMIT INTEG'                                      20040021
         DC    C'ER-1 NOT SPECIFI'                                      20050021
         DC    C'ED OR INVALID. ASSUME '                                20060021
         DC    C'9999/'                                                 20070021
TX1160   DC    C'CONTINUATION OF '                                      20080021
         DC    C'WORD FOUND IN A-'                                      20090021
         DC    C'MARGIN.='                                              20100021
         DC    FL1'02'                                                  20110021
TX1161   DC    C'RESERVED WORD MI'                                      20120021
         DC    C'SSING.='                                               20130021
         DC    FL1'28'                                                  20140021
TX1162   DC    C'INTEGER IN LINE '                                      20150021
         DC    C'CLAUSE IS LESS T'                                      20160021
         DC    C'HAN PREVIOUS VAL'                                      20170021
         DC    C'UE.='                                                  20180021
         DC    FL1'2'                                                   20190021
TX1163   DC    C'ABSOLUTE LINE NU'                                      20200021
         DC    C'MBER IS PRECEDED'                                      20210021
         DC    C' BY A RELATIVE L'                                      20220021
         DC    C'INE NUMBER.='                                          20230021
         DC    FL1'2'                                                   20240021
TX1164   DC    C'NO PAGE CLAUSE S'                                      20250021
         DC    C'PECIFIED. ALL LI'                                      20260021
         DC    C'NE CLAUSES MUST '                                      20270021
         DC    C'BE ''LINE PLUS I'                                      20280021
         DC    C'NTEGER''.='                                            20290021
         DC    FL1'2'                                                   20300021
TX1165   DC    C'''HEADING'' EQUALS ''FIRST DETAIL'' I'                 20310021
         DC    C'N PAGE CLAUSE. P'                                      20320021
         DC    C'AGE HEADING IS I'                                      20330021
         DC    C'LLEGAL.='                                              20340021
         DC    FL1'29'                                                  20350021
TX1166   DC    C'''FOOTING'' EQUALS ''PAGE LIMIT'' IN'                  20360021
         DC    C' PAGE CLAUSE. PA'                                      20370021
         DC    C'GE FOOTING IS IL'                                      20380021
         DC    C'LEGAL.='                                               20390021
         DC    FL1'29'                                                  20400021
TX1167   DC    C'''LINE NEXT PAGE'                                      20410021
         DC    C''' CLAUSE IS ILL'                                      20420021
         DC    C'EGAL FOR THIS RE'                                      20430021
         DC    C'PORT GROUP.='                                          20440021
         DC    FL1'2'                                                   20450021
TX1168 DC    C'DUPLICATE REPORT-'                                       20460021
         DC    C'NAME. SKIPPING'                                        20470021
         DC    C' TO NEW RD/'                                           20480021
TX1169   DC    C'/'                                                     20490021
TX1170   DC    C'DETAIL REPORT GR'                                      20500021
         DC    C'OUP SPECIFIED WI'                                      20510021
         DC    C'TH NO DATA-NAME.='                                     20520021
         DC    FL1'29'                                                  20530021
TX1171   DC    C'INTEGERS IN PAGE'                                      20540021
         DC    C' CLAUSE ARE NOT '                                      20550021
         DC    C'IN ASCENDING ORD'                                      20560021
         DC    C'ER.='                                                  20570021
         DC    FL1'29'                                                  20580021
TX1172   DC    C'WORD INVALID AS '                                      20590021
         DC    C'REPORT NAME. RD='                                      20600021
         DC    FL1'02'                                                  20610021
TX1173   DC    C'GROUP INDICATE I'                                      20620021
         DC    C'S ILLEGAL FOR TH'                                      20630021
         DC    C'IS REPORT GROUP.'                                      20640021
         DC    C'='                                                     20650021
         DC    FL1'02'                                                  20660021
TX1174   DC    C'NO LINE CLAUSE S'                                      20670021
         DC    C'PECIFIED IN PREC'                                      20680021
         DC    C'EDING REPORT GRO'                                      20690021
         DC    C'UP. NO OUTPUT GENERATED/'                              20700021
TX1175   DC    C'DATA-NAME FOR THI'                                     20710021
         DC    C'S REPORT GROUP I'                                      20720021
         DC    C'S NOT UNIQUE. S'                                       20730021
         DC    C'KIPPING TO NEW 0'                                      20740021
         DC    C'1, RD OR SECTION'                                      20750021
         DC    C'/'                                                     20760021
         DC    FL1'2'                                                   20770021
TX1176 DC    C'$IS RESERVED WORD. ACC'                                  20780021
       DC    C'EPTED AS WRITTEN/'                                       20790021
TX1177   DC    C'/'                                                     20800021
TX1178   DC    C'RESET CLAUSE SPE'                                      20810021
         DC    C'CIFIED, AND IS E'                                      20820021
         DC    C'ITHER ILLEGAL FO'                                      20830021
         DC    C'R THIS REPORT GR'                                      20840021
         DC    C'OUP, OR ELEMENTA'                                      20850021
         DC    C'RY ITEM DOES NOT'                                      20860021
         DC    C' CONTAIN A SUM C'                                      20870021
         DC    C'LAUSE.='                                               20880021
         DC    FL1'19'                                                  20890021
TX1179   DC    C'COLUMN NUMBER IL'                                      20900021
         DC    C'LEGAL. ASSUME CO'                                      20910021
         DC    C'LUMN 1/'                                               20920021
TX1180   DC    C'SYNTAX OF COMMEN'                                      20930021
         DC    C'T IS INCORRECT.='                                      20940021
         DC    FL1'30'                                                  20950021
TX1181 DC    C'/'                                                       20960021
TX1182 DC    C'/'                                                       20970021
TX1183 DC    C'/'                                                 9321  20980021
TX1184 DC    C'/'                                                 9321  20990021
TX1185 DC    C'/'                                                 9321  21000021
TX1186 DC    C'/'                                                 9321  21010021
TX1187 DC    C'/'                                                 9321  21020021
TX1188 DC    C'/'                                                 9321  21030021
TX1189 DC    C'''TO$'' PORTION OF APPLY '                         9321  21040021
       DC    C'CORE-INDEX CLAUSE IGNORED/'                        9321  21050021
TX1190 DC    C'''OF FILENAME'' PORTION OF RERUN'                  9321  21060021
       DC   C' CLAUSE MISSING. RERUN IGNORED/'                    9321  21070021
IKF704 CSECT                                                            21080021
TX2000 DC    C'/'                                                       21090021
TX2001 DC    C'OPEN OPTION IS '                                         21100021
       DC    C'ILLEGAL FOR THIS'                                        21110021
       DC    C' ACCESS METHOD/'                                         21120021
TX2002 DC    C'DEVICE MUST BE '                                         21130021
       DC    C'DIRECT-ACCESS '                                          21140021
       DC    C'FOR OPEN I-O/'                                           21150021
TX2003 DC    C'DEVICE MUST BE '                                         21160021
       DC    C'DIRECT-ACCESS '                                          21170021
       DC    C'FOR THIS ACCESS '                                        21180021
       DC    C'METHOD/'                                                 21190021
TX2004   DC    C'RECORDING MODE O'                                      21200021
         DC    C'PTION ILLEGAL FO'                                      21210021
         DC    C'R THIS ACCESS ME'                                      21220021
         DC    C'THOD.='                                                21230021
         DC    FL1'19'                                                  21240021
TX2005   DC    C'''APPLY RECORD O'                                      21250021
         DC    C'VERFLOW'' CLAUSE'                                      21260021
         DC    C' ILLEGAL FOR TH'                                       21270021
         DC    C'IS ACCESS METHOD'                                      21280021
         DC    C'.='                                                    21290021
         DC    FL1'19'                                                  21300021
TX2006   DC    C'BLOCK CONTAINS C'                                      21310021
         DC    C'LAUSE WITH RECOR'                                      21320021
         DC    C'DING MODE ''U'''                                       21330021
         DC    C' ILLEGAL.='                                            21340021
         DC    FL1'19'                                                  21350021
TX2007   DC    C'''APPLY REORG-'                                        21360021
         DC    C'CRITERIA'' CLAU'                                       21370021
         DC    C'SE ILL'                                                21380021
         DC    C'EGAL FOR THIS AC'                                      21390021
         DC    C'CESS METHOD.='                                         21400021
         DC    FL1'19'                                                  21410021
TX2008 DC    C'APPLY WRITE-ONLY'                                        21420021
       DC    C' ILLEGAL FOR '                                           21430021
       DC    C'THIS ACCESS '                                            21440021
       DC    C'METHOD.='                                                21450021
       DC    FL1'2'                                                     21460021
TX2009 DC    C'LABEL RECORDS '                                          21470021
       DC    C'OPTION INCOMPAT'                                         21480021
       DC    C'IBLE WITH DEVICE'                                        21490021
       DC    C' TYPE/'                                                  21500021
TX2010   DC    C'OBJECT OF REDEFINES CLAUSE'                            21510021
         DC    C' IS OCCURS DEPENDING ON SUB'                           21520021
         DC    C'JECT. REDEFINES='                                      21530021
         DC    FL1'02'                                                  21540021
TX2011   DC    C'AN INDEX DATA ITEM MAY '                               21550021
         DC    C'NOT BE A CONDITIONAL '                                 21560021
       DC    C'VARIABLE. 88='                                           21570021
         DC    FL1'03'                                                  21580021
TX2012   DC    C'INDEX NAMES AND-'                                      21590021
         DC    C'OR KEYS IGNORED '                                      21600021
         DC    C'FOR TABLE WITH I'                                      21610021
         DC    C'LLEGAL SUBJECT/'                                       21620021
TX2013   DC    C'TRACK-LIMIT CLAU'                                      21630021
         DC    C'SE ILLEGAL FOR T'                                      21640021
         DC    C'HIS ACCESS METHO'                                      21650021
         DC    C'D.='                                                   21660021
         DC    FL1'19'                                                  21670021
TX2014   DC    C'TRACK-LIMIT SPEC'                                      21680021
         DC    C'IFIED AND FILE N'                                      21690021
         DC    C'OT '                                                   21700021
         DC    C'OPENED AS OUTPUT'                                      21710021
         DC    C'.='                                                    21720021
         DC    FL1'19'                                                  21730021
TX2015   DC    C'''RESERVE ALTERN'                                      21740021
         DC    C'ATE AREA'' CLAUS'                                      21750021
         DC    C'E '                                                    21760021
         DC    C'TREATED AS COMME'                                      21770021
         DC    C'NTS FOR THIS ACC'                                      21780021
         DC    C'ESS METHOD/'                                           21790021
TX2016   DC    C'DATA-RECORD SIZE'                                      21800021
       DC    C' IS VARIABLE, AND ''R'                                   21810021
       DC    C'ECORDING MODE IS F'' '                                   21820021
       DC    C'SPECIFIED. FORMAT F '                                    21830021
       DC    C'FILE ASSUMED/'                                           21840021
         DC    FL1'2'                                                   21850021
TX2017   DC    C'IF THE SUBJECT OF AN INDEXED BY '                      21860021
         DC    C'CLAUSE IS AN ELEMENTARY ITEM ONLY '                    21870021
       DC    C'THAT ITEM ITSELF MAY BE SPECIFIED '                      21880021
       DC    C'IN THE KEY CLAUSE. REST OF KEYS DI'                      21890021
       DC    C'SCARDED/'                                                21900021
TX2018   DC    C'OBJECT OF RENAME'                                      21910021
         DC    C'S CLAUSE WAS NOT'                                      21920021
         DC    C' FOUND OR NON-UN'                                      21930021
         DC    C'IQUE IN LOGICAL '                                      21940021
         DC    C'RECORD/'                                               21950021
TX2019 DC    C'BLOCK CONTAINS '                                         21960021
         DC    C'CLAUSE TREATED A'                                      21970021
         DC    C'S COMMENT FOR TH'                                      21980021
         DC    C'IS ACCESS METHOD'                                      21990021
       DC    C'.='                                                      22000021
         DC    FL1'19'                                                  22010021
TX2020 DC    C'TRACK-AREA '                                             22020021
       DC    C'CLAUSE='                                                 22030021
       DC    FL1'42'                                                    22040021
TX2021    DC    C'PICTURE DUPLICAT'                                     22050021
          DC    C'ION FACTOR TRUNC'                                     22060021
          DC    C'ATED TO 5 SIGNIF'                                     22070021
          DC    C'ICANT DIGITS/'                                        22080021
TX2022   DC    C'THE OBJECT OF TH'                                      22090021
         DC    C'E RENAMES OR REN'                                      22100021
         DC    C'AMES THRU CLAUSE'                                      22110021
       DC    C' CANNOT BE 01, 6'                                        22120021
       DC    C'6, 77 OR 88.='                                           22130021
         DC    FL1'06'                                                  22140021
TX2023   DC    C'A(N)$ KEY '                                            22150021
       DC    C'WAS NOT SPECIFIE'                                        22160021
       DC    C'D FOR THIS FILE/'                                        22170021
TX2024 DC    C'$KEY IS='                                                22180021
       DC    FL1'42'                                                    22190021
TX2025   DC    C'WRITE ADVANCING '                                      22200021
         DC    C'OR POSITIONING O'                                      22210021
         DC    C'PTION WAS SPECIF'                                      22220021
         DC    C'IED AND FILE WAS'                                      22230021
         DC    C' NO'                                                   22240021
         DC    C'T OPENED OUTPUT '                                      22250021
         DC    C'OR ACCESS METHOD'                                      22260021
         DC    C' NOT STANDARD SE'                                      22270021
         DC    C'QUENTIAL. WRITES'                                      22280021
         DC    C' '                                                     22290021
         DC    C'WILL NOT HAVE AD'                                      22300021
         DC    C'VANCING OPTION F'                                      22310021
         DC    C'OR THIS FILE/'                                         22320021
TX2026   DC    C'TOTALING AREA, T'                                      22330021
         DC    C'OTALED AREA IGNO'                                      22340021
         DC    C'RED FOR FILE WIT'                                      22350021
         DC    C'H RECORDING MODE'                                      22360021
         DC    C' S/'                                                   22370021
TX2027   DC    C'APPLY CORE-INDEX'                                      22380021
         DC    C'='                                                     22390021
         DC    FL1'42'                                                  22400021
TX2028   DC    C'REORG-CRITERIA D'                                      22410021
         DC    C'ATA-NAME NOT FOU'                                      22420021
         DC    C'ND OR NON-UNIQUE.'                                     22430021
         DC    C' ='                                                    22440021
       DC    FL1'19'                                                    22450021
TX2029 DC    C'FIRST NON 77, '                                          22460021
       DC    C'88 '                                                     22470021
       DC    C'ITEM IN SECTION '                                        22480021
       DC    C'IS NOT AN 01. '                                          22490021
       DC    C'THIS ITEM WAS='                                          22500021
       DC    FL1'43'                                                    22510021
TX2030 DC    C'77 ITEM PRECEDED'                                        22520021
       DC    C' BY 01-49 '                                              22530021
       DC    C'ITEM OR 77 IN FI'                                        22540021
       DC    C'LE SECTION. 77='                                         22550021
       DC    FL1'43'                                                    22560021
TX2031   DC    C'88 ITEM MUST BE '                                      22570021
         DC    C'PRECEDED BY 01-4'                                      22580021
         DC    C'9 OR 77 ITEM. 88'                                      22590021
         DC    C'='                                                     22600021
         DC    FL1'43'                                                  22610021
TX2032 DC    C'88 ITEM CONTAINE'                                        22620021
       DC    C'D A CLAUSE OTHER'                                        22630021
       DC    C' THAN VALUE CLAU'                                        22640021
       DC    C'SE.='                                                    22650021
       DC    FL1'44'                                                    22660021
TX2033 DC    C'ITEM''S USAGE IN'                                        22670021
       DC    C'COMPATIBLE WITH '                                        22680021
       DC    C'USAGE OF GROUP '                                         22690021
       DC    C'IT BELONGS TO. '                                         22700021
       DC    C'USAGE CHANGED TO'                                        22710021
       DC    C' GROUP''S USAGE/'                                        22720021
TX2034 DC    C'GROUP ITEM HAS '                                         22730021
       DC    C'PICTURE CLAUSE.='                                        22740021
       DC    FL1'44'                                                    22750021
TX2035 DC    C'GROUP ITEM HAS '                                         22760021
       DC    C'BLANK WHEN ZERO '                                        22770021
       DC    C'CLAUSE.='                                                22780021
       DC    FL1'44'                                                    22790021
TX2036 DC    C'GROUP ITEM HAS J'                                        22800021
       DC    C'USTIFIED CLAUSE.'                                        22810021
       DC    C'='                                                       22820021
       DC    FL1'44'                                                    22830021
TX2037 DC    C'BLANK WHEN ZERO '                                        22840021
       DC    C'CLAUSE USED INCO'                                        22850021
       DC    C'RRECTLY.='                                               22860021
       DC    FL1'19'                                                    22870021
TX2038   DC    C'TOTALING AREA, T'                                      22880021
         DC    C'OTALED AREA IGNO'                                      22890021
         DC    C'RED FOR THIS ACC'                                      22900021
         DC    C'ESS METHOD/'                                           22910021
TX2039 DC    C'PICTURE CONFIGUR'                                        22920021
       DC    C'ATION ILLEGAL. P'                                        22930021
       DC    C'ICT'                                                     22940021
       DC    C'URE CHANGED TO 9'                                        22950021
       DC    C' UNLESS USAGE IS'                                        22960021
       DC    C' ''DISPLAY-ST'','                                        22970021
       DC    C' THEN L(6)BDZ9BD'                                        22980021
       DC    C'Z9/'                                                     22990021
TX2040 DC    C'JUSTIFIED CLAUSE'                                        23000021
       DC    C' SPEC''D FOR NON'                                        23010021
       DC    C'-ALPHABETIC OR '                                         23020021
       DC    C'NON-ALPHANUMERIC'                                        23030021
       DC    C' ITEM.='                                                 23040021
       DC    FL1'44'                                                    23050021
TX2041   DC    C'CONDITION NAME U'                                      23060021
         DC    C'NDER GROUP HAS V'                                      23070021
         DC    C'ALUE CLAUSE THAT'                                      23080021
         DC    C' IS NUMERIC. 88='                                      23090021
         DC    FL1'03'                                                  23100021
TX2042 DC    C'THIS ITEM CAUSES'                                        23110021
       DC    C' OVER 3 LEVELS '                                         23120021
       DC    C'OF SUBSCRIPTING.'                                        23130021
       DC    C' OCCURS CLAUSE '                                         23140021
       DC    C'DROPPED FOR THIS'                                        23150021
       DC    C' ITEM/'                                                  23160021
TX2043   DC    C'01 OR 77 LEVEL H'                                      23170021
         DC    C'AS AN '                                                23180021
       DC    C'OCCURS CLAUSE.='                                         23190021
       DC    FL1'44'                                                    23200021
TX2044   DC    C'DUPLICATE SD.='                                        23210021
         DC    FL1'02'                                                  23220021
TX2045 DC    C'REPORT CONTROL '                                         23230021
       DC    C'NAME UNDEFINED/'                                         23240021
TX2046 DC    C'REPORT CONTROL '                                         23250021
       DC    C'NAME NOT FIXED '                                         23260021
       DC    C'LENGTH/'                                                 23270021
TX2047   DC    C'MORE THAN 12 IND'                                      23280021
         DC    C'EX NAMES SPECIFI'                                      23290021
         DC    C'ED FOR TABLE. FI'                                      23300021
         DC    C'RST 12 ACCEPTED/'                                      23310021
TX2048 DC    C'NON-STANDARD USER LABEL SIZE GREATER '  * 2ND REL        23320021
         DC    C'THAN 4095 BYTES/'                                      23330021
TX2049 DC    C'NO OPEN CLAUSE '                                         23340021
       DC    C'FOUND FOR FILE/'                                         23350021
TX2050 DC    C'BLOCK SIZE GREAT'                                        23360021
         DC    C'ER THAN 32760. C'                                      23370021
         DC    C'ANNOT WRITE BLOC'                                      23380021
         DC    C'K OF THIS SIZE/'                                       23390021
TX2051   DC    C'TRACK-AREA DATA-'                                      23400021
       DC    C'NAME IS NON-UNIQ'                                        23410021
       DC    C'UE OR UNDEFINED.'                                        23420021
       DC    C'='                                                       23430021
       DC    FL1'19'                                                    23440021
TX2052   DC    C'MORE THAN 12 KEY'                                      23450021
         DC    C'S SPECIFIED FOR '                                      23460021
         DC    C'TABLE. FIRST 12 '                                      23470021
         DC    C'ACCEPTED/'                                             23480021
TX2053   DC    C'NOMINAL OR ACTUA'                                58305 23490021
         DC    C'L KEY NON-UNIQUE'                                58305 23500021
         DC    C' OR UNDEFINED.='                                 58305 23510021
*DEL                                                                    23520021
       DC    FL1'19'                                                    23530021
TX2054   DC    C'NOMINAL KEY PICT'                                      23540021
         DC    C'URE OR USAGE NOT'                                      23550021
         DC    C' LEGAL/'                                               23560021
TX2055 DC    C'STERLING NON-REP'                                        23570021
       DC    C'ORT PICTURE - SI'                                        23580021
       DC    C'GN IN POUND FIEL'                                        23590021
       DC    C'D MUST BE ON HI '                                        23600021
       DC    C'OR LO ORDER DIGI'                                        23610021
       DC    C'T.='                                                     23620021
       DC    FL1'21'                                                    23630021
TX2056 DC    C'STERLING NON-REP'                                        23640021
       DC    C'ORT PICTURE - 9 '                                        23650021
       DC    C'IN ILLEGAL POSIT'                                        23660021
       DC    C'ION.='                                                   23670021
       DC    FL1'21'                                                    23680021
TX2057 DC    C'STERLING NON-REP'                                        23690021
       DC    C'ORT PICTURE - SI'                                        23700021
       DC    C'GN IN SHILLING F'                                        23710021
       DC    C'IELD ILLEGAL.='                                          23720021
       DC    FL1'21'                                                    23730021
TX2058 DC    C'STERLING NON-REP'                                        23740021
       DC    C'ORT PICTURE - 8 '                                        23750021
       DC    C'IN ILLEGAL POSIT'                                        23760021
       DC    C'ION.='                                                   23770021
       DC    FL1'21'                                                    23780021
TX2059 DC    C'STERLING NON-REP'                                        23790021
       DC    C'ORT PICTURE - SI'                                        23800021
       DC    C'GN IN PENCE FIEL'                                        23810021
       DC    C'D ILLEGAL.='                                             23820021
       DC    FL1'21'                                                    23830021
TX2060 DC    C'STERLING NON-REP'                                        23840021
       DC    C'ORT PICTURE - 6 '                                        23850021
       DC    C'OR 7 IN ILLEGAL '                                        23860021
       DC    C'POSITION.='                                              23870021
       DC    FL1'21'                                                    23880021
TX2061 DC    C'STERLING NON-REP'                                        23890021
       DC    C'ORT PICTURE - US'                                        23900021
       DC    C'AGE NOT DISPLAY-'                                        23910021
       DC    C'ST.='                                                    23920021
       DC    FL1'22'                                                    23930021
TX2062 DC    C'STERLING NON-REP'                                        23940021
       DC    C'ORT PICTURE - V '                                        23950021
       DC    C'IN ILLEGAL POSIT'                                        23960021
       DC    C'ION.='                                                   23970021
       DC    FL1'21'                                                    23980021
TX2063 DC    C'STERLING NON-REP'                                        23990021
       DC    C'ORT PICTURE - S '                                        24000021
       DC    C'IN ILLEGAL POSIT'                                        24010021
       DC    C'ION.='                                                   24020021
       DC    FL1'21'                                                    24030021
IKF706 CSECT                                                            24040021
TX2064 DC    C'STERLING NON-REP'                                        24050021
       DC    C'ORT PICTURE - DI'                                        24060021
       DC    C'GIT LENGTH GT 18'                                        24070021
       DC    C'.='                                                      24080021
       DC    FL1'21'                                                    24090021
TX2065 DC    C'STERLING NON-REP'                                        24100021
       DC    C'ORT PICTURE - SH'                                        24110021
       DC    C'ILLING FIELD GT '                                        24120021
       DC    C'2.='                                                     24130021
       DC    FL1'21'                                                    24140021
TX2066 DC    C'STERLING NON-REP'                                        24150021
       DC    C'ORT PICTURE - PE'                                        24160021
       DC    C'NCE FIELD GT 2.='                                        24170021
       DC    FL1'21'                                                    24180021
TX2067 DC    C'STERLING NON-REP'                                        24190021
       DC    C'ORT PICTURE - NO'                                        24200021
       DC    C' POUND SEPARATOR'                                        24210021
       DC    C'.='                                                      24220021
       DC    FL1'21'                                                    24230021
TX2068   DC    C'ONLY THE RENAMES '                                     24240021
         DC    C'CLAUSE MAY BE S'                                       24250021
         DC    C'PECIFIED FOR A L'                                      24260021
         DC    C'EVEL 66 ENTRY.='                                       24270021
         DC    FL1'19'                                                  24280021
TX2069 DC    C'NUMERIC PICTURE '                                        24290021
       DC    C'- SIGN IN ILLEGA'                                        24300021
       DC    C'L POSITION.='                                            24310021
       DC    FL1'22'                                                    24320021
TX2070 DC    C'NUMERIC PICTURE '                                        24330021
       DC    C'- P IN ILLEGAL P'                                        24340021
       DC    C'OSITION.='                                               24350021
       DC    FL1'22'                                                    24360021
TX2071 DC    C'NUMERIC PICTURE '                                        24370021
       DC    C'- V IN ILLEGAL P'                                        24380021
       DC    C'OSITION.='                                               24390021
       DC    FL1'22'                                                    24400021
TX2072 DC    C'NUMERIC PICTURE '                                        24410021
       DC    C'- NO 9 IN PICTUR'                                        24420021
       DC    C'E.='                                                     24430021
       DC    FL1'22'                                                    24440021
TX2073 DC    C'NUMERIC PICTURE '                                        24450021
       DC    C'- P ENCLOSED BY '                                        24460021
       DC    C'9''S.='                                                  24470021
       DC    FL1'22'                                                    24480021
TX2074   DC    C'='                                                     24490021
         DC    FL1'16'                                                  24500021
TX2075 DC    C'NUMERIC PICTURE '                                        24510021
       DC    C'- DIGIT LENGTH G'                                        24520021
       DC    C'T 18.='                                                  24530021
       DC    FL1'22'                                                    24540021
TX2076   DC    C'NUMERIC PICTURE '                                      24550021
         DC    C'- DIGIT LENGTH +'                                      24560021
         DC    C' SIGN SCALE GT 1'                                      24570021
         DC    C'8.='                                                   24580021
         DC    FL1'22'                                                  24590021
TX2077 DC    C'EXTERNAL FLOATIN'                                        24600021
       DC    C'G-POINT PICTURE '                                        24610021
       DC    C'- USAGE NOT DISP'                                        24620021
       DC    C'LAY.='                                                   24630021
       DC    FL1'45'                                                    24640021
TX2078 DC    C'EXTERNAL FLOATIN'                                        24650021
       DC    C'G-POINT PICTURE '                                        24660021
         DC    C'- MORE THAN 1 SIGN. '                                  24670021
         DC    C'CHANGED TO'                                            24680021
       DC    C' 1/'                                                     24690021
TX2079 DC    C'EXTERNAL FLOATIN'                                        24700021
       DC    C'G-POINT PICTURE '                                        24710021
       DC    C'- SIGN IN ILLEGA'                                        24720021
       DC    C'L POSITION.='                                            24730021
       DC    FL1'23'                                                    24740021
TX2080 DC    C'EXTERNAL FLOATIN'                                        24750021
       DC    C'G-POINT PICTURE '                                        24760021
       DC    C'- SIGN MISSING. '                                        24770021
       DC    C'ASSUME MINUS SIG'                                        24780021
       DC    C'N/'                                                      24790021
TX2081 DC    C'EXTERNAL FLOATIN'                                        24800021
       DC    C'G-POINT PICTURE '                                        24810021
       DC    C'- REQUIRED CHARA'                                        24820021
       DC    C'CTER BEFORE EXPO'                                        24830021
       DC    C'NENT MISSING.='                                          24840021
       DC    FL1'23'                                                    24850021
TX2082 DC    C'EXTERNAL FLOATIN'                                        24860021
       DC    C'G-POINT PICTURE '                                        24870021
       DC    C'- NO DECIMAL-POI'                                        24880021
       DC    C'NT IN MANTISSA. '                                        24890021
       DC    C'ASSUME IMPLIED V'                                        24900021
       DC    C'/'                                                       24910021
TX2083 DC    C'EXTERNAL FLOATIN'                                        24920021
       DC    C'G-POINT PICTURE '                                        24930021
       DC    C'- MANTISSA LENGT'                                        24940021
       DC    C'H GT 16.='                                               24950021
       DC    FL1'23'                                                    24960021
TX2084 DC    C'EXTERNAL FLOATIN'                                        24970021
       DC    C'G-POINT PICTURE '                                        24980021
       DC    C'- TOTAL LENGTH G'                                        24990021
       DC    C'T 21.='                                                  25000021
       DC    FL1'23'                                                    25010021
TX2085 DC    C'EXTERNAL FLOATIN'                                        25020021
       DC    C'G-POINT PICTURE '                                        25030021
       DC    C'- EXPONENT LENGT'                                        25040021
       DC    C'H NOT 2 DIGITS. '                                        25050021
       DC    C'ASSUME 2 DIGITS/'                                        25060021
TX2086   DC    C'NUMERIC EDITED P'                                      25070021
         DC    C'ICTURE -'                                              25080021
       DC    C' TWO FIXED DOLLA'                                        25090021
       DC    C'R SIGNS, +, - OR'                                        25100021
       DC    C' FIXED AND FLOAT'                                        25110021
       DC    C'ING DOLLAR SIGN.'                                        25120021
       DC    C'='                                                       25130021
       DC    FL1'22'                                                    25140021
TX2087   DC    C'TOTALING AREA SIZE GREATER THAN '       *X 2ND REL     25150021
         DC    C'4095 BYTES. 4095 BYTES USED/'                          25160021
TX2088   DC    C'RECORD CONTAINS '                                      25170021
         DC    C'0 CHARACTERS OPT'                                      25180021
         DC    C'ION IGNORED FOR '                                      25190021
         DC    C'BASIC FILE/'                                           25200021
TX2089   DC    C'NUMERIC EDITED P'                                      25210021
         DC    C'ICTURE -'                                              25220021
       DC    C' 9, Z OR * PRECE'                                        25230021
       DC    C'DES FLOATING STR'                                        25240021
       DC    C'ING.='                                                   25250021
       DC    FL1'22'                                                    25260021
TX2090   DC    C'NUMERIC EDITED P'                                      25270021
         DC    C'ICTURE -'                                              25280021
       DC    C' P IN ILLEGAL PO'                                        25290021
       DC    C'SITION.='                                                25300021
       DC    FL1'22'                                                    25310021
TX2091   DC    C'NUMERIC EDITED P'                                      25320021
         DC    C'ICTURE -'                                              25330021
       DC    C' TWO DIFFERENT F'                                        25340021
       DC    C'LOATING STRING C'                                        25350021
       DC    C'HARACTERS.='                                             25360021
       DC    FL1'22'                                                    25370021
TX2092   DC    C'NUMERIC EDITED P'                                      25380021
         DC    C'ICTURE -'                                              25390021
       DC    C' Z AND * IN PICT'                                        25400021
       DC    C'URE.='                                                   25410021
       DC    FL1'22'                                                    25420021
TX2093   DC    C'NUMERIC EDITED P'                                      25430021
         DC    C'ICTURE -'                                              25440021
       DC    C' 9 PRECEDES * OR'                                        25450021
       DC    C' Z.='                                                    25460021
       DC    FL1'22'                                                    25470021
TX2094   DC    C'NUMERIC EDITED P'                                      25480021
         DC    C'ICTURE -'                                              25490021
       DC    C' FLOATING STRING'                                        25500021
       DC    C' PRECEDES * OR Z'                                        25510021
       DC    C'.='                                                      25520021
       DC    FL1'22'                                                    25530021
TX2095 DC    C'NUMBER OF CHARAC'                                        25540021
       DC    C'TERS IN BLOCK CO'                                        25550021
       DC    C'NTAINS CLAUSE ON'                                        25560021
       DC    C' FORMAT F FILE N'                                        25570021
       DC    C'OT MULTIPLE OF R'                                        25580021
       DC    C'ECORD LENGTH. AS'                                        25590021
       DC    C'SUMING BLOCK SIZ'                                        25600021
       DC    C'E TO BE CLOSEST '                                        25610021
       DC    C'MULTIPLE/'                                               25620021
TX2096   DC    C'DECIMAL POINT MAY ONLY APPEAR '                        25630021
         DC    C'ONCE IN A PICTURE CHARACTER STRING.='                  25640021
       DC    FL1'22'                                                    25650021
TX2097   DC    C'NUMERIC EDITED P'                                      25660021
         DC    C'ICTURE -'                                              25670021
       DC    C' DECIMAL POINT O'                                        25680021
       DC    C'R V CONTRADICTOR'                                        25690021
       DC    C'Y TO P.='                                                25700021
       DC    FL1'22'                                                    25710021
TX2098   DC    C'INDEXED BY AND-O'                                      25720021
         DC    C'R KEY CLAUSE IS '                                      25730021
         DC    C'ILLEGAL FOR ITEM'                                      25740021
         DC    C' SUBORDINATE TO '                                      25750021
         DC    C'GROUP THAT HAS O'                                      25760021
         DC    C'CCURS BUT NO IND'                                      25770021
         DC    C'EXED BY CLAUSE.='                                      25780021
         DC    FL1'19'                                                  25790021
TX2099   DC    C'NUMERIC EDITED P'                                      25800021
         DC    C'ICTURE -'                                              25810021
       DC    C' CR OR DB AND SI'                                        25820021
       DC    C'GN BOTH USED.='                                          25830021
       DC    FL1'22'                                                    25840021
TX2100   DC    C'NUMERIC EDITED P'                                      25850021
         DC    C'ICTURE -'                                              25860021
       DC    C' CR OR DB NOT LA'                                        25870021
       DC    C'ST TWO CHARACTER'                                        25880021
       DC    C'S IN PICTURE.='                                          25890021
       DC    FL1'22'                                                    25900021
TX2101   DC    C'NUMERIC EDITED P'                                      25910021
         DC    C'ICTURE -'                                              25920021
       DC    C' SIGN IS NOT FIR'                                        25930021
       DC    C'ST OR LAST CHARA'                                        25940021
       DC    C'CTER IN PICTURE.'                                        25950021
       DC    C'='                                                       25960021
       DC    FL1'22'                                                    25970021
TX2102   DC    C'NUMERIC EDITED P'                                      25980021
         DC    C'ICTURE -'                                              25990021
       DC    C' NUMERIC CHARACT'                                        26000021
       DC    C'ERS AFTER DECIMA'                                        26010021
       DC    C'L POINT ARE NOT '                                        26020021
       DC    C'THE SAME.='                                              26030021
       DC    FL1'22'                                                    26040021
TX2103   DC    C'NUMERIC EDITED P'                                      26050021
         DC    C'ICTURE -'                                              26060021
       DC    C' TOTAL LENGTH GT'                                        26070021
       DC    C' 127.='                                                  26080021
       DC    FL1'22'                                                    26090021
TX2104   DC    C'NUMERIC EDITED P'                                      26100021
         DC    C'ICTURE -'                                              26110021
       DC    C' NUMERIC LENGTH '                                        26120021
       DC    C'GT 18.='                                                 26130021
       DC    FL1'22'                                                    26140021
TX2105   DC    C'ONLY ONE KEY MAY'                                      26150021
         DC    C' '                                                     26160021
         DC    C'BE SPECIFIED IF'                                       26170021
         DC    C' THE SUBJECT OF '                                      26180021
         DC    C'TABLE IS A KEY. '                                      26190021
         DC    C'REST OF KEYS DIS'                                      26200021
         DC    C'CARDED/'                                               26210021
TX2106   DC    C'THE RENAMES CLAU'                                      26220021
         DC    C'SE MUST BE THE L'                                      26230021
         DC    C'AST ENTRY IN A L'                                      26240021
         DC    C'OGICAL RECORD.='                                       26250021
         DC    FL1'34'                                                  26260021
TX2107   DC    C'NUMERIC EDITED P'                                      26270021
         DC    C'ICTURE -'                                              26280021
         DC    C' USAGE NOT DISPL'                                      26290021
         DC    C'AY.='                                                  26300021
         DC    FL1'45'                                                  26310021
TX2108   DC    C'KEYS IGNORED FOR'                                      26320021
         DC    C' ITEM WITH NO IN'                                      26330021
         DC    C'DEXED BY CLAUSE/'                                      26340021
TX2109 DC    C'TRACK-AREA INTEG'                                        26350021
       DC    C'ER NOT MULTIPLE '                                        26360021
       DC    C'OF 8. ROUNDED DO'                                        26370021
       DC    C'WN TO MULTIPLE O'                                        26380021
       DC    C'F 8/'                                                    26390021
TX2110 DC    C'APPLY WRITE-ONLY'                                        26400021
       DC    C' CLAUSE ILLEGALL'                                        26410021
       DC    C'Y USED.='                                                26420021
       DC    FL1'2'                                                     26430021
TX2111   DC    C'TOTALING AREA SIZE VARIABLE. '                         26440021
         DC    C'MAXIMUM SIZE ASSUMED/'                  *X 2ND REL     26450021
TX2112   DC    C'$IN KEY CLAUSE N'                                      26460021
         DC    C'OT DEFINED/'                                           26470021
TX2113 DC    C'ITEM WITH USAGE '                                        26480021
       DC    C'OF COMPUTATIONAL'                                        26490021
       DC    C'-1 OR COMPUTATIO'                                        26500021
       DC    C'NAL-2 HAS PICTUR'                                        26510021
       DC    C'E CLAUSE.='                                              26520021
       DC    FL1'19'                                                    26530021
TX2114   DC    C'ONLY THE SYNCHRO'                                      26540021
         DC    C'NIZED CLAUSE IS '                                      26550021
         DC    C'ALLOWED FOR A US'                                      26560021
         DC    C'AGE IS INDEX ITE'                                      26570021
         DC    C'M.='                                                   26580021
         DC    FL1'19'                                                  26590021
TX2115   DC    C'ITEM SIZE '                                            26600021
       DC    C'IS GT'                                                   26610021
       DC    C' 32K/'                                                   26620021
TX2116 DC    C'FIXED LENGTH GRO'                                        26630021
       DC    C'UP ITEM IN WORKI'                                        26640021
         DC    C'NG-STORAGE OR LINKAGE '                                26650021
       DC    C'SECTION IS GT 13'                                        26660021
       DC    C'1K/'                                                     26670021
TX2117   DC    C'INVALID REPORT C'                                      26680021
         DC    C'HARACTER.='                                            26690021
         DC    FL1'45'                                                  26700021
TX2118 DC    C'LENGTH OF REDEFI'                                        26710021
       DC    C'NES SUBJECT GREA'                                        26720021
       DC    C'TER THAN LENGTH '                                        26730021
       DC    C'OF REDEFINES OBJ'                                        26740021
       DC    C'ECT. SUBJECT LEN'                                        26750021
       DC    C'GTH USED/'                                               26760021
TX2119 DC    C'VALUE CLAUSE SPE'                                        26770021
       DC    C'CIFIED FOR AN IT'                                        26780021
       DC    C'EM IN A REDEFINE'                                        26790021
       DC    C'S GROUP.='                                               26800021
       DC    FL1'19'                                                    26810021
TX2120 DC    C'OBJECT OF REDEFI'                                        26820021
       DC    C'NES CLAUSE UNDEF'                                        26830021
       DC    C'INED OR ILLEGAL.'                                        26840021
       DC    C'='                                                       26850021
       DC    FL1'19'                                                    26860021
TX2121 DC    C'SUBJECT OF REDEF'                                        26870021
       DC    C'INES IS VARIABLE'                                        26880021
       DC    C' LENGTH/'                                                26890021
TX2122 DC    C'REDEFINES SUBJEC'                                        26900021
       DC    C'T LEVEL NUMBER N'                                        26910021
       DC    C'OT EQUAL TO REDE'                                        26920021
       DC    C'FINES OBJECT LEV'                                        26930021
         DC    C'EL NUMBER OR OBJ'                                      26940021
         DC    C'ECT NOT IMMEDIAT'                                      26950021
         DC    C'ELY PRECEDING SU'                                      26960021
         DC    C'BJECT.='                                               26970021
       DC    FL1'19'                                                    26980021
TX2123 DC    C'OBJECT OF REDEFI'                                        26990021
       DC    C'NES IS SUBSCRIPT'                                        27000021
       DC    C'ED/'                                                     27010021
TX2124 DC    C'OBJECT OF REDEFI'                                        27020021
       DC    C'NES IS VARIABLE '                                        27030021
       DC    C'LENGTH GROUP ITE'                                        27040021
         DC    C'M. REDEFINES CLAUSE='                                  27050021
         DC    FL1'02'                                                  27060021
TX2125   DC    C'VALUE CLAUSE TRE'                                      27070021
         DC    C'ATED AS COMMENTS FOR I'                                27080021
       DC    C'TEMS IN FILE SEC'                                        27090021
       DC    C'TION AND LINKAGE'                                        27100021
         DC    C' SECTION/'                                             27110021
TX2126 DC    C'VALUE CLAUSE LIT'                                        27120021
       DC    C'ERAL TOO LONG. T'                                        27130021
       DC    C'RUNCATED TO PICT'                                        27140021
       DC    C'URE SIZE/'                                               27150021
TX2127   DC    C'NUMERIC VALUE CL'                                      27160021
         DC    C'AUSE SPE'                                              27170021
       DC    C'CIFIED FOR GROUP'                                        27180021
       DC    C' ITEM.='                                                 27190021
       DC    FL1'19'                                                    27200021
TX2128 DC    C'VALUE CLAUSE LIT'                                        27210021
       DC    C'ERAL DOES NOT CO'                                        27220021
       DC    C'NFORM TO PICTURE'                                        27230021
       DC    C'. CHANGED TO BLA'                                        27240021
       DC    C'NKS/'                                                    27250021
IKF707 CSECT                                                            27260021
TX2129 DC    C'VALUE CLAUSE LIT'                                        27270021
       DC    C'ERAL DOES NOT CO'                                        27280021
       DC    C'NFORM TO PICTURE'                                        27290021
       DC    C'.='                                                      27300021
       DC    FL1'20'                                                    27310021
TX2130 DC    C'ITEM CANNOT HAVE'                                        27320021
       DC    C' VALUE CLAUSE.='                                         27330021
       DC    FL1'19'                                                    27340021
TX2131 DC    C'RECORD KEY UNDEF'                                        27350021
       DC    C'INED OR NON-UNIQ'                                        27360021
       DC    C'UE.='                                                    27370021
       DC    FL1'24'                                                    27380021
TX2132 DC    C'RECORD KEY LENGT'                                        27390021
       DC    C'H GREATER THAN 2'                                        27400021
       DC    C'55 BYTES. USING '                                        27410021
       DC    C'FIRST 255 BYTES/'                                        27420021
TX2133 DC    C'LABEL RECORDS CL'                                        27430021
         DC    C'AUSE MISSING. DD '                                     27440021
         DC    C'CARD OPTION WILL BE TAKEN/'                            27450021
TX2134 DC    C'VALUE FOR SCALIN'                                        27460021
       DC    C'G CHARACTER SHOU'                                        27470021
       DC    C'LD BE ZERO.='                                            27480021
       DC    FL1'20'                                                    27490021
TX2135   DC    C'RECORD DESCRIPTI'                                      27500021
         DC    C'ON VARIABLE FOR '                                      27510021
         DC    C'INDEXED OR RELAT'                                      27520021
         DC    C'IVE FILE. ASSUME'                                      27530021
         DC    C'D FIXED SIZE TAK'                                      27540021
         DC    C'EN FROM MAXIMUM '                                      27550021
         DC    C'RECORD SIZE/'                                          27560021
TX2136   DC    C'NOMINAL KEY LENG'                                      27570021
         DC    C'TH FOR INDEXED F'                                      27580021
         DC    C'ILE GREATER THAN'                                      27590021
         DC    C' '                                                     27600021
         DC    C'255 BYTES.='                                           27610021
         DC    FL1'24'                                                  27620021
TX2137   DC    C'DATANAME-3 IS SU'                                      27630021
         DC    C'BORDINATE TO DAT'                                      27640021
         DC    C'ANAME-2 IN THE R'                                      27650021
         DC    C'ENAMES THRU CLAU'                                      27660021
         DC    C'SE.='                                                  27670021
         DC    FL1'06'                                                  27680021
TX2138 DC    C'ITEM LENGTH GREA'                                        27690021
       DC    C'TER THAN 32K. TR'                                        27700021
       DC    C'UNCATED TO 32K/'                                         27710021
TX2139   DC    C'APPLY OVERFLOW C'                                      27720021
         DC    C'LAUSE ILLEGAL FO'                                      27730021
         DC    C'R V OR U MODE DI'                                      27740021
         DC    C'RECT FILE.='                                           27750021
         DC    FL1'19'                                                  27760021
TX2140   DC    C'VALUE CLAUSE SPE'                                      27770021
         DC    C'CIFIED ON BOTH G'                                      27780021
         DC    C'ROUP AND ELEMENT'                                      27790021
         DC    C'ARY ITEM OR ON S'                                      27800021
         DC    C'UBORDINATE GROUP'                                      27810021
         DC    C'. SECOND '                                             27820021
         DC    C'ITEM''S '                                              27830021
         DC    C'VALUE='                                                27840021
         DC    FL1'19'                                                  27850021
TX2141   DC    C'LENGTH OF LITERA'                                      27860021
         DC    C'L IS MORE OR LES'                                      27870021
         DC    C'S THAN LENGTH OF'                                      27880021
         DC    C' GROUP. LENGTH O'                                      27890021
         DC    C'F LITERAL='                                            27900021
         DC    FL1'01'                                                  27910021
TX2142 DC    C'ALPHABETIC OR AL'                                        27920021
       DC    C'PHANUMERIC ITEM '                                        27930021
       DC    C'HAS ILLEGAL USAG'                                        27940021
       DC    C'E.='                                                     27950021
       DC    FL1'45'                                                    27960021
TX2143 DC    C'STERLING NON-REP'                                        27970021
         DC    C'ORT PICTURE - MORE THAN '                              27980021
         DC    C'ONE V OR S.='                                          27990021
       DC    FL1'46'                                                    28000021
TX2144 DC    C'NUMERIC PICTURE '                                        28010021
         DC    C'- MORE THAN ONE '                                      28020021
         DC    C'V OR S.='                                              28030021
       DC    FL1'46'                                                    28040021
TX2145 DC    C'ALPHABETIC OR AL'                                        28050021
       DC    C'PHANUMERIC ITEM '                                        28060021
       DC    C'LENGTH GREATER T'                                        28070021
       DC    C'HAN 32767. TRUNC'                                        28080021
       DC    C'ATED TO 32767/'                                          28090021
TX2146 DC    C'RECORD SIZE IN R'                                        28100021
       DC    C'ECORD-CONTAINS C'                                        28110021
       DC    C'LAUSE DISAGREES '                                        28120021
       DC    C'WITH COMPUTED RE'                                        28130021
       DC    C'CORD SIZE. USING'                                        28140021
       DC    C' MAXIMUM COMPUTE'                                        28150021
       DC    C'D SIZE/'                                                 28160021
TX2147 DC    C'''RECORD CONTAIN'                                        28170021
       DC    C'S INTEGER-1'' IS'                                        28180021
       DC    C' NOT MINIMUM/'                                           28190021
TX2148 DC    C'ON AN 01(77) COP'                                        28200021
       DC    C'Y LIBRARY-NAME C'                                        28210021
       DC    C'LAUSE, LIBRARY D'                                        28220021
       DC    C'ID NOT HAVE AN 0'                                        28230021
       DC    C'1(77) AS FIRST C'                                        28240021
       DC    C'ARD/'                                                    28250021
TX2149 DC    C'VALUE CLAUSE SPE'                                        28260021
       DC    C'CIFIED FOR ITEM '                                        28270021
       DC    C'WITH OCCURS OR F'                                        28280021
       DC    C'OR ITEM SUBORDIN'                                        28290021
       DC    C'ATE TO AN ITEM W'                                        28300021
       DC    C'ITH OCCURS.='                                            28310021
       DC    FL1'19'                                                    28320021
TX2150 DC    C'VALUE CLAUSE SPE'                                        28330021
       DC    C'CIFIED FOR ITEM '                                        28340021
       DC    C'IN VARIABLE LENG'                                        28350021
       DC    C'TH PORTION OF A '                                        28360021
       DC    C'WORKING-STORAGE '                                        28370021
       DC    C'RECORD.='                                                28380021
       DC    FL1'19'                                                    28390021
TX2151 DC    C'ELEMENTARY ITEMS'                                        28400021
       DC    C' NOT INTERNAL FL'                                        28410021
       DC    C'OATING-POINT MUS'                                        28420021
       DC    C'T HAVE PICTURE. '                                        28430021
       DC    C'PICTURE ASSUMED '                                        28440021
       DC    C'9/'                                                      28450021
TX2152   DC    C'='                                                     28460021
         DC    FL1'16'                                                  28470021
TX2153 DC    C'DATA-NAME OF TRA'                                        28480021
       DC    C'CK-AREA CLAUSE I'                                        28490021
       DC    C'S NOT AN ITEM OF'                                        28500021
       DC    C' LEVEL 01 OR 77 '                                        28510021
         DC    C'IN WORKING-STORA'                                      28520021
       DC    C'GE.='                                                    28530021
       DC    FL1'19'                                                    28540021
TX2154 DC    C'THE AREA BEING R'                                        28550021
       DC    C'EDEFINED IS NOT '                                        28560021
       DC    C'IMMEDIATELY PREC'                                        28570021
       DC    C'EDING THE ENTRY '                                        28580021
       DC    C'WHICH REDEFINES '                                        28590021
       DC    C'IT OR THE LEVEL '                                        28600021
       DC    C'NUMBERS OF THE S'                                        28610021
       DC    C'UBJECT AND OBJEC'                                        28620021
       DC    C'T OF THE REDEFIN'                                        28630021
       DC    C'ES ARE NOT THE S'                                        28640021
       DC    C'AME. THE OBJECT '                                        28650021
       DC    C'OF THE REDEFINES'                                        28660021
       DC    C' IS ASSUMED TO B'                                        28670021
       DC    C'E THE LAST ENTRY'                                        28680021
       DC    C' WITH SAME LEVEL'                                        28690021
       DC    C' NUMBER AS SUBJE'                                        28700021
       DC    C'CT OF REDEFINES/'                                        28710021
TX2155 DC    C'ILLEGAL STERLING'                                        28720021
       DC    C' NON-REPORT PICT'                                        28730021
       DC    C'URE CHARACTER.='                                         28740021
       DC    FL1'21'                                                    28750021
TX2156 DC    C'PICTURE DOES NOT'                                        28760021
       DC    C' CONTAIN A SIGN.'                                        28770021
       DC    C' SIGN DROPPED FR'                                        28780021
       DC    C'OM VALUE CLAUSE '                                        28790021
       DC    C'LITERAL/'                                                28800021
TX2157   DC    C'NOMINAL KEY FOR '                                      28810021
         DC    C'A RELATIVE ORGAN'                                      28820021
       DC    C'IZATION FILE M'                                          28830021
         DC    C'UST BE S9(8) COM'                                      28840021
         DC    C'PUTATIONAL/'                                           28850021
TX2158 DC    C'OCCURS DEPENDING'                                        28860021
       DC    C' ON VARIABLE IS '                                        28870021
       DC    C'IN VARIABLE PORT'                                        28880021
       DC    C'ION OF A RECORD.'                                        28890021
         DC    C' PROGRAM MAY NOT'                                      28900021
         DC    C' EXECUTE/'                                             28910021
TX2159   DC    C'OBJECT OF REDEFI'                                      28920021
         DC    C'NES CLAUSE NOT D'                                      28930021
         DC    C'EFINED. PREVIOUS'                                      28940021
         DC    C' 01 ASSUMED TO B'                                      28950021
         DC    C'E OBJECT/'                                             28960021
TX2160   DC    C'THE OBJECT OF TH'                                      28970021
         DC    C'E RENAMES OR REN'                                      28980021
         DC    C'AMES THRU CLAUSE'                                      28990021
         DC    C' CANNOT CONTAIN '                                      29000021
         DC    C'AN OCCURS OR OCC'                                      29010021
         DC    C'URS DEPENDING ON'                                      29020021
         DC    C' CLAUSE NOR MAY '                                      29030021
         DC    C'IT BE SUBORDINAT'                                      29040021
         DC    C'E TO AN ITEM THA'                                      29050021
         DC    C'T HAS ONE OF THE'                                      29060021
         DC    C'SE CLAUSES.='                                          29070021
         DC    FL1'06'                                                  29080021
TX2161 DC    C'PICTURE INVALID.'                                        29090021
       DC    C' ADJACENT C DELI'                                        29100021
       DC    C'MITERS.='                                                29110021
       DC    FL1'25'                                                    29120021
TX2162 DC    C'PICTURE INVALID.'                                        29130021
       DC    C' ADJACENT D DELI'                                        29140021
       DC    C'MITERS.='                                                29150021
       DC    FL1'25'                                                    29160021
TX2163 DC    C'PICTURE INVALID.'                                        29170021
       DC    C' MORE THAN 2 DEL'                                        29180021
       DC    C'IMITERS.='                                               29190021
       DC    FL1'25'                                                    29200021
TX2164 DC    C'PICTURE INVALID.'                                        29210021
       DC    C' NO STERLING DEL'                                        29220021
       DC    C'IMITERS.='                                               29230021
       DC    FL1'25'                                                    29240021
TX2165 DC    C'PICTURE INVALID.'                                        29250021
       DC    C' ONLY 1 STERLING'                                        29260021
       DC    C' DELIMITER.='                                            29270021
       DC    FL1'25'                                                    29280021
TX2166 DC    C'PICTURE INVALID.'                                        29290021
       DC    C' ERROR IN SHILLI'                                        29300021
       DC    C'NG FIELD. ASSUME'                                        29310021
       DC    C'D SHILLING PICTU'                                        29320021
       DC    C'RE Z9B/'                                                 29330021
TX2167 DC    C'PICTURE INVALID.'                                        29340021
       DC    C' NUMBER OF POUND'                                        29350021
       DC    C' DIGITS EXCEEDS '                                        29360021
       DC    C'15. ASSUMED PICT'                                        29370021
       DC    C'URE L(6)9BD/'                                            29380021
TX2168 DC    C'PICTURE INVALID.'                                        29390021
       DC    C' ERROR IN WHOLE '                                        29400021
       DC    C'PENCE FIELD. ASS'                                        29410021
       DC    C'UMED PENCE PICTU'                                        29420021
       DC    C'RE Z9/'                                                  29430021
TX2169 DC    C'PICTURE INVALID.'                                        29440021
       DC    C' ERROR IN DECIMA'                                        29450021
       DC    C'L PENCE FIELD.='                                         29460021
       DC    FL1'26'                                                    29470021
TX2170 DC    C'PICTURE INVALID.'                                        29480021
       DC    C' ERROR IN POUND '                                        29490021
       DC    C'FIELD. ASSUMED P'                                        29500021
       DC    C'OUND PICTURE L(6'                                        29510021
       DC    C')9B/'                                                    29520021
TX2171 DC    C'PICTURE INVALID.'                                        29530021
       DC    C' NUMBER OF POUND'                                        29540021
       DC    C' DIGITS PLUS NUM'                                        29550021
       DC    C'BER OF PENCE DEC'                                        29560021
       DC    C'IMAL EXCEEDS 15.'                                        29570021
       DC    C' DECIMAL PENCE D'                                        29580021
       DC    C'ROPPED/'                                                 29590021
TX2172 DC    C'PICTURE INVALID.'                                        29600021
       DC    C' SIZE OF REPORT '                                        29610021
       DC    C'FIELD EXCEEDS 12'                                        29620021
       DC    C'7 BYTES. ASSUMED'                                        29630021
       DC    C' PICTURE L(6)BDZ'                                        29640021
       DC    C'9BDZ9/'                                                  29650021
TX2173 DC    C'PICTURE INVALID.'                                        29660021
       DC    C' CR OR DB NOT VA'                                        29670021
       DC    C'LID WITH LEADING'                                        29680021
       DC    C' SIGN.='                                                 29690021
       DC    FL1'26'                                                    29700021
TX2174 DC    C'PICTURE INVALID.'                                        29710021
       DC    C' SIGN IN DECIMAL'                                        29720021
       DC    C' PENCE FIELD NOT'                                        29730021
       DC    C' VALID WITH LEAD'                                        29740021
       DC    C'ING SIGN.='                                              29750021
       DC    FL1'26'                                                    29760021
TX2175 DC    C'TRACK-AREA EXCEE'                                        29770021
       DC    C'DS AND IS REDUCE'                                        29780021
       DC    C'D TO 32,760 BYTE'                                        29790021
       DC    C'S/'                                                      29800021
TX2176 DC    C'DATA-NAME OF TRA'                                        29810021
       DC    C'CK-AREA CLAUSE E'                                        29820021
       DC    C'XCEEDS 32,767 BY'                                        29830021
       DC    C'TES IN LENGTH.='                                         29840021
       DC    FL1'19'                                                    29850021
TX2177 DC    C'DATA-NAME OF TRA'                                        29860021
       DC    C'CK-AREA CLAUSE I'                                        29870021
       DC    C'S NOT FIXED-LENG'                                        29880021
       DC    C'TH.='                                                    29890021
       DC    FL1'19'                                                    29900021
TX2178   DC    C'RECORD KEY IS NO'                                      29910021
         DC    C'T WITHIN FILE RE'                                      29920021
       DC    C'CORD/'                                                   29930021
TX2179   DC    C'RECORD KEY IS NO'                                      29940021
         DC    C'T FIXED LENGTH/'                                       29950021
TX2180   DC    C'RECORD KEY FOR U'                                      29960021
       DC    C'NBLOCKED FILE IN'                                        29970021
       DC    C'CLUDES FIRST BYT'                                        29980021
       DC    C'E OF RECORD/'                                            29990021
TX2181   DC    C'NOMINAL OR ACTUA'                                      30000021
         DC    C'L KEY IS DEFINED'                                      30010021
         DC    C' WITHIN THE FILE'                                      30020021
         DC    C'/'                                                     30030021
TX2182   DC    C'APPLY WRITE-ONLY'                                      30040021
         DC    C' IS MEANINGLESS '                                      30050021
         DC    C'WHEN RECORDING '                                       30060021
         DC    C'MODE IS F OR U.='                                      30070021
         DC    FL1'19'                                                  30080021
TX2183 DC    C'NO LEVEL 01 FOR '                                        30090021
         DC    C'FD OR SD/'                                             30100021
TX2184   DC    C'VALUE CLAUSE LIT'                                      30110021
         DC    C'ERAL DOES NOT CO'                                      30120021
         DC    C'NFORM TO PICTURE'                                      30130021
         DC    C'.='                                                    30140021
         DC    FL1'19'                                                  30150021
TX2185   DC    C'DATA-NAME-3 EITHE'                                     30160021
         DC    C'R PRECEDES DATA-'                                      30170021
         DC    C'NAME-2 OR IS DATA'                                     30180021
         DC    C'-NAME-2 IN THE REN'                                    30190021
         DC    C'AMES THRU CLAUSE'                                      30200021
         DC    C'.='                                                    30210021
         DC    FL1'06'                                                  30220021
TX2186   DC    C'PICTURE DUPLICAT'                                      30230021
         DC    C'ION FACTOR IS ZE'                                      30240021
         DC    C'RO. ASSUMING ONE'                                      30250021
         DC    C' OCCURRENCE OF P'                                      30260021
         DC    C'ICTURE CHARACTER'                                      30270021
         DC    C'/'                                                     30280021
TX2187   DC    C'OBJECT OF RENAME'                                      30290021
         DC    C'S CLAUSE OR RENA'                                      30300021
         DC    C'MES THRU CLAUSE '                                      30310021
         DC    C'IS NOT IN THE SA'                                      30320021
         DC    C'ME LOGICAL RECOR'                                      30330021
         DC    C'D.='                                                   30340021
         DC    FL1'06'                                                  30350021
TX2188   DC    C'EXTERNAL FLOATIN'                                      30360021
         DC    C'G-POINT PICTURE '                                      30370021
         DC    C'ILLEGAL WHEN CUR'                                      30380021
         DC    C'RENCY SIGN IS E.'                                      30390021
         DC    C'='                                                     30400021
         DC    FL1'45'                                                  30410021
TX2189   DC    C'''BLOCK CONTAINS'                                      30420021
         DC    C' 0 '' OPTION ILL'                                51301 30430021
         DC    C'EGAL FOR BISAM O'                                51301 30440021
         DC    C'R WITH ''SAME AR'                                51301 30450021
         DC    C'EA'' CLAUSE.'                                    51301 30460021
         DC    C' ''BLOCK CONTAIN'                                      30470021
         DC    C'S''='                                                  30480021
         DC    FL1'19'                                                  30490021
TX2190   DC    C'PICTURE CLAUSE I'                                      30500021
         DC    C'S SIGNED, VALUE C'                                     30510021
         DC    C'LAUSE UNSIGNED. '                                      30520021
         DC    C'ASSUMED POSITIVE'                                      30530021
         DC    C'/'                                                     30540021
TX2191   DC    C'THE SYNCHRONIZED'                                      30550021
         DC    C' CLAUSE SHOULD N'                                      30560021
         DC    C'OT BE SPECIFIED '                                      30570021
         DC    C'WHEN 88''S ARE U'                                      30580021
         DC    C'NDER GROUP.='                                          30590021
         DC    FL1'11'                                                  30600021
TX2192   DC    C'ONLY USAGE IS DI'                                      30610021
         DC    C'SPLAY SHOULD BE '                                      30620021
         DC    C'SPECIFIED WHEN A'                                      30630021
         DC    C' VALUE CLAUSE IS '                                     30640021
         DC    C'ASSOCIATED WITH '                                      30650021
         DC    C'A GROUP ITEM. VALUE CLAUSE='                           30660021
         DC    FL1'3'                                                   30670021
TX2193   DC    C'LITERAL-1 IS GRE'                                      30680021
         DC    C'ATER THAN OR EQU'                                      30690021
         DC    C'AL TO LITERAL-2 '                                      30700021
         DC    C'IN THE VALUE THR'                                      30710021
         DC    C'U CLAUSE.='                                            30720021
         DC    FL1'11'                                                  30730021
TX2194   DC    C'RECORD CONTAINS '                                      30740021
         DC    C'0 CHARACTERS OPT'                                      30750021
         DC    C'ION IGNORED FOR '                                      30760021
         DC    C'FILE WITH SAME A'                                      30770021
         DC    C'REA OR SAME RECO'                                      30780021
         DC    C'RD AREA CLAUSE/'                                       30790021
TX2195   DC    C'UNIT RECORD DEVI'                                      30800021
         DC    C'CE ILLEGAL FOR R'                                      30810021
         DC    C'ECORDING MODE S.'                                      30820021
         DC    C' RECORDING MODE '                                      30830021
         DC    C'V='                                                    30840021
         DC    FL1'1'                                                   30850021
TX2196   DC    C'NO VALUE CLAUSE '                                      30860021
         DC    C'GIVEN FOR CONDIT'                                      30870021
         DC    C'ION NAME. VALUE '                                      30880021
         DC    C'ASSUMED ZERO OR '                                      30890021
         DC    C'SPACES DEPENDING'                                      30900021
         DC    C' ON PICTURE/'                                          30910021
TX2197   DC    C'INDEXED BY CLAUS'                                      30920021
         DC    C'E MUST BE PRESEN'                                      30930021
         DC    C'T WHEN ITEM IS U'                                      30940021
         DC    C'NDER GROUP WITH '                                      30950021
         DC    C'INDEXED BY CLAUS'                                      30960021
         DC    C'E/'                                                    30970021
TX2198   DC    C'INDEXED BY CLAUS'                                      30980021
         DC    C'E IGNORED FOR IT'                                      30990021
         DC    C'EM UNDER GROUP W'                                      31000021
         DC    C'ITH OCCURS BUT N'                                      31010021
         DC    C'O INDEXED BY CLA'                                      31020021
         DC    C'USE/'                                                  31030021
TX2199   DC    C'ZERO SUPRESSION '                                      31040021
         DC    C'CHARACTER WILL O'                                      31050021
         DC    C'VERRIDE BLANK WH'                                      31060021
         DC    C'EN ZERO CLAUSE.='                                      31070021
         DC    FL1'19'                                                  31080021
TX2200   DC    C'INVALID ALPHANUMERIC'                                  31090021
         DC    C' EDITED CHARACTER.='                                   31100021
         DC    FL1'11'                                                  31110021
TX2201   DC    C'SYNCHRONIZED ITEM NOT '                                31120021
         DC    C'ON PROPER BOUNDARY. NO '                               31130021
         DC    C'ALIGNMENT PERFORMED '                                  31140021
         DC    C'BECAUSE STARTING ADDRESS '                             31150021
         DC    C'OF THE REDEFINING ITEM '                               31160021
         DC    C'WOULD HAVE TO BE CHANGED/'                             31170021
TX2202   DC    C'STERLING NON-REPORT PICTURE - '                        31180021
         DC    C'NO SHILLING SEPARATOR.='                               31190021
         DC    FL1'21'                                                  31200021
TX2203 DC    C'NUMERIC EDITED PICTURE - '                               31210021
         DC    C'NO NUMERIC CHARACTERS IN '                             31220021
       DC    C'PICTURE.='                                               31230021
         DC    FL1'22'                                                  31240021
TX2204   DC    C'/'                                                     31250021
TX2205   DC    C'/'                                                     31260021
TX2206   DC    C'/'                                                     31270021
TX2207   DC    C'/'                                                     31280021
TX2208   DC    C'/'                                                     31290021
TX2209   DC    C'/'                                                     31300021
TX2210   DC    C'/'                                                     31310021
TX2211   DC    C'VALUE CLAUSE SPE'                                07762 31320021
         DC    C'CIFIED ON VARIAB'                                07762 31330021
         DC    C'LE LENGTH GROUP.'                                07762 31340021
         DC    C' VALUE CLAUSE='                                  07762 31350021
         DC    FL1'3'                                             07762 31360021
TX2212   DC    C'/'                                                     31370021
TX2213   DC    C'/'                                                     31380021
TX2214   DC    C'/'                                                     31390021
TX2215   DC    C'/'                                                     31400021
TX2216   DC    C'/'                                                     31410021
TX2217   DC    C'/'                                                     31420021
TX2218   DC    C'/'                                                     31430021
TX2219   DC    C'/'                                                     31440021
TX2220   DC    C'/'                                                     31450021
TX2221   DC    C'/'                                                     31460021
TX2222   DC    C'/'                                                     31470021
TX2223   DC    C'PICTURE LENGTH WOULD '                                 31480021
         DC    C'CAUSE OVERFLOW FROM '                                  31490021
         DC    C'REPORT LINE AT SPECI'                                  31500021
         DC    C'FIED COLUMN, TRUNCATED '                               31510021
         DC    C'TO AVAILABLE SIZE/'                                    31520021
TX2224   DC    C'''OCCURS 0 TIMES'                                47955 31530021
         DC    C''' (WITH OR WITH'                                47955 31540021
         DC    C'OUT THE ''DEPEND'                                47955 31550021
         DC    C'ING ON'' OPTION)'                                47955 31560021
         DC    C' IS ILLEGAL.  1 '                                47955 31570021
         DC    C'OCCURRENCE ='                                    47955 31580021
         DC    FL1'1'                                             47955 31590021
TX2225   DC    C'ITEM SUBORDINATE '                               07271 31600021
         DC    C'TO ITEM WITH PICT'                               07271 31610021
         DC    C'URE CLAUSE/'                                     07271 31620021
TX2226   DC    C'TOTALING AREA DA'                                      31630021
         DC    C'TA NAME NOT FOUN'                                      31640021
         DC    C'D/'                                                    31650021
TX2227   DC    C'TOTALING AREA DA'                                      31660021
         DC    C'TA NAME NOT DEFI'                                      31670021
         DC    C'NED IN WORKING-S'                                      31680021
         DC    C'TORAGE SECTION/'                                       31690021
TX2228   DC    C'COMPILER ERROR.$'                                51873 31700021
         DC    C'OPTION CANCELLED/'                               51873 31710021
TX2229   DC    C'/'                                               51873 31720021
TX2230   DC    C'NOMINAL KEY IS NOT DEFINED '                     51873 31730021
         DC    C'IN WORKING STORAGE/'                             51873 31740021
IKF708 CSECT                                                            31750021
TX3000 DC    C'/'                                                       31760021
TX3001 DC      C'$NOT DEFINED.='                                        31770021
       DC      XL1'FF'                                                  31780021
TX3002 DC      C'$NOT UNIQUE.='                                         31790021
       DC      XL1'FF'                                                  31800021
TX3003   DC    C'HIGHEST LEVEL QU'                                      31810021
         DC    C'ALIFIER$NOT DEFI'                                      31820021
       DC      C'NED.='                                                 31830021
       DC      XL1'FF'                                                  31840021
TX3004   DC    C'QUALIFYING NAME$'                                      31850021
         DC    C'NOT UNIQUE.='                                          31860021
         DC    FL1'3'                                                   31870021
TX3005   DC    C'$NOT A VALID QUA'                                      31880021
       DC      C'LIFIER.='                                              31890021
       DC      XL1'FF'                                                  31900021
TX3006   DC    C'$NOT DEFINED AS '                                      31910021
       DC      C'PART OF $.='                                           31920021
       DC      XL1'FF'                                                  31930021
TX3007   DC    C'$NOT UNIQUELY QU'                                      31940021
       DC      C'ALIFIED BY$.='                                         31950021
       DC    FL1'3'                                                     31960021
TX3008   DC    C'$NOT VALID AS ID'                                      31970021
         DC    C'ENTIFIER-1 IN$COR'                                     31980021
         DC    C'RESPONDING STATE'                                      31990021
       DC      C'MENT.='                                                32000021
       DC      XL1'FF'                                                  32010021
TX3009   DC    C'$NOT VALID AS ID'                                      32020021
         DC    C'ENTIFIER-2 IN $COR'                                    32030021
         DC    C'RESPONDING STATE'                                      32040021
       DC      C'MENT.='                                                32050021
       DC      XL1'FF'                                                  32060021
TX3010 DC    C'SUPERFLUOUS ''TO'                                        32070021
       DC    C''''                                                      32080021
         DC    C' IGNORED IN$CORR'                                      32090021
         DC    C'ESPONDING STATEM'                                      32100021
         DC    C'ENT/'                                                  32110021
TX3011   DC    C'NO CORRESPONDENC'                                      32120021
         DC    C'E FOUND BETWEEN '                                      32130021
         DC    C'IDENTIFIER-1 AND$ '                                    32140021
         DC    C'/'                                                     32150021
TX3012   DC    C'='                                                     32160021
         DC    FL1'16'                                                  32170021
TX3013   DC    C'='                                                     32180021
         DC    FL1'16'                                                  32190021
TX3014   DC    C'='                                                     32200021
         DC    FL1'16'                                                  32210021
TX3015   DC    C'/'                                                     32220021
TX3016   DC    C'='                                                     32230021
         DC    FL1'16'                                                  32240021
TX3017   DC    C'='                                                     32250021
         DC    FL1'16'                                                  32260021
TX3018 DC    C'SPECIAL REGISTER'                                        32270021
       DC    C'S TIME-OF-DAY OR'                                        32280021
       DC    C' CURRENT-DATE MA'                                        32290021
       DC    C'Y ONLY BE USED I'                                        32300021
       DC    C'N THE MOVE STATE'                                        32310021
       DC    C'MENT.='                                                  32320021
       DC    XL1'FF'                                                    32330021
TX3019   DC    C'='                                                     32340021
         DC    FL1'16'                                                  32350021
TX3020 DC    C'REPORT NAME ILLEGAL AS'                                  32360021
       DC    C' USED. DISCARDED/'                                       32370021
TX3021   DC    C'$NOT UNIQUE IN I'                                      32380021
         DC    C'TS GROUP.='                                            32390021
         DC    FL1'3'                                                   32400021
TX3022   DC    C'$NOT VALID AS ID'                                      32410021
         DC    C'ENTIFIER-1 IN SE'                                      32420021
       DC    C'ARCH STATEMENT.'                                         32430021
       DC    C'='                                                       32440021
       DC    XL1'FF'                                                    32450021
TX3023   DC    C'ITEMS CONTAINING'                                      32460021
         DC    C' THE USAGE IS IN'                                      32470021
         DC    C'DEX, REDEFINES, '                                      32480021
         DC    C'RENAMES OR OCCUR'                                      32490021
         DC    C'S CLAUSES DO NOT'                                      32500021
         DC    C' QUALIFY AS CORR'                                      32510021
         DC    C'ESPONDING IDENTI'                                      32520021
         DC    C'FIERS/'                                                32530021
TX3024   DC    C'NO KEYS WERE SPE'                                      32540021
         DC    C'CIFIED FOR$.='                                         32550021
         DC    FL1'6'                                                   32560021
TX3025   DC    C'AN ERROR WAS DET'                                      32570021
         DC    C'ECTED PROCESSING'                                      32580021
         DC    C' THE KEYS FOR$'                                        32590021
         DC    C'.='                                                    32600021
         DC    XL1'FF'                                                  32610021
TX3026   DC    C'IDENTIFIER-2 OMIT'                                     32620021
         DC    C'TED IN$CORRESPON'                                      32630021
         DC    C'DING STATEMENT.='                                      32640021
         DC    XL1'FF'                                                  32650021
TX3027   DC    C'DATA-NAME UNDER '                                      32660021
         DC    C'LABEL RECORD IS '                                      32670021
         DC    C'NON-UNIQUE. LAST'                                      32680021
         DC    C' DATA DESCRIPTIO'                                      32690021
         DC    C'N OF$ASSUMED/'                                         32700021
TX3028   DC   C'SPECIAL REGISTERS MAY NOT '                             32710021
       DC    C'BE USED WITH ACCEPT, DISPLAY OR '                        32720021
         DC    C'EXHIBIT VERBS.='                                       32730021
         DC    XL1'FF'                                                  32740021
TX3029   DC    C'OCCURS DEPENDING'                                34761 32750021
         DC    C' ON OBJECT NOT D'                                34761 32760021
         DC    C'EFINED FOR$/'                                          32770021
TX3030   DC    C'/'                                                     32780021
IKF709 CSECT                                                            32790021
TX4000 DC    C'/'                                                       32800021
TX4001 DC      C'OUTCOME OF A PRE'                                      32810021
       DC      C'CEDING CONDITIO'                                       32820021
       DC      C'N LEADS TO NON-E'                                      32830021
       DC    C'XISTENT ''NEXT S'                                        32840021
         DC    C'ENTENCE''. ''GOBACK'' '                                32850021
         DC    C'INSERTED'                                              32860021
       DC    C'/'                                                       32870021
TX4002 DC      C'$STATEMENT INCOM'                                      32880021
       DC    C'PLETE.='                                                 32890021
       DC    FL1'6'                                                     32900021
TX4003 DC      C'EXPECTING NEW'                                         32910021
       DC    C' STATEMENT. FOUN'                                        32920021
       DC    C'D$. DELETING TIL'                                        32930021
       DC    C'L NEXT VERB OR P'                                        32940021
         DC    C'ROCEDURE-NAME/'                                        32950021
TX4004 DC      C'$$IS ILLEGALLY U'                                      32960021
       DC      C'SED IN$STATEMENT'                                      32970021
       DC    C'.='                                                      32980021
       DC    FL1'3'                                                     32990021
TX4005 DC      C'$AND$VIOLATE RU'                                       33000021
       DC      C'LE ABOUT LENGTH '                                      33010021
       DC      C'OF TRANSFORM OPE'                                      33020021
       DC    C'RANDS.='                                                 33030021
       DC    FL1'6'                                                     33040021
TX4006 DC      C'$STATEMENT CONTA'                                      33050021
       DC      C'INS UNPAIRED LEF'                                      33060021
       DC      C'T PARENTHESES. O'                                      33070021
       DC    C'UTERMOST='                                               33080021
       DC    FL1'2'                                                     33090021
TX4007 DC      C'$MISSING OR MISP'                                      33100021
       DC      C'LACED IN$STATEM'                                       33110021
       DC      C'ENT. ASSUMED IN '                                      33120021
       DC      C'REQUIRED POSITIO'                                      33130021
       DC      C'N/'                                                    33140021
TX4008 DC      C'SUPERFLUOUS$FOUN'                                      33150021
       DC    C'D IN$STATEMENT.='                                        33160021
       DC    FL1'2'                                                     33170021
TX4009   DC    C'EXAMINE STATEMEN'                                      33180021
         DC    C'T REQUIRES FIGUR'                                      33190021
         DC    C'ATIVE CONSTANT, '                                      33200021
         DC    C'SINGLE ALPHANUME'                                      33210021
       DC    C'RIC CHARACTER O'                                         33220021
         DC    C'R '                                                    33230021
         DC    C'1-DIGIT UNSIGNED'                                      33240021
         DC    C' NUMERIC INTEGRA'                                      33250021
         DC    C'L LITERAL. FOUND'                                      33260021
         DC    C'$'                                                     33270021
         DC    C'. STATEMENT DELE'                                      33280021
         DC    C'TED/'                                                  33290021
TX4010 DC      C'$STATEMENT CONTA'                                      33300021
       DC      C'INS UNPAIRED RIG'                                      33310021
       DC      C'HT PARENTHESES. '                                      33320021
       DC    C'OUTERMOST='                                              33330021
       DC    FL1'2'                                                     33340021
TX4011 DC      C'$IS NOT AN ALLOW'                                      33350021
       DC      C'ABLE CHARACTER F'                                      33360021
       DC    C'OR$.='                                                   33370021
       DC    FL1'6'                                                     33380021
TX4012 DC      C'COMPARISON BETWE'                                      33390021
       DC      C'EN TWO LITERALS '                                      33400021
       DC    C'IS ILLEGAL.='                                            33410021
       DC    FL1'4'                                                     33420021
TX4013 DC      C'RELATIONAL MISSI'                                      33430021
         DC    C'NG IN IF OR CONDITIONAL STATEME'                 2651  33440021
       DC    C'NT. ''EQUAL''='                                          33450021
       DC    FL1'1'                                                     33460021
TX4014 DC      C'EXAMINE STATEMEN'                                      33470021
         DC    C'T REQUIRES IDENT'                                      33480021
         DC    C'IFIER WHOSE USAGE'                                     33490021
       DC    C' '                                                       33500021
       DC      C'IS DISPLAY. FOUN'                                      33510021
       DC    C'D$$.='                                                   33520021
       DC    FL1'6'                                                     33530021
TX4015 DC    C'''GO TO.'' ILLEG'                                        33540021
       DC    C'AL'                                                      33550021
       DC    C' UNLESS ALTERED.'                                        33560021
       DC    C'='                                                       33570021
       DC    FL1'6'                                                     33580021
TX4016 DC    C'OPERAND OF$APPEA'                                        33590021
       DC    C'RS IN WRONG SEGM'                                        33600021
       DC    C'ENT OF PROGRAM.='                                        33610021
       DC    FL1'11'                                                    33620021
TX4017 DC      C'ELSE UNMATCHED B'                                      33630021
       DC    C'Y CONDITION IS='                                         33640021
       DC    FL1'3'                                                     33650021
TX4018   DC    C'SET STATEMENT HA'                                      33660021
         DC    C'S AN ILLEGAL OPE'                                      33670021
         DC    C'RAND BEFORE ''TO'                                      33680021
         DC    C''' OR INCOMPATIB'                                      33690021
         DC    C'LE OPERANDS. OPE'                                      33700021
         DC    C'RAND BEFORE ''TO'                                      33710021
         DC    C'''='                                                   33720021
         DC    FL1'3'                                                   33730021
TX4019 DC      C'$$MAY NOT BE USE'                                      33740021
       DC      C'D AS ARITHMETIC '                                      33750021
       DC      C'OPERAND IN$STATE'                                      33760021
       DC    C'MENT. ARBITRARIL'                                        33770021
       DC    C'Y='                                                      33780021
       DC    FL1'9'                                                     33790021
TX4020 DC    C'SIGN BEFORE$IS='                                         33800021
       DC    FL1'3'                                                     33810021
TX4021 DC      C'MINUS SIGN FOLLO'                                      33820021
       DC      C'WED BY SPACE ACC'                                      33830021
       DC      C'EPTED AS REVERSI'                                      33840021
       DC      C'NG SIGN OF FOLLO'                                      33850021
       DC      C'WING LITERAL/'                                         33860021
TX4022 DC      C'EXIT MUST BE SIN'                                      33870021
       DC      C'GLE-WORD PARAGRA'                                      33880021
       DC      C'PH PRECEDED BY A'                                      33890021
       DC      C' PROCEDURE-NAME.'                                      33900021
       DC      C'='                                                     33910021
       DC      FL1'6'                                                   33920021
TX4023   DC    C'STORE-FIELD WHEN'                                      33930021
         DC    C' USED IN COMPUTA'                                      33940021
         DC    C'TION MUST BE NUM'                                      33950021
         DC    C'ERIC ITEM, '                                           33960021
         DC    C'OTHERWISE IT MUS'                                      33970021
         DC    C'T BE REPORT ITEM'                                      33980021
         DC    C' OR NUMERIC'                                           33990021
       DC    C' ITEM. FOUND$.='                                         34000021
       DC    FL1'6'                                                     34010021
TX4024 DC      C'TWO OPERANDS ARE'                                      34020021
       DC      C' '                                                     34030021
       DC      C'REQUIRED BEFORE '                                      34040021
       DC    C'''GIVING''.='                                            34050021
       DC    FL1'6'                                                     34060021
TX4025 DC    C'/'                                                       34070021
TX4026 DC      C'$$IS ILLEGALLY U'                                      34080021
       DC    C'SED IN$TEST.='                                           34090021
       DC    FL1'4'                                                     34100021
TX4027 DC      C'RIGHT TERM OF A '                                      34110021
       DC      C'CONDITION MAY NO'                                      34120021
       DC      C'T BE NEGATED. NE'                                      34130021
       DC      C'GATION IS APPLIE'                                      34140021
       DC      C'D TO THE RELATIO'                                      34150021
       DC      C'NAL/'                                                  34160021
TX4028 DC    C'TWO ''NOT''S'' I'                                        34170021
       DC    C'N SUCCESSION ILL'                                        34180021
       DC    C'EGAL. ACCEPTED A'                                        34190021
       DC    C'S CANCELLING EAC'                                        34200021
       DC    C'H OTHER/'                                                34210021
TX4029 DC    C'$$MAY NOT BE COM'                                        34220021
       DC    C'PARED WITH$$.='                                          34230021
       DC    FL1'4'                                                     34240021
TX4030   DC    C'FOUND ''$'' AFTER COND'                                34250021
       DC    C'ITION. EXPECT '''                                        34260021
       DC    C'OR'', ''AND'' OR'                                        34270021
       DC    C' VER'                                                    34280021
       DC    C'B TO IMMEDIATELY'                                        34290021
       DC    C' FOLLOW CONDITIO'                                        34300021
       DC    C'N.='                                                     34310021
       DC    FL1'8'                                                     34320021
TX4031 DC      C'PROCEDURE-NAME N'                                      34330021
       DC      C'OT THAT OF A SIN'                                      34340021
       DC      C'GLE GO PARAGRAPH'                                      34350021
       DC      C' MAY NOT BE ALTE'                                      34360021
       DC      C'RED.='                                                 34370021
       DC    FL1'6'                                                     34380021
TX4032 DC      C'NO ACTION INDICA'                                      34390021
       DC      C'TED IF PRECEDING'                                      34400021
       DC      C' CONDITION IS TR'                                      34410021
         DC    C'UE. NEXT SENTEN'                                       34420021
         DC    C'CE ASSUMED/'                                           34430021
TX4033 DC      C'PROCEDURE-NAME W'                                      34440021
       DC      C'HICH IS THE END-'                                      34450021
       DC      C'OF-RANGE OF A PE'                                      34460021
       DC      C'RFORM STATEMENT '                                      34470021
       DC      C'MAY NOT BE ALTER'                                      34480021
       DC      C'ED.='                                                  34490021
       DC      FL1'6'                                                   34500021
TX4034 DC      C'GO DEPENDING ON '                                      34510021
       DC      C'MUST BE FOLLOWED'                                      34520021
       DC      C' '                                                     34530021
         DC    C'BY INTEGRAL IDENT'                                     34540021
         DC    C'IFIER LESS THAN '                                      34550021
         DC    C'OR EQUAL TO '                    E                     34560021
       DC      C'4 DIGITS IN LENG'                                      34570021
       DC    C'TH. FOUND$.='                                            34580021
       DC    FL1'6'                                                     34590021
TX4035   DC    C'NO MORE THAN 3 I'                                      34600021
         DC    C'NDEX NAMES OR ID'                                      34610021
         DC    C'ENTIFIERS SHOULD'                                      34620021
       DC    C' BE VARIED IN PE'                                        34630021
       DC    C'RFORM STATEMENT.'                                        34640021
       DC    C'='                                                       34650021
       DC    FL1'11'                                                    34660021
TX4036 DC      C'PERFORM RANGE IS'                                      34670021
       DC      C' '                                                     34680021
       DC      C'FROM$TO$, WHICH '                                      34690021
       DC    C'PRECEDES IT.='                                           34700021
       DC    FL1'11'                                                    34710021
TX4037 DC      C'SYNTAX REQUIRES '                                      34720021
       DC      C'PROCEDURE-NAME T'                                      34730021
       DC      C'O FOLLOW ''THRU'''                                     34740021
       DC      C'. FOUND$.='                                            34750021
       DC    FL1'5'                                                     34760021
TX4038 DC      C'VARYING OPTION R'                                      34770021
         DC    C'EQUIRES INDEX NA'                                      34780021
         DC    C'ME OR IDENTIFIER'                                      34790021
         DC    C'. FOUND'                                               34800021
       DC      C' LITERAL. ARBITR'                                      34810021
       DC    C'ARILY='                                                  34820021
       DC    FL1'9'                                                     34830021
TX4039   DC    C'$$IN VARYING OR TIMES OPT'                             34840021
       DC      C'ION IS NOT NUMER'                                      34850021
       DC    C'IC. ARBITRARILY='                                        34860021
       DC    FL1'9'                                                     34870021
TX4040 DC      C'$FILE$MAY NOT BE'                                      34880021
       DC    C' OPENED$AND IS='                                         34890021
       DC    FL1'3'                                                     34900021
TX4041 DC      C'SYNTAX REQUIRES '                                      34910021
       DC    C'''INPUT'', ''OUT'                                        34920021
       DC    C'PUT'', OR ''I-O'                                         34930021
       DC    C''' AFTER O'                                              34940021
       DC    C'PEN. FOUND$.='                                           34950021
       DC    FL1'8'                                                     34960021
TX4042 DC      C'SYNTAX REQUIRES '                                      34970021
       DC      C'FILE-NAME IN$STA'                                      34980021
       DC      C'TEMENT. FOUND$.'                                       34990021
       DC    C'='                                                       35000021
       DC    FL1'7'                                                     35010021
TX4043   DC    C'REWRITE STATEMEN'                                      35020021
         DC    C'T SHOULD NOT BE '                                      35030021
         DC    C'USED WITH A DIRE'                                      35040021
         DC    C'CT BDAM-D FILE.='                                      35050021
         DC    FL1'11'                                                  35060021
TX4044   DC    C'$$SHOULD NOT BE '                                      35070021
         DC    C'M'                                                     35080021
         DC    C'OVED TO NUMERIC '                                      35090021
         DC    C'FIELD.='                                               35100021
         DC    FL1'9'                                                   35110021
TX4045 DC    C'''ADVANCING'' OP'                                        35120021
       DC    C'TI'                                                      35130021
       DC    C'ON MUST BE FOLLO'                                        35140021
       DC    C'WED BY MNEMONIC '                                        35150021
       DC    C'NAME, NUMERIC IN'                                        35160021
       DC    C'TEGRAL DATA-NAME'                                        35170021
       DC    C' OR INTEGER LESS'                                        35180021
       DC    C' THAN 100. FOUND'                                        35190021
       DC    C'$.='                                                     35200021
       DC    FL1'9'                                                     35210021
TX4046 DC    C'ILLEGAL TO$$FILE'                                        35220021
       DC    C'$.='                                                     35230021
       DC    FL1'6'                                                     35240021
TX4047   DC    C'READ OR WRITE VE'                                      35250021
         DC    C'RB ILLEGAL FOR L'                                      35260021
         DC    C'ABEL RECORDS.='                                        35270021
       DC    FL1'6'                                                     35280021
TX4048 DC      C'USE VERB MAY NOT'                                      35290021
       DC      C' '                                                     35300021
       DC      C'APPEAR EXCEPT IN'                                      35310021
       DC      C' '                                                     35320021
       DC      C'DECLARATIVES SEC'                                      35330021
       DC    C'TION.='                                                  35340021
       DC    FL1'6'                                                     35350021
TX4049 DC      C'INAPPROPRIATE OP'                                      35360021
       DC      C'TIONAL CO'                                             35370021
       DC      C'BOL WORDS PRECED'                                      35380021
       DC    C'ING$='                                                   35390021
       DC    FL1'2'                                                     35400021
TX4050 DC      C'SYNTAX REQUIRES$'                                      35410021
       DC    C'. FOUND$.='                                              35420021
       DC    FL1'6'                                                     35430021
TX4051   DC    C'''AFTER POSITION'                                      35440021
         DC    C'ING'' REQUIRES 1'                                      35450021
         DC    C'-CHARACTER ALPHA'                                      35460021
       DC    C'NUMERIC DATA-NAM'                                        35470021
         DC    C'E OR INTEGER LES'                                      35480021
         DC    C'S THAN 4. FOUND$'                                      35490021
         DC    C'.='                                                    35500021
         DC    FL1'9'                                                   35510021
TX4052 DC      C'$$MAY NOT BE TAR'                                      35520021
       DC      C'GET FIELD FOR$$I'                                      35530021
       DC    C'N$STATEMENT, AND'                                        35540021
       DC    C' IS='                                                    35550021
       DC    FL1'3'                                                     35560021
TX4053   DC    C'POSITIONING VALI'                                      35570021
         DC    C'D FOR CLOSE REEL'                                      35580021
         DC    C' WHILE DISP VALI'                                      35590021
         DC    C'D FOR CLOSE.$FIL'                                      35600021
         DC    C'E SKIPPED/'                                            35610021
TX4054 DC      C'SYNTAX REQUIRES '                                      35620021
       DC      C'SORT-FILE NAME. '                                      35630021
       DC    C'FOUND$.='                                                35640021
       DC    FL1'6'                                                     35650021
TX4055 DC      C'SORT SEQUENCE NO'                                      35660021
       DC      C'T SPECIFIED. ASC'                                      35670021
       DC    C'ENDING='                                                 35680021
       DC    FL1'1'                                                     35690021
TX4056 DC      C'SYNTAX REQUIRES$'                                      35700021
       DC    C'. FOUND$.='                                              35710021
       DC    FL1'3'                                                     35720021
TX4057 DC    C'NUMBER OF SORT K'                                        35730021
       DC    C'EYS EXCEEDS MAXI'                                        35740021
       DC    C'MUM OR TOTAL KEY'                                        35750021
       DC    C' LENGTH EXCEEDS '                                        35760021
       DC    C'256 BYTES.$='                                            35770021
       DC    FL1'3'                                                     35780021
TX4058 DC      C'SYNTAX REQUIRES '                                      35790021
       DC      C'''USING'' (''GI'                                       35800021
       DC      C'VING'') T'                                             35810021
       DC      C'O BE FOLLOWED BY'                                      35820021
         DC    C' STANDARD SEQUEN'                                      35830021
       DC    C'TIAL FILE-NAME DE'                                       35840021
         DC    C'FINE'                                                  35850021
       DC      C'D UNDER AN FD. F'                                      35860021
       DC    C'OUND$.='                                                 35870021
       DC    FL1'6'                                                     35880021
TX4059   DC    C'SORT-KEY MUST BE'                                      35890021
         DC    C' NON-SUBSCRIPTED'                                      35900021
       DC    C' AND NON-INDEXED'                                        35910021
         DC    C' FIXED-LENGTH DA'                                      35920021
         DC    C'TA-NAME DEFINED '                                      35930021
         DC    C'UNDER AN SD. FOU'                                      35940021
         DC    C'ND$.='                                                 35950021
         DC    FL1'3'                                                   35960021
TX4060 DC      C'$IS NOT A POSITI'                                      35970021
       DC    C'VE NUMERIC INTEG'                                        35980021
       DC    C'RAL LITER'                                               35990021
       DC      C'AL OF REQUIRED L'                                      36000021
       DC      C'ENGTH.='                                               36010021
       DC    FL1'5'                                                     36020021
TX4061 DC      C'NEITHER NAMED NO'                                      36030021
       DC      C'R CHANGED SPECIF'                                      36040021
       DC      C'IED. STATEMENT A'                                      36050021
       DC      C'CCEPTED. WILL BE'                                      36060021
       DC      C' '                                                     36070021
       DC      C'TREATED AS FORMA'                                      36080021
       DC      C'TTED DISPLAY/'                                         36090021
TX4062 DC      C'''NAMED CHANGED'                                       36100021
       DC      C''' ACCEPTED AS '                                       36110021
       DC      C'''CHANGED NAMED'                                       36120021
       DC      C'''/'                                                   36130021
TX4063 DC      C'PREVIOUS DEBUG P'                                      36140021
       DC      C'ACKET REFERS TO '                                      36150021
       DC      C'SAME PROCEDURE-N'                                      36160021
       DC      C'AME.='                                                 36170021
       DC      FL1'14'                                                  36180021
IKF710 CSECT                                                            36190021
TX4064 DC      C'$IS NOT A POSITI'                                      36200021
       DC    C'VE NUMERIC INTEG'                                        36210021
       DC    C'RAL LITER'                                               36220021
       DC      C'AL OF REQUIRED L'                                      36230021
       DC    C'ENGTH.='                                                 36240021
       DC    FL1'9'                                                     36250021
TX4065 DC    C'NUMERIC LITERAL '                                        36260021
       DC    C'IN EXAMINE STATE'                                        36270021
       DC    C'MENT SHOULD BE U'                                        36280021
       DC    C'NSIGNED. SIGN='                                          36290021
       DC    FL1'2'                                                     36300021
TX4066 DC      C'SYNTAX REQUIRES '                                      36310021
       DC      C'01 LEVEL SD DATA'                                      36320021
       DC      C'-NAME IN RELEASE'                                      36330021
       DC      C' '                                                     36340021
       DC      C'STATEMENT. FOUND'                                      36350021
       DC    C'$.='                                                     36360021
       DC    FL1'6'                                                     36370021
TX4067 DC    C'ALL CHARACTER SH'                                        36380021
       DC    C'OULD NOT BE USED'                                        36390021
       DC    C' AS LITERAL IN E'                                        36400021
       DC    C'XAMINE STATEMENT'                                        36410021
       DC    C'.='                                                      36420021
       DC    FL1'11'                                                    36430021
TX4068   DC    C'='                                                     36440021
         DC    FL1'16'                                                  36450021
TX4069 DC      C'SYNTAX REQUIRES '                                      36460021
       DC      C'DEVICE-NAME. FOU'                                      36470021
       DC      C'ND$IN$STATEMENT.'                                      36480021
       DC    C' SYSTEM UNIT='                                           36490021
       DC    FL1'1'                                                     36500021
TX4070 DC    C'''AT-END'' CLAUS'                                        36510021
       DC    C'E REQUIRED HERE.'                                        36520021
       DC    C' ''AT-END-NEXT-S'                                        36530021
       DC    C'ENTENCE''='                                              36540021
       DC    FL1'1'                                                     36550021
TX4071 DC      C'$EXCEEDS LEGAL L'                                      36560021
       DC      C'ENGTH.='                                               36570021
       DC      FL1'3'                                                   36580021
TX4072 DC      C'EXIT FROM$PROCED'                                      36590021
       DC      C'URE ASSUMED BEFO'                                      36600021
       DC      C'RE$/'                                                  36610021
TX4073 DC    C'$SHOUL'                                                  36620021
       DC      C'D NOT APPEAR IN '                                      36630021
       DC      C'DECLARATIVE SECT'                                      36640021
       DC    C'ION.='                                                   36650021
       DC    FL1'11'                                                    36660021
TX4074   DC    C'STATEMENT CONTAINS FLOATING '                          36670021
         DC    C'POINT DATA ITEMS. REMAINDER='                          36680021
         DC    FL1'02'                                                  36690021
TX4075 DC    C'''NEXT SENTENCE'                                         36700021
       DC    C''' '                                                     36710021
         DC    C'ILLEGAL AND DISC'                                      36720021
       DC    C'ARDED. BOTH'                                             36730021
       DC    C'$AND N'                                                  36740021
         DC    C'OT$WILL CAUSE EX'                                      36750021
         DC    C'ECUTION OF NEXT '                                      36760021
         DC    C'VERB/'                                                 36770021
TX4076 DC    C'$REQUIRES$LEVELS'                                        36780021
       DC    C' OF SUBSCRIPTING'                                        36790021
       DC    C' OR INDEXING.='                                          36800021
       DC    FL1'10'                                                    36810021
TX4077 DC      C'$MAY NOT BE USED'                                      36820021
       DC      C' '                                                     36830021
       DC      C'AS A SUBSCRIPT S'                                      36840021
       DC      C'INCE IT REQUIRES'                                      36850021
       DC      C' '                                                     36860021
       DC      C'SUBSCRIPTING ITS'                                      36870021
       DC    C'ELF.='                                                   36880021
       DC    FL1'10'                                                    36890021
TX4078 DC      C'SUBSCRIPT MUST B'                                      36900021
       DC      C'E INTEGRAL DATA-'                                      36910021
       DC      C'NAME OR LITERAL.'                                      36920021
       DC      C' FOUND NON-INTEG'                                      36930021
       DC    C'ER$.='                                                   36940021
       DC    FL1'10'                                                    36950021
TX4079 DC      C'$FOUND AMONG SUB'                                      36960021
       DC    C'SCRIPTS.='                                               36970021
       DC    FL1'10'                                                    36980021
TX4080 DC    C'DEBUG CARD MAY '                                         36990021
       DC      C'NOT REFER TO A P'                                      37000021
       DC    C'ROCEDURE NAME WH'                                        37010021
       DC    C'IC'                                                      37020021
       DC      C'H ITSELF IS IN A'                                      37030021
       DC      C' DEBUG PACKET.='                                       37040021
       DC      FL1'14'                                                  37050021
TX4081 DC    C'$EXCEEDS$CHARACT'                                        37060021
         DC    C'ERS. UP TO 114 A'                                      37070021
       DC    C'CCEPTED/'                                                37080021
TX4082 DC    C'$IS NOT DEFINED'                                         37090021
       DC    C' AS SUBSCRIPTED '                                        37100021
       DC    C'OR INDEXED. SUBS'                                        37110021
       DC    C'CRIPTS='                                                 37120021
       DC    FL1'3'                                                     37130021
TX4083 DC    C'OCCURS-DEPENDING'                                        37140021
       DC    C'-ON VARIABLE MUS'                                        37150021
       DC    C'T BE INTEGRAL NO'                                        37160021
       DC    C'N-SUBSCRIPTED DA'                                        37170021
       DC    C'TA-NAME. FOUND$.'                                        37180021
       DC    C' ARBITRARILY='                                           37190021
       DC    FL1'9'                                                     37200021
TX4084 DC    C'ILLOGICAL USE OF'                                        37210021
       DC    C' PARENTHESES ACC'                                        37220021
       DC    C'EPTED WITH DOUBT'                                        37230021
       DC    C'S AS TO MEANING/'                                        37240021
TX4085 DC    C'RECORD DESCRIPTI'                                        37250021
       DC    C'ON FOR FILE$MISS'                                        37260021
       DC    C'ING OR ILLEGAL.='                                        37270021
       DC    FL1'6'                                                     37280021
TX4086 DC    C'$CONDITION USED '                                        37290021
       DC    C'WHERE ONLY IMPER'                                        37300021
       DC    C'ATIVE STATEMENTS'                                        37310021
       DC    C' ARE LEGAL MAY C'                                        37320021
       DC    C'AUSE ERRORS IN P'                                        37330021
       DC    C'ROCESSING/'                                              37340021
TX4087 DC    C'''END DECLARATIV'                                        37350021
       DC    C'ES'' MISSING OR '                                        37360021
       DC    C'MI'                                                      37370021
       DC      C'SPLACED. PROGRAM'                                      37380021
       DC      C' CANNOT BE EXECU'                                      37390021
       DC      C'TED/'                                                  37400021
TX4088   DC    C'='                                                     37410021
         DC    FL1'16'                                                  37420021
TX4089 DC    C'$$SHOULD NOT BE '                                        37430021
       DC    C'TARGET FIELD FOR'                                        37440021
       DC    C'$$IN$STATEMENT.='                                        37450021
         DC    FL1'11'                                            0321  37460021
TX4090 DC    C'SORT-KEY MUST BE'                                        37470021
       DC    C' IN FIXED POSITI'                                        37480021
       DC    C'ON NOT MORE THAN'                                        37490021
       DC    C' 4092 BYTES FROM'                                        37500021
       DC    C' START OF RECORD'                                        37510021
       DC    C'.$='                                                     37520021
       DC    FL1'3'                                                     37530021
TX4091 DC    C'SYNTAX REQUIRES '                                        37540021
       DC      C'OPERAND. FOUND$.'                                      37550021
       DC      C'='                                                     37560021
       DC    FL1'4'                                                     37570021
TX4092 DC      C'EXTERNAL DECIMAL'                                      37580021
         DC    C' ITEM USED IN TR'                                      37590021
       DC      C'ANSFORM STATEMEN'                                      37600021
       DC    C'T.='                                                     37610021
       DC    FL1'11'                                                    37620021
TX4093   DC    C'ALL WRITE STATEM'                                      37630021
         DC    C'ENTS FOR$SHOULD '                                      37640021
         DC    C'HAVE$OPTION.$$1 '                                      37650021
         DC    C'LINE='                                                 37660021
         DC    FL1'1'                                                   37670021
TX4094 DC    C'$IS IN A RECORD '                                        37680021
         DC    C'OF AN APPLY WRIT'                                      37690021
       DC      C'E-ONLY FILE, AND'                                      37700021
       DC      C' REFERRING TO IT'                                      37710021
       DC      C' MAY CAUSE ERROR'                                      37720021
       DC      C'S IF FILE IS OPE'                                      37730021
       DC      C'NED AS OUTPUT WH'                                      37740021
       DC      C'EN$STATEMENT IS '                                      37750021
       DC      C'EXECUTED/'                                             37760021
TX4095   DC    C'WRITE FROM IDENT'                                      37770021
         DC    C'IFIER REQUIRED FO'                                     37780021
       DC    C'R$, TO WHICH WRI'                                        37790021
       DC    C'TE-ONLY IS APPLI'                                        37800021
       DC    C'ED.='                                                    37810021
       DC    FL1'6'                                                     37820021
TX4096 DC    C'$STATEMENT WILL '                                        37830021
       DC    C'NEVER BE EXECUTE'                                        37840021
       DC    C'D/'                                                      37850021
TX4097   DC    C'UNIT(REEL) OPTIO'                                      37860021
         DC    C'N ILLEGAL FOR$.='                                      37870021
         DC    FL1'3'                                                   37880021
TX4098   DC    C'''ALTER'' STATEM'                                      37890021
         DC    C'ENT VIOLATES RUL'                                      37900021
         DC    C'E ABOUT REFERENC'                                      37910021
         DC    C'ES TO A GO TO IN'                                      37920021
         DC    C' AN INDEPENDENT'                                       37930021
         DC    C' SEGMENT.='                                            37940021
         DC    FL1'2'                                                   37950021
       DC    FL1'2'                                                     37960021
TX4099 DC    C'NO EXIT SPECIFIE'                                        37970021
       DC    C'D BEFORE END OF '                                        37980021
       DC    C'THIS DECLARATIVE'                                        37990021
       DC    C' SECTION. CONTRO'                                        38000021
       DC    C'L WILL FALL THRO'                                        38010021
       DC    C'UGH TO NEXT SECT'                                        38020021
       DC    C'ION/'                                                    38030021
TX4100 DC    C'IDENTIFIER FOLLO'                                        38040021
       DC    C'WING INTO (FROM)'                                        38050021
       DC    C' IN READ (WRITE)'                                        38060021
       DC    C' STATEMENT SHOUL'                                        38070021
       DC    C'D NOT BE DEFINED'                                        38080021
       DC    C' UNDER SAME FD A'                                        38090021
         DC    C'S RECORD-NAME.='                                       38100021
       DC    FL1'11'                                                    38110021
TX4101   DC    C'SET STATEMENT RE'                                      38120021
         DC    C'QUIRES OPERAND A'                                      38130021
         DC    C'FTER ''UP'' OR '                                       38140021
         DC    C'''DOWN'' TO BE N'                                      38150021
         DC    C'UMERIC INTEGRAL '                                      38160021
         DC    C'DATA-NAME OR POS'                                      38170021
         DC    C'ITIVE INTEGRAL N'                                      38180021
         DC    C'UMERIC LITERAL. '                                      38190021
         DC    C'FOUND$.='                                              38200021
         DC    FL1'06'                                                  38210021
TX4102   DC    C'SET STATEMENT RE'                                      38220021
         DC    C'QUIRES OPERAND A'                                      38230021
         DC    C'FTER ''TO'' TO B'                                      38240021
         DC    C'E INDEX NAME, IN'                                      38250021
         DC    C'DEX DATA ITEM, N'                                      38260021
         DC    C'UMERIC INTEGRAL '                                      38270021
       DC    C'DATA-NAME OR '                                           38280021
       DC    C'INTEGRAL N'                                              38290021
         DC    C'UMERIC LITERAL. '                                      38300021
         DC    C'FOUND$.='                                              38310021
         DC    FL1'06'                                                  38320021
TX4103   DC    C'ALL MUST BE FOLL'                                      38330021
         DC    C'OWED BY ALPHANUM'                                      38340021
         DC    C'ERIC LITERAL. FO'                                      38350021
         DC    C'UND$.  ''ALL''='                                       38360021
         DC    FL1'03'                                                  38370021
TX4104   DC    C'SEARCH OR SEARCH'                                      38380021
         DC    C' ALL STATEMENT'                                        38390021
       DC    C' HAS EITHER SUBS'                                        38400021
       DC    C'CRIPTED OR INDEX'                                        38410021
       DC    C'ED IDENTIFIER-1 '                                        38420021
       DC    C'OR ILLEGAL OPERA'                                        38430021
       DC    C'ND. SCANNING TIL'                                        38440021
       DC    C'L ''AT END'' OR '                                        38450021
       DC    C'''WHEN''.='                                              38460021
       DC    FL1'8'                                                     38470021
TX4105 DC    C'DATA-NAME CANNOT'                                        38480021
       DC    C' BE BOTH INDEXED'                                        38490021
       DC    C' AND SUBSCRIPTED'                                        38500021
         DC    C' IN$STATEMENT. '                                       38510021
       DC    C'SUBSCRIPTS='                                             38520021
       DC    FL1'3'                                                     38530021
TX4106 DC    C'DATA-NAME MUST B'                                        38540021
       DC    C'E INDEXED BY IND'                                        38550021
       DC    C'EX NAME OR INDEX'                                        38560021
       DC    C' NAME PLUS OR MI'                                        38570021
       DC    C'NUS AN INTEGRAL '                                        38580021
       DC    C'NUMERIC LITERAL.'                                        38590021
       DC    C'='                                                       38600021
       DC    FL1'10'                                                    38610021
TX4107   DC    C'$ILLEGAL FOR SOR'                                      38620021
         DC    C'T FILE.='                                              38630021
         DC    FL1'06'                                                  38640021
TX4108 DC    C'ENTRY STATEMENT '                                        38650021
       DC    C'MAY ONLY BE CODE'                                        38660021
       DC    C'D IN ROOT SEGMEN'                                        38670021
       DC   C'T IF PROGRAM IS '                                         38680021
       DC   C'SEGMENTED. STATE'                                         38690021
       DC    C'MENT='                                                   38700021
       DC    FL1'02'                                                    38710021
TX4109   DC    C'KEY IN SEARCH-AL'                                      38720021
         DC    C'L FLOATING POINT'                                      38730021
         DC    C' OR STERLING. ST'                                      38740021
         DC    C'ATEMENT CHANGED '                                      38750021
         DC    C'TO SEARCH STATEM'                                      38760021
         DC    C'ENT/'                                                  38770021
TX4110   DC    C'CONDITION IN SEA'                                      38780021
         DC    C'RCH ALL STATEMEN'                                      38790021
         DC    C'T TESTS KEY WITH'                                      38800021
         DC    C'OUT TESTING ALL '                                      38810021
         DC    C'PRECEDING KEYS.='                                      38820021
         DC    FL1'06'                                                  38830021
TX4111   DC    C'INVALID CONDITIO'                                      38840021
         DC    C'N OR INVALID FOR'                                      38850021
         DC    C'MULA IN CONDITIO'                                      38860021
         DC    C'N IN SEARCH ALL '                                      38870021
         DC    C'STATEMENT.='                                           38880021
         DC    FL1'6'                                                   38890021
TX4112   DC    C'SET UP OR DOWN S'                                      38900021
         DC    C'HOULD NOT INCREM'                                      38910021
       DC    C'ENT INDEX NAME BY'                                       38920021
         DC    C' INDEX DATA ITEM'                                      38930021
         DC    C'.='                                                    38940021
         DC    FL1'11'                                                  38950021
TX4113   DC    C'LABEL DECLARATIV'                                      38960021
         DC    C'E ILLEGAL FOR IS'                                      38970021
         DC    C'AM FILE$. FILE S'                                      38980021
         DC    C'KIPPED/'                                               38990021
TX4114   DC    C'LABEL DECLARATIV'                                      39000021
         DC    C'E FOR BDAM FILE '                                      39010021
         DC    C'SHOULD NOT HAVE '                                      39020021
         DC    C'UNIT OR REEL OPT'                                      39030021
         DC    C'ION.$FILE SKIPPE'                                      39040021
         DC    C'D/'                                                    39050021
TX4115   DC    C'$STATEMENT REQUI'                                      39060021
         DC    C'RES IDENTIFIER W'                                      39070021
         DC    C'HOSE USAGE IS DI'                                      39080021
       DC    C'SPLAY. FOUND SPEC'                                       39090021
         DC    C'IAL REGISTER.='                                        39100021
         DC    FL1'6'                                                   39110021
TX4116   DC    C'NSTD-REELS IS HAN'                                     39120021
         DC    C'DLED IN OS BY JCL'                                     39130021
         DC    C'. STATEMENT TREATE'                                    39140021
         DC    C'D AS COMMENT/'                                         39150021
TX4117   DC    C'/'                                               43536 39160021
TX4118   DC    C'/'                                               43536 39170021
TX4119   DC    C'/'                                               43536 39180021
TX4120   DC    C'/'                                               43536 39190021
TX4121   DC    C'/'                                               43536 39200021
TX4122   DC    C'/'                                               43536 39210021
TX4123   DC    C'/'                                               43536 39220021
TX4124   DC    C'/'                                               43536 39230021
TX4125   DC    C'/'                                               43536 39240021
TX4126   DC    C'/'                                               43536 39250021
TX4127   DC    C'/'                                               43536 39260021
TX4128   DC    C'/'                                               43536 39270021
TX4129   DC    C'/'                                               43536 39280021
TX4130   DC    C'/'                                               43536 39290021
TX4131   DC    C'EXPECTING$. '                                    50782 39300021
         DC    C'FOUND$.='                                        50782 39310021
         DC    FL1'11'                                            50782 39320021
TX4132   DC    C'/'                                               43536 39330021
TX4133   DC    C'/'                                               43536 39340021
TX4134   DC    C'/'                                               43536 39350021
TX4135   DC    C'/'                                               43536 39360021
TX4136   DC    C'/'                                               43536 39370021
TX4137   DC    C'/'                                               43536 39380021
TX4138   DC    C'/'                                               43536 39390021
TX4139   DC    C'/'                                               43536 39400021
TX4140   DC    C'/'                                               43536 39410021
TX4141   DC    C'IN A QSAM OR QI'                                 43536 39420021
         DC    C'SAM REWRITE, THE '                               43536 39430021
         DC    C'INVALID KEY CLAU'                                43536 39440021
         DC    C'SE HAS NO MEANIN'                                43536 39450021
         DC    C'G AND IS IGNORED/'                               43536 39460021
TX4142   DC    C'/'                                               43536 39470021
TX4143   DC    C'/'                                               43536 39480021
TX4144   DC    C'/'                                               43536 39490021
TX4145   DC    C'/'                                               43536 39500021
TX4146   DC    C'/'                                               43536 39510021
TX4147   DC    C'/'                                               43536 39520021
TX4148   DC    C'/'                                               43536 39530021
TX4149   DC    C'/'                                               43536 39540021
TX4150   DC    C'/'                                               43536 39550021
TX5000 DC    C'/'                                                       39560021
TX5001   DC    C'='                                                     39570021
         DC    FL1'16'                                                  39580021
TX5002   DC    C'='                                                     39590021
         DC    FL1'16'                                                  39600021
TX5003 DC    C'A DIVISOR IS A Z'                                        39610021
       DC    C'ERO CONSTANT. RE'                                        39620021
       DC    C'SULT OF DIVIDE W'                                        39630021
       DC    C'ILL BE SET TO AL'                                        39640021
       DC    C'L 9''S/'                                                 39650021
TX5004 DC    C'THE ALPHANUMERIC'                                        39660021
       DC    C' SENDING FIELD E'                                        39670021
       DC    C'XCEEDS MAXIMUM P'                                        39680021
       DC    C'ERMISSIBLE SIZE.'                                        39690021
       DC    C' 18 LO'                                                  39700021
         DC    C'W ORDER BYTES US'                                      39710021
         DC    C'ED/'                                                   39720021
TX5005   DC    C'='                                                     39730021
         DC    FL1'16'                                                  39740021
TX5006   DC    C'='                                                     39750021
         DC    FL1'16'                                                  39760021
TX5007   DC    C'='                                                     39770021
         DC    FL1'16'                                                  39780021
TX5008   DC    C'='                                                     39790021
         DC    FL1'16'                                                  39800021
TX5009   DC    C'='                                                     39810021
         DC    FL1'16'                                                  39820021
TX5010 DC    C'A CONSTANT INTER'                                        39830021
       DC    C'MEDIATE RESULT H'                                        39840021
       DC    C'AD TO='                                                  39850021
       DC      FL1'17'                                                  39860021
TX5011 DC    C'AN INTERMEDIATE '                                        39870021
       DC    C'RESULT OR A SEND'                                        39880021
       DC    C'ING FIELD MIGHT='                                        39890021
       DC      FL1'17'                                                  39900021
TX5012   DC    C'='                                                     39910021
         DC    FL1'16'                                                  39920021
TX5013 DC    C'ILLEGAL COMPARIS'                                        39930021
       DC    C'ON OF TWO NUMERI'                                        39940021
       DC    C'C LITERALS.='                                            39950021
       DC    FL1'6'                                                     39960021
TX5014   DC    C'KEY IN SEARCH AL'                                      39970021
         DC    C'L AT INVALID OFF'                                      39980021
         DC    C'SET.='                                                 39990021
         DC    FL1'6'                                                   40000021
TX5015   DC    C'INVALID USE OF S'                                      40010021
         DC    C'PECIAL REGISTER.'                                      40020021
         DC    C'='                                                     40030021
         DC    FL1'6'                                                   40040021
TX5016   DC    C'MORE THAN 255 SU'                                      40050021
         DC    C'BSCRIPT ADDRESS '                                      40060021
         DC    C'CELLS USED. PROG'                                      40070021
         DC    C'RAM CANNOT EXECU'                                      40080021
         DC    C'TE CORRECTLY/'                                         40090021
TX5017   DC    C'EXHIBIT CHANGED OPERAND GREATER THAN 256 BYTES.'       40100021
       DC    C' LENGTH OF 256 ASSUMED/'                                 40110021
TX5018   DC    C'NAME OF IDENTIFIER IN '                                40120021
         DC    C'EXHIBIT STATEMENT EXCEEDS '                            40130021
         DC    C'MAXIMUM. TRUNCATED TO 120/'                            40140021
TXTEND   EQU   *                                                        40150021
IKF711 CSECT                                                            40160021
*=1  ERROR ACTION TABLE                                                 40170021
*                                                                       40180021
EACT00 DC    C'***/'         UNKNOWN ACTION CODE                        40190021
EACT01 DC    C'ASSUMED/'                                                40200021
EACT02 DC    C'IGNORED/'                                                40210021
EACT03 DC    C'DISCARDED/'                                              40220021
EACT04 DC    C'TEST DISCARDED/'                                         40230021
EACT05 DC      C'$OPTION DISCARDE'                                      40240021
       DC      C'D/'                                                    40250021
EACT06 DC    C'STATEMENT DISCAR'                                        40260021
       DC    C'DED/'                                                    40270021
EACT07 DC    C'DELETING TILL LE'                                        40280021
       DC    C'GAL ELEMENT FOUN'                                        40290021
       DC    C'D/'                                                      40300021
EACT08 DC    C'DELETING TILL ON'                                        40310021
       DC    C'E OF THESE IS FO'                                        40320021
       DC    C'UND/'                                                    40330021
EACT09 DC    C'SUBSTITUTING$/'                                          40340021
EACT10 DC    C'SUBSTITUTING FIR'                                        40350021
       DC    C'ST OCCURRENCE OF'                                        40360021
       DC    C'$/'                                                      40370021
EACT11 DC    C'STATEMENT ACCEPT'                                        40380021
       DC    C'ED AS WRITTEN/'                                          40390021
EACT12 DC      C'SYSTEM UNIT ASSU'                                      40400021
       DC      C'MED/'                                                  40410021
EACT13 DC      C'EVEN IF NOT REFE'                                      40420021
       DC      C'RENCED, MAY CAUS'                                      40430021
       DC      C'E WRONG CODING T'                                      40440021
       DC      C'O BE PRODUCED FO'                                      40450021
       DC      C'R DECLARATIVES O'                                      40460021
       DC      C'R PERFORMED PROC'                                      40470021
       DC      C'EDURES ON EITHER'                                      40480021
       DC      C' SIDE OF IT/'                                          40490021
EACT14 DC      C'CARD DELETED AN'                                       40500021
       DC      C'D FOLLOWING STA'                                       40510021
       DC      C'TEMENTS ATTACHE'                                       40520021
       DC      C'D TO IMMEDIATEL'                                       40530021
       DC      C'Y PRECEDING PAC'                                       40540021
       DC      C'KET/'                                                  40550021
EACT15 DC    C'PROGRAM INTERRUP'                                        40560021
       DC    C'T WILL OCCUR/'                                           40570021
EACT16   DC    C'COMPILER ERROR. COMPILATION'                           40580021
         DC    C' WILL NOT BE COMPLETE/'                                40590021
EACT17 DC      C'HAVE ITS HIGH OR'                                      40600021
       DC    C'DER DIGIT POSITI'                                        40610021
       DC    C'ON TRUNCATED/'                                           40620021
EACT18   DC    C'/'                                                     40630021
EACT19 DC    C'CLAUSE IGNORED/'                                         40640021
EACT20 DC    C'CHANGED TO ZERO/'                                        40650021
EACT21 DC    C'PICTURE REPLACED'                                        40660021
       DC    C' BY 9D8D7/'                                              40670021
EACT22 DC    C'PICTURE REPLACED'                                        40680021
       DC    C' BY 9(1)/'                                               40690021
EACT23 DC    C'PICTURE CHANGED '                                        40700021
       DC    C'TO +9.E+99/'                                             40710021
EACT24 DC    C'KEY IGNORED/'                                            40720021
EACT25 DC    C'ASSUMED PICTURE '                                        40730021
       DC    C'L(6)9BDZ9BDZ9/'                                          40740021
EACT26 DC    C'DECIMAL FIELD TR'                                        40750021
       DC    C'UNCATED/'                                                40760021
EACT27 DC    C'SKIPPING TO NEXT'                                        40770021
       DC    C' 01/'                                                    40780021
EACT28 DC    C'ASSUMED PRESENT/'                                        40790021
EACT29 DC    C'CONTINUING/'                                             40800021
EACT30 DC    C'SKIPPING TO NEXT'                                        40810021
       DC    C' CLAUSE/'                                                40820021
EACT31 DC    C'SKIPPING TO NEXT'                                        40830021
       DC    C' CARD/'                                                  40840021
EACT32 DC    C'SENTENCE IGNORED'                                        40850021
       DC    C'/'                                                       40860021
EACT33 DC    C'USING LOWEST NAM'                                        40870021
       DC    C'E/'                                                      40880021
EACT34 DC    C'SKIPPING TO NEXT'                                        40890021
       DC    C' LEVEL, SECTION '                                        40900021
       DC    C'OR DIVISION/'                                            40910021
EACT35 DC    C'IGNORING COPY/'                                          40920021
EACT36 DC    C'DROPPED/'                                                40930021
EACT37 DC    C'RESCANNING AT E/'                                        40940021
EACT38 DC    C'ASSUME END OF SE'                                        40950021
       DC    C'NTENCE/'                                                 40960021
EACT39 DC    C'SKIPPING TO NEXT'                                        40970021
       DC    C' INSERT OR DELET'                                        40980021
       DC    C'E NUMBER.$/'                                             40990021
EACT40 DC    C'STOP INSERT AND '                                        41000021
       DC    C'DELETE.$/'                                               41010021
EACT41 DC    C'ASSUME SPACE/'                                           41020021
EACT42 DC    C'ILLEGAL FOR THIS'                                        41030021
       DC    C' ACCESS METHOD. '                                        41040021
       DC    C'CLAUSE IGNORED/'                                         41050021
EACT43 DC    C'CHANGED TO 01/'                                          41060021
EACT44 DC    C'CLAUSE DELETED/'                                         41070021
EACT45 DC    C'PICTURE CHANGED '                                        41080021
       DC    C'TO 9/'                                                   41090021
EACT46 DC    C'ASSUMED ONE/'                                            41100021
EACT47 DC    C'FILE-NAME. USE I'                                        41110021
       DC    C'GNORED/'                                                 41120021
EACT48 DC    C'SKIPPING TO NEXT'                                        41130021
       DC    C' RECOGNIZABLE WO'                                        41140021
       DC    C'RD/'                                                     41150021
ENDEAC EQU   *                                                          41160021
       EJECT                                                            41170021
IKF712 CSECT                                                            41180021
*=1   ERROR PARAMETER TABLE                                             41190021
*=                                                                      41200021
PAR000 DC    C'/'                       COBOL WORDS                     41210021
PAR001 DC    C'DATA/'                                                   41220021
PAR002   DC    C'SKIP1/'                                                41230021
PAR003   DC    C'SKIP2/'                                                41240021
PAR004   DC    C'SKIP3/'                                                41250021
PAR005   DC    C'EJECT/'                                                41260021
PAR006 DC    C'/'                                                       41270021
PAR007   DC    C'SUPPRESS/'                                             41280021
PAR008 DC    C'/'                                                       41290021
PAR009   DC    C'/'                                                     41300021
PAR00A   DC    C'/'                                                     41310021
PAR00B   DC    C'/'                                                     41320021
PAR00C   DC    C'CORE-INDEX/'                                           41330021
PAR00D   DC    C'PROGRAM/'                                              41340021
PAR00E DC    C'RF/'                                                     41350021
PAR00F DC    C'WRITE-ONLY/'                                             41360021
PAR010   DC    C'TOTALING/'                                             41370021
PAR011   DC    C'TOTALED/'                                              41380021
PAR012 DC    C'COMMA/'                                                  41390021
PAR013 DC    C'DECIMAL-POINT/'                                          41400021
PAR014 DC    C'FILE-LIMIT/'                                             41410021
PAR015 DC    C'MODE/'                                                   41420021
PAR016 DC    C'RECORDING/'                                              41430021
PAR017 DC    C'REEL/'                                                   41440021
PAR018 DC    C'SYSIN/'                                                  41450021
PAR019 DC    C'SYSOUT/'                                                 41460021
PAR01A DC    C'TRACK-AREA/'                                             41470021
PAR01B DC    C'/'                                                       41480021
PAR01C   DC    C'TRACK-LIMIT/'                                          41490021
PAR01D DC    C'/'                                                       41500021
PAR01E DC    C'/'                                                       41510021
PAR01F DC    C'/'                                                       41520021
PAR020 DC    C'/'                                                       41530021
PAR021 DC    C'/'                                                       41540021
PAR022 DC    C'/'                                                       41550021
PAR023 DC    C'/'                                                       41560021
PAR024 DC    C'/'                                                       41570021
PAR025   DC    C'REORG-CRITERIA/'                                       41580021
PAR026 DC    C'DISPLAY/'                                                41590021
PAR027   DC    C'CLASS/'                                                41600021
PAR028 DC    C'RESET/'                                                  41610021
PAR029 DC    C'/'                                                       41620021
PAR02A DC    C'/'                                                       41630021
PAR02B DC    C'ON/'                                                     41640021
PAR02C DC    C'/'                                                       41650021
PAR02D DC    C'/'                                                       41660021
PAR02E DC    C'/'                                                       41670021
PAR02F DC    C'/'                                                       41680021
PAR030   DC    C'CURRENCY/'                                             41690021
PAR031   DC    C'/'                                                     41700021
PAR032   DC    C'INDEX/'                                                41710021
PAR033   DC    C'STATUS/'                                               41720021
PAR034   DC    C'MODULES/'                                              41730021
PAR035   DC    C'MEMORY/'                                               41740021
PAR036   DC    C'WORDS/'                                                41750021
PAR037   DC    C'SYNCHRONIZED/'                                         41760021
PAR038   DC    C'OFF/'                                                  41770021
PAR039   DC    C'RENAMES/'                                              41780021
PAR03A   DC    C'UP/'                                                   41790021
PAR03B   DC    C'DOWN/'                                                 41800021
PAR03C   DC    C'FILE/'                                                 41810021
PAR03D   DC    C'OPTIONAL/'                                             41820021
PAR03E   DC    C'REMAINDER/'                                            41830021
PAR03F   DC    C'POSITION/'                                             41840021
PAR040   DC    C'TAPE/'                                                 41850021
PAR041   DC    C'/'                                                     41860021
PAR042   DC    C'ADDRESS/'                                              41870021
PAR043   DC    C'/'                                                     41880021
PAR044   DC    C'NUMBER/'                                               41890021
PAR045   DC    C'CURRENT-DATE/'                                         41900021
PAR046   DC    C'TIME-OF-DAY/'                                          41910021
PAR047   DC    C'COM-REG/'                                              41920021
PAR048   DC    C'SORT-RETURN/'                                          41930021
PAR049 DC    C'/'                                                       41940021
PAR04A DC    C'LEAVE/'                 OS                               41950021
PAR04B DC    C'REREAD/'                                                 41960021
PAR04C DC    C'DISP/'                                                   41970021
PAR04D   DC    C'/'                                                     41980021
PAR04E   DC    C'/'                                                     41990021
PAR04F   DC    C'/'                                                     42000021
PAR050 DC    C'THEN/'                                                   42010021
PAR051   DC    C'CYL-INDEX/'                                            42020021
PAR052   DC    C'WRITE-VERIFY/'                                         42030021
PAR053 DC    C'THAN/'                                                   42040021
PAR054   DC    C'RECORD-OVERFLOW/'                                      42050021
PAR055 DC    C'ALPHABETIC/'                                             42060021
PAR056 DC    C'NUMERIC/'                                                42070021
PAR057 DC    C'POSITIVE/'                                               42080021
PAR058 DC    C'NEGATIVE/'                                               42090021
PAR059   DC    C'UPDATE/'                                               42100021
PAR05A   DC    C'END-OF-PAGE/'                                          42110021
PAR05B DC    C'LABEL-RETURN/'                                           42120021
PAR05C DC    C'NOT/'                                                    42130021
PAR05D DC    C'AND/'                                                    42140021
PAR05E DC    C'OR/'                                                     42150021
PAR05F DC    C'LIMIT/'                                                  42160021
PAR060 DC    C'/'                                                       42170021
PAR061 DC    C'BEGINNING/'                                              42180021
PAR062 DC    C'ENDING/'                                                 42190021
PAR063 DC    C'MORE-LABELS/'                                            42200021
PAR064 DC    C'OUTPUT/'                                                 42210021
PAR065 DC    C'/'                                                       42220021
PAR066 DC    C'INPUT/'                                                  42230021
PAR067 DC    C'RANDOM/'                                                 42240021
PAR068 DC    C'PROCESSING/'                                             42250021
PAR069 DC    C'BEFORE/'                                                 42260021
PAR06A DC    C'REPORTING/'                                              42270021
PAR06B DC    C'I-O/'                                                    42280021
PAR06C DC    C'WITH/'                                                   42290021
PAR06D DC    C'REWIND/'                                                 42300021
PAR06E DC    C'REVERSED/'                                               42310021
PAR06F DC    C'INTO/'                                                   42320021
PAR070 DC    C'AT/'                                                     42330021
PAR071 DC    C'INVALID/'                                                42340021
PAR072 DC    C'AFTER/'                                                  42350021
PAR073 DC    C'ADVANCING/'                                              42360021
PAR074 DC    C'/'                                                       42370021
PAR075 DC    C'/'                                                       42380021
PAR076 DC    C'LOCK/'                                                   42390021
PAR077 DC    C'SYSPUNCH/'                                               42400021
PAR078 DC    C'CONSOLE/'                                                42410021
PAR079 DC    C'ALL/'                                                    42420021
PAR07A DC    C'CORRESPONDING/'                                          42430021
PAR07B DC    C'TALLYING/'                                               42440021
PAR07C DC    C'LEADING/'                                                42450021
PAR07D DC    C'UNTIL/'                                                  42460021
PAR07E DC    C'REPLACING/'                                              42470021
PAR07F DC    C'BY/'                                                     42480021
PAR080 DC    C'/'                                                       42490021
PAR081 DC    C'GIVING/'                                                 42500021
PAR082 DC    C'ROUNDED/'                                                42510021
PAR083 DC    C'SIZE/'                                                   42520021
PAR084 DC    C'ERROR/'                                                  42530021
PAR085 DC    C'RUN/'                                                    42540021
PAR086 DC    C'PROCEED/'                                                42550021
PAR087 DC    C'THRU/'                                                   42560021
PAR088 DC    C'VARYING/'                                                42570021
PAR089 DC    C'USING/'                                                  42580021
PAR08A DC    C'COBOL/'                                                  42590021
PAR08B   DC    C'/'                                                     42600021
PAR08C DC    C'DESCENDING/'                                             42610021
PAR08D DC    C'ASCENDING/'                                              42620021
PAR08E DC    C'TRACE/'                                                  42630021
PAR08F DC    C'CHANGED/'                                                42640021
PAR090 DC    C'NAMED/'                                                  42650021
PAR091 DC    C'LINKAGE/'                                                42660021
PAR092 DC    C'CHARACTER/'                                              42670021
PAR093 DC    C'TIMES/'                                                  42680021
PAR094 DC    C'DEPENDING/'                                              42690021
PAR095 DC    C'LINES/'                                                  42700021
PAR096 DC    C'FIRST/'                                                  42710021
PAR097 DC    C'NEXT/'                                                   42720021
PAR098 DC    C'UPON/'                                                   42730021
PAR099 DC    C'PROCEDURE/'                                              42740021
PAR09A DC    C'EVERY/'                                                  42750021
PAR09B DC    C'TO/'                                                     42760021
PAR09C DC    C'IS/'                                                     42770021
PAR09D DC    C'FROM/'                                                   42780021
PAR09E DC    C'NO/'                                                     42790021
PAR09F DC    C'KEY/'                                                    42800021
PAR0A0 DC    C'RETURN-CODE/'                                            42810021
PAR0A1 DC    C'END/'                                                    42820021
PAR0A2 DC    C'UNIT/'                                                   42830021
PAR0A3 DC    C'FOR/'                                                    42840021
PAR0A4   DC    C'IN-OF/'                                                42850021
PAR0A5 DC    C'SECTION/'                                                42860021
PAR0A6   DC    C'LABEL-RETURN/'                                         42870021
PAR0A7 DC    C'DIVISION/'                                               42880021
PAR0A8   DC    C'SORT-FILE-SIZE/'                                       42890021
PAR0A9   DC    C'SORT-CORE-SIZE/'                                       42900021
PAR0AA   DC    C'SORT-MODE-SIZE/'                                       42910021
PAR0AB   DC    C'SIGN/'                                                 42920021
PAR0AC   DC    C'SORT/'                                                 42930021
PAR0AD   DC    C'MULTIPLE/'                                             42940021
PAR0AE DC    C'/'                                                       42950021
PAR0AF DC    C'FILLER/'                                                 42960021
PAR0B0 DC    C'/'                                                       42970021
PAR0B1 DC    C'ASSIGN/'                                                 42980021
PAR0B2 DC    C'ACCESS/'                                                 42990021
PAR0B3 DC    C'/'                                                       43000021
PAR0B4 DC    C'RESERVE/'                                                43010021
PAR0B5   DC    C'NOMINAL/'                                              43020021
PAR0B6 DC    C'ACTUAL/'                                                 43030021
PAR0B7 DC    C'BASIS/'                                            0094  43040021
PAR0B8 DC    C'DEBUG/'                                            0094  43050021
PAR0B9 DC    C'DELETE/'                                           0094  43060021
PAR0BA DC    C'SEQUENTIAL/'                                             43070021
PAR0BB DC    C'INSERT/'                                           0094  43080021
PAR0BC DC    C'INDEXED/'                                                43090021
PAR0BD DC    C'/'                                                       43100021
PAR0BE DC    C'ALTERNATE/'                                              43110021
PAR0BF DC    C'AREA/'                                                   43120021
PAR0C0 DC    C'/'                                                       43130021
PAR0C1 DC    C'/'                                                       43140021
PAR0C2 DC    C'/'                                                       43150021
PAR0C3 DC    C'SEARCH/'                                                 43160021
PAR0C4   DC    C'TRACK(S)/'                                             43170021
PAR0C5 DC    C'/'                                                       43180021
PAR0C6 DC    C'/'                                                       43190021
PAR0C7   DC    C'/'                                                     43200021
PAR0C8 DC    C'LIBRARY/'                                                43210021
PAR0C9 DC    C'/'                                                       43220021
PAR0CA DC    C'VALUE/'                                                  43230021
PAR0CB DC    C'PRINT-SWITCH/'                                           43240021
PAR0CC DC    C'BLOCK/'                                                  43250021
PAR0CD DC    C'RECORD/'                                                 43260021
PAR0CE DC    C'/'                                                       43270021
PAR0CF DC    C'RECORDS/'                                          50747 43280021
PAR0D0 DC    C'CONTROL/'                                                43290021
PAR0D1 DC    C'LABEL/'                                                  43300021
PAR0D2 DC    C'/'                                                       43310021
PAR0D3 DC    C'CONTAINS/'                                               43320021
PAR0D4 DC    C'OMITTED/'                                                43330021
PAR0D5 DC    C'STANDARD/'                                               43340021
PAR0D6 DC    C'REPORT(S)/'                                              43350021
PAR0D7 DC    C'REDEFINES/'                                              43360021
PAR0D8 DC    C'PICTURE/'                                                43370021
PAR0D9 DC    C'BLANK/'                                                  43380021
PAR0DA DC    C'OCCURS/'                                                 43390021
PAR0DB DC    C'JUSTIFIED/'                                              43400021
PAR0DC DC    C'POSITIONING/'                                            43410021
PAR0DD DC    C'USAGE/'                                                  43420021
PAR0DE DC    C'COMPUTATIONAL/'                                          43430021
PAR0DF DC    C'COMPUTATIONAL-1/'                                        43440021
PAR0E0 DC    C'COMPUTATIONAL-2/'                                        43450021
PAR0E1 DC    C'COMPUTATIONAL-3/'                                        43460021
PAR0E2 DC    C'WHEN/'                                                   43470021
PAR0E3 DC    C'RIGHT/'                                                  43480021
PAR0E4 DC    C'LEFT/'                                                   43490021
PAR0E5 DC    C'CODE/'                                                   43500021
PAR0E6 DC    C'PAGE/'                                                   43510021
PAR0E7 DC    C'FINAL/'                                                  43520021
PAR0E8   DC    C'CONTROLS/'                                             43530021
PAR0E9 DC    C'HEADING/'                                                43540021
PAR0EA DC    C'DETAIL/'                                                 43550021
PAR0EB DC    C'LAST/'                                                   43560021
PAR0EC DC    C'FOOTING/'                                                43570021
PAR0ED   DC    C'LINE/'                                                 43580021
PAR0EE DC    C'GROUP/'                                                  43590021
PAR0EF DC    C'TYPE/'                                                   43600021
PAR0F0 DC    C'PLUS/'                                                   43610021
PAR0F1 DC    C'/'                                                       43620021
PAR0F2 DC    C'DISPLAY-ST/'                                             43630021
PAR0F3 DC    C'RH/'                                                     43640021
PAR0F4 DC    C'PH/'                                                     43650021
PAR0F5   DC    C'/'                                                     43660021
PAR0F6 DC    C'CH/'                                                     43670021
PAR0F7   DC    C'DE/'                                                   43680021
PAR0F8 DC    C'CF/'                                                     43690021
PAR0F9 DC    C'/'                                                       43700021
PAR0FA DC    C'PF/'                                                     43710021
PAR0FB DC    C'SENTENCE/'                                               43720021
PAR0FC DC    C'COLUMN/'                                                 43730021
PAR0FD DC    C'INDICATE/'                                               43740021
PAR0FE DC    C'SOURCE/'                                                 43750021
PAR0FF DC    C'SUM/'                                                    43760021
PAR100 DC    C'ADD/'                    VERBS                           43770021
PAR101 DC    C'SUBTRACT/'                                               43780021
PAR102 DC    C'MULTIPLY/'                                               43790021
PAR103 DC    C'DIVIDE/'                                                 43800021
PAR104 DC    C'COMPUTE/'                                                43810021
PAR105 DC    C'/'                                                       43820021
PAR106 DC    C'END-OF-SENT/'                                            43830021
PAR107 DC    C'IF/'                                                     43840021
PAR108 DC    C'ELSE/'                                                   43850021
PAR109 DC      C'/'                                                     43860021
PAR10A DC      C'/'                                                     43870021
PAR10B DC      C'/'                                                     43880021
PAR10C DC      C'/'                                                     43890021
PAR10D DC      C'/'                                                     43900021
PAR10E DC      C'/'                                                     43910021
PAR10F DC      C'/'                                                     43920021
PAR110 DC    C'STOP/'                                                   43930021
PAR111 DC    C'GO/'                                                     43940021
PAR112 DC    C'/'                                                       43950021
PAR113 DC    C'/'                                                       43960021
PAR114 DC    C'/'                                                       43970021
PAR115 DC    C'/'                                                       43980021
PAR116 DC    C'/'                                                       43990021
PAR117 DC    C'/'                                                       44000021
PAR118 DC    C'/'                                                       44010021
PAR119 DC    C'/'                                                       44020021
PAR11A DC    C'/'                                                       44030021
PAR11B DC    C'/'                                                       44040021
PAR11C DC    C'ALTER/'                                                  44050021
PAR11D DC    C'MOVE/'                                                   44060021
PAR11E DC    C'EXAMINE/'                                                44070021
PAR11F DC    C'TRANSFORM/'                                              44080021
PAR120 DC    C'READ/'                                                   44090021
PAR121 DC    C'OPEN/'                                                   44100021
PAR122 DC    C'CLOSE/'                                                  44110021
PAR123 DC    C'WRITE/'                                                  44120021
PAR124 DC    C'REWRITE/'                                                44130021
PAR125 DC    C'ACCEPT/'                                                 44140021
PAR126 DC    C'DISPLAY/'                                                44150021
PAR127 DC    C'EXHIBIT/'                                                44160021
PAR128 DC    C'RESET/'                                                  44170021
PAR129 DC    C'READY/'                                                  44180021
PAR12A DC    C'RETURN/'                                                 44190021
PAR12B DC    C'ON/'                                                     44200021
PAR12C DC    C'ENTRY/'                                                  44210021
PAR12D DC    C'CALL/'                                                   44220021
PAR12E DC    C'ENTER/'                                                  44230021
PAR12F   DC    C'/'                                                     44240021
PAR130   DC    C'/'                                                     44250021
PAR131 DC    C'USE/'                                                    44260021
PAR132 DC    C'EXIT/'                                                   44270021
PAR133 DC    C'INITIATE/'                                               44280021
PAR134 DC    C'GENERATE/'                                               44290021
PAR135 DC    C'TERMINATE/'                                              44300021
PAR136 DC    C'SORT/'                                                   44310021
PAR137 DC    C'RELEASE/'                                                44320021
PAR138 DC    C'PERFORM/'                                                44330021
PAR139 DC    C'/'                                                       44340021
PAR13A DC    C'LINK/'                                                   44350021
PAR13B DC    C'DEBUG/'                                                  44360021
PAR13C DC    C'/'                                                       44370021
PAR13D DC    C'/'                                                       44380021
PAR13E DC    C'/'                                                       44390021
PAR13F DC    C'/'                                                       44400021
PAR140 DC    C'INIT/'                                                   44410021
PAR141 DC    C'INCRA/'                                                  44420021
PAR142 DC    C'STEP/'                                                   44430021
PAR143 DC    C'UPDATE/'                                                 44440021
PAR144 DC    C'/'                                                       44450021
PAR145 DC    C'/'                                                       44460021
PAR146 DC    C'/'                                                       44470021
PAR147 DC    C'/'                                                       44480021
PAR148 DC    C'/'                                                       44490021
PAR149 DC    C'/'                                                       44500021
PAR14A DC    C'/'                                                       44510021
PAR14B DC    C'/'                                                       44520021
PAR14C DC    C'/'                                                       44530021
PAR14D DC    C'/'                                                       44540021
PAR14E DC    C'/'                                                       44550021
PAR14F DC    C'/'                                                       44560021
PAR150 DC    C'/'                                                       44570021
PAR151 DC    C'/'                                                       44580021
PAR152 DC    C'/'                                                       44590021
PAR153 DC    C'/'                                                       44600021
PAR154 DC    C'/'                                                       44610021
PAR155 DC    C'/'                                                       44620021
PAR156 DC    C'/'                                                       44630021
PAR157 DC    C'/'                                                       44640021
PAR158 DC    C'/'                                                       44650021
PAR159 DC    C'/'                                                       44660021
PAR15A DC    C'/'                                                       44670021
PAR15B DC    C'/'                                                       44680021
PAR15C DC    C'/'                                                       44690021
PAR15D DC    C'/'                                                       44700021
PAR15E   DC    C'SEARCH/'                                               44710021
PAR15F   DC    C'SEARCH ALL/'                                           44720021
PAR160   DC    C'GOBACK/'                                               44730021
PAR161   DC    C'SET/'                                                  44740021
PAR162   DC    C'SEGMENT-LIMIT/'                                  0809  44750021
PAR163   DC    C'SEEK/'                                                 44760021
PAR164   DC    C'START/'                                                44770021
PAR165   DC    C'/'                                                     44780021
PAR166   DC    C'/'                                                     44790021
PAR167 DC    C'/'                                                       44800021
PAR168   DC    C'/'                                                     44810021
PAR169 DC    C'/'                                                       44820021
PAR16A DC    C'/'                                                       44830021
PAR16B DC    C'/'                                                       44840021
PAR16C DC    C'/'                                                       44850021
PAR16D DC    C'/'                                                       44860021
PAR16E DC    C'/'                                                       44870021
PAR16F DC    C'/'                                                       44880021
PAR170 DC    C'/'                                                       44890021
PAR171   DC    C'READ/'                                                 44900021
PAR172   DC    C'WRITE/'                                                44910021
PAR173   DC    C'GOBACK/'                                               44920021
PAR174 DC    C'/'                                                       44930021
PAR175   DC    C'/'                                                     44940021
PAR176   DC    C'SETVLC/'                                               44950021
PAR177 DC    C'/'                                                       44960021
PAR178 DC    C'/'                                                       44970021
PAR179 DC    C'/'                                                       44980021
PAR17A DC    C'/'                                                       44990021
PAR17B DC    C'/'                                                       45000021
PAR17C DC    C'/'                                                       45010021
PAR17D DC    C'/'                                                       45020021
PAR17E DC    C'/'                                                       45030021
PAR17F DC    C'/'                                                       45040021
PAR180 DC    C'/'                                                       45050021
PAR181 DC    C'VIRTUAL REFERENC'                                        45060021
       DC    C'E/'                                                      45070021
PAR182 DC    C'/'                                                       45080021
PAR183   DC    C'CARRIAGE CONTR'                                        45090021
         DC    C'OL WORD/'                                              45100021
PAR184 DC    C'/'                                                       45110021
PAR185 DC    C'/'                                                       45120021
PAR186 DC    C'EQUAL/'                                                  45130021
PAR187 DC    C'/'                                                       45140021
PAR188 DC    C'GREATER/'                                                45150021
PAR189 DC    C'/'                                                       45160021
PAR18A DC    C'LESS/'                                                   45170021
PAR18B DC    C'/'                                                       45180021
PAR18C DC    C'/'                                                       45190021
PAR18D DC    C'/'                                                       45200021
PAR18E DC    C'/'                                                       45210021
PAR18F DC    C'/'                                                       45220021
PAR190 DC    C'LEFT PAREN/'                  PARENTHESES                45230021
PAR191 DC    C'RIGHT PAREN/'                                            45240021
PAR192 DC    C'/'                                                       45250021
PAR193 DC    C'/'                                                       45260021
PAR194 DC    C'/'                                                       45270021
PAR195 DC    C'/'                                                       45280021
PAR196 DC    C'/'                                                       45290021
PAR197 DC    C'/'                                                       45300021
PAR198 DC    C'/'                                                       45310021
PAR199 DC    C'/'                                                       45320021
PAR19A DC    C'/'                                                       45330021
PAR19B DC    C'/'                                                       45340021
PAR19C DC    C'/'                                                       45350021
PAR19D DC    C'/'                                                       45360021
PAR19E DC    C'/'                                                       45370021
PAR19F DC    C'/'                                                       45380021
PAR1A0 DC    C'PLUS SIGN/'              ARITHMETIC OPERATORS            45390021
PAR1A1 DC    C'MINUS SIGN/'                                             45400021
PAR1A2 DC    C'ASTERISK/'                                               45410021
PAR1A3 DC    C'SLASH/'                                                  45420021
PAR1A4 DC    C'**/'                                                     45430021
PAR1A5 DC    C'/'                                                       45440021
PAR1A6 DC    C'/'                                                       45450021
PAR1A7 DC    C'/'                                                       45460021
PAR1A8 DC    C'/'                                                       45470021
PAR1A9 DC    C'/'                                                       45480021
PAR1AA DC    C'/'                                                       45490021
PAR1AB DC    C'/'                                                       45500021
PAR1AC DC    C'/'                                                       45510021
PAR1AD DC    C'/'                                                       45520021
PAR1AE DC    C'/'                                                       45530021
PAR1AF DC    C'/'                                                       45540021
PAR1B0 DC    C'/'                       CRITICAL PROGRAM BREAKS         45550021
PAR1B1 DC    C'DATA/'                                                   45560021
PAR1B2 DC    C'FILE/'                                                   45570021
PAR1B3 DC    C'WORKING-STORAGE/'                                        45580021
PAR1B4 DC    C'LINKAGE/'                                                45590021
PAR1B5 DC    C'REPORT/'                                                 45600021
PAR1B6 DC    C'PROCEDURE/'                                              45610021
PAR1B7 DC    C'DECLARATIVES/'                                           45620021
PAR1B8 DC    C'END DECLARATIVES'                                        45630021
       DC    C'/'                                                       45640021
PAR1B9 DC    C'DEBUG SECT/'                                             45650021
PAR1BA DC    C'/'                                                       45660021
PAR1BB DC    C'BEGINNING OF Q-T'                                        45670021
       DC    C'EXT/'                                                    45680021
PAR1BC DC    C'END OF Q-TEXT/'                                          45690021
PAR1BD DC    C'BEGINNING OF R-T'                                        45700021
       DC    C'EXT/'                                                    45710021
PAR1BE DC    C'END OF R-TEXT/'                                          45720021
PAR1BF DC    C'DATE-COMPILED/'                                          45730021
PAR1C0 DC    C'SECURITY/'                                               45740021
PAR1C1 DC    C'IDENTIFICATION/'                                         45750021
PAR1C2 DC    C'PROGRAM-ID/'                                             45760021
PAR1C3 DC    C'AUTHOR/'                                                 45770021
PAR1C4 DC    C'/'                                                       45780021
PAR1C5 DC    C'CONFIGURATION/'                                          45790021
PAR1C6 DC    C'SOURCE-COMPUTER/'                                        45800021
PAR1C7 DC    C'OBJECT-COMPUTER/'                                        45810021
PAR1C8 DC    C'INPUT-OUTPUT/'                                           45820021
PAR1C9 DC    C'FILE-CONTROL/'                                           45830021
PAR1CA DC    C'I-O-CONTROL/'                                            45840021
PAR1CB DC    C'SPECIAL-NAMES/'                                          45850021
PAR1CC DC    C'DATE-WRITTEN/'                                           45860021
PAR1CD DC    C'INSTALLATION/'                                           45870021
PAR1CE DC    C'REMARKS/'                                                45880021
PAR1CF DC    C'END OF PROGRAM/'                                         45890021
PAR1D0 DC    C'LOW-VALUE/'              FIGURATIVE CONSTANTS            45900021
PAR1D1   DC    C'77/'                   LEVEL NUMBERS                   45910021
PAR1D2   DC    C'88/'                                                   45920021
PAR1D3   DC    C'RD/'                                                   45930021
PAR1D4   DC    C'SA/'                                                   45940021
PAR1D5   DC    C'SD/'                                                   45950021
PAR1D6   DC    C'/'                                                     45960021
PAR1D7   DC    C'FD/'                                                   45970021
PAR1D8 DC    C'SPACE/'                                                  45980021
PAR1D9 DC    C'/'                                                       45990021
PAR1DA DC    C'/'                                                       46000021
PAR1DB DC    C'/'                                                       46010021
PAR1DC DC    C'/'                                                       46020021
PAR1DD DC    C'/'                                                       46030021
PAR1DE DC    C'/'                                                       46040021
PAR1DF DC    C'QUOTE/'                                                  46050021
PAR1E0 DC    C'/'                                                       46060021
PAR1E1 DC    C'/'                                                       46070021
PAR1E2 DC    C'/'                                                       46080021
PAR1E3 DC    C'/'                                                       46090021
PAR1E4 DC    C'/'                                                       46100021
PAR1E5 DC    C'/'                                                       46110021
PAR1E6 DC    C'/'                                                       46120021
PAR1E7 DC    C'/'                                                       46130021
PAR1E8 DC    C'/'                                                       46140021
PAR1E9 DC    C'/'                                                       46150021
PAR1EA DC    C'/'                                                       46160021
PAR1EB DC    C'/'                                                       46170021
PAR1EC DC    C'/'                                                       46180021
PAR1ED DC    C'/'                                                       46190021
PAR1EE DC    C'ZERO/'                                                   46200021
PAR1EF DC    C'HIGH-VALUE/'                                             46210021
PAR1F0 DC    C'/'                      ENVIRONMENT DIV. VERBS           46220021
PAR1F1 DC    C'SELECT/'                                                 46230021
PAR1F2 DC    C'RERUN/'                                                  46240021
PAR1F3 DC    C'SAME/'                                                   46250021
PAR1F4 DC    C'APPLY/'                                                  46260021
PAR1F5 DC    C'COPY/'                                                   46270021
PAR1F6 DC    C'INCLUDE/'                                                46280021
PAR1F7 DC    C'NOTE/'                                                   46290021
PAR1F8 DC    C'/'                      STANDARD DATA NAMES              46300021
PAR1F9 DC    C'LINE-COUNTER/'                                           46310021
PAR1FA DC    C'PAGE-COUNTER/'                                           46320021
PAR1FB DC    C'/'                                                       46330021
PAR1FC DC    C'/'                                                       46340021
PAR1FD DC    C'TALLY/'                                                  46350021
PAR1FE DC    C'/'                                                       46360021
PAR1FF DC    C'/'                                                       46370021
PAREND EQU   *                                                          46380021
* TRT TABLE FOR ERROR MESSAGE SCAN                                      46390021
TRTABL DC    64X'00'                                                    46400021
       DC    X'1F'       BLANK                                          46410021
       DC    26X'00'                                                    46420021
       DC    X'2F'       $ (EPARAM)                                     46430021
       DC    5X'00'                                                     46440021
       DC    X'8F'       / (ENTEX)                                      46450021
       DC    25X'00'                                                    46460021
       DC    X'4F'       = (ACTION)                                     46470021
       DC    2X'00'                                                     46480021
       DC    X'4F'        EQUAL SAME AS NUMBER  *****                   46490021
       DC    129X'00'                                                   46500021
       EJECT                                                            46510021
*                                                                       46520021
IKF713 CSECT                                                            46530021
PH1ERR DS    0F                                                         46540021
         DC  AL3(TX1000)                                                46550021
         DC  AL3(TX1001)                                                46560021
         DC  AL3(TX1002)                                                46570021
         DC  AL3(TX1003)                                                46580021
         DC  AL3(TX1004)                                                46590021
         DC  AL3(TX1005)                                                46600021
         DC  AL3(TX1006)                                                46610021
         DC  AL3(TX1007)                                                46620021
         DC  AL3(TX1008)                                                46630021
         DC  AL3(TX1009)                                                46640021
MS1010   DC  AL3(TX1010)                                                46650021
         DC  AL3(TX1011)                                                46660021
         DC  AL3(TX1012)                                                46670021
         DC  AL3(TX1013)                                                46680021
         DC  AL3(TX1014)                                                46690021
         DC  AL3(TX1015)                                                46700021
         DC  AL3(TX1016)                                                46710021
         DC  AL3(TX1017)                                                46720021
         DC  AL3(TX1018)                                                46730021
         DC  AL3(TX1019)                                                46740021
         DC  AL3(TX1020)                                                46750021
MS1021   DC  AL3(TX1021)                                                46760021
MS1022   DC  AL3(TX1022)                                                46770021
MS1023   DC  AL3(TX1023)                                                46780021
MS1024   DC  AL3(TX1024)                                                46790021
MS1025   DC  AL3(TX1025)                                                46800021
MS1026   DC  AL3(TX1026)                                                46810021
MS1027   DC  AL3(TX1027)                                                46820021
MS1028   DC  AL3(TX1028)                                                46830021
MS1029   DC  AL3(TX1029)                                                46840021
MS1030   DC  AL3(TX1030)                                                46850021
MS1031   DC  AL3(TX1031)                                                46860021
MS1032   DC  AL3(TX1032)                                                46870021
MS1033   DC  AL3(TX1033)                                                46880021
MS1034   DC  AL3(TX1034)                                                46890021
MS1035   DC  AL3(TX1035)                                                46900021
MS1036   DC  AL3(TX1036)                                                46910021
MS1037   DC  AL3(TX1037)                                                46920021
MS1038   DC  AL3(TX1038)                                                46930021
MS1039   DC  AL3(TX1039)                                                46940021
MS1040   DC  AL3(TX1040)                                                46950021
MS1041   DC  AL3(TX1041)                                                46960021
MS1042   DC  AL3(TX1042)                                                46970021
MS1043   DC  AL3(TX1043)                                                46980021
MS1044   DC  AL3(TX1044)                                                46990021
MS1045   DC  AL3(TX1045)                                                47000021
MS1046   DC  AL3(TX1046)                                                47010021
MS1047   DC  AL3(TX1047)                                                47020021
MS1048   DC  AL3(TX1048)                                                47030021
MS1049   DC  AL3(TX1049)                                                47040021
MS1050   DC  AL3(TX1050)                                                47050021
MS1051   DC  AL3(TX1051)                                                47060021
MS1052   DC  AL3(TX1052)                                                47070021
MS1053   DC  AL3(TX1053)                                                47080021
MS1054   DC  AL3(TX1054)                                                47090021
MS1055   DC  AL3(TX1055)                                                47100021
MS1056   DC  AL3(TX1056)                                                47110021
MS1057   DC  AL3(TX1057)                                                47120021
MS1058   DC  AL3(TX1058)                                                47130021
MS1059   DC  AL3(TX1059)                                                47140021
MS1060   DC  AL3(TX1060)                                                47150021
MS1061   DC  AL3(TX1061)                                                47160021
MS1062   DC  AL3(TX1062)                                                47170021
MS1063   DC  AL3(TX1063)                                                47180021
MS1064   DC  AL3(TX1064)                                                47190021
MS1065   DC  AL3(TX1065)                                                47200021
MS1066   DC  AL3(TX1066)                                                47210021
MS1067   DC  AL3(TX1067)                                                47220021
MS1068   DC  AL3(TX1068)                                                47230021
MS1069   DC  AL3(TX1069)                                                47240021
MS1070   DC  AL3(TX1070)                                                47250021
MS1071   DC  AL3(TX1071)                                                47260021
MS1072   DC  AL3(TX1072)                                                47270021
MS1073   DC  AL3(TX1073)                                                47280021
MS1074   DC  AL3(TX1074)                                                47290021
MS1075   DC  AL3(TX1075)                                                47300021
MS1076   DC  AL3(TX1076)                                                47310021
MS1077   DC  AL3(TX1077)                                                47320021
MS1078   DC  AL3(TX1078)                                                47330021
MS1079   DC  AL3(TX1079)                                                47340021
MS1080   DC  AL3(TX1080)                                                47350021
MS1081   DC  AL3(TX1081)                                                47360021
MS1082   DC  AL3(TX1082)                                                47370021
MS1083   DC  AL3(TX1083)                                                47380021
MS1084   DC  AL3(TX1084)                                                47390021
MS1085   DC  AL3(TX1085)                                                47400021
MS1086   DC  AL3(TX1086)                                                47410021
MS1087   DC  AL3(TX1087)                                                47420021
MS1088   DC  AL3(TX1088)                                                47430021
MS1089   DC  AL3(TX1089)                                                47440021
MS1090   DC  AL3(TX1090)                                                47450021
MS1091   DC  AL3(TX1091)                                                47460021
MS1092   DC  AL3(TX1092)                                                47470021
MS1093   DC  AL3(TX1093)                                                47480021
MS1094   DC  AL3(TX1094)                                                47490021
MS1095   DC  AL3(TX1095)                                                47500021
MS1096   DC  AL3(TX1096)                                                47510021
MS1097   DC  AL3(TX1097)                                                47520021
MS1098   DC  AL3(TX1098)                                                47530021
MS1099   DC  AL3(TX1099)                                                47540021
MS1100   DC  AL3(TX1100)                                                47550021
MS1101   DC  AL3(TX1101)                                                47560021
MS1102   DC  AL3(TX1102)                                                47570021
MS1103   DC  AL3(TX1103)                                                47580021
MS1104   DC  AL3(TX1104)                                                47590021
MS1105   DC  AL3(TX1105)                                                47600021
MS1106   DC  AL3(TX1106)                                                47610021
MS1107   DC  AL3(TX1107)                                                47620021
MS1108   DC  AL3(TX1108)                                                47630021
MS1109   DC  AL3(TX1109)                                                47640021
MS1110   DC  AL3(TX1110)                                                47650021
MS1111   DC  AL3(TX1111)                                                47660021
MS1112   DC  AL3(TX1112)                                                47670021
MS1113   DC  AL3(TX1113)                                                47680021
MS1114   DC  AL3(TX1114)                                                47690021
MS1115   DC  AL3(TX1115)                                                47700021
MS1116   DC  AL3(TX1116)                                                47710021
MS1117   DC  AL3(TX1117)                                                47720021
MS1118   DC  AL3(TX1118)                                                47730021
MS1119   DC  AL3(TX1119)                                                47740021
MS1120   DC  AL3(TX1120)                                                47750021
MS1121   DC  AL3(TX1121)                                                47760021
MS1122   DC  AL3(TX1122)                                                47770021
MS1123   DC  AL3(TX1123)                                                47780021
MS1124   DC  AL3(TX1124)                                                47790021
MS1125   DC  AL3(TX1125)                                                47800021
MS1126   DC  AL3(TX1126)                                                47810021
MS1127   DC  AL3(TX1127)                                                47820021
MS1128   DC  AL3(TX1128)                                                47830021
MS1129   DC  AL3(TX1129)                                                47840021
MS1130   DC  AL3(TX1130)                                                47850021
MS1131   DC  AL3(TX1131)                                                47860021
MS1132   DC  AL3(TX1132)                                                47870021
MS1133   DC  AL3(TX1133)                                                47880021
MS1134   DC  AL3(TX1134)                                                47890021
MS1135   DC  AL3(TX1135)                                                47900021
MS1136   DC  AL3(TX1136)                                                47910021
MS1137   DC  AL3(TX1137)                                                47920021
MS1138   DC  AL3(TX1138)                                                47930021
MS1139   DC  AL3(TX1139)                                                47940021
MS1140   DC  AL3(TX1140)                                                47950021
MS1141   DC  AL3(TX1141)                                                47960021
MS1142   DC  AL3(TX1142)                                                47970021
MS1143   DC  AL3(TX1143)                                                47980021
MS1144   DC  AL3(TX1144)                                                47990021
MS1145   DC  AL3(TX1145)                                                48000021
MS1146   DC  AL3(TX1146)                                                48010021
MS1147   DC  AL3(TX1147)                                                48020021
MS1148   DC  AL3(TX1148)                                                48030021
MS1149   DC  AL3(TX1149)                                                48040021
MS1150   DC    AL3(TX1150)                                        7075  48050021
         DC  AL3(TX1151)                                                48060021
         DC  AL3(TX1152)                                                48070021
         DC  AL3(TX1153)                                                48080021
         DC  AL3(TX1154)                                                48090021
         DC  AL3(TX1155)                                                48100021
         DC  AL3(TX1156)                                                48110021
         DC  AL3(TX1157)                                                48120021
         DC  AL3(TX1158)                                                48130021
         DC  AL3(TX1159)                                                48140021
         DC  AL3(TX1160)                                                48150021
         DC  AL3(TX1161)                                                48160021
         DC  AL3(TX1162)                                                48170021
         DC  AL3(TX1163)                                                48180021
         DC  AL3(TX1164)                                                48190021
         DC  AL3(TX1165)                                                48200021
         DC  AL3(TX1166)                                                48210021
         DC  AL3(TX1167)                                                48220021
         DC  AL3(TX1168)                                                48230021
         DC  AL3(TX1169)                                                48240021
         DC  AL3(TX1170)                                                48250021
         DC  AL3(TX1171)                                                48260021
         DC  AL3(TX1172)                                                48270021
         DC  AL3(TX1173)                                                48280021
         DC  AL3(TX1174)                                                48290021
         DC  AL3(TX1175)                                                48300021
MS1176 DC    AL3(TX1176)                                                48310021
         DC  AL3(TX1177)                                                48320021
         DC  AL3(TX1178)                                                48330021
         DC  AL3(TX1179)                                                48340021
         DC  AL3(TX1180)                                                48350021
       DC    AL3(TX1181)                                                48360021
       DC    AL3(TX1182)                                                48370021
       DC    AL3(TX1183)                                          9321  48380021
       DC    AL3(TX1184)                                          9321  48390021
       DC    AL3(TX1185)                                          9321  48400021
       DC    AL3(TX1186)                                          9321  48410021
       DC    AL3(TX1187)                                          9321  48420021
       DC    AL3(TX1188)                                          9321  48430021
MS1189 DC    AL3(TX1189)                                          9321  48440021
MS1190 DC    AL3(TX1190)                                          9321  48450021
PH2ERR DS    0F                                                         48460021
MS2000   DC  AL3(TX2000)                                                48470021
MS2001   DC  AL3(TX2001)                                                48480021
MS2002   DC  AL3(TX2002)                                                48490021
MS2003   DC  AL3(TX2003)                                                48500021
MS2004   DC  AL3(TX2004)                                                48510021
MS2005   DC  AL3(TX2005)                                                48520021
MS2006   DC  AL3(TX2006)                                                48530021
MS2007   DC  AL3(TX2007)                                                48540021
MS2008   DC  AL3(TX2008)                                                48550021
MS2009   DC  AL3(TX2009)                                                48560021
MS2010   DC  AL3(TX2010)                                                48570021
MS2011   DC  AL3(TX2011)                                                48580021
MS2012   DC  AL3(TX2012)                                                48590021
MS2013   DC  AL3(TX2013)                                                48600021
MS2014   DC  AL3(TX2014)                                                48610021
MS2015   DC  AL3(TX2015)                                                48620021
MS2016   DC  AL3(TX2016)                                                48630021
MS2017   DC  AL3(TX2017)                                                48640021
MS2018   DC  AL3(TX2018)                                                48650021
MS2019   DC  AL3(TX2019)                                                48660021
MS2020   DC  AL3(TX2020)                                                48670021
MS2021   DC  AL3(TX2021)                                                48680021
MS2022   DC  AL3(TX2022)                                                48690021
MS2023   DC  AL3(TX2023)                                                48700021
MS2024   DC  AL3(TX2024)                                                48710021
MS2025   DC  AL3(TX2025)                                                48720021
MS2026   DC  AL3(TX2026)                                                48730021
MS2027   DC  AL3(TX2027)                                                48740021
MS2028   DC  AL3(TX2028)                                                48750021
MS2029   DC  AL3(TX2029)                                                48760021
MS2030   DC  AL3(TX2030)                                                48770021
MS2031   DC  AL3(TX2031)                                                48780021
MS2032   DC  AL3(TX2032)                                                48790021
MS2033   DC  AL3(TX2033)                                                48800021
MS2034   DC  AL3(TX2034)                                                48810021
MS2035   DC  AL3(TX2035)                                                48820021
MS2036   DC  AL3(TX2036)                                                48830021
MS2037   DC  AL3(TX2037)                                                48840021
MS2038   DC  AL3(TX2038)                                                48850021
MS2039   DC  AL3(TX2039)                                                48860021
MS2040   DC  AL3(TX2040)                                                48870021
MS2041   DC  AL3(TX2041)                                                48880021
MS2042   DC  AL3(TX2042)                                                48890021
MS2043   DC  AL3(TX2043)                                                48900021
MS2044   DC  AL3(TX2044)                                                48910021
MS2045   DC  AL3(TX2045)                                                48920021
MS2046   DC  AL3(TX2046)                                                48930021
MS2047   DC  AL3(TX2047)                                                48940021
MS2048   DC  AL3(TX2048)                                                48950021
MS2049   DC  AL3(TX2049)                                                48960021
MS2050   DC  AL3(TX2050)                                                48970021
MS2051   DC  AL3(TX2051)                                                48980021
MS2052   DC  AL3(TX2052)                                                48990021
MS2053   DC  AL3(TX2053)                                                49000021
MS2054   DC  AL3(TX2054)                                                49010021
MS2055   DC  AL3(TX2055)                                                49020021
MS2056   DC  AL3(TX2056)                                                49030021
MS2057   DC  AL3(TX2057)                                                49040021
MS2058   DC  AL3(TX2058)                                                49050021
MS2059   DC  AL3(TX2059)                                                49060021
MS2060   DC  AL3(TX2060)                                                49070021
MS2061   DC  AL3(TX2061)                                                49080021
MS2062   DC  AL3(TX2062)                                                49090021
MS2063   DC  AL3(TX2063)                                                49100021
MS2064   DC  AL3(TX2064)                                                49110021
MS2065   DC  AL3(TX2065)                                                49120021
MS2066   DC  AL3(TX2066)                                                49130021
MS2067   DC  AL3(TX2067)                                                49140021
MS2068   DC  AL3(TX2068)                                                49150021
MS2069   DC  AL3(TX2069)                                                49160021
MS2070   DC  AL3(TX2070)                                                49170021
MS2071   DC  AL3(TX2071)                                                49180021
MS2072   DC  AL3(TX2072)                                                49190021
MS2073   DC  AL3(TX2073)                                                49200021
MS2074   DC  AL3(TX2074)                                                49210021
MS2075   DC  AL3(TX2075)                                                49220021
MS2076   DC  AL3(TX2076)                                                49230021
MS2077   DC  AL3(TX2077)                                                49240021
MS2078   DC  AL3(TX2078)                                                49250021
MS2079   DC  AL3(TX2079)                                                49260021
MS2080   DC  AL3(TX2080)                                                49270021
MS2081   DC  AL3(TX2081)                                                49280021
MS2082   DC  AL3(TX2082)                                                49290021
MS2083   DC  AL3(TX2083)                                                49300021
MS2084   DC  AL3(TX2084)                                                49310021
MS2085   DC  AL3(TX2085)                                                49320021
MS2086   DC  AL3(TX2086)                                                49330021
MS2087   DC  AL3(TX2087)                                                49340021
MS2088   DC  AL3(TX2088)                                                49350021
MS2089   DC  AL3(TX2089)                                                49360021
MS2090   DC  AL3(TX2090)                                                49370021
MS2091   DC  AL3(TX2091)                                                49380021
MS2092   DC  AL3(TX2092)                                                49390021
MS2093   DC  AL3(TX2093)                                                49400021
MS2094   DC  AL3(TX2094)                                                49410021
MS2095   DC  AL3(TX2095)                                                49420021
MS2096   DC  AL3(TX2096)                                                49430021
MS2097   DC  AL3(TX2097)                                                49440021
MS2098   DC  AL3(TX2098)                                                49450021
MS2099   DC  AL3(TX2099)                                                49460021
MS2100   DC  AL3(TX2100)                                                49470021
MS2101   DC  AL3(TX2101)                                                49480021
MS2102   DC  AL3(TX2102)                                                49490021
MS2103   DC  AL3(TX2103)                                                49500021
MS2104   DC  AL3(TX2104)                                                49510021
MS2105   DC  AL3(TX2105)                                                49520021
MS2106   DC  AL3(TX2106)                                                49530021
MS2107   DC  AL3(TX2107)                                                49540021
MS2108   DC  AL3(TX2108)                                                49550021
MS2109   DC  AL3(TX2109)                                                49560021
MS2110   DC  AL3(TX2110)                                                49570021
MS2111   DC  AL3(TX2111)                                                49580021
MS2112   DC  AL3(TX2112)                                                49590021
MS2113   DC  AL3(TX2113)                                                49600021
MS2114   DC  AL3(TX2114)                                                49610021
MS2115   DC  AL3(TX2115)                                                49620021
MS2116   DC  AL3(TX2116)                                                49630021
MS2117   DC  AL3(TX2117)                                                49640021
MS2118   DC  AL3(TX2118)                                                49650021
MS2119   DC  AL3(TX2119)                                                49660021
MS2120   DC  AL3(TX2120)                                                49670021
MS2121   DC  AL3(TX2121)                                                49680021
MS2122   DC  AL3(TX2122)                                                49690021
MS2123   DC  AL3(TX2123)                                                49700021
MS2124   DC  AL3(TX2124)                                                49710021
MS2125   DC  AL3(TX2125)                                                49720021
MS2126   DC  AL3(TX2126)                                                49730021
MS2127   DC  AL3(TX2127)                                                49740021
MS2128   DC  AL3(TX2128)                                                49750021
MS2129   DC  AL3(TX2129)                                                49760021
MS2130   DC  AL3(TX2130)                                                49770021
MS2131   DC  AL3(TX2131)                                                49780021
MS2132   DC  AL3(TX2132)                                                49790021
MS2133   DC  AL3(TX2133)                                                49800021
MS2134   DC  AL3(TX2134)                                                49810021
MS2135   DC  AL3(TX2135)                                                49820021
MS2136   DC  AL3(TX2136)                                                49830021
MS2137   DC  AL3(TX2137)                                                49840021
MS2138   DC  AL3(TX2138)                                                49850021
MS2139   DC  AL3(TX2139)                                                49860021
MS2140   DC  AL3(TX2140)                                                49870021
MS2141   DC  AL3(TX2141)                                                49880021
MS2142   DC  AL3(TX2142)                                                49890021
MS2143   DC  AL3(TX2143)                                                49900021
MS2144   DC  AL3(TX2144)                                                49910021
MS2145   DC  AL3(TX2145)                                                49920021
MS2146   DC  AL3(TX2146)                                                49930021
MS2147   DC  AL3(TX2147)                                                49940021
MS2148   DC  AL3(TX2148)                                                49950021
MS2149   DC  AL3(TX2149)                                                49960021
MS2150   DC  AL3(TX2150)                                                49970021
MS2151   DC  AL3(TX2151)                                                49980021
MS2152   DC  AL3(TX2152)                                                49990021
MS2153   DC  AL3(TX2153)                                                50000021
MS2154   DC  AL3(TX2154)                                                50010021
MS2155   DC  AL3(TX2155)                                                50020021
MS2156   DC  AL3(TX2156)                                                50030021
MS2157   DC  AL3(TX2157)                                                50040021
MS2158   DC  AL3(TX2158)                                                50050021
MS2159   DC  AL3(TX2159)                                                50060021
MS2160   DC  AL3(TX2160)                                                50070021
MS2161   DC  AL3(TX2161)                                                50080021
         DC  AL3(TX2162)                                                50090021
         DC  AL3(TX2163)                                                50100021
         DC  AL3(TX2164)                                                50110021
         DC  AL3(TX2165)                                                50120021
         DC  AL3(TX2166)                                                50130021
         DC  AL3(TX2167)                                                50140021
         DC  AL3(TX2168)                                                50150021
         DC  AL3(TX2169)                                                50160021
         DC  AL3(TX2170)                                                50170021
         DC    AL3(TX2171)                                              50180021
         DC  AL3(TX2172)                                                50190021
         DC  AL3(TX2173)                                                50200021
         DC  AL3(TX2174)                                                50210021
         DC  AL3(TX2175)                                                50220021
         DC  AL3(TX2176)                                                50230021
         DC  AL3(TX2177)                                                50240021
         DC  AL3(TX2178)                                                50250021
         DC  AL3(TX2179)                                                50260021
         DC  AL3(TX2180)                                                50270021
         DC  AL3(TX2181)                                                50280021
         DC  AL3(TX2182)                                                50290021
         DC  AL3(TX2183)                                                50300021
         DC  AL3(TX2184)                                                50310021
         DC  AL3(TX2185)                                                50320021
         DC  AL3(TX2186)                                                50330021
         DC  AL3(TX2187)                                                50340021
         DC  AL3(TX2188)                                                50350021
         DC  AL3(TX2189)                                                50360021
         DC  AL3(TX2190)                                                50370021
         DC  AL3(TX2191)                                                50380021
         DC  AL3(TX2192)                                                50390021
         DC  AL3(TX2193)                                                50400021
         DC  AL3(TX2194)                                                50410021
         DC  AL3(TX2195)                                                50420021
         DC  AL3(TX2196)                                                50430021
         DC  AL3(TX2197)                                                50440021
         DC  AL3(TX2198)                                                50450021
         DC  AL3(TX2199)                                                50460021
         DC  AL3(TX2200)                                                50470021
         DC    AL3(TX2201)                                              50480021
         DC    AL3(TX2202)                                              50490021
         DC    AL3(TX2203)                                              50500021
         DC    AL3(TX2204)                                              50510021
         DC    AL3(TX2205)                                              50520021
         DC    AL3(TX2206)                                              50530021
         DC    AL3(TX2207)                                              50540021
         DC    AL3(TX2208)                                              50550021
         DC    AL3(TX2209)                                              50560021
         DC    AL3(TX2210)                                              50570021
MS2211   DC    AL3(TX2211)                                        07762 50580021
         DC    AL3(TX2212)                                              50590021
         DC    AL3(TX2213)                                              50600021
         DC    AL3(TX2214)                                              50610021
         DC    AL3(TX2215)                                              50620021
         DC    AL3(TX2216)                                              50630021
         DC    AL3(TX2217)                                              50640021
         DC    AL3(TX2218)                                              50650021
         DC    AL3(TX2219)                                              50660021
         DC    AL3(TX2220)                                              50670021
         DC    AL3(TX2221)                                              50680021
         DC    AL3(TX2222)                                              50690021
MS2223   DC    AL3(TX2223)                                              50700021
MS2224   DC    AL3(TX2224)                                        47955 50710021
MS2225   DC    AL3(TX2225)                                        07271 50720021
MS2226   DC    AL3(TX2226)                                              50730021
MS2227   DC    AL3(TX2227)                                              50740021
MS2228   DC    AL3(TX2228)                                        51873 50750021
MS2229   DC    AL3(TX2229)                                        51873 50760021
MS2230   DC    AL3(TX2230)                                        51873 50770021
PH3ERR DS    0F                                                         50780021
MS3000   DC  AL3(TX3000)                                                50790021
MS3001   DC  AL3(TX3001)                                                50800021
MS3002   DC  AL3(TX3002)                                                50810021
MS3003   DC  AL3(TX3003)                                                50820021
MS3004   DC  AL3(TX3004)                                                50830021
MS3005   DC  AL3(TX3005)                                                50840021
MS3006   DC  AL3(TX3006)                                                50850021
MS3007   DC  AL3(TX3007)                                                50860021
MS3008   DC  AL3(TX3008)                                                50870021
MS3009   DC  AL3(TX3009)                                                50880021
MS3010   DC  AL3(TX3010)                                                50890021
MS3011   DC  AL3(TX3011)                                                50900021
       DC    AL3(TX3012)                                                50910021
       DC    AL3(TX3013)                                                50920021
MS3014   DC  AL3(TX3014)                                                50930021
MS3015   DC  AL3(TX3015)                                                50940021
MS3016   DC  AL3(TX3016)                                                50950021
MS3017   DC  AL3(TX3017)                                                50960021
MS3018   DC  AL3(TX3018)                                                50970021
MS3019   DC  AL3(TX3019)                                                50980021
MS3020   DC  AL3(TX3020)                                                50990021
         DC  AL3(TX3021)                                                51000021
         DC  AL3(TX3022)                                                51010021
         DC  AL3(TX3023)                                                51020021
         DC  AL3(TX3024)                                                51030021
         DC  AL3(TX3025)                                                51040021
         DC  AL3(TX3026)                                                51050021
         DC  AL3(TX3027)                                                51060021
         DC  AL3(TX3028)                                                51070021
MS3029   DC    AL3(TX3029)                                        34761 51080021
         DC  AL3(TX3030)                                                51090021
PH4ERR DS    0F                                                         51100021
MS4000   DC  AL3(TX4000)                                                51110021
MS4001   DC  AL3(TX4001)                                                51120021
MS4002   DC  AL3(TX4002)                                                51130021
MS4003   DC  AL3(TX4003)                                                51140021
MS4004   DC  AL3(TX4004)                                                51150021
MS4005   DC  AL3(TX4005)                                                51160021
MS4006   DC  AL3(TX4006)                                                51170021
MS4007   DC  AL3(TX4007)                                                51180021
MS4008   DC  AL3(TX4008)                                                51190021
MS4009   DC  AL3(TX4009)                                                51200021
MS4010   DC  AL3(TX4010)                                                51210021
MS4011   DC  AL3(TX4011)                                                51220021
MS4012   DC  AL3(TX4012)                                                51230021
MS4013   DC  AL3(TX4013)                                                51240021
MS4014   DC  AL3(TX4014)                                                51250021
MS4015   DC  AL3(TX4015)                                                51260021
MS4016   DC  AL3(TX4016)                                                51270021
MS4017   DC  AL3(TX4017)                                                51280021
MS4018   DC  AL3(TX4018)                                                51290021
MS4019   DC  AL3(TX4019)                                                51300021
MS4020   DC  AL3(TX4020)                                                51310021
MS4021   DC  AL3(TX4021)                                                51320021
MS4022   DC  AL3(TX4022)                                                51330021
MS4023   DC  AL3(TX4023)                                                51340021
MS4024   DC  AL3(TX4024)                                                51350021
MS4025   DC  AL3(TX4025)                                                51360021
MS4026   DC  AL3(TX4026)                                                51370021
MS4027   DC  AL3(TX4027)                                                51380021
MS4028   DC  AL3(TX4028)                                                51390021
MS4029   DC  AL3(TX4029)                                                51400021
MS4030   DC  AL3(TX4030)                                                51410021
MS4031   DC  AL3(TX4031)                                                51420021
MS4032   DC  AL3(TX4032)                                                51430021
MS4033   DC  AL3(TX4033)                                                51440021
MS4034   DC  AL3(TX4034)                                                51450021
MS4035   DC  AL3(TX4035)                                                51460021
MS4036   DC  AL3(TX4036)                                                51470021
MS4037   DC  AL3(TX4037)                                                51480021
MS4038   DC  AL3(TX4038)                                                51490021
MS4039   DC  AL3(TX4039)                                                51500021
MS4040   DC  AL3(TX4040)                                                51510021
MS4041   DC  AL3(TX4041)                                                51520021
MS4042   DC  AL3(TX4042)                                                51530021
MS4043   DC  AL3(TX4043)                                                51540021
MS4044   DC  AL3(TX4044)                                                51550021
MS4045   DC  AL3(TX4045)                                                51560021
MS4046   DC  AL3(TX4046)                                                51570021
MS4047   DC  AL3(TX4047)                                                51580021
MS4048   DC  AL3(TX4048)                                                51590021
MS4049   DC  AL3(TX4049)                                                51600021
MS4050   DC  AL3(TX4050)                                                51610021
MS4051   DC  AL3(TX4051)                                                51620021
MS4052   DC  AL3(TX4052)                                                51630021
MS4053   DC  AL3(TX4053)                                                51640021
MS4054   DC  AL3(TX4054)                                                51650021
MS4055   DC  AL3(TX4055)                                                51660021
MS4056   DC  AL3(TX4056)                                                51670021
MS4057   DC  AL3(TX4057)                                                51680021
MS4058   DC  AL3(TX4058)                                                51690021
MS4059   DC  AL3(TX4059)                                                51700021
MS4060   DC  AL3(TX4060)                                                51710021
MS4061   DC  AL3(TX4061)                                                51720021
MS4062   DC  AL3(TX4062)                                                51730021
MS4063   DC  AL3(TX4063)                                                51740021
MS4064   DC  AL3(TX4064)                                                51750021
MS4065   DC  AL3(TX4065)                                                51760021
MS4066   DC  AL3(TX4066)                                                51770021
MS4067   DC  AL3(TX4067)                                                51780021
MS4068   DC  AL3(TX4068)                                                51790021
MS4069   DC  AL3(TX4069)                                                51800021
MS4070   DC  AL3(TX4070)                                                51810021
MS4071   DC  AL3(TX4071)                                                51820021
MS4072   DC  AL3(TX4072)                                                51830021
MS4073   DC  AL3(TX4073)                                                51840021
MS4074   DC  AL3(TX4074)                                                51850021
MS4075   DC  AL3(TX4075)                                                51860021
MS4076   DC  AL3(TX4076)                                                51870021
MS4077   DC  AL3(TX4077)                                                51880021
MS4078   DC  AL3(TX4078)                                                51890021
MS4079   DC  AL3(TX4079)                                                51900021
MS4080   DC  AL3(TX4080)                                                51910021
MS4081   DC  AL3(TX4081)                                                51920021
MS4082   DC  AL3(TX4082)                                                51930021
MS4083   DC  AL3(TX4083)                                                51940021
MS4084   DC  AL3(TX4084)                                                51950021
MS4085   DC  AL3(TX4085)                                                51960021
MS4086   DC  AL3(TX4086)                                                51970021
MS4087   DC  AL3(TX4087)                                                51980021
MS4088   DC  AL3(TX4088)                                                51990021
MS4089   DC  AL3(TX4089)                                                52000021
MS4090   DC  AL3(TX4090)                                                52010021
MS4091   DC  AL3(TX4091)                                                52020021
MS4092   DC  AL3(TX4092)                                                52030021
MS4093   DC  AL3(TX4093)                                                52040021
MS4094   DC  AL3(TX4094)                                                52050021
MS4095   DC  AL3(TX4095)                                                52060021
MS4096   DC  AL3(TX4096)                                                52070021
MS4097   DC  AL3(TX4097)                                                52080021
MS4098   DC  AL3(TX4098)                                                52090021
MS4099   DC  AL3(TX4099)                                                52100021
         DC  AL3(TX4100)                                                52110021
         DC   AL3(TX4101)                                               52120021
         DC  AL3(TX4102)                                                52130021
         DC  AL3(TX4103)                                                52140021
         DC  AL3(TX4104)                                                52150021
         DC  AL3(TX4105)                                                52160021
         DC  AL3(TX4106)                                                52170021
         DC  AL3(TX4107)                                                52180021
MS4108 DC    AL3(TX4108)                                                52190021
         DC  AL3(TX4109)                                                52200021
         DC  AL3(TX4110)                                                52210021
         DC  AL3(TX4111)                                                52220021
         DC  AL3(TX4112)                                                52230021
         DC  AL3(TX4113)                                                52240021
         DC  AL3(TX4114)                                                52250021
         DC  AL3(TX4115)                                                52260021
MS4116 DC    AL3(TX4116)                                                52270021
         DC    AL3(TX4117)                                        43536 52280021
         DC    AL3(TX4118)                                        43536 52290021
         DC    AL3(TX4119)                                        43536 52300021
         DC    AL3(TX4120)                                        43536 52310021
         DC    AL3(TX4121)                                        43536 52320021
         DC    AL3(TX4122)                                        43536 52330021
         DC    AL3(TX4123)                                        43536 52340021
         DC    AL3(TX4124)                                        43536 52350021
         DC    AL3(TX4125)                                        43536 52360021
         DC    AL3(TX4126)                                        43536 52370021
         DC    AL3(TX4127)                                        43536 52380021
         DC    AL3(TX4128)                                        43536 52390021
         DC    AL3(TX4129)                                        43536 52400021
         DC    AL3(TX4130)                                        43536 52410021
MS4131   DC    AL3(TX4131)                                        50782 52420021
         DC    AL3(TX4132)                                        43536 52430021
         DC    AL3(TX4133)                                        43536 52440021
         DC    AL3(TX4134)                                        43536 52450021
         DC    AL3(TX4135)                                        43536 52460021
         DC    AL3(TX4136)                                        43536 52470021
         DC    AL3(TX4137)                                        43536 52480021
         DC    AL3(TX4138)                                        43536 52490021
         DC    AL3(TX4139)                                        43536 52500021
         DC    AL3(TX4140)                                        43536 52510021
MS4141   DC    AL3(TX4141)                                        43536 52520021
         DC    AL3(TX4142)                                        43536 52530021
         DC    AL3(TX4143)                                        43536 52540021
         DC    AL3(TX4144)                                        43536 52550021
         DC    AL3(TX4145)                                        43536 52560021
         DC    AL3(TX4146)                                        43536 52570021
         DC    AL3(TX4147)                                        43536 52580021
         DC    AL3(TX4148)                                        43536 52590021
         DC    AL3(TX4149)                                        43536 52600021
         DC    AL3(TX4150)                                        43536 52610021
PH5ERR DS    0F                                                         52620021
       DC    AL3(TX5000)                                                52630021
MS5001   DC  AL3(TX5001)                                                52640021
MS5002   DC  AL3(TX5002)                                                52650021
MS5003   DC  AL3(TX5003)                                                52660021
MS5004   DC  AL3(TX5004)                                                52670021
MS5005   DC  AL3(TX5005)                                                52680021
MS5006   DC  AL3(TX5006)                                                52690021
MS5007   DC  AL3(TX5007)                                                52700021
MS5008   DC  AL3(TX5008)                                                52710021
MS5009   DC  AL3(TX5009)                                                52720021
MS5010   DC  AL3(TX5010)                                                52730021
MS5011   DC  AL3(TX5011)                                                52740021
MS5012   DC  AL3(TX5012)                                                52750021
MS5013   DC  AL3(TX5013)                                                52760021
MS5014   DC  AL3(TX5014)                                                52770021
         DC  AL3(TX5015)                                                52780021
         DC  AL3(TX5016)                                                52790021
         DC  AL3(TX5017)                                                52800021
         DC  AL3(TX5018)                                                52810021
EACTAB DS    0F                                                         52820021
         DC  AL3(EACT00)                                                52830021
       DC    AL3(EACT01)                                                52840021
       DC    AL3(EACT02)                                                52850021
       DC    AL3(EACT03)                                                52860021
       DC    AL3(EACT04)                                                52870021
       DC    AL3(EACT05)                                                52880021
       DC    AL3(EACT06)                                                52890021
       DC    AL3(EACT07)                                                52900021
       DC    AL3(EACT08)                                                52910021
       DC    AL3(EACT09)                                                52920021
       DC    AL3(EACT10)                                                52930021
       DC    AL3(EACT11)                                                52940021
       DC    AL3(EACT12)                                                52950021
       DC    AL3(EACT13)                                                52960021
       DC    AL3(EACT14)                                                52970021
       DC    AL3(EACT15)                                                52980021
       DC    AL3(EACT16)                                                52990021
       DC    AL3(EACT17)                                                53000021
       DC    AL3(EACT18)                                                53010021
       DC    AL3(EACT19)                                                53020021
       DC    AL3(EACT20)                                                53030021
       DC    AL3(EACT21)                                                53040021
       DC    AL3(EACT22)                                                53050021
       DC    AL3(EACT23)                                                53060021
       DC    AL3(EACT24)                                                53070021
       DC    AL3(EACT25)                                                53080021
       DC    AL3(EACT26)                                                53090021
       DC    AL3(EACT27)                                                53100021
       DC    AL3(EACT28)                                                53110021
       DC    AL3(EACT29)                                                53120021
       DC    AL3(EACT30)                                                53130021
       DC    AL3(EACT31)                                                53140021
       DC    AL3(EACT32)                                                53150021
       DC    AL3(EACT33)                                                53160021
       DC    AL3(EACT34)                                                53170021
       DC    AL3(EACT35)                                                53180021
       DC    AL3(EACT36)                                                53190021
       DC    AL3(EACT37)                                                53200021
       DC    AL3(EACT38)                                                53210021
       DC    AL3(EACT39)                                                53220021
       DC    AL3(EACT40)                                                53230021
       DC    AL3(EACT41)                                                53240021
       DC    AL3(EACT42)                                                53250021
       DC    AL3(EACT43)                                                53260021
       DC    AL3(EACT44)                                                53270021
       DC    AL3(EACT45)                                                53280021
       DC    AL3(EACT46)                                                53290021
       DC    AL3(EACT47)                                                53300021
       DC    AL3(EACT48)                                                53310021
PARTAB DS    0F                                                         53320021
       DC  AL3(PAR000)                                                  53330021
       DC  AL3(PAR001)                                                  53340021
       DC  AL3(PAR002)                                                  53350021
       DC  AL3(PAR003)                                                  53360021
       DC  AL3(PAR004)                                                  53370021
       DC  AL3(PAR005)                                                  53380021
       DC  AL3(PAR006)                                                  53390021
       DC  AL3(PAR007)                                                  53400021
       DC  AL3(PAR008)                                                  53410021
       DC  AL3(PAR009)                                                  53420021
       DC  AL3(PAR00A)                                                  53430021
       DC  AL3(PAR00B)                                                  53440021
       DC  AL3(PAR00C)                                                  53450021
       DC  AL3(PAR00D)                                                  53460021
       DC  AL3(PAR00E)                                                  53470021
       DC  AL3(PAR00F)                                                  53480021
       DC  AL3(PAR010)                                                  53490021
       DC  AL3(PAR011)                                                  53500021
       DC  AL3(PAR012)                                                  53510021
       DC  AL3(PAR013)                                                  53520021
       DC  AL3(PAR014)                                                  53530021
       DC  AL3(PAR015)                                                  53540021
       DC  AL3(PAR016)                                                  53550021
       DC  AL3(PAR017)                                                  53560021
       DC  AL3(PAR018)                                                  53570021
       DC  AL3(PAR019)                                                  53580021
       DC  AL3(PAR01A)                                                  53590021
       DC  AL3(PAR01B)                                                  53600021
       DC  AL3(PAR01C)                                                  53610021
       DC  AL3(PAR01D)                                                  53620021
       DC  AL3(PAR01E)                                                  53630021
       DC  AL3(PAR01F)                                                  53640021
       DC  AL3(PAR020)                                                  53650021
       DC  AL3(PAR021)                                                  53660021
       DC  AL3(PAR022)                                                  53670021
       DC  AL3(PAR023)                                                  53680021
       DC  AL3(PAR024)                                                  53690021
       DC  AL3(PAR025)                                                  53700021
       DC  AL3(PAR026)                                                  53710021
       DC  AL3(PAR027)                                                  53720021
       DC  AL3(PAR028)                                                  53730021
       DC  AL3(PAR029)                                                  53740021
         DC  AL3(PAR02A)                                                53750021
         DC  AL3(PAR02B)                                                53760021
         DC  AL3(PAR02C)                                                53770021
         DC  AL3(PAR02D)                                                53780021
         DC  AL3(PAR02E)                                                53790021
         DC  AL3(PAR02F)                                                53800021
       DC  AL3(PAR030)                                                  53810021
       DC  AL3(PAR031)                                                  53820021
       DC  AL3(PAR032)                                                  53830021
       DC  AL3(PAR033)                                                  53840021
       DC  AL3(PAR034)                                                  53850021
       DC  AL3(PAR035)                                                  53860021
       DC  AL3(PAR036)                                                  53870021
       DC  AL3(PAR037)                                                  53880021
       DC  AL3(PAR038)                                                  53890021
       DC  AL3(PAR039)                                                  53900021
       DC  AL3(PAR03A)                                                  53910021
       DC  AL3(PAR03B)                                                  53920021
       DC  AL3(PAR03C)                                                  53930021
       DC  AL3(PAR03D)                                                  53940021
       DC  AL3(PAR03E)                                                  53950021
       DC  AL3(PAR03F)                                                  53960021
       DC  AL3(PAR040)                                                  53970021
       DC  AL3(PAR041)                                                  53980021
       DC  AL3(PAR042)                                                  53990021
       DC  AL3(PAR043)                                                  54000021
       DC  AL3(PAR044)                                                  54010021
       DC  AL3(PAR045)                                                  54020021
       DC  AL3(PAR046)                                                  54030021
       DC  AL3(PAR047)                                                  54040021
       DC  AL3(PAR048)                                                  54050021
       DC  AL3(PAR049)                                                  54060021
       DC  AL3(PAR04A)                                                  54070021
       DC  AL3(PAR04B)                                                  54080021
       DC  AL3(PAR04C)                                                  54090021
       DC  AL3(PAR04D)                                                  54100021
       DC  AL3(PAR04E)                                                  54110021
       DC  AL3(PAR04F)                                                  54120021
       DC  AL3(PAR050)                                                  54130021
       DC  AL3(PAR051)                                                  54140021
       DC  AL3(PAR052)                                                  54150021
       DC  AL3(PAR053)                                                  54160021
       DC  AL3(PAR054)                                                  54170021
       DC  AL3(PAR055)                                                  54180021
       DC  AL3(PAR056)                                                  54190021
       DC  AL3(PAR057)                                                  54200021
       DC  AL3(PAR058)                                                  54210021
       DC  AL3(PAR059)                                                  54220021
       DC  AL3(PAR05A)                                                  54230021
       DC  AL3(PAR05B)                                                  54240021
       DC  AL3(PAR05C)                                                  54250021
       DC  AL3(PAR05D)                                                  54260021
       DC  AL3(PAR05E)                                                  54270021
       DC  AL3(PAR05F)                                                  54280021
       DC  AL3(PAR060)                                                  54290021
       DC  AL3(PAR061)                                                  54300021
       DC  AL3(PAR062)                                                  54310021
       DC  AL3(PAR063)                                                  54320021
       DC  AL3(PAR064)                                                  54330021
       DC  AL3(PAR065)                                                  54340021
       DC  AL3(PAR066)                                                  54350021
       DC  AL3(PAR067)                                                  54360021
       DC  AL3(PAR068)                                                  54370021
       DC  AL3(PAR069)                                                  54380021
       DC  AL3(PAR06A)                                                  54390021
       DC  AL3(PAR06B)                                                  54400021
       DC  AL3(PAR06C)                                                  54410021
       DC  AL3(PAR06D)                                                  54420021
       DC  AL3(PAR06E)                                                  54430021
       DC  AL3(PAR06F)                                                  54440021
       DC  AL3(PAR070)                                                  54450021
       DC  AL3(PAR071)                                                  54460021
       DC  AL3(PAR072)                                                  54470021
       DC  AL3(PAR073)                                                  54480021
       DC  AL3(PAR074)                                                  54490021
       DC  AL3(PAR075)                                                  54500021
       DC  AL3(PAR076)                                                  54510021
       DC  AL3(PAR077)                                                  54520021
       DC  AL3(PAR078)                                                  54530021
       DC  AL3(PAR079)                                                  54540021
       DC  AL3(PAR07A)                                                  54550021
       DC  AL3(PAR07B)                                                  54560021
       DC  AL3(PAR07C)                                                  54570021
       DC  AL3(PAR07D)                                                  54580021
       DC  AL3(PAR07E)                                                  54590021
       DC  AL3(PAR07F)                                                  54600021
       DC  AL3(PAR080)                                                  54610021
       DC  AL3(PAR081)                                                  54620021
       DC  AL3(PAR082)                                                  54630021
       DC  AL3(PAR083)                                                  54640021
       DC  AL3(PAR084)                                                  54650021
       DC  AL3(PAR085)                                                  54660021
       DC  AL3(PAR086)                                                  54670021
       DC  AL3(PAR087)                                                  54680021
       DC  AL3(PAR088)                                                  54690021
       DC  AL3(PAR089)                                                  54700021
       DC  AL3(PAR08A)                                                  54710021
       DC  AL3(PAR08B)                                                  54720021
       DC  AL3(PAR08C)                                                  54730021
       DC  AL3(PAR08D)                                                  54740021
       DC  AL3(PAR08E)                                                  54750021
       DC  AL3(PAR08F)                                                  54760021
       DC  AL3(PAR090)                                                  54770021
       DC  AL3(PAR091)                                                  54780021
       DC  AL3(PAR092)                                                  54790021
       DC  AL3(PAR093)                                                  54800021
       DC  AL3(PAR094)                                                  54810021
       DC  AL3(PAR095)                                                  54820021
       DC  AL3(PAR096)                                                  54830021
       DC  AL3(PAR097)                                                  54840021
       DC  AL3(PAR098)                                                  54850021
       DC  AL3(PAR099)                                                  54860021
       DC  AL3(PAR09A)                                                  54870021
       DC  AL3(PAR09B)                                                  54880021
       DC  AL3(PAR09C)                                                  54890021
       DC  AL3(PAR09D)                                                  54900021
       DC  AL3(PAR09E)                                                  54910021
       DC  AL3(PAR09F)                                                  54920021
       DC  AL3(PAR0A0)                                                  54930021
       DC  AL3(PAR0A1)                                                  54940021
       DC  AL3(PAR0A2)                                                  54950021
       DC  AL3(PAR0A3)                                                  54960021
       DC  AL3(PAR0A4)                                                  54970021
       DC  AL3(PAR0A5)                                                  54980021
       DC  AL3(PAR0A6)                                                  54990021
       DC  AL3(PAR0A7)                                                  55000021
       DC  AL3(PAR0A8)                                                  55010021
       DC  AL3(PAR0A9)                                                  55020021
       DC  AL3(PAR0AA)                                                  55030021
       DC  AL3(PAR0AB)                                                  55040021
       DC  AL3(PAR0AC)                                                  55050021
       DC  AL3(PAR0AD)                                                  55060021
       DC  AL3(PAR0AE)                                                  55070021
       DC  AL3(PAR0AF)                                                  55080021
       DC  AL3(PAR0B0)                                                  55090021
       DC  AL3(PAR0B1)                                                  55100021
       DC  AL3(PAR0B2)                                                  55110021
       DC  AL3(PAR0B3)                                                  55120021
       DC  AL3(PAR0B4)                                                  55130021
       DC  AL3(PAR0B5)                                                  55140021
       DC  AL3(PAR0B6)                                                  55150021
       DC  AL3(PAR0B7)                                                  55160021
       DC  AL3(PAR0B8)                                                  55170021
       DC  AL3(PAR0B9)                                                  55180021
       DC  AL3(PAR0BA)                                                  55190021
       DC  AL3(PAR0BB)                                                  55200021
       DC  AL3(PAR0BC)                                                  55210021
       DC  AL3(PAR0BD)                                                  55220021
       DC  AL3(PAR0BE)                                                  55230021
       DC  AL3(PAR0BF)                                                  55240021
       DC  AL3(PAR0C0)                                                  55250021
       DC  AL3(PAR0C1)                                                  55260021
       DC  AL3(PAR0C2)                                                  55270021
       DC  AL3(PAR0C3)                                                  55280021
       DC  AL3(PAR0C4)                                                  55290021
       DC  AL3(PAR0C5)                                                  55300021
       DC  AL3(PAR0C6)                                                  55310021
       DC  AL3(PAR0C7)                                                  55320021
       DC  AL3(PAR0C8)                                                  55330021
       DC  AL3(PAR0C9)                                                  55340021
       DC  AL3(PAR0CA)                                                  55350021
       DC  AL3(PAR0CB)                                                  55360021
       DC  AL3(PAR0CC)                                                  55370021
       DC  AL3(PAR0CD)                                                  55380021
       DC  AL3(PAR0CE)                                                  55390021
       DC  AL3(PAR0CF)                                                  55400021
       DC  AL3(PAR0D0)                                                  55410021
       DC  AL3(PAR0D1)                                                  55420021
       DC  AL3(PAR0D2)                                                  55430021
       DC  AL3(PAR0D3)                                                  55440021
       DC  AL3(PAR0D4)                                                  55450021
       DC  AL3(PAR0D5)                                                  55460021
       DC  AL3(PAR0D6)                                                  55470021
       DC  AL3(PAR0D7)                                                  55480021
       DC  AL3(PAR0D8)                                                  55490021
       DC  AL3(PAR0D9)                                                  55500021
       DC  AL3(PAR0DA)                                                  55510021
       DC  AL3(PAR0DB)                                                  55520021
       DC  AL3(PAR0DC)                                                  55530021
       DC  AL3(PAR0DD)                                                  55540021
       DC  AL3(PAR0DE)                                                  55550021
       DC  AL3(PAR0DF)                                                  55560021
       DC  AL3(PAR0E0)                                                  55570021
       DC  AL3(PAR0E1)                                                  55580021
       DC  AL3(PAR0E2)                                                  55590021
       DC  AL3(PAR0E3)                                                  55600021
       DC  AL3(PAR0E4)                                                  55610021
       DC  AL3(PAR0E5)                                                  55620021
       DC  AL3(PAR0E6)                                                  55630021
       DC  AL3(PAR0E7)                                                  55640021
       DC  AL3(PAR0E8)                                                  55650021
       DC  AL3(PAR0E9)                                                  55660021
       DC  AL3(PAR0EA)                                                  55670021
       DC  AL3(PAR0EB)                                                  55680021
       DC  AL3(PAR0EC)                                                  55690021
       DC  AL3(PAR0ED)                                                  55700021
       DC  AL3(PAR0EE)                                                  55710021
       DC  AL3(PAR0EF)                                                  55720021
       DC  AL3(PAR0F0)                                                  55730021
       DC  AL3(PAR0F1)                                                  55740021
       DC  AL3(PAR0F2)                                                  55750021
       DC  AL3(PAR0F3)                                                  55760021
       DC  AL3(PAR0F4)                                                  55770021
       DC  AL3(PAR0F5)                                                  55780021
       DC  AL3(PAR0F6)                                                  55790021
       DC  AL3(PAR0F7)                                                  55800021
       DC  AL3(PAR0F8)                                                  55810021
       DC  AL3(PAR0F9)                                                  55820021
       DC  AL3(PAR0FA)                                                  55830021
       DC  AL3(PAR0FB)                                                  55840021
       DC  AL3(PAR0FC)                                                  55850021
       DC  AL3(PAR0FD)                                                  55860021
       DC  AL3(PAR0FE)                                                  55870021
       DC  AL3(PAR0FF)                                                  55880021
       DC  AL3(PAR100)                                                  55890021
       DC  AL3(PAR101)                                                  55900021
       DC  AL3(PAR102)                                                  55910021
       DC  AL3(PAR103)                                                  55920021
       DC  AL3(PAR104)                                                  55930021
       DC  AL3(PAR105)                                                  55940021
       DC  AL3(PAR106)                                                  55950021
       DC  AL3(PAR107)                                                  55960021
       DC  AL3(PAR108)                                                  55970021
       DC  AL3(PAR109)                                                  55980021
       DC  AL3(PAR10A)                                                  55990021
       DC  AL3(PAR10B)                                                  56000021
       DC  AL3(PAR10C)                                                  56010021
       DC  AL3(PAR10D)                                                  56020021
       DC  AL3(PAR10E)                                                  56030021
       DC  AL3(PAR10F)                                                  56040021
       DC  AL3(PAR110)                                                  56050021
       DC  AL3(PAR111)                                                  56060021
       DC  AL3(PAR112)                                                  56070021
       DC  AL3(PAR113)                                                  56080021
       DC  AL3(PAR114)                                                  56090021
       DC  AL3(PAR115)                                                  56100021
       DC  AL3(PAR116)                                                  56110021
       DC  AL3(PAR117)                                                  56120021
       DC  AL3(PAR118)                                                  56130021
       DC  AL3(PAR119)                                                  56140021
       DC  AL3(PAR11A)                                                  56150021
       DC  AL3(PAR11B)                                                  56160021
       DC  AL3(PAR11C)                                                  56170021
       DC  AL3(PAR11D)                                                  56180021
       DC  AL3(PAR11E)                                                  56190021
       DC  AL3(PAR11F)                                                  56200021
       DC  AL3(PAR120)                                                  56210021
       DC  AL3(PAR121)                                                  56220021
       DC  AL3(PAR122)                                                  56230021
       DC  AL3(PAR123)                                                  56240021
       DC  AL3(PAR124)                                                  56250021
       DC  AL3(PAR125)                                                  56260021
       DC  AL3(PAR126)                                                  56270021
       DC  AL3(PAR127)                                                  56280021
       DC  AL3(PAR128)                                                  56290021
       DC  AL3(PAR129)                                                  56300021
         DC  AL3(PAR12A)                                                56310021
         DC  AL3(PAR12B)                                                56320021
         DC  AL3(PAR12C)                                                56330021
         DC  AL3(PAR12D)                                                56340021
         DC  AL3(PAR12E)                                                56350021
         DC  AL3(PAR12F)                                                56360021
       DC  AL3(PAR130)                                                  56370021
       DC  AL3(PAR131)                                                  56380021
       DC  AL3(PAR132)                                                  56390021
       DC  AL3(PAR133)                                                  56400021
       DC  AL3(PAR134)                                                  56410021
       DC  AL3(PAR135)                                                  56420021
       DC  AL3(PAR136)                                                  56430021
       DC  AL3(PAR137)                                                  56440021
       DC  AL3(PAR138)                                                  56450021
       DC  AL3(PAR139)                                                  56460021
       DC  AL3(PAR13A)                                                  56470021
       DC  AL3(PAR13B)                                                  56480021
       DC  AL3(PAR13C)                                                  56490021
       DC  AL3(PAR13D)                                                  56500021
       DC  AL3(PAR13E)                                                  56510021
       DC  AL3(PAR13F)                                                  56520021
       DC  AL3(PAR140)                                                  56530021
       DC  AL3(PAR141)                                                  56540021
       DC  AL3(PAR142)                                                  56550021
       DC  AL3(PAR143)                                                  56560021
       DC  AL3(PAR144)                                                  56570021
       DC  AL3(PAR145)                                                  56580021
       DC  AL3(PAR146)                                                  56590021
       DC  AL3(PAR147)                                                  56600021
       DC  AL3(PAR148)                                                  56610021
       DC  AL3(PAR149)                                                  56620021
       DC  AL3(PAR14A)                                                  56630021
       DC  AL3(PAR14B)                                                  56640021
       DC  AL3(PAR14C)                                                  56650021
       DC  AL3(PAR14D)                                                  56660021
       DC  AL3(PAR14E)                                                  56670021
       DC  AL3(PAR14F)                                                  56680021
       DC  AL3(PAR150)                                                  56690021
       DC  AL3(PAR151)                                                  56700021
       DC  AL3(PAR152)                                                  56710021
       DC  AL3(PAR153)                                                  56720021
       DC  AL3(PAR154)                                                  56730021
       DC  AL3(PAR155)                                                  56740021
       DC  AL3(PAR156)                                                  56750021
       DC  AL3(PAR157)                                                  56760021
       DC  AL3(PAR158)                                                  56770021
       DC  AL3(PAR159)                                                  56780021
       DC  AL3(PAR15A)                                                  56790021
       DC  AL3(PAR15B)                                                  56800021
       DC  AL3(PAR15C)                                                  56810021
       DC  AL3(PAR15D)                                                  56820021
       DC  AL3(PAR15E)                                                  56830021
       DC  AL3(PAR15F)                                                  56840021
       DC  AL3(PAR160)                                                  56850021
       DC  AL3(PAR161)                                                  56860021
       DC  AL3(PAR162)                                                  56870021
       DC  AL3(PAR163)                                                  56880021
       DC  AL3(PAR164)                                                  56890021
       DC  AL3(PAR165)                                                  56900021
       DC  AL3(PAR166)                                                  56910021
       DC  AL3(PAR167)                                                  56920021
       DC  AL3(PAR168)                                                  56930021
       DC  AL3(PAR169)                                                  56940021
       DC  AL3(PAR16A)                                                  56950021
       DC  AL3(PAR16B)                                                  56960021
       DC  AL3(PAR16C)                                                  56970021
       DC  AL3(PAR16D)                                                  56980021
       DC  AL3(PAR16E)                                                  56990021
       DC  AL3(PAR16F)                                                  57000021
       DC  AL3(PAR170)                                                  57010021
       DC  AL3(PAR171)                                                  57020021
       DC  AL3(PAR172)                                                  57030021
       DC  AL3(PAR173)                                                  57040021
       DC  AL3(PAR174)                                                  57050021
       DC  AL3(PAR175)                                                  57060021
       DC  AL3(PAR176)                                                  57070021
       DC  AL3(PAR177)                                                  57080021
       DC  AL3(PAR178)                                                  57090021
       DC  AL3(PAR179)                                                  57100021
       DC  AL3(PAR17A)                                                  57110021
       DC  AL3(PAR17B)                                                  57120021
       DC  AL3(PAR17C)                                                  57130021
       DC  AL3(PAR17D)                                                  57140021
       DC  AL3(PAR17E)                                                  57150021
       DC  AL3(PAR17F)                                                  57160021
       DC  AL3(PAR180)                                                  57170021
       DC  AL3(PAR181)                                                  57180021
       DC  AL3(PAR182)                                                  57190021
       DC  AL3(PAR183)                                                  57200021
       DC  AL3(PAR184)                                                  57210021
       DC  AL3(PAR185)                                                  57220021
       DC  AL3(PAR186)                                                  57230021
       DC  AL3(PAR187)                                                  57240021
       DC  AL3(PAR188)                                                  57250021
       DC  AL3(PAR189)                                                  57260021
       DC  AL3(PAR18A)                                                  57270021
       DC  AL3(PAR18B)                                                  57280021
       DC  AL3(PAR18C)                                                  57290021
       DC  AL3(PAR18D)                                                  57300021
       DC  AL3(PAR18E)                                                  57310021
       DC  AL3(PAR18F)                                                  57320021
       DC  AL3(PAR190)                                                  57330021
       DC  AL3(PAR191)                                                  57340021
       DC  AL3(PAR192)                                                  57350021
       DC  AL3(PAR193)                                                  57360021
       DC  AL3(PAR194)                                                  57370021
       DC  AL3(PAR195)                                                  57380021
       DC  AL3(PAR196)                                                  57390021
       DC  AL3(PAR197)                                                  57400021
       DC  AL3(PAR198)                                                  57410021
       DC  AL3(PAR199)                                                  57420021
       DC  AL3(PAR19A)                                                  57430021
       DC  AL3(PAR19B)                                                  57440021
       DC  AL3(PAR19C)                                                  57450021
       DC  AL3(PAR19D)                                                  57460021
       DC  AL3(PAR19E)                                                  57470021
       DC  AL3(PAR19F)                                                  57480021
       DC  AL3(PAR1A0)                                                  57490021
       DC  AL3(PAR1A1)                                                  57500021
       DC  AL3(PAR1A2)                                                  57510021
       DC  AL3(PAR1A3)                                                  57520021
       DC  AL3(PAR1A4)                                                  57530021
       DC  AL3(PAR1A5)                                                  57540021
       DC  AL3(PAR1A6)                                                  57550021
       DC  AL3(PAR1A7)                                                  57560021
       DC  AL3(PAR1A8)                                                  57570021
       DC  AL3(PAR1A9)                                                  57580021
       DC  AL3(PAR1AA)                                                  57590021
       DC  AL3(PAR1AB)                                                  57600021
       DC  AL3(PAR1AC)                                                  57610021
       DC  AL3(PAR1AD)                                                  57620021
       DC  AL3(PAR1AE)                                                  57630021
       DC  AL3(PAR1AF)                                                  57640021
       DC  AL3(PAR1B0)                                                  57650021
       DC  AL3(PAR1B1)                                                  57660021
       DC  AL3(PAR1B2)                                                  57670021
       DC  AL3(PAR1B3)                                                  57680021
       DC  AL3(PAR1B4)                                                  57690021
       DC  AL3(PAR1B5)                                                  57700021
       DC  AL3(PAR1B6)                                                  57710021
       DC  AL3(PAR1B7)                                                  57720021
       DC  AL3(PAR1B8)                                                  57730021
       DC  AL3(PAR1B9)                                                  57740021
       DC  AL3(PAR1BA)                                                  57750021
       DC  AL3(PAR1BB)                                                  57760021
       DC  AL3(PAR1BC)                                                  57770021
       DC  AL3(PAR1BD)                                                  57780021
       DC  AL3(PAR1BE)                                                  57790021
       DC  AL3(PAR1BF)                                                  57800021
       DC  AL3(PAR1C0)                                                  57810021
       DC  AL3(PAR1C1)                                                  57820021
       DC  AL3(PAR1C2)                                                  57830021
       DC  AL3(PAR1C3)                                                  57840021
       DC  AL3(PAR1C4)                                                  57850021
       DC  AL3(PAR1C5)                                                  57860021
       DC  AL3(PAR1C6)                                                  57870021
       DC  AL3(PAR1C7)                                                  57880021
       DC  AL3(PAR1C8)                                                  57890021
       DC  AL3(PAR1C9)                                                  57900021
       DC  AL3(PAR1CA)                                                  57910021
       DC  AL3(PAR1CB)                                                  57920021
       DC  AL3(PAR1CC)                                                  57930021
       DC  AL3(PAR1CD)                                                  57940021
       DC  AL3(PAR1CE)                                                  57950021
       DC  AL3(PAR1CF)                                                  57960021
       DC  AL3(PAR1D0)                                                  57970021
       DC  AL3(PAR1D1)                                                  57980021
       DC  AL3(PAR1D2)                                                  57990021
       DC  AL3(PAR1D3)                                                  58000021
       DC  AL3(PAR1D4)                                                  58010021
       DC  AL3(PAR1D5)                                                  58020021
       DC  AL3(PAR1D6)                                                  58030021
       DC  AL3(PAR1D7)                                                  58040021
       DC  AL3(PAR1D8)                                                  58050021
       DC  AL3(PAR1D9)                                                  58060021
       DC  AL3(PAR1DA)                                                  58070021
       DC  AL3(PAR1DB)                                                  58080021
       DC  AL3(PAR1DC)                                                  58090021
       DC  AL3(PAR1DD)                                                  58100021
       DC  AL3(PAR1DE)                                                  58110021
       DC  AL3(PAR1DF)                                                  58120021
       DC  AL3(PAR1E0)                                                  58130021
       DC  AL3(PAR1E1)                                                  58140021
       DC  AL3(PAR1E2)                                                  58150021
       DC  AL3(PAR1E3)                                                  58160021
       DC  AL3(PAR1E4)                                                  58170021
       DC  AL3(PAR1E5)                                                  58180021
       DC  AL3(PAR1E6)                                                  58190021
       DC  AL3(PAR1E7)                                                  58200021
       DC  AL3(PAR1E8)                                                  58210021
       DC  AL3(PAR1E9)                                                  58220021
       DC  AL3(PAR1EA)                                                  58230021
       DC  AL3(PAR1EB)                                                  58240021
       DC  AL3(PAR1EC)                                                  58250021
       DC  AL3(PAR1ED)                                                  58260021
       DC  AL3(PAR1EE)                                                  58270021
       DC  AL3(PAR1EF)                                                  58280021
       DC  AL3(PAR1F0)                                                  58290021
       DC  AL3(PAR1F1)                                                  58300021
       DC  AL3(PAR1F2)                                                  58310021
       DC  AL3(PAR1F3)                                                  58320021
       DC  AL3(PAR1F4)                                                  58330021
       DC  AL3(PAR1F5)                                                  58340021
       DC  AL3(PAR1F6)                                                  58350021
       DC  AL3(PAR1F7)                                                  58360021
       DC  AL3(PAR1F8)                                                  58370021
       DC  AL3(PAR1F9)                                                  58380021
       DC  AL3(PAR1FA)                                                  58390021
       DC  AL3(PAR1FB)                                                  58400021
       DC  AL3(PAR1FC)                                                  58410021
       DC  AL3(PAR1FD)                                                  58420021
       DC  AL3(PAR1FE)                                                  58430021
       DC  AL3(PAR1FF)                                                  58440021
*=1    SYMBOLIC OPERAND TABLE                                           58450021
*                                                                       58460021
XSYMC  EQU     *                                                        58470021
XDNC   DC      C'DNM='      SOURCE DATA NAME                            58480021
*      THIS GROUP MUST BE IN ORDER                                      58490021
XSAVC  DC      C'SAV+'      SAVE AREA CELL                              58500021
       DC      C'SWT+'      SWITCH CELL                                 58510021
       DC      C'TLY+'      TALLY CELL                                  58520021
       DC      C'DBG+'      DEBUG SAVE CELL                             58530021
       DC      C'ECB+'      ECB CELL                                    58540021
       DC      C'RPE+'      RANDOM PROCESSING ECB CELL                  58550021
       DC      C'RPH+'      RANDOM PROCESSING HOLD CELL                 58560021
*      THIS GROUP MUST BE IN ORDER                                      58570021
XDCBC  EQU     *                                                        58580021
       DC      C'DCB='      DCB ADDR                                    58590021
       DC      C'VLC='      VARIABLE LENGTH CELL                        58600021
       DC      C'ON=0'      ON COUNTER                                  58610021
       DC      C'PFM='      PERFORM COUNTER                             58620021
       DC      C'PSV='      PERFORM SAVE                                58630021
       DC      C'DEC='      DECB ADDR                                   58640021
       DC      C'XSA='      EXHIBIT SAVE AREA                           58650021
       DC      C'PRM='      PARAMETER                                   58660021
       DC    C'WC=0'     WORKING CELL                                   58670021
       DC    C'TS=0'     TEMPORARY STORAGE CELL                         58680021
       DC      C'XSW='      EXHIBIT SWITCH                              58690021
       DC    C'SBS='      SUBSCRIPT CELL (LATER ON ALSO)                58700021
       DC    C'TS2='     TEMPORARY STORAGE (NON-ARITH)                  58710021
         DC    C'RPI='     RANDOM PROCESSING INFO FOR SPECIFIED RPD     58720021
       DC    C'VLC='          VLC (OUT-OF-LINE HERE)                    58730021
       DC    C'SAV2'                                                    58740021
       DC    C'SAV3'                                                    58750021
*      THIS GROUP MUST BE IN ORDER                                      58760021
XBLIC  DC    C'BLI='     BASE LOCATOR FOR INLINE FILE OR W-S            58770021
XBLOC  DC    C'BLO='     BASE LOCATOR FOR OUT-OF-LINE FILE              58780021
XBLLC  EQU     *                                                        58790021
       DC      C'BLL='      BL FOR LINKAGE SECTION                      58800021
XBLSC  EQU     *                                                        58810021
       DC      C'BLS='      BL FOR SA                                   58820021
XSBLC  EQU     *                                                        58830021
       DC      C'SBL='      2RY BASE LOCATOR CELL                       58840021
XSBSC  EQU     *                                                        58850021
       DC      C'SBS='      SUBSCRIPT CELL                              58860021
XRPIC  EQU     *                                                        58870021
         DC    C'RPI='     RANDOM PROCESSING INFO FOR SPECIFIED RPD     58880021
       EJECT                                                            58890021
* DESCRIPTION OF PHASE 7 TABLES                                         58900021
       SPACE 2                                                          58910021
*      PH1ERR                                                           58920021
*      TIB= 15                                                          58930021
*      PRIMING VALUE IS VARIABLE                                        58940021
*      ENTRY LENGTH IS 3 BYTES                                          58950021
*      GROW FACTOR IS VARIABLE                                          58960021
*      FORMAT  // PTR //                                                58970021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             58980021
*            PH1ERR HAS A POINTER TO THE TEXT OF EACH                   58990021
*            PHASE 1 ERROR MESSAGE.                                     59000021
       SPACE 2                                                          59010021
*      PH2ERR                                                           59020021
*      TIB= 16                                                          59030021
*      PRIMING VALUE IS VARIABLE                                        59040021
*      ENTRY LENGTH IS 3 BYTES                                          59050021
*      GROW FACTOR IS VARIABLE                                          59060021
*      FORMAT  // PTR //                                                59070021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             59080021
*            PH2ERR HAS A POINTER TO THE TEXT OF EACH                   59090021
*            PHASE 2 ERROR MESSAGE.                                     59100021
       SPACE 2                                                          59110021
*      PH3ERR                                                           59120021
*      TIB= 9                                                           59130021
*      PRIMING VALUE IS VARIABLE                                        59140021
*      ENTRY LENGTH IS 3 BYTES                                          59150021
*      GROW FACTOR IS VARIABLE                                          59160021
*      FORMAT  // PTR //                                                59170021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             59180021
*            PH3ERR HAS A POINTER TO THE TEXT OF EACH                   59190021
*            PHASE 3 ERROR MESSAGE.                                     59200021
       SPACE 2                                                          59210021
*      PH4ERR                                                           59220021
*      TIB= 13                                                          59230021
*      PRIMING VALUE IS VARIABLE                                        59240021
*      ENTRY LENGTH IS 3 BYTES                                          59250021
*      GROW FACTOR IS VARIABLE                                          59260021
*      FORMAT  // PTR //                                                59270021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             59280021
*            PH4ERR HAS A POINTER TO THE TEXT OF EACH                   59290021
*            PHASE 4 ERROR MESSAGE.                                     59300021
       SPACE 2                                                          59310021
*      PH5ERR                                                           59320021
*      TIB= 17                                                          59330021
*      PRIMING VALUE IS VARIABLE                                        59340021
*      ENTRY LENGTH IS 3 BYTES                                          59350021
*      GROW FACTOR IS VARIABLE                                          59360021
*      FORMAT  // PTR //                                                59370021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             59380021
*            PH5ERR HAS A POINTER TO THE TEXT OF EACH                   59390021
*            PHASE 5 ERROR MESSAGE.                                     59400021
       SPACE 2                                                          59410021
*      PARTBL                                                           59420021
*      TIB= 14                                                          59430021
*      PRIMING VALUE IS 1536 BYTES                                      59440021
*      ENTRY LENGTH IS 3 BYTES                                          59450021
*      GROW FACTOR IS 192 BYTES                                         59460021
*      FORMAT  // PTR //                                                59470021
*            PTR IS A 3-BYTE ADDRESS OF ERROR PARAMETER TEXT.           59480021
*            PARTBL CONTAINS POINTERS TO CERTAIN WORDS THAT MAY         59490021
*            BE USED AS ERROR MESSAGE PARAMETERS.                       59500021
       SPACE 2                                                          59510021
*      EACTBL                                                           59520021
*      TIB= 18                                                          59530021
*      PRIMING VALUE IS VARIABLE                                        59540021
*      ENTRY LENGTH IS 3 BYTES                                          59550021
*      GROW FACTOR IS VARIABLE                                          59560021
*      FORMAT  // PTR //                                                59570021
*            PTR IS A 3-BYTE ADDRESS OF ERROR MESSAGE TEXT.             59580021
*            EACTBL HAS POINTERS TO ALL STANDARD ACTION CODES THAT      59590021
*            AN ERROR MESSAGE MAY REFER TO.                             59600021
       EJECT                                                            59610021
*=1    EVERYTHING PAST THIS POINT EITHER DSECT OR TEMPORARY             59620021
*=1    COMMON AREA DEFINITION                                           59630021
*                                                                       59640021
       EJECT                                                            59650021
*=1    6.  INPUT AREA--A-TEXT ELEMENT DEFINITIONS                       59660021
*                                                                       59670021
A6TEXT DSECT                                                            59680021
       DS    0CL125                                                     59690021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59700021
A6COND DS    CL1         CONDEF                                         59710021
A6CONL DS    CL3         RELLOC                                         59720021
A6CONT DS    CL1         TYPE                                           59730021
A6CONS DS    CL2         SIZE                                           59740021
A6CONLV  DS    CL1                 LENGTH OF VALUE FOR ALL TYPE         59750021
A6CONV DS    CL1         * VALUE                                        59760021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59770021
A6ACON DS    CL1         ACONDEF                                        59780021
A6ACOL DS    CL3         RELLOC                                         59790021
A6ACOS DS    CL1         SIZE OF ACON                                   59800021
A6ACOA DS    CL3         RELADR                                         59810021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59820021
A6IAD  DS    CL1         IACONDEF                                       59830021
A6IAL  DS    CL3         RELLOC                                         59840021
A6IAS  DS    CL1         SIZE OF ADCON                                  59850021
A6IAT  DS    CL1         TYPE OF CELL TO FETCH                          59860021
A6IAN  DS    CL2         NO OF CELL OF ABOVE TYPE                       59870021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59880021
A6QD   DS    CL1         QDEF                                           59890021
A6QGN  DS    CL2         GN= OF QRTNE                                   59900021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59910021
A6PNCD DS    CL1         PN EQU CODE                                    59920021
A6PNCT DS    CL1                COUNT                                   59930021
A6PNL  DS    CL2                PN=                                     59940021
A6GNR  DS    CL2                GN=                                     59950021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               59960021
A6GNCD DS    CL1         GN EQU CODE                                    59970021
A6GNCT DS    CL1                COUNT                                   59980021
A6GNL  DS    CL2                GN=                                     59990021
A6GNRR DS    CL2                        GN=                             60000021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60010021
A6CKPT DS    CL1         CKPTDEF                                        60020021
A6CKPD DS    CL2         DCB=                                           60030021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60040021
A6MSGD DS    CL1         MSGDEF                                         60050021
A6MSGN DS    CL1         LENGTH OF ELT                                  60060021
A6MSGZ DS    CL1              ZERO                                      60070021
A6MSGM DS    CL2         MSG NUMBER                                     60080021
A6MSGC DS    CL2         REC NO OF SOURCE CARD                          60090021
A6MSGS DS    CL1         HIGH 4 BITS= SEVERITY                          60100021
       ORG   A6MSGS                    PHASE # & SEV BYTE               60110021
A6MSGP DS    CL1         LOW  4 BITS= PHASE NO                          60120021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60130021
A6PARD DS    CL1         MSGPAR                                         60140021
A6PARN DS    CL1         LENGTH OF PARAM                                60150021
A6PAR  DS    CL1         * PARAM                                        60160021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60170021
A6CODE DS    CL1                        HEX VALUE FOR ATEXT CODES       60180021
       DS    CL124                      FOR MAX ATEXT REC               60190021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60200021
A7DNDEF  DS    CL6                                                      60210021
A7DNLN   DS    CL1                                                      60220021
       ORG   A6TEXT                    A-TEXT ELEMENT DEF               60230021
A7PNDEF  DS    CL5                                                      60240021
A7PNLN   DS    CL1                                                      60250021
IKF714 CSECT                                                            60260021
DX0      EQU   0                                                        60270021
DX1      EQU   1                                                        60280021
NX1      EQU   1                                                        60290021
DX2      EQU   2                                                        60300021
NX2      EQU   2                                                        60310021
LX2      EQU   2                                                        60320021
DX3      EQU   3                                                        60330021
LX3      EQU   3                                                        60340021
DX4      EQU   4                                                        60350021
NX4      EQU   4                                                        60360021
NX5      EQU   5                                                        60370021
LX5      EQU   5                                                        60380021
DX6      EQU   6                                                        60390021
NX6      EQU   6                                                        60400021
DX7      EQU   7                                                        60410021
NX7      EQU   7                                                        60420021
DX8      EQU   8                                                        60430021
NX8      EQU   8                                                        60440021
NX9      EQU   9                                                        60450021
LX9      EQU   9                                                        60460021
NX11     EQU   11                                                       60470021
DX12     EQU   12                                                       60480021
NX12     EQU   12                                                       60490021
NX14     EQU   14                                                       60500021
NX15     EQU   15                                                       60510021
NX16     EQU   16                                                       60520021
NX17     EQU   17                                                       60530021
NX22     EQU   22                                                       60540021
NX23     EQU   23                                                       60550021
DX34     EQU   34                                                       60560021
NX38     EQU   38                                                       60570021
NX39     EQU   39                                                       60580021
NX40     EQU   40                                                       60590021
DX120    EQU   120                                                      60600021
DX256    EQU   256                                                      60610021
XX0      EQU   X'00'                                                    60620021
XX40     EQU   X'40'                                                    60630021
XXF0     EQU   X'F0'                                                    60640021
XXFF     EQU   X'FF'                                                    60650021
XX4B     EQU   X'4B'                                                    60660021
XX00     EQU   X'00'                                                    60670021
XXC0     EQU   X'C0'                                                    60680021
XX04     EQU   X'04'                                                    60690021
XX60     EQU   X'60'                                                    60700021
XX7F     EQU   X'7F'                                                    60710021
XX5B     EQU   X'5B'                                                    60720021
XX05     EQU   X'05'                                                    60730021
XX22     EQU   X'22'                                                    60740021
XX23     EQU   X'23'                                                    60750021
XX34     EQU   X'34'                                                    60760021
XX42     EQU   X'42'                                                    60770021
XX43     EQU   X'43'                                                    60780021
XX44     EQU   X'44'                                                    60790021
XX50     EQU   X'50'                                                    60800021
XX52     EQU   X'52'                                                    60810021
XX53     EQU   X'53'                                                    60820021
XX54     EQU   X'54'                                                    60830021
XX55     EQU   X'55'                                                    60840021
XX75     EQU   X'75'                                                    60850021
XX79     EQU   X'79'                                                    60860021
XXF9     EQU   X'F9'                                                    60870021
XXFA     EQU   X'FA'                                                    60880021
XXFE     EQU   X'FE'                                                    60890021
XX08     EQU   X'08'                                                    60900021
XX10     EQU   X'10'                                                    60910021
XXFB     EQU   X'FB'                                                    60920021
XX80     EQU   X'80'                                                    60930021
XX77     EQU   X'77'                                                    60940021
XX20     EQU   X'20'                                                    60950021
XX01     EQU   X'01'                                                    60960021
XX03     EQU   X'03'                                                    60970021
XC0      EQU   C'0'                                                     60980021
XC1      EQU   C'1'                                                     60990021
ZER0   EQU   0                                                          61000021
ONE      EQU   C'1'                                                     61010021
ONE1     EQU   1                                                        61020021
TWO      EQU   2                                                        61030021
THREE    EQU   3                                                        61040021
FOUR     EQU   4                                                        61050021
SEVEN  EQU   7                                                          61060021
EIGHT    EQU   8                                                        61070021
TWELVE   EQU   12                                                       61080021
SIXTEEN  EQU   16                                                       61090021
TWENTY   EQU   20                                                       61100021
THIRTY4  EQU   34                                                       61110021
BLANK    EQU   C' '                                                     61120021
TOTAL    EQU   119                                                      61130021
MASKF0   EQU   X'F0'                                                    61140021
SWITC1   EQU   SWITCH+1                                                 61150021
MAX      EQU   256                                                      61160021
MASKFF   EQU   255                                                      61170021
XXADD1   EQU   XXADDR+1                                                 61180021
PERIOD   EQU   C'.'                                                     61190021
XF0      EQU   X'F0'                                                    61200021
X40      EQU   X'40'                                                    61210021
XU6RC1   EQU   XU6REC+1                                                 61220021
XU6RC2   EQU   XU6REC+2                                                 61230021
XU6RC5   EQU   XU6REC+5                                                 61240021
XU6RC6   EQU   XU6REC+6                                                 61250021
XU6RC7   EQU   XU6REC+7                                                 61260021
XU6RC8   EQU   XU6REC+8                                                 61270021
XU6RC9   EQU   XU6REC+9                                                 61280021
XU6R11   EQU   XU6REC+11                                                61290021
XU6R15   EQU   XU6REC+15                                                61300021
XU6R23   EQU   XU6REC+23                                                61310021
XU6R39   EQU   XU6REC+39                                                61320021
XU6R40   EQU   XU6REC+40                                                61330021
LX0      EQU   0                                                        61340021
LX1      EQU   1                                                        61350021
LX4      EQU   4                                                        61360021
LX23     EQU   23                                                       61370021
LX24     EQU   24                                                       61380021
LX27     EQU   27                                                       61390021
LX36     EQU   36                                                       61400021
LX41     EQU   41                                                       61410021
LX119    EQU   119                                                      61420021
LX256    EQU   256                                                      61430021
         END   PH7                                                      61440021
