*$MODULE       PHASE3                                                   00020021
       PRINT ON,GEN,DATA                                                00040021
       IHBCOB                                                           00060021
IKF301   CSECT                                                          00080021
       USING COS,R1                                                     00100021
       ENTRY PH3                                                        00120021
ENTPH3   DC    C'IKFCBL30'                                              00140021
         DC    C'B'                                                     00160021
         DC    X'1C'                                                    00180021
*                                                                       00200021
*                                                                       00220021
*                                                                       00240021
*                                                                       00260021
*                                                                       00280021
*                                                                       00300021
*                                                                       00320021
*                                                                       00340021
*                                                                       00360021
*                                                                       00380021
*=3                                                                     00400021
*                                                                       00420021
*                                                                       00440021
*                                                                       00460021
*TITLE:                                                                 00480021
*                                                                       00500021
*   'IEQCBL30'                                                          00520021
*                                                                       00540021
*STATUS:                                                                00560021
*                                                                       00580021
*   CHANGE LEVEL 000                                                    00600021
*                                                                       00620021
*FUNCTION/OPERATION:                                                    00640021
*                                                                       00660021
*   PHASE 3'S FUNCTION:  TRANSLATES PROCEDURE IC-TEXT FROM P0 TO P1     00680021
*   FORMAT BY SUBSTITUTING DICTIONARY ATTRIBUTES FOR DATA NAMES AND     00700021
*   PROCEDURE NAMES IN THE SOURCE PROCEDURE STATEMENTS.  BREAKS DOW     00720021
*   SOURCE STATEMENTS CONTAINING THE CORRESPONDING OPTION INTO A SE     00740021
*   OF SIMILAR STATEMENTS, ONE FOR EACH MATCHING SUBORDINATE PAIR.      00760021
*   BUILDS A DATA DIVISION GLOSSARY CONTAINING ALL OF THE SOURCE        00780021
*   PROGRAM DATA NAMES AND THEIR LEVEL NUMBERS, ADDRESSES, DEFINITI     00800021
*   AND USAGES.                                                         00820021
*                                                                       00840021
*   THE FUNCTION/OPERATION AND GENERAL CONSIDERATION OF THE ACCESS      00860021
*   ARE DESCRIBED IN DETAIL IN PLM AND PHASE 1 LISTING.                 00880021
*   PHASE 3 USES ACCESS TO REPLACE DATA NAMES AND PROCEDURE NAMES I     00900021
*   PROCEDURE STATEMENTS WITH THE DICTIONARY ENTRIES                    00920021
*                                                                       00940021
*ENTRY POINT:                                                           00960021
*                                                                       00980021
*        PHINIT                                                         01000021
*                                                                       01020021
*INPUT:                                                                 01040021
*                                                                       01060021
*        SYSUT2   I-C  (P0)   FROM PHASE 1                              01080021
*        DICTIONARY IN CORE   FROM PHASE 1 + 2                          01100021
*                                                                       01120021
*OUTPUT:                                                                01140021
*                                                                       01160021
*        SYSUT3   IC (P1) TEXT AND E-TEXT  TO PHASE 4                   01180021
*        SYSPRINT   PROGRAM LISTING AND DATA DIVISION GLOSSARY          01200021
*                                                                       01220021
*EXTERNAL ROUTINE:                                                      01240021
*                                                                       01260021
*        PHASE 00    LINK TO I-O AND INTERFACE COMMON REGION            01280021
*        TABREL      FREE TABLE AREA IF IT IS NO LONGER NEEDED          01300021
*                                                                       01320021
*EXITS-NORMAL:                                                          01340021
*                                                                       01360021
*   VIA PHASE 00 TO PHASE 4                                             01380021
*                                                                       01400021
*   CALLING SEQUENCE:                                                   01420021
*   L   RWA,COSADR     BALR   0,1      DC   X'23'                       01440021
*                                                                       01460021
*EXITS-ERROR:                                                           01480021
*                                                                       01500021
*   AFTER WRITES ERROR MESSAGE, VIA PHASE 00 TO PHASE 4                 01520021
*                                                                       01540021
*   CALLING SEQUENCE IS THE SAME AS NORMAL EXIT                         01560021
*                                                                       01580021
*TABLE/WORK AREAS:                                                      01600021
*                                                                       01620021
*   QFILE - VARIBLE, FOR OCCURS DEPENDING ON CLAUSE.  FROM PHASE 2.     01640021
*   QVAR - VARIABLE, FOR OCCURS DEPENDING ON CLAUSE.  FROM PHASE 2.     01660021
*   CTABLE - 49 F FOR CORRESPONDING SUBJECT AND OBJECT HIERACHIES       01680021
*   ALL TABLES DESCRIBED IN DETAIL IN PLM AND LISTING                   01700021
*   OTHER WORK AREA STARTS AT DATA AREA.                                01720021
*                                                                       01740021
*ATTRIBUTES:                                                            01760021
*                                                                       01780021
*   NOT REUSABLE                                                        01800021
*                                                                       01820021
*                                                                       01840021
*NOTES: GENERAL ORGANIZATION:                                           01860021
*                                                                       01880021
*   1.  COMMON EQU'S                                                    01900021
*   2.  STANDARD EQUATES                                                01920021
*   3.  REGISTERS ASSIGNMENT                                            01940021
*   4.  OTHER EQUATED VALUES                                            01960021
*   5.  ACCESS EQU'S                                                    01980021
*   6.  REGISTER'S EQU FOR TAMMER                                       02000021
*   7.  PHASE 3 INITIALIZATION                                          02020021
*   8.  PHASE CONTROL                                                   02040021
*   9.  MAIN PROGRAM - READIN, EOF, SEARCH, GENOP, CORRTN,              02060021
*   10. GLOSSARY                                                        02080021
*   11. SUBROUTINES                                                     02100021
*   12. CONSTANT                                                        02120021
*   13. DATA                                                            02140021
*                                                                       02160021
*                                                                       02180021
*   REGISTERS USAGE:                                                    02200021
*                                                                       02220021
*   REGISTERS 0 - 6 ARE WORK REGISTERS                                  02240021
*   REGISTERS 7 - 12 ARE BASE REGISTERS                                 02260021
*   REGISTER 13  -  GLOBAL TABLE BASE REGISTER, NEVER TOUCHED           02280021
*   REGISTER 14  -  LINK REGISTER                                       02300021
*   REGISTER 15  -  BASE REGISTERS FOR INTERFACE AND INFREQUENT SUB     02320021
*                                                                       02340021
*                                                                       02360021
PH30     TITLE 'IKFCBL30'                                               02380021
       EJECT                                                            02400021
*                                                                       02420021
*                                                                       02440021
*=1        STANDARD EQUATES FOR BC INSTRUCTIONS                         02460021
*                                                                       02480021
*                                                                       02500021
UNCOND EQU   15                                                         02520021
HI     EQU   2                                                          02540021
LO     EQU   4                                                          02560021
EQ     EQU   8                                                          02580021
EQUAL    EQU   8                                                        02600021
NOTHI  EQU   13                                                         02620021
NOTLO  EQU   11                                                         02640021
NOTEQ  EQU   7                                                          02660021
OV     EQU   1                                                          02680021
POS    EQU   2                                                          02700021
NEG    EQU   4                                                          02720021
ZERO   EQU   8                                                          02740021
NOTOV  EQU   14                                                         02760021
NOTPOS EQU   13                                                         02780021
NOTNEG EQU   11                                                         02800021
NOTZER EQU   7                                                          02820021
ONES   EQU   1                                                          02840021
MIXED  EQU   4                                                          02860021
NOTONE EQU   14                                                         02880021
NOTMXD EQU   11                                                         02900021
NOP    EQU   0                                                          02920021
*                                                                       02940021
       EJECT                                                            02960021
*                                                                       02980021
*                                                                       03000021
*=1        REGISTERS ASSIGNMENTS -- PHASE 3                             03020021
*                                                                       03040021
*                                                                       03060021
RA0    EQU   0                                                          03080021
RWA    EQU     1                                                        03100021
RWB    EQU     2                                                        03120021
RWC    EQU     3                                                        03140021
RWD    EQU     4                                                        03160021
RWE    EQU     5                                                        03180021
RWF    EQU     6                                                        03200021
RBA    EQU     7                                                        03220021
RBB    EQU     8                                                        03240021
RBC    EQU     9                                                        03260021
RBD    EQU   10                                                         03280021
RBE    EQU   11                                                         03300021
RBF    EQU   12                                                         03320021
RESERV EQU   13             N E V E R T O U C H  - GLOBAL-TABLE BAS     03340021
RCS    EQU   14          CALL REGISTER FOR SUBROUTINES                  03360021
RAS    EQU     15            BASE FOR INTERPHASE AND INFREQUENT         03380021
*                                                                       03400021
*                                                                       03420021
R0     EQU   0                                                          03440021
R1     EQU   1                                                          03460021
R2     EQU   2                                                          03480021
R3     EQU   3                                                          03500021
R4     EQU   4                                                          03520021
R5     EQU   5                                                          03540021
R6     EQU   6                                                          03560021
R7     EQU   7                                                          03580021
R8     EQU   8                                                          03600021
R9     EQU   9                                                          03620021
R10    EQU   10                                                         03640021
R11    EQU   11                                                         03660021
R12    EQU   12                                                         03680021
R13    EQU   13                                                         03700021
R14    EQU   14                                                         03720021
R15    EQU   15                                                         03740021
       EJECT                                                            03760021
*                                                                       03780021
*                                                                       03800021
*=1        OTHER EQUATED VALUES                                         03820021
*                                                                       03840021
*                                                                       03860021
MSWON  EQU     1                                                        03880021
MSWOFF EQU     254                                                      03900021
MFF      EQU   255                                                      03920021
MVERB    EQU   68                                                       03940021
MWORD    EQU   X'54'                                                    03960021
MBREAK EQU   X'42'                                                      03980021
MCARD  EQU   X'81'                                                      04000021
MDN      EQU   X'30'                                                    04020021
LIMBO    EQU   0                                                        04040021
MBCD   EQU   X'23'                                                      04060021
MLHPNI EQU   X'05'                                                      04080021
MQUAL  EQU   X'22'                                                      04100021
MFDREF EQU   X'21'                                                      04120021
MMJPRO EQU   X'0D'                                                      04140021
MMJCND EQU   X'0C'                                                      04160021
MMJOVF EQU     X'0F'                                                    04180021
MRDNAM   EQU   X'0E'                                                    04200021
MAJWRO EQU     X'07'                                                    04220021
MSECNM EQU   X'40'                                                      04240021
MRHPNO EQU   X'20'                                                      04260021
MLHPNO EQU   X'06'                                                      04280021
MERHDR EQU   X'00'                                                      04300021
MDATIC EQU   X'30'                                                      04320021
MLIT     EQU   X'32'                      LITERAL                 49571 04340021
MPERFM EQU   X'38'                                                      04360021
MDATAT EQU   X'08'                                                      04380021
MGROUP EQU   X'E0'                                                      04400021
MGRVAR EQU   X'B0'                                                      04420021
MMOVE  EQU   X'1D'                                                      04440021
MADD   EQU   X'00'                                                      04460021
XX15   EQU   15                                                         04480021
NX1    EQU   1                                                          04500021
DX0    EQU   0                                                          04520021
LX1    EQU   1                                                          04540021
MSUB   EQU   X'01'                                                      04560021
MREAD  EQU   X'20'                                                      04580021
MINCRA   EQU   X'41'                                               4758 04600021
MRUPDT EQU   X'65'                                                      04620021
MIF    EQU   X'07'                                                      04640021
MDISPL   EQU   X'26'                                                    04660021
MACCPT   EQU   X'25'                                                    04680021
MEXHBIT EQU  X'27'                                                      04700021
MRDRRN EQU   X'71'                                                      04720021
MRDUPD EQU   X'75'                                                      04740021
MRPT   EQU   X'05'                                                      04760021
MSRPT  EQU   X'06'                                                      04780021
MSNRPT EQU   X'0D'                                                      04800021
MANEDT EQU   X'0E'                                                      04820021
MTHREE EQU     3                                                        04840021
MFFF   EQU     4095                MASK X'0FFF'                         04860021
MFQBIT EQU     X'80'              FOR TESTING FILE Q BIT                04880021
MQBIT  EQU     02                  FOR TESTING Q BIT                    04900021
PNTBL  EQU   TIB19-COS                                                  04920021
DICOT  EQU   TIB20-COS                                                  04940021
QFILE  EQU   TIB23-COS        8                                         04960021
QVAR   EQU   TIB24-COS        8                                         04980021
QSBL     EQU   TIB25-COS                                           4758 05000021
INDKEY EQU   TIB31-COS                                                  05020021
VALTRU EQU   TIB33-COS                                                  05040021
MSIX   EQU     6                                                        05060021
MZERO  EQU     0                                                        05080021
MEIGHT EQU     X'80'                                                    05100021
MDCOTB EQU     X'10'         UPDATE BIT FOR DICOT ON WRITE-ONLY ITE     05120021
*                                                                       05140021
       EJECT                                                            05160021
         ACCESS  3                                                      05180021
       EJECT                                                            05200021
         EJECT                                                          05220021
         EJECT                                                          05240021
       EJECT                                                            05260021
       USING COMON1,R7                                                  05280021
       USING   COMON2,RBB                                               05300021
       USING   COMON3,RBC                                               05320021
         USING COMON2A,RBD                                        39847 05340021
IKF302 CSECT                                                            05360021
COMON1 EQU     *                                                        05380021
*                                                                       05400021
*                   START AFTER GLOSSARY PROCESSING                     05420021
*                                                                       05440021
GLORET EQU   *                                                          05460021
       L     RWA,COSADR            READ IN FIRST BLOCK                  05480021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 05500021
       DC    X'02'                                                      05520021
       ST    RA0,PNTIN               INITIALIZE GETNXT POINTER          05540021
       BC    UNCOND,PHCTRL         GO TO PHASE CONTROLLER               05560021
*                                                                       05580021
* ADDRESS CONSTANTS FOR BASE REGISTERS                                  05600021
*                                                                       05620021
APH3SV DC    A(PH3SAV)                                                  05640021
*                                                                       05660021
       EJECT                                                            05680021
*=1    PHCTRL                      PHASE CONTROLLER                     05700021
*******************************************************************     05720021
*                                                                       05740021
*                             P H C T R L                               05760021
*                                                                       05780021
*                                                                       05800021
*FUNCTION                                                               05820021
*   PHASE 3 CONTROLLER.  READS IN THE PROCEDURE IC-TEXT ELEMENT AND     05840021
*   BRANCHES TO PROPER HANDLING ROUTINES.                               05860021
*                                                                       05880021
*                                                                       05900021
*SUBROUTINES CALLED                                                     05920021
*   COPYIN, SEARCH, GENOP, GETNXT                                       05940021
*                                                                       05960021
*EXIT POINTS                                                            05980021
*   CORRTN, READFN                                                      06000021
*                                                                       06020021
*                                                                       06040021
*                                                                       06060021
*******************************************************************     06080021
       SPACE   3                                                        06100021
PHCTRL EQU   *                                                          06120021
       BAL   RCS,GETNXT            GET IC-TEXT ELEMENT                  06140021
PHCTR1 CLI     GOTTEN,MBCD                                              06160021
       BC      EQ,BCDNAM           BCD NAME                             06180021
       CLI     GOTTEN,MVERB                                             06200021
       BC      EQ,VERB             VERB                                 06220021
       CLI     GOTTEN,MCARD                                             06240021
       BC      EQ,CARD             CARD NUMBER                          06260021
       CLI     GOTTEN,MLHPNI                                            06280021
       BC      EQ,BCDNAM           LEFT-HAND NAME                       06300021
       CLI     GOTTEN,MQUAL                                             06320021
       BC      EQ,BCDNAM           QUALIFIED NAME                       06340021
       CLI   GOTTEN,RPTCOD             REPORT WITH CODE                 06360021
       BE    BCDNAM                    YES                              06380021
*                                                                       06400021
PASSON BAL   RCS,COPYIN            NONE OF THESE.  COPY IT              06420021
       BC    UNCOND,PHCTRL         GO BACK AND GET NEXT ELEMENT         06440021
*                                                                       06460021
*                                                                       06480021
BCDNAM   BAL   RCS,SEARCH          DO SUBRTN SEARCH                     06500021
         BC    UNCOND,PHCTR1       GO ELEMENT ANALYZER                  06520021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   06540021
         BC    UNCOND,PHCTRL       DETERMINE BRANCH OUT PHASE           06560021
*                                                                       06580021
* CARD NUMBER.  SAVE AS ERROR PARAMETER, COPY.                          06600021
*                                                                       06620021
CARD   EQU     *                                                        06640021
       L     RWB,PNTIN                                                  06660021
       L     RWA,COSADR                                                 06680021
         MVC   CURCRD(LX2),DX1(RWB)      MOVE CARD NUMBER               06700021
       CLI   SGLMT,SEGT                IS PROGRAM SEGMENTED             06720021
       BNE   ISIT                      YES                              06740021
PASSIT BAL   RCS,COPYIN                NO, COPY CARD NUMBER             06760021
         B     PHCTRL              DETERMINE BRANCH OUT PHASE           06780021
*                                                                       06800021
*PROGRAM IS SEGMENTED, CHECK IF IN NEW SEGMENT.  IF SO PUT OUT          06820021
*   CONTROL BREAK.                                                      06840021
*                                                                       06860021
ISIT   EQU   *                                                          06880021
       L     RWA,COSADR                                                 06900021
         MVC   GENCRD+NX1(LX2),CURCRD SAVE CARD NUMBER                  06920021
ISIT0    BAL   RCS,GETNXT          OBTAIN NEXT ELEMENT                  06940021
       CLI   GOTTEN,ISTPRO         IS IT PROCEDURE NAME                 06960021
         BNE   ISIT2               NO                                   06980021
       OI    CARDSW,SEGT               TURN SW ON                       07000021
         B     PHCTR1              GO ELEMENT ANALYZER                  07020021
ISIT1  LA    RWB,GENCRD                                                 07040021
       BAL   RCS,GENDAT                COPY CARD NUMBER                 07060021
         TM    ATXTSW,SWON         IS A 37 ITEM SAVED                   07080021
         BNO   PHCTR1              RETURN WITH NEXT ELEMENT             07100021
         LA    RWB,ATXTSVD         ADR OF SAVED 37 ITEM                 07120021
         NI    ATXTSW,X'FF'-SWON   TURN SW OFF                          07140021
         BAL   RCS,GENDAT          COPY 37 ITEM                         07160021
       B     PHCTR1                    RETURN WITH NEXT ELEMENT         07180021
ISIT2    CLI   GOTTEN,XX37         LISTING A-TEXT                       07200021
         BNE   ISIT1               NO                                   07220021
         L     RWB,PNTIN           POINTER TO 37 ITEM                   07240021
         SR    RWF,RWF             CLEAR REGISTER                       07260021
         IC    RWF,DX1(RWB)        GET COUNT                            07280021
         LA    RWF,DX1(RWF)        ADD 1 TO IT                          07300021
         EX    RWF,MVCATXT         SAVE 37 ITEM                         07320021
         OI    ATXTSW,SWON         TURN SW ON                           07340021
         B     ISIT0               GET NEXT ELEMENT                     07360021
MVCATXT  MVC   ATXTSVD(RA0),DX0(RWB)  SAVE A-TXT 37 ITEM                07380021
*                                                                       07400021
* VERB                                                                  07420021
*                                                                       07440021
VERB   EQU   *                                                          07460021
         MVC   COVERB(LX2),GOTTEN       SAVE VERB                       07480021
         CLI   GOTTEN+NX1,MINCRA                                    475 07500021
       BE    INCRAV                    GO PUT OUT LITERAL               07520021
         CLI   GOTTEN+NX1,MRETRN         IS IT RETURN                   07540021
       BE    READFN                     YES, PROCESS LIKE READ          07560021
VERB2    CLI   GOTTEN+NX1,MMOVE          IS IT MOVE                     07580021
         BC    EQ,ISTCOR           IS IT CORRESPONDING                  07600021
         CLI   GOTTEN+NX1,MADD                                          07620021
         BC    EQ,ISTCOR           IS IT CORRESPONDING                  07640021
         CLI   GOTTEN+NX1,MSUB                                          07660021
         BC    EQ,ISTCOR           IS IT CORRESPONDING                  07680021
         CLI   GOTTEN+NX1,MSORT         IS VERB SORT                    07700021
       BNE   VERB3                     NO                               07720021
       BAL   RCS,COPYIN                COPY VERB                        07740021
       BAL   RCS,GETNXT                GET NEXT ELEMENT                 07760021
       CLI   GOTTEN,MBCD               IS IT BCD                        07780021
       BNE   PHCTR1                    NO                               07800021
       BAL   RCS,COPYIN                YES COPY NAME                    07820021
         B     PHCTR1              GO ELEMENT ANALYZER                  07840021
VERB3    CLI   GOTTEN+NX1,MREAD         IS VERB READ                    07860021
         BC    EQ,READFN           GO READ CHECK                        07880021
         CLI   GOTTEN+NX1,MRDRRN        IS IT READ FOR                  07900021
       BE    READFN                    YES, PROCESS LIKE READ           07920021
         CLI   GOTTEN+NX1,MSRCH         IS IT SEARCH VERB               07940021
         BE    STSRCH              GO TO STSRCH                         07960021
         CLI   GOTTEN+NX1,MSRCHAL       IS IT SEARCH ALL                07980021
         BNE   PASSON              UNEQUAL:PASS IT                      08000021
         B     STSRCH              GO TO ELEM SEARCH                    08020021
* MOVE, ADD OR SUBTRACT.  CHECK FOR CORRESPONDING.                      08040021
*                                                                       08060021
ISTCOR EQU     *                                                        08080021
       BAL   RCS,COPYIN            COPY VERB                            08100021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     08120021
         CLC   GOTTEN(LX2),CBCORR   IS IT CORRESPONDING                 08140021
       BC    NOTEQ,PHCTR1          NO-BACK TO PHASE CONTROLLER SCAN     08160021
       BAL   RCS,COPYIN            YES-COPY OUT                         08180021
       BC    UNCOND,CORRTN         GO ANALYZE                           08200021
*                                                                       08220021
*                                                                       08240021
       EJECT                                                            08260021
*=1    READFN      APPENDS RECORD NAME TO READ FILE-NAME                08280021
*******************************************************************     08300021
*                                                                       08320021
*                          R E A D                                      08340021
*                                                                       08360021
*                                                                       08380021
*FUNCTION                                                               08400021
*   PROCESSES READ STATEMENTS, APPENDS RECORD NAME TO READ FILE NAM     08420021
*                                                                       08440021
*SUBROUTINES CALLED                                                     08460021
*   COPYIN, GETNXT, ISTBCD, SEARCH, GENOP, LOCNXT, GETLVL, GENDAT.      08480021
*                                                                       08500021
*EXIT POINTS                                                            08520021
*   PHCTR1, PHCTRL                                                      08540021
*                                                                       08560021
*ERROR PROCESSING                                                       08580021
*   IF ITEM FOLLOWING FD IS NOT RECORD NAME, AN ERROR SYMBOL IS         08600021
*   SUBSTITUTED FOR PHASE 4 PROCESSING.                                 08620021
*                                                                       08640021
*                                                                       08660021
*******************************************************************     08680021
       SPACE   3                                                        08700021
READFN BAL   RCS,COPYIN            COPY 'READ'                          08720021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     08740021
       BAL   RCS,ISTBCD            IS IT BCD NAME                       08760021
       BC    UNCOND,PHCTR1         NO-GO OUT                            08780021
RDFN5  STM   RWA,RAS,S01PTR                                             08800021
       BAL   RCS,GETALL           MOVE NAME TO WORK AREA                08820021
       L     RWA,ALDEPR           CALL LDELNM-(LOCATE DELIMITER         08840021
       L     RAS,ALDLNM           GIVEN NAME)                           08860021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           08880021
         BC    UNCOND,RDFN6(RAS)   BRANCH TO RDFN6+16                   08900021
RDFN6    BC    UNCOND,*+NX16        UNIQUE FILE NAME FOUND              08920021
       BC    UNCOND,PHCTR1        NAME NOT FOUND                        08940021
       BC    UNCOND,PHCTR1             NOT UNIQUE                       08960021
       BC    UNCOND,PHCTR1             NOT A GROUP ELEMENT              08980021
       ST    RWA,SVDPTR           SAVE DELIMETER POINTER                09000021
       LM    RWA,RAS,S01PTR                                             09020021
       BAL   RCS,SEARCH            YES-SEARCH DICTIONARY                09040021
         BC    UNCOND,PHCTR1       ERROR                                09060021
         TM    DX0(RWB),MDATAT      IS IT NON-DATA ITEM                 09080021
       BC    ZERO,PHCTR1           NO-GO OUT                            09100021
         TM    DX0(RWB),XX05        YES-IS IT FD                        09120021
       BZ    RDFN3                     YES                              09140021
         CLI   DX0(RWB),XX89            IS IT SD                        09160021
       BNE   PHCTR1                    NO, ERROR                        09180021
RDFN3  OI    READSW,SWON               TURN SWITCH ON                   09200021
       ST    RWC,SAVPTR                                                 09220021
       ST    RWB,S01PTR                                                 09240021
       BAL   RCS,GENOP             YES-GENERATE FD P1 OPERAND           09260021
         XC    READSW(LX1),READSW       TURN SW OFF                     09280021
       L       RWA,SAVPTR                                               09300021
       L       RWF,COSADR                                               09320021
       C     RWA,DICND2-COS(RWF)                                        09340021
         BC    EQ,RDFN1            IS IT NON-RECORD                     09360021
       L     RWB,S01PTR                                                 09380021
         TM    DX1(RWB),XX80       DOES FILE CONTAIN ODO'S              09400021
       BC    ZERO,CHKL01          NO - GET LONGEST 01                   09420021
RDFN2  L     RAS,ALCNXT                LOCATE NEXT ELEMENT              09440021
       BALR  RCS,RAS               GET NEXT DIC. ENTRY VIA LOCNXT       09460021
         TM    DX0(RWB),MDATAT      IS IT DATA ITEM                     09480021
       BC    NOTZER,RDFN1          NO-GO SUBSTITUTE ERROR SYMBOL        09500021
         TM    DX0(RWB),XX05            LABEL RCDS OR APPLY WRITE ONLY  09520021
       BC    NOTONE,RDFN4              NO                               09540021
         TM    DX0(RWB),XX02                                            09560021
       BZ    RDFN2                     IT IS LABEL RECORD               09580021
RDFN4  BAL   RCS,GETLVL                GET LEVEL NUMBER                 09600021
       BCT   RWD,RDFN1             NOT 01                               09620021
       SR    RWF,RWF                                                    09640021
         IC    RWF,DX0(RWC)         GET COUNT OF BCDNAME                09660021
       EX    RWF,MVBCD                                                  09680021
RDFN0    MVC   ERAREA+NX1(LX32),WKAREA                               05 09700021
       LR    RWC,RWA               LVL 01-GET DIC PTR                   09720021
       BAL   RCS,GENOP             GENERATE P1 OPERAND FOR RECORD N     09740021
         BC    UNCOND,PHCTRL       DETERMINE PHASE BRANCH               09760021
RDFN1  LA    RWB,ERSYM1            RECORD DOESN'T FOLLOW-GEN. ER. S     09780021
         BAL   RCS,GENDAT          GENERATE INTERNAL CODE               09800021
         BC    UNCOND,PHCTRL       DETERMINE PHASE BRANCH               09820021
CHKL01 XC    OHONE,OHONE          CLEAR 01 SWITCH                       09840021
       XC    S01LNG,S01LNG        ZERO 01 LENGTH                        09860021
CHKL00 L     RWF,COSADR           IS THIS THE LAST DICTIONARY           09880021
       C     RWA,DICND2-COS(RWF)  ENTRY                                 09900021
       BC    EQ,CHKL02            YES - CHKL02                          09920021
CHKL03 L     RAS,ALCNXT           GET NEXT DIC. ENTRY VIA LOCNXT        09940021
         BALR  RCS,RAS             GO INTERPH&INFREQ BASE               09960021
       C     RWA,SVDPTR           IS THIS ENTRY PAST FD BOUNDS          09980021
         BC    R10,CHKL02          YES - CHKL02                         10000021
         TM    DX0(RWB),MDATAT     IS IT A DATA ITEM                    10020021
       BC    NOTZER,CHKL00        NO - GET NEXT ENTRY                   10040021
         TM    DX0(RWB),XX05            LABEL RCDS                      10060021
       BC    NOTONE,CHKL04             NO                               10080021
         TM    DX0(RWB),XX02                                            10100021
         BZ    CHKL03              BRANCH ON ZERO                       10120021
CHKL04 BAL   RCS,GETLVL           GET LEVEL NUMBER                      10140021
       BCT   RWD,CHKL00           NOT 01 - GET NEXT ENTRY               10160021
         OI    OHONE,XX01          PUT ON 01 SWITCH                     10180021
         CLC   S01LNG,DX7(RWB)     WAS LAST 01 OF THIS FD LONGER        10200021
         BC    R10,CHKL00          YES - GET NEXT ENTRY                 10220021
       STM   RWA,RWC,S01PTR       SAVE POINTERS FOR THIS 01             10240021
         MVC   S01LNG,DX7(RWB)     SAVE 01 LENGTH                       10260021
         SR    RWF,RWF                                             0572 10280021
         IC    RWF,DX0(RWC)         GET COUNT OF BCD NAME           057 10300021
         EX    RWF,MVBCD                                           0572 10320021
       BC    UNCOND,CHKL00        GET NEXT ENTRY                        10340021
CHKL02   TM    OHONE,XX01          WERE ANY 01'S FOUND                  10360021
       BC    ZERO,RDFN1           NO - GENERATE ERROR SYM.              10380021
       LM    RWA,RWC,S01PTR       PICK UP POINTERS FOR LONGEST 01       10400021
       BC    UNCOND,RDFN0         GENERATE P1 TEXT FOR RECORD           10420021
*                                                                       10440021
MVBCD    MVC   WKAREA(LX1),DX0(RWC)  PUT BCD NAME AND COUNT IN WORK A   10460021
*                                                                       10480021
       SPACE   10                                                       10500021
         EJECT                                                     0572 10520021
*                                                                       10540021
*=1    EOF         END-OF -FILE ROUTINE                                 10560021
*******************************************************************     10580021
*                                                                       10600021
*                             E O F                                     10620021
*                                                                       10640021
*FUNCTION                                                               10660021
*   CLOSES FILES, RELEASES TABLES, CALLS DUMP                           10680021
*                                                                       10700021
*SUBROUTINE CALLED                                                      10720021
*   COS, RELEAS, DUMP                                                   10740021
*                                                                       10760021
*EXIT POINT                                                             10780021
*   COS TO PHASE 4                                                      10800021
*                                                                       10820021
*                                                                       10840021
*******************************************************************     10860021
       SPACE   3                                                        10880021
*                                                                       10900021
EOF    DS    0H                                                         10920021
PH3END DS      0H                                                       10940021
*                                                                       10960021
       L       RWA,COSADR                                               10980021
       L     RWF,COSADR                                                 11000021
       LA    RWA,DICOT(RWA)                                             11020021
       L     RAS,RELADD-COS(RWF)                                        11040021
       BALR  RCS,RAS                    RELEASE DICOT TABLE             11060021
       L     RWA,COSADR                                                 11080021
       LA    RWA,TIB30-COS(RWA)                                         11100021
       BALR  RCS,RAS                   RELEASE HASH TABLE               11120021
       L     RWA,COSADR                                                 11140021
         TM    SWITCH,XX04                                              11160021
         BZ    TESTFQ              BRANCH TO TESTFQ                     11180021
       LA    RWA,QVAR(RWA)                                              11200021
       L     RAS,RELADD-COS(RWF)                                        11220021
         BALR  RCS,RAS             BASE  INTERPHAS/INFREQUENT           11240021
*                                                                       11260021
TESTFQ L       RWA,COSADR                                               11280021
         TM    SWITCH,XX01                                              11300021
         BC    ZERO,TSTSBL         GET NEXT ENTRY                       11320021
       LA      RWA,QFILE(RWA)      RELEASE IT                           11340021
       L       RWF,COSADR                                               11360021
       L     RAS,RELADD-COS(RWF)                                        11380021
         BALR  RCS,RAS             GO INTERPH/INFREQ BKSE               11400021
*                                                                  4758 11420021
TSTSBL   L     RWA,COSADR                                          4758 11440021
         CLC   QSBL+NX1(LX3,RWA),ZEROES WAS TABLE PRIMED                11460021
         BC    EQ,TSTIND                NO, TST FOR INDKEY TBL    43972 11480021
         LA    RWA,QSBL(RWA)       RELEASE IT                      4758 11500021
         L     RWF,COSADR                                          4758 11520021
         L     RAS,RELADD-COS(RWF)                                 4758 11540021
         BALR  RCS,RAS             GO INTERPH/INFREQ BASE               11560021
*                                                                       11580021
TSTIND   L     RWA,COSADR               PH0 ADDRESS               43972 11600021
         CLC   INDKEY+NX1(LX3,RWA),ZEROES                         43972 11620021
*   WAS INDKEY TABLE BUILT BY PHASE2                              43972 11640021
         BC    EQ,TSTVLTR               NO, TST FOR VALTRU        43972 11660021
         LA    RWA,INDKEY(RWA)                YES,                43972 11680021
         L     RWF,COSADR                   RELEASE IT            43972 11700021
         L     RAS,RELADD-COS(RWF)                                43972 11720021
         BALR  RCS,RAS                  BR TO RELEASE TBL         43972 11740021
*                                                                 43972 11760021
TSTVLTR  L     RWA,COSADR                 PH0 ADDRESS             43972 11780021
         CLC   VALTRU+NX1(LX3,RWA),ZEROES                         43972 11800021
*  WAS VALTRU TABLE BUILT BY PHASE2                               43972 11820021
         BC    EQ,GETDMP                    NO, BR                43972 11840021
         LA    RWA,VALTRU(RWA)                YES,                43972 11860021
         L     RWF,COSADR                   RELEASE IT            43972 11880021
         L     RAS,RELADD-COS(RWF)                                43972 11900021
         BALR  RCS,RAS                  BR TO RELEASE TBL         43972 11920021
*                                                                 43972 11940021
GETDMP EQU     *                                                        11960021
       L       RWA,COSADR          LOAD PHASE 4                         11980021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 12000021
       DC      X'A0'                                                    12020021
         EJECT                                                     4758 12040021
       EJECT                                                            12060021
*****************************************************************       12080021
*                                                                       12100021
*                                                                       12120021
*                               STSRCH                                  12140021
*                                                                       12160021
*                                                                       12180021
* FUNCTION                                                              12200021
*   PROCESSES SEARCH AND SEARCH ALL STATEMENTS APPENDING                12220021
*    THE NECESSARY P1-TEXT ELEMENTS FOR PHASE4.                         12240021
*                                                                       12260021
*                                                                       12280021
* SUBROUTINES CALLED                                                    12300021
*   COPYIN, GETNXT, ISTBCD, SEARCH, ERROR, GENOP, GETADD, GENDAT        12320021
*                                                                       12340021
*                                                                       12360021
* EXIT POINTS                                                           12380021
*   PHCTRL AND PHCTR1                                                   12400021
*                                                                       12420021
*                                                                       12440021
* ERROR PROCESSING                                                      12460021
*   IF IDENTIFIER-1 IS NOT VALID AN ERROR MESSAGE WILL BE               12480021
*   GENERATED.  OTHER ERRORS WILL BE FOUND BY PHASE4.                   12500021
*                                                                       12520021
*                                                                       12540021
****************************************************************        12560021
*                                                                       12580021
*                                                                       12600021
STSRCH   DS    0H                                                       12620021
       BAL   RCS,COPYIN                 COPY SEARCH VERB                12640021
       BAL   RCS,GETNXT                GET NEXT ELEMENT                 12660021
       BAL   RCS,ISTBCD                IS IT BCDNAME                    12680021
       B     PHCTR1                    NO                               12700021
       BAL   RCS,SEARCH                YES - SEARCH DICT                12720021
       B     PHCTR1                    ERROR                            12740021
       TM    FIRST(RWB),MDATAT         IS IT DATA ITEM                  12760021
       BO    PHCTR1                    NO                               12780021
       ST    RWC,ID1PTR                SAVE ID-1 PTR                    12800021
       L     RWA,COSADR                                                 12820021
       A     RWA,IDXTBL                                                 12840021
         L     RWA,DX0(RWA)                                             12860021
         LTR   RWA,RWA             IS TABLE EMPTY?                55177 12880021
         BZ    IDNFND              IF SO, ERROR                   55177 12900021
         MVC   SAVLTH(LX2),DX4(RWA)      SAVE LENGTH OF TABLE           12920021
         L     RWA,DX0(RWA)                                             12940021
       LR    RWF,RWA                                                    12960021
       AH    RWF,SAVLTH                LENGTH OF TABLE                  12980021
       ST    RWA,SAVSTR                SAVE TABLE START                 13000021
INTBL    CLC   DX1(LX3,RWA),ID1PTR+NX1   IS THIS PROPER ENTRY           13020021
       BE    ID1FND                    YES                              13040021
       BH    IDNFND                    PTR NOT IN TABLE                 13060021
       SR    RWD,RWD                                                    13080021
       IC    RWD,FIRST(RWA)            GET COUNT OF ENTRY               13100021
       AR    RWA,RWD                   POINT TO NEXT ENTRY              13120021
       CR    RWA,RWF                   AT END OF TABLE                  13140021
       BL    INTBL                     NO                               13160021
*                                                                       13180021
*                                                                       13200021
*=E  0022  -- NOT VALID AS IDENTIFIER-1 IN THE SEARCH                   13220021
*       STATEMENT.                                                      13240021
*                                                                       13260021
*                                                                       13280021
IDNFND EQU   *                                                          13300021
       CNOP  2,4                                                        13320021
         BAL   RCS,ERROR           GO HANDLE ERR COND                   13340021
       DC    X'1621'                                                    13360021
       DC    A(WKAREA)                                                  13380021
       LA    RWB,ERSYM1                                                 13400021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                13420021
         B     PHCTRL              DETERMINE PHASE BRANCH               13440021
*                                                                       13460021
*                                                                       13480021
*ID-1 WAS FOUND IN TABLE. GENERATE IT AND OTHER INFO.                   13500021
*                                                                       13520021
*                                                                       13540021
ID1FND   TM    ODO(RWA),XX01            WAS ENTRY OK                    13560021
       BO    ERRKEY                    NO, ERROR IN KEYS                13580021
         TM    ODO(RWA),XX04             WAS ODO OBJ DEFINED      34761 13600021
         BZ    ID1FND1                  YES, BR AROUND ERR MSG    34761 13620021
         CNOP  2,4                                                      13640021
         BAL   RCS,ERROR                GO GENERATE MSG           34761 13660021
         DC    X'1D21'                   MSG. NO. 29              34761 13680021
         DC    A(WKAREA)                   CURRENT ITEM           34761 13700021
         LA    RWB,ERSYM1                                         34761 13720021
         BAL   RCS,GENDAT               GENERATE INTERPH CODE     34761 13740021
         B     PHCTRL                   DETERMINE PHASE BR        34761 13760021
ID1FND1  EQU   *                                                  34761 13780021
       S     RWA,SAVSTR                GET DISPL IN TABLE               13800021
       ST    RWA,SAVDSP                SAVE TO LOCATE AGAIN             13820021
       BAL   RCS,GENOP                 GENERATE ID-1                    13840021
         CLI   COVERB+NX1,XX5E          IS IT SEARCH VERB               13860021
       BNE   SRCHAL                    NO, MUST BE SEARCH ALL           13880021
       BAL   RCS,GETADD                ADDRESS OF PROPER ENTRY          13900021
         TM    ODO(RWA),XX10            IS THERE PTR TO OCCURS          13920021
       BZ    GETMAX                    NO                               13940021
         MVC   TEMPT(LX4),ODO(RWA)      YES, MOVE PTR TO FIRST          13960021
       L     RWC,TEMPT                                                  13980021
       BAL   RCS,GENOP                 GENERATE OBJ OF ODO              14000021
       B     GETVAR                    SEE IF VARYING PRESENT           14020021
*                                                                       14040021
*                                                                       14060021
* =E  AN ERROR WAS FOUND PROCESSING THE KEYS FOR - -.                   14080021
*                                                                       14100021
*                                                                       14120021
ERRKEY EQU   *                                                          14140021
       CNOP  2,4                                                        14160021
       BAL   RCS,ERROR                 GO GEN MESSAGE                   14180021
       DC    X'1921'                                                    14200021
       DC    A(WKAREA)                                                  14220021
       LA    RWB,ERSYM1                                                 14240021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                14260021
         B     PHCTRL              DETERMINE PHASE BRANCH               14280021
GETMAX LA    RWB,WKAREA                AREA FOR MAX                     14300021
         BAL   R14,GETMX0          SET UP WORK AREAS                    14320021
       BAL   RCS,GENDAT                GENERATE                         14340021
GETVAR   BAL   RCS,GETNXT          GET NEXT RECORD                      14360021
         CLC   VARYING(LX2),GOTTEN      IS VARYING PRESENT              14380021
         BNE   NOVAR               NON-VARIABLE                         14400021
*                                                                       14420021
*                                                                       14440021
* VARYING IS PRESENT. DOES INDEX-NAME BELONG TO TABLE.                  14460021
*                                                                       14480021
*                                                                       14500021
       BAL   RCS,COPYIN                COPY VARYING                     14520021
       BAL   RCS,GETNXT                GET NEXT ELEMENT                 14540021
       BAL   RCS,ISTBCD                IS IT BCDNAME                    14560021
       B     PHCTR1                    NO                               14580021
       BAL   RCS,SEARCH                YES, SEARCH DOCT                 14600021
         B     PHCTR1              GO ELEM ANALYZER                     14620021
         BAL   RCS,GETADD          FORM TABLE                           14640021
       ST    RWC,ID2PTR                                                 14660021
       TM    FIRST(RWB),INDNM          IT INDEX NAME                    14680021
       BO    INDDNM                    YES                              14700021
         MVC   TEMPT(LX4),FRSTID(RWA)   PTR TO FIRST                    14720021
       L     RWC,TEMPT                                                  14740021
       BAL   RCS,GENOP                 GENERATE                         14760021
       LA    RWB,VARYING               GENERATE VARYING FOR PH4         14780021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                14800021
       L     RWC,ID2PTR                PTR TO ID-2                      14820021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   14840021
         B     PHCTRL              DETERMINE PHASE BRANCH               14860021
*                                                                       14880021
*                                                                       14900021
*NO VARYING PRESENT. ADD IT TO P-1 TEXT FOR PH4.                        14920021
*                                                                       14940021
*                                                                       14960021
NOVAR  LA    RWB,VARYING               GENERATE VARYING                 14980021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                15000021
         BAL   RCS,GETADD          FORM TABLE                           15020021
         MVC   TEMPT(LX4),FRSTID(RWA)   PTR TO FIRST                    15040021
       L     RWC,TEMPT                                                  15060021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   15080021
       B     PHCTR1                    PROCESS REST OF STRING           15100021
*                                                                       15120021
*INDEX-NAME IS PRESENT. DOES IT BELONG TO TABLE.                        15140021
*                                                                       15160021
INDDNM SR    RWC,RWC                                                    15180021
       IC    RWC,IDCT(RWA)             HOW MANY INDEX NAMES             15200021
         MVC   TEMPT(LX4),FRSTID(RWA)   PTR TO FIRST                    15220021
IND1     CLC   ID2PTR+NX1(LX3),IDPTR(RWA) PTRS EQUAL                    15240021
       BE    PTRSEQ                    YES                              15260021
         LA    RWA,DX3(RWA)                                             15280021
         BCT   RWC,IND1            SET UP PH TRANSFER                   15300021
       L     RWC,TEMPT                                                  15320021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   15340021
       LA    RWB,VARYING               GENERATE FOR PH4                 15360021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                15380021
PTRSEQ L     RWC,ID2PTR                PTR TO INDEX NAME                15400021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   15420021
         B     PHCTRL              DETERMINE PHASE BRANCH               15440021
*                                                                       15460021
*                                                                       15480021
* CHANGE NUMBER OF OCCURENCES TO NUMERIC LITERAL                        15500021
*                                                                       15520021
*                                                                       15540021
GETMX0 DS    0H                                                         15560021
         MVI   WKAREA,XX32              HEADER                          15580021
         MVI   WKAREA+NX3,XX00           CLEAR BYTE                     15600021
         TM    MAX(RWA),XXFF            3 BYTE FIELD                    15620021
       BZ    GETMX2                    NO                               15640021
         MVI   WKAREA+NX1,XX05      STORE COUNT                         15660021
         MVC   WKAREA+NX4(LX3),MAX(RWA)  MOVE FIELD                     15680021
         TM    MAX(RWA),XXF0            YES, 1ST BYTE FILLED            15700021
       BZ    GETMX1                    NO                               15720021
         MVI   WKAREA+NX2,XX05          NUMBER OF PLACES                15740021
         BR    R14                 GO TO ADDR AT REG14                  15760021
GETMX1   MVI   WKAREA+NX2,XX04          NUMBER OF PLACES                15780021
         BR    R14                 GO TO ADDR AT REG14                  15800021
GETMX2   TM    MAX+NX1(RWA),XXFF        2 BYTE FIELD                    15820021
       BZ    GETMX4                    NO                               15840021
         MVI   WKAREA+NX1,XX04          STORE COUNT                     15860021
         MVC   WKAREA+NX4(LX2),MAX+NX1(RWA) MOVE FIELD                  15880021
         TM    MAX+NX1(RWA),XXF0                                        15900021
         BZ    GETMX3              GO TO INSTR. ALTER                   15920021
         MVI   WKAREA+NX2,XX03          NUMBER OF PLACES                15940021
         BR    R14                 REGISTER 14                          15960021
GETMX3   MVI   WKAREA+NX2,XX02                                          15980021
         BR    R14                 REGISTER 14                          16000021
GETMX4   MVI   WKAREA+NX1,XX03          NUMBER OF PLACES                16020021
         MVI   WKAREA+NX2,XX01                                          16040021
         MVC   WKAREA+NX4(LX1),MAX+NX2(RWA) MOVE FIELD                  16060021
         BR    R14                 REGISTER 14                          16080021
*                                                                       16100021
*                                                                       16120021
* PROCESSES SEARCH ALL VERB APPENDING THE FIRST INDEX-NAME AND          16140021
*   ALL THE KEYS ASSOCIATED WITH THE TABLE.                             16160021
*                                                                       16180021
*                                                                       16200021
SRCHAL   BAL   RCS,GETADD          FORM TABLE                           16220021
       SR    RWD,RWD                                                    16240021
       IC    RWD,FIRST(RWA)            GET LENGTH OF ENTRY              16260021
       AR    RWD,RWA                   POINT TO END OF ENTRY            16280021
         LA    RWD,DX0(RWD)            CLEAR TOP BYTE                   16300021
       SR    RWC,RWC                                                    16320021
       IC    RWC,IDCT(RWA)             CT OF ID-NMAES                   16340021
         LA    RWB,DX3                                                  16360021
       MR    RWB,RWB                                                    16380021
       AR    RWA,RWC                                                    16400021
         LA    RWA,DX9(RWA)             UPDATE PTR                      16420021
         LA    RWC,DX9(RWC)             UPDATE COUNT                    16440021
       CR    RWA,RWD                   ANY KEYS FOR TABLE               16460021
       BE    KEYERR                    NO, GENERATE ERROR MESSAGE       16480021
       ST    RWC,SAVRWC                DISPL FROM START OF TABLE        16500021
       SR    RWB,RWB                                                    16520021
       IC    RWB,KEYCT(RWA)            GET KEY CT                       16540021
         STC   RWB,KEYCNT+NX2           NUM OF KEYS FOR PHASE 4         16560021
       LA    RWB,KEYCNT                                                 16580021
       BAL   RCS,GENDAT                GENERATE                         16600021
       SR    RWB,RWB                                                    16620021
         IC    RWB,KEYCNT+NX2           RESTORE COUNT OF KEYS           16640021
GETKEY   MVC   TEMPT(LX4),KEYCT(RWA)    GET PTR                         16660021
       STH   RWB,SAVCTR                SAVE COUNT OF KEYS               16680021
       L     RWC,TEMPT                                                  16700021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   16720021
         BAL   RCS,GETADD          FORM TABLE                           16740021
       L     RWC,SAVRWC                RESTORE DISPL                    16760021
         LA    RWC,DX3(RWC)             POINT TO NEXT ENTRY             16780021
       AR    RWA,RWC                   UPDATE TABLE PTR                 16800021
       ST    RWC,SAVRWC                                                 16820021
       LH    RWB,SAVCTR                RESTORE COUNT OF KEYS            16840021
       BCT   RWB,GETKEY                AT END OF KEYS                   16860021
       BAL   RCS,GETADD                YES                              16880021
         MVC   TEMPT(LX4),FRSTID(RWA)   APPEND 1ST INDEX NAME           16900021
       L     RWC,TEMPT                                                  16920021
         BAL   RCS,GENOP           CREATE MODIFIED EL                   16940021
*                                                                       16960021
* APPEND EITHER OBJECT OF ODO OR MAXIMUM NUMBER OF OCCURENCES           16980021
* AND MINIMUM NUMBER OF OCCURENCES FOR PHASE 4.                         17000021
*                                                                       17020021
         BAL   RCS,GETADD          FORM TABLE                           17040021
         TM    ODO(RWA),XX10            IS THERE PTR TO OCCURS          17060021
       BZ    GENMAX                    NO                               17080021
         MVC   TEMPT(LX4),ODO(RWA)      YES, GET PTR                    17100021
       L     RWC,TEMPT                                                  17120021
       BAL   RCS,GENOP                 GENERATE                         17140021
       B     PHCTRL                    PROCESS REST                     17160021
GENMAX LA    RWB,WKAREA                AREA FOR MAX                     17180021
         BAL   R14,GETMX0          SET UP WORK AREAS                    17200021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                17220021
       B     PHCTRL                    PROCESS REST                     17240021
*                                                                       17260021
*                                                                       17280021
*  =E  0024  NO KEYS WERE SPECIFIED FOR - -.                            17300021
*                                                                       17320021
*                                                                       17340021
KEYERR EQU   *                                                          17360021
         MVI   ID1PTR,XXFE                                              17380021
       CNOP  2,4                                                        17400021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            17420021
       DC    X'1821'                   MSG  24                          17440021
       DC    A(ID1PTR)                                                  17460021
         B     PHCTRL              DETERMINE PHASE BRANCH               17480021
       EJECT                                                            17500021
*=1    SEARCH      SEARCHES DICTIONARY FOR A GIVEN BCD NAME             17520021
*******************************************************************     17540021
*                                                                       17560021
*                             S E A R C H                               17580021
*                                                                       17600021
*                                                                       17620021
*      BAL   RCS,SEARCH                                                 17640021
*      (ERROR RETURN)              NAME NOT FOUND OR NOT UNIQUE         17660021
*      (NORMAL RETURN)             UNIQUE NAME FOUND                    17680021
*                                                                       17700021
*                                                                       17720021
*FUNCTION                                                               17740021
*   SEARCHES DICTIONARY FOR A GIVEN BCD-NAME, CHECKING TO MAKE SURE     17760021
*   IT IS UNIQUE                                                        17780021
*                                                                       17800021
*SUBROUTINES CALLED                                                     17820021
*   GETALL, LATRNM, LATGRP,ERROR, GENDAT, QUALIF, EOF                   17840021
*                                                                       17860021
*NOTES                                                                  17880021
*   IF THE GIVEN BCD-NAME IS A QUALIFIED NAME TRANSFER TO QUALIF        17900021
*   SUBROUTINE TO RESOLVE ITS QUALIFICATION. EXITS THRU SEARCH EXIT     17920021
*                                                                       17940021
*   IF  NON-UNIQUE NAME IS A RHN, OR IS NOT UNIQUE EVEN IN SECTION      17960021
*   SUBSTITUTES ERSYM1 FOR NAME IN ERROR MESSAGE.  IF NON-UNIQUE NA     17980021
*   IS A LHN THEN GENERATES ERSYM2 IN ERROR MESSAGE.                    18000021
*                                                                       18020021
*                                                                       18040021
*******************************************************************     18060021
       SPACE   3                                                        18080021
SEARCH DS      0H                                                       18100021
       ST    RCS,SAVSCH                                                 18120021
       BAL   RCS,GETALL            MOVE NAME FROM INP. BUFFER TO WK     18140021
       CLI   GOTTEN,MQUAL          IS NAME QUALIFIED                    18160021
         BC    EQ,QUALIF           DO DICTIONARY LVL SEARCH             18180021
*                                                                       18200021
* SEARCH DICTIONARY FOR NAME                                            18220021
*                                                                       18240021
       L     RWA,ALTNPR            CALL LATRNM-(LOCATE ATTRIBUTES       18260021
       L     RAS,ALTRNM            GIVEN NAME)                          18280021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           18300021
         BC    UNCOND,SRCH2(RAS)   CHECK FOR UNIQUE NAME                18320021
SRCH2  BC    UNCOND,SRCHOK         UNIQUE NAME FOUND                    18340021
       BC    UNCOND,SRCHNF         NAME NOT FOUND                       18360021
*                                                                       18380021
* NAME APPARENTLY NOT UNIQUE.  CHECK IF IT IS LEFT-HAND PARAGRAPH N     18400021
* UNIQUE IN SECTION OR IMPLICITLY QUALIFIED RIGHT-HAND NAME.            18420021
*                                                                       18440021
       ST    R3,WKARSV                 SAVE PTR                         18460021
       L     RWA,ALTGPR            CALL LATGRP-(LOCATE ATTRIBUTES G     18480021
       L     RAS,ALTGRP            GROUP POINTER)                       18500021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           18520021
         BC    UNCOND,SRCH3(RAS)   CHECK UNIQUENESS IN SECTION          18540021
SRCH3  BC    UNCOND,SRCHOK         UNIQUE IN CURRENT SECTION            18560021
       BC    UNCOND,SRCHNU         NOT FOUND-MUST BE NON-UNIQUE R.H     18580021
       BC    UNCOND,SRCHNU         NOT UNIQUE EVEN IN SECTION           18600021
         BC    UNCOND,CMPERR       UNIQUE NAME CONTINGENCY              18620021
*                                                                       18640021
*                                                                       18660021
*                                                                       18680021
*                                                                       18700021
*=E    0018    COMPILER ERROR, LAST ITEM REF. BY ACCESS WAS ELEM IT     18720021
*                                                                       18740021
*                                                                       18760021
CMPERR EQU     *                                                        18780021
       CNOP    2,4                                                      18800021
         BAL   RCS,ERROR           GO HANDLE ERROR COND                 18820021
         DC    X'0C81'                                                  18840021
       DC      A(WKAREA)                                                18860021
         BC    UNCOND,EOF          DO END OF FILE                       18880021
*                                                                       18900021
* UNIQUE NAME FOUND.  NORMAL EXIT                                       18920021
*                                                                       18940021
SRCHOK EQU   *                                                          18960021
         MVC   ERAREA(LX32),WKAREA    SAVE BCD NAME FOR GENOP           18980021
*                                                                       19000021
       L       RCS,SAVSCH                                               19020021
         BC    UNCOND,DX4(RCS)     GO TO 4 PAST REG                     19040021
*                                                                       19060021
*                                                                       19080021
*                                                                       19100021
*                                                                       19120021
*=E    0001    -- NOT DEFINED.                                          19140021
*                                                                       19160021
* NAME NOT FOUND                                                        19180021
*                                                                       19200021
SRCHNF EQU   *                                                          19220021
       SR    RWB,RWB                    CLEAR REGISTER                  19240021
         CLI   WKAREA+NX1,XX0B          IS IT SPECIAL REG               19260021
       BL    SPCRG3                    INO                              19280021
         LA    RWD,DX8                  MAYBE, COMPARE NAMES            19300021
         IC    RWB,WKAREA+NX1           GET COUNT OF NAME               19320021
       LA    RWF,REGATT                                                 19340021
       LA    RWC,SPCREG                 A(SPECIAL REGISTERS)            19360021
SPCRG2 EX    RWB,ISSPRG                 IS IT SPECIAL REGISTER          19380021
       BE    SPCRG8                     IT WAS FOUND                    19400021
       LA    RWC,XX15(RWC)             POINT TO PROPER ENTRY            19420021
         LA    RWF,DX11(RWF)             POINT TO PROPER ATTRIBUTES     19440021
       BCT   RWD,SPCRG2                 ANY MORE                        19460021
SPCRG3 EQU   *                                                          19480021
       CNOP  2,4                                                        19500021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            19520021
       DC    X'0121'                                                    19540021
       DC    A(WKAREA)                                                  19560021
         BC    UNCOND,SRCHE1       GO GENERATE ERROR SYMBOL             19580021
SPCRG8   OI    MVCRSPRG,XX80      SPEC REG ON FOR CORRTN          47031 19600021
         TM    MVCRSPRG,XX08      IS IT CORRESPONDING             47031 19620021
         BO    SRCHOK             YES                             47031 19640021
         CLI   COVERB+NX1,MDISPL  IS IT DISPLAY                   47031 19660021
       BE    SPCRGB                     YES, ERR/R                      19680021
         CLI   COVERB+NX1,MACCPT         IS IT ACCEPT                   19700021
       BE    SPCRGB                     YES, ERROR                      19720021
         CLI   COVERB+NX1,MEXHBIT        IS IT EXHIBIT                  19740021
       BE    SPCRGB                     YES, ERROR                      19760021
         CLC   WKAREA+NX2(LX11),SORTRTRN SORT-RETURN...           42047 19780021
         BNE   SPCRG9              GO CHECK TIME OF DAY                 19800021
       L     RWA,COSADR                                                 19820021
         OI    SWITCH+NX1,SORTRTN        TURN ON BIT IN COMMON          19840021
SPCRG9   CLI   WKAREA+NX2,XCT           IS IT TIME-OF-DAY               19860021
       BE    SPCRGA                    YES                              19880021
         CLI   WKAREA+NX2,XCC           IS IT CURRENT-DATE              19900021
       BE    SPCRGA                    YES                              19920021
SPCRGM MVI   WKAREA,MDN                DATA-NAME HEADER                 19940021
         MVI   WKAREA+NX1,XX0B           COUNT OF ATTRIBUTES            19960021
         MVC   WKAREA+NX2(LX11),DX0(RWF)  APPEND ATTRIBUTES             19980021
       LA    RWB,WKAREA                                                 20000021
       BAL   RCS,GENDAT                 GO GENERATE                     20020021
         B     PHCTRL              DETERMINE PHASE BRANCH               20040021
*                                                                       20060021
SPCRGA EQU   *                                                          20080021
         CLI   COVERB+NX1,MMOVE         IS IT MOVE VERB                 20100021
       BE    SPCRGM                    YES, OK                          20120021
       CNOP  2,4                                                        20140021
       BAL   RCS,ERROR                 GO GENERATE                      20160021
       DC    X'1220'                   MSG 18                           20180021
         B     SRCHE1              GO GENERATE ERROR SYMBOL             20200021
*                                                                       20220021
*                                                                       20240021
*=E    0028  SPECIAL REGISTER MAY NOT BE USED WITH ACCEPT               20260021
*            DISPLAY OR EXHIBIT VERBS. ****                             20280021
*                                                                       20300021
*                                                                       20320021
SPCRGB EQU   *                                                          20340021
       CNOP  2,4                                                        20360021
       BAL   RCS,ERROR                  GO GENERATE                     20380021
       DC    X'1C20'                    MSG 28                          20400021
       B     SRCHE1                     PUT OUT B90000                  20420021
*                                                                       20440021
ISSPRG CLC   WKAREA+NX1(LX1),DX0(RWC)  IS IT SPEC REG                   20460021
*                                                                       20480021
*                                                                       20500021
*                                                                       20520021
*                                                                       20540021
*=E    0002    -- NOT UNIQUE.                                           20560021
*                                                                       20580021
* NAME NOT UNIQUE                                                       20600021
*                                                                       20620021
SRCHNU EQU   *                                                          20640021
         MVI   WKARSV,XX04              INDICATOR                       20660021
       LA    RWA,WKARSV                                                 20680021
       L     RAS,ALTRPT                MAKE CHECK TO SEE IF LABEL RDC   20700021
       BALR RCS,RAS                    GO LOCATE ATTRIBUTES             20720021
       L     RWC,WKARSV                RESTORE REGISTER                 20740021
         CLI   DX4(RWB),XX01            LOCATOR = 1                     20760021
       BNE   SRCHN1                    NO                               20780021
         TM    DX2(RWB),XX10            IS IT BLL                       20800021
       BZ    SRCHN1                    NO, NOT LABEL RCD                20820021
*                                                                       20840021
*                                                                       20860021
* =E 0027  DATA-NAME UNDER LABEL RECORD IS NON-UNIQUE. LAST             20880021
*          DATA DESCRIPTION OF **** ASSUMED.                            20900021
       CNOP  2,4                                                        20920021
       BAL   RCS,ERROR                 GO GENERATE                      20940021
       DC    X'1B01'                   MSG 27                           20960021
       DC    A(WKAREA)                 PARAMETER                        20980021
       B     SRCHOK                    OK EXIT                          21000021
SRCHN1 EQU   *                                                          21020021
       CNOP  2,4                                                        21040021
       CNOP  2,4                                                        21060021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            21080021
       DC    X'0221'                                                    21100021
       DC    A(WKAREA)                                                  21120021
       CLI   GOTTEN,MLHPNI         IS IT LEFT-HAND NAME                 21140021
       BC    NOTEQ,SRCHE1          NO                                   21160021
       LA    RWB,ERSYM2            YES-SET TO PUT OUT SPECIAL SYMBO     21180021
         BC    UNCOND,SRCHE2       GO CHECK SUBSCRIPTING                21200021
*                                                                       21220021
* COMMON ERROR EXIT                                                     21240021
*                                                                       21260021
SRCHE1 LA    RWB,ERSYM1            GENERATE ERROR SYMBOL                21280021
SRCHE2   BAL   RCS,GENDAT          GENERATE INTERPHASE CODING           21300021
         BAL   RCS,GETNXT          IS IT SUBSCRIPTED                    21320021
         CLC   GOTTEN(LX2),LPAREN                                       21340021
         BC    NOTEQ,SRCHE4        NO-EXIT                              21360021
SRCHE3   BAL   RCS,GETNXT          YES                                  21380021
         CLC   GOTTEN(LX2),CBIN     IS IT COBOL WORD 'IN'               21400021
         BC    EQ,SRCHE3             YES,GET NEXT ITEM                  21420021
         CLI GOTTEN,MWORD          IS IT A COBOL WORD (NOT 'IN')        21440021
         BC    EQ,SRCHE4             YES, STOP LOOKING                  21460021
         CLI   GOTTEN,MVERB        IS IT A VERB                         21480021
         BC    EQ,SRCHE4             YES, STOP LOOKING                  21500021
         CLC   GOTTEN(LX2),CBEOS    IS IT EOS                           21520021
         BC    EQ,SRCHE4             YES, STOP LOOKING                  21540021
         CLC   GOTTEN(LX2),RPAREN     IS IT END OF SUBSCRIPT            21560021
         BC    NOTEQ,SRCHE3        NO                                   21580021
         BAL   RCS,GETNXT          YES                                  21600021
SRCHE4   L     RCS,SAVSCH          RETURN WITH NEXT ELEMENT             21620021
         MVI   MVCRSPRG,XX00                                      47031 21640021
         BCR   UNCOND,RCS          REGISTER ADDRESS                     21660021
       EJECT                                                            21680021
*=2    QUALIF    RESOLVES NAME QUALIFICATION                            21700021
*******************************************************************     21720021
*                                                                       21740021
*                             Q U A L I F                               21760021
*                                                                       21780021
*                                                                       21800021
*                                                                       21820021
*FUNCTION                                                               21840021
* RESOLVES NAME QUALIFICATION.                                          21860021
* QUALIFIERS ENTER PHASE 3 IN REVERSE OF SOURCE ORDER, HIGHEST LEVE     21880021
* QUALIFIER FIRST, QUALIFIED NAME LAST.                                 21900021
* QUALIF CHECKS TO SEE IF THE HIGHEST LEVEL QUALIFIER IS UNIQUE,        21920021
* IF NOT A WARNING MESSAGE IS WRITTEN, THE ELEMENT IS DISCARDED         21940021
* AND PROCESSING CONTINUES ON THE REST OF THE STRING. IF THE            21960021
* HIGHEST LEVEL QUALIFIER IS UNIQUE, QUALIF CHECKS TO SEE               21980021
* THAT SUBSEQUENT QUALIFIERS AND THE QUALIFIED NAME ARE ON PROGRES-     22000021
* SIVELY LOWER LEVELS IN THE SAME HIERARCHY, AND THAT THE QUALIFIED     22020021
* NAME IS UNIQUELY IDENTIFIED BY ITS QUALIFIERS.  EXITS VIA SEARCH.     22040021
*                                                                       22060021
*SUBROUTINES CALLED                                                     22080021
*   LDELNM, GETNXT, GETALL, LATACP, ERROR                               22100021
*                                                                       22120021
*EXIT POINTS                                                            22140021
*   SRCHOK (GOOD UNIQUE NAME EXIT)                                      22160021
*   SRCHE1 (DISQUALIFIED NAME EXIT)                                     22180021
*    PHCTRL (IF HIGHEST LEVEL QUALIFIER IS NOT UNIQUE)                  22200021
*                                                                       22220021
*ERROR PROCESSING                                                       22240021
*   IF ANY ERROR IN QUALIFIER OR QUALIFIED NAME BYPASSES THE REST       22260021
*   OF QUALIFICATION STRING AND VIA SEARCH SUBROUTINE TO ERROR EXIT     22280021
*******************************************************************     22300021
       SPACE   3                                                        22320021
*                                                                       22340021
QUALIF EQU   *                                                          22360021
*                                                                       22380021
* SEARCH DICTIONARY FOR HIGHEST LEVEL QUALIFIER.                        22400021
*                                                                       22420021
       L     RWA,ALDEPR            CALL LDELNM-(LOCATE DELIMITER GI     22440021
       L     RAS,ALDLNM            NAME)                                22460021
         BALR  RCS,RAS             BR AND LINK WITH REG ADDR            22480021
         BC    UNCOND,QUAL2(RAS)   GO TO POSITION W/I TABLE             22500021
QUAL2  BC    UNCOND,QUAL3          UNIQUE GROUP OR SECTION NAME FOU     22520021
       BC    UNCOND,HLQNF          NAME NOT FOUND                       22540021
       B     QUAL2A                    QUALIFIER NOT UNIQUE             22560021
       BC    UNCOND,HLQNG          NOT A GROUP ITEM                     22580021
*                                                                       22600021
*                                                                       22620021
*                                                                       22640021
* =W  0004  QUALIFYING NAME -- IS NOT UNIQUE.                           22660021
*                                                                       22680021
*                                                                       22700021
*                                                                       22720021
QUAL2A EQU   *                                                          22740021
       CNOP  2,4                                                        22760021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            22780021
       DC    X'0401'                                                    22800021
       DC    A(WKAREA)                                                  22820021
*                                                                       22840021
*                                                                       22860021
* MESSAGE IS ONLY WARNING.  CONTINUE PROCESSING STRING                  22880021
*  DISCARDING THIS ELEMENT HOPING TO FIND UNIQUE ELEMENT                22900021
*  IN THIS STRING.                                                      22920021
*                                                                       22940021
*                                                                       22960021
         B     PHCTRL              DETERMINE PHASE BRANCH               22980021
*                                                                       23000021
* SEARCH DICTIONARY FOR SUBSEQUENT ELEMENTS IN STRING                   23020021
*                                                                       23040021
QUAL3  EQU   *                                                          23060021
         MVC   QERPRM(LX32),WKAREA    SAVE CUR. QUALIFIER AS ERR PAR    23080021
       BAL   RCS,GETLVL                SAVE LEVEL NUMBER FOR            23100021
       STC   RWD,SAVLVL                    CHECK OF 66 ITEMS            23120021
QUAL3A   BAL   RCS,GETNXT          GET NEXT RECORD                      23140021
         BAL   RCS,GETALL          SET UP POINTERS                      23160021
       L     RWA,ALACPR            CALL LATACP-(LOCATE ATTRIBUTES U     23180021
       L     RAS,ALTACP            ACCESS POINTER                       23200021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           23220021
       LTR   RAS,RAS               IS IT UNIQUE SUBFLD OF LAST QUAL     23240021
         BC    NOTZER,QUAL4-NX4(RAS) NO                                 23260021
       CLI   GOTTEN,MBCD           YES-IS IT QUALIFIED NAME ITSELF      23280021
       BE    SRCHOK                NAME OK                              23300021
       BC    UNCOND,QUAL3          NO-GO GET NEXT ELEMENT IN STRING     23320021
*                                                                       23340021
QUAL4  BC    UNCOND,QNF            NOT A SUBFIELD OF LAST QUALIFIER     23360021
       BC    UNCOND,QNU            NON-UNIQUE SUBFLD OF LAST QUALIF     23380021
       BC    UNCOND,QNG            LAST QUALIFIER NOT A GROUP ITEM      23400021
*                                                                       23420021
*                                                                       23440021
*                                                                       23460021
*                                                                       23480021
*                                                                       23500021
*                                                                       23520021
*=E    0003    HIGHEST LEVEL QUALIFIER -- NOT DEFINED.                  23540021
*                                                                       23560021
* HIGHEST LEVEL QUALIFIER NOT FOUND                                     23580021
*                                                                       23600021
HLQNF  EQU   *                                                          23620021
       CNOP  2,4                                                        23640021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            23660021
       DC    X'0321'                                                    23680021
       DC    A(WKAREA)                                                  23700021
         BC    UNCOND,QUALER       HANDLE                               23720021
*                                                                       23740021
*                                                                       23760021
*                                                                       23780021
*                                                                       23800021
*=E    0005    -- NOT A VALID QUALIFIER.                                23820021
*                                                                       23840021
* QUALIFIER NOT GROUP ITEM                                              23860021
*                                                                       23880021
QNG      MVC   WKAREA(LX32),QERPRM  IF NOT HLQ, PARAM IS LAST QUALIF    23900021
       CNOP  2,4                                                        23920021
HLQNG  EQU   *                                                          23940021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            23960021
       DC    X'0521'                                                    23980021
       DC    A(WKAREA)                                                  24000021
         BC    UNCOND,QUALER       CHECK FOR QUALIFIER                  24020021
*                                                                       24040021
*                                                                       24060021
*                                                                       24080021
*                                                                       24100021
*=E    0006    -- NOT A SUBFIELD OF --.                                 24120021
*                                                                       24140021
* CURRENT ELEMENT NOT A SUBFIELD OF LAST QUALIFIER                      24160021
*                                                                       24180021
       CNOP  2,4                                                        24200021
QNF    EQU   *                                                          24220021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            24240021
       DC    X'0622'                                                    24260021
       DC    A(WKAREA)                                                  24280021
       DC    A(QERPRM)                                                  24300021
         BC    UNCOND,QUALER       CHECK FOR QUALIFIER                  24320021
*                                                                       24340021
*                                                                       24360021
*                                                                       24380021
*                                                                       24400021
*=E    0007    -- NOT UNIQUELY QUALIFIED BY --.                         24420021
*                                                                       24440021
* CURRENT ELEMENT A NON-UNIQUE SUBFIELD OF LAST QUALIFIER               24460021
*                                                                       24480021
       CNOP  2,4                                                        24500021
QNU    EQU   *                                                          24520021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            24540021
       DC    X'0702'                                                    24560021
       DC    A(WKAREA)                                                  24580021
       DC    A(QERPRM)                                                  24600021
       CLI   GOTTEN,MBCD                                                24620021
       BNE   QUAL3A                    YES                              24640021
       CNOP  2,4                                                        24660021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            24680021
       DC    X'0521'                                                    24700021
       DC    A(WKAREA)                                                  24720021
         B     SRCHE1              GO GENERATE ERROR SYMBOL             24740021
*                                                                       24760021
* COMMON ERROR EXIT--BYPASS REST OF QUALIFICATION STRING                24780021
*                                                                       24800021
QUALER EQU   *                                                          24820021
       CLI   GOTTEN,MQUAL          IS CURRENT ELEMENT A QUALIFIER       24840021
       BC    NOTEQ,SRCHE1          NO-EXIT, VIA SEARCH RTN ERROR EX     24860021
       BAL   RCS,GETNXT            YES-GET NEXT ELEMENT                 24880021
         BC    UNCOND,QUALER       CHECK FOR QUALIFIER                  24900021
*                                                                       24920021
*                                                                       24940021
       EJECT                                                            24960021
       EJECT                                                            24980021
IKF302A  CSECT                                                    39847 25000021
COMON2A  EQU   *                                                  39847 25020021
*=1      GENOP  GENERATES P1 OPERAND                              39847 25040021
*******************************************************************     25060021
*                                                                       25080021
*                                                                       25100021
*                            G E N O P                                  25120021
*                                                                       25140021
*      BAL     RCS,GENOP                                                25160021
*      (RETURN)                                                         25180021
*                                                                       25200021
*                                                                       25220021
*FUNCTION                                                               25240021
*   GENERATES P1 TEXT ELEMENTS FOR PROCEDURE NAMES, FILE NAMES, DAT     25260021
*   NAMES AND OVERFLOW NAMES.  RESOLVES DATA NAMES AND/OR FILE NAME     25280021
*   HAVING OCCURS DEPENDING ON CLAUSE AND CONDITION NAMES.              25300021
*                                                                       25320021
*SUBROUTINES CALLED                                                     25340021
*   FILENM, OVFLNM, ISGROC, COS, ERROR, LATRPT, GENDAT, CONDNM, EOF     25360021
*                                                                       25380021
*NOTES                                                                  25400021
*   THE QVAR TABLE EACH ENTRY HAS 6 BYTES LENGTH, DICTIONARY POINTE     25420021
*   (4 BYTES), AND GN= (2 BYTES).  IF DICTIONARY POINTER EQUAL TO F     25440021
*   INDICATES END OF THE QVAR TABLE.                                    25460021
*                                                                       25480021
*                                                                       25500021
*******************************************************************     25520021
       SPACE   3                                                        25540021
GENOP  EQU   *                                                          25560021
       ST    RCS,SAVGNP                                                 25580021
       ST      RWC,WKARSV                                               25600021
         MVI   WKARSV,XX04                                              25620021
       LA      RWA,WKARSV                                               25640021
       L       RAS,ALTRPT                                               25660021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           25680021
         TM    DX0(RWB),XX08                                            25700021
       BC    ZERO,DATANM           DATA NAME                            25720021
         TM    DX0(RWB),MMJPRO                                          25740021
         BC    NOTONE,GENOP0       CHECK CONDITION NAME                 25760021
         TM    DX0(RWB),INDNM                                           25780021
       BC      NOTONE,PRONAM      PROCEDURE NAME                        25800021
       BO    IDNM1                      INDEX NAME                      25820021
GENOP0 EQU     *                                                        25840021
         CLI   DX0(RWB),MMJCND                                          25860021
       BC      EQ,CONDNM           CONDITION NAME                       25880021
         TM    DX0(RWB),MRDNAM      RD NAME                             25900021
         BC    ONES,RDERR          YES - ERROR                          25920021
       CLI   FRST(RWB),MAJCFD          IS IT FD                         25940021
       BE    FILENM                    YES, GO PROCESS                  25960021
       CLI   FRST(RWB),RANPFD          RANDOM PROC. FD                  25980021
       BE    FILENM                    YES                              26000021
         CLI   COVERB+NX1,MSORT         IS VERB SORT                    26020021
       BNE   SORTNM                    NO                               26040021
       TM    READSW,SWON               CALLED BY READ VERB              26060021
       BZ    RDFN5                      ES                              26080021
       B     SORTNM                    MUST BE SD                       26100021
*                                                                       26120021
GENOP1 L     RCS,SAVGNP            EXIT RETURN FOR ALL BRANCHES         26140021
         BCR   UNCOND,RCS          GO REG ADDRESS                       26160021
*                                                                       26180021
*=E      0020  REPORT NAME ILLEGAL AS USED. DISCARDED.                  26200021
*                                                                       26220021
RDERR    EQU   *                                                        26240021
         CNOP  2,4                                                      26260021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            26280021
         DC    X'1420'                                                  26300021
         BC    UNCOND,GENOP1       GO TO RETURN FROM ALL BRANCHES       26320021
*                                                                       26340021
*                                                                       26360021
*                                                                       26380021
*                                                                       26400021
*=2    DATANM      GENERATES DATA OPERAND                               26420021
*                                                                       26440021
*                                                                       26460021
*                                                                       26480021
DATANM EQU   *                                                          26500021
*                                                                       26520021
       ST    R14,CONSAV                FOR CONDITION NAMES              26540021
       SR    RWF,RWF               INIT COUNT OF BYTES BEYOND 1ST 8     26560021
       MVI   WKAREA,MDN            ENTER DATA NAME HEADER               26580021
         MVC   DNMATT(LX9),FRST(RWB)    ATTRIBUTES TO WKAREA+2          26600021
         MVO   DNMATT(LX1),DNMAT5(LX1)  MOVE BITS 4-7 TO 0-3            26620021
         BAL   RCS,GETLVL              GET LEVEL NUMBER                 26640021
         NI    DNMAT6,MSKFST            ZERO BITS 0-5                   26660021
         BCT   RWD,NOT01               IS IT LEVEL 01                   26680021
         XI    DNMAT6,BIT4             SET BIT 4 ON                     26700021
         B     MVBYTE              GO GET BYTE FOR MINOR CODE           26720021
NOT01    C     RWD,LEV77               IS IT LEVEL 77                   26740021
         BNE   MVBYTE                  NO                               26760021
         XI    DNMAT6,BIT5             SET BIT 5 ON                     26780021
MVBYTE   MVZ   DNMAT6(LX1),DNMAT5       MOVE HIGH ORDER BITS            26800021
         MVC   DNMAT5(LX3),DNMAT6       DELETE 6TH BYTE                 26820021
         MVO   WKBYTE(LX2),DX1(LX1,RWB) GET MINOR CODE                  26840021
       CLI   WKBYTE,MRPT                                                26860021
       BC    EQ,RPRTNM             REPORT                               26880021
       CLI   WKBYTE,MSRPT                                               26900021
       BC    EQ,RPRTNM             STERLING REPORT                      26920021
       CLI   WKBYTE,MSNRPT                                              26940021
       BC    EQ,STNRPT             STERLING NON-REPORT                  26960021
       CLI   GOTTEN,RPTCOD             WITH CODE OPTION                 26980021
       BNE   MVBYT1                    NO                               27000021
       OI    DNMAT5,WTHCOD             WITH CODE BIT FOR PH5            27020021
         B     TIFGOC              GO CHK OCCUR GRP POINTER             27040021
MVBYT1 CLI   WKBYTE,MANEDT             ALPHA-NUM EDITED                 27060021
       BNE   TIFGOC                    NO                               27080021
*                                                                       27100021
* REPORT ITEM                                                           27120021
*                                                                       27140021
RPRTNM   IC    RWF,DNMATT+NX6       PICK UP VARIABLE COUNT              27160021
         LA    RWD,END(RWB)            POINT TO 10TH BYTE               27180021
       BAL   RCS,ISGROC            IS THERE PTR TO GROUP WITH OCCUR     27200021
       BC    UNCOND,RPT2           NO                                   27220021
         LA    RWD,DX3(RWD)         YES-DELETE PTR                      27240021
       S     RWF,N3                REDUCE COUNT CORRESPONDINGLY         27260021
RPT2   BCTR  RWF,RA0                 8TH BYTE WILL BE DELETED.          27280021
         STC   RWF,DNMATT+NX6       ENTER UPDATED COUNT                 27300021
         BCTR  RWF,RA0             GO TO TABLE POSITION                 27320021
       EX    RWF,MOVRPT            MOVE VARIABLE FIELD                  27340021
         BC    UNCOND,TIFGOC       GO CHK OCCUR GRP POINTER             27360021
MOVRPT   MVC   DNMATT+NX7(LX1),DX0(RWD)                                 27380021
*                                                                       27400021
*                                                                       27420021
* INDEX NAME.  REQUIRES DIFFERENT PROCESSING THAN OTHER                 27440021
* DATA NAMES.                                                           27460021
*                                                                       27480021
*                                                                       27500021
IDNM1    MVI   WKAREA,XX36              HEARDER                         27520021
         MVI   WKAREA+NX1,XX08                                          27540021
         MVC   DNMATT(LX6),FIRST(RWB)   MOVE ATTRIBUTES                 27560021
         MVZ   DNMATT(LX1),DNMATT+NX1    MOVE FLAG BYTE                 27580021
         MVC   DNMATT+NX1(LX4),DNMATT+NX2 DELETE BYTE                   27600021
         MVC   DNMATT+NX5(LX3),WKARSV+NX1 APPEND DICT PTR               27620021
       LA    RWB,WKAREA                                                 27640021
         BAL   RCS,GENDAT          GO CHK OCCUR GRP POINTER             27660021
         B     GENOP1              GO TO RETURN FROM ALL BRANCHES       27680021
*                                                                       27700021
* STERLING NON-REPORT                                                   27720021
*                                                                       27740021
STNRPT   LA    RWD,END(RWB)            POINT TO 10TH BYTE               27760021
       BAL   RCS,ISGROC            IS THERE PTR TO GROUP WITH OCCUR     27780021
       BC    UNCOND,ST2            NO                                   27800021
         LA    RWD,DX3(RWD)         YES-SKIP IT                         27820021
ST2      MVC   DNMATT+NX8(LX1),DX0(RWD) ENTER BYTE 9 OR 12              27840021
         LA    RWF,DX1(RWF)         INDICATE 1 EXTRA BYTE               27860021
         BC    UNCOND,TIFGOC       GO CHK OCCUR GRP PTR                 27880021
*                                                                       27900021
*                                                                       27920021
*      IF CURRENT DATA NAME IS SUBORDINATED TO EITHER ONE OR MORE G     27940021
*      ITEMS OR ELEMENTARY ITEM HAVING OCCURS DEPENDING ON CLAUSE,A     27960021
*      BIT OF ATTRIBUTE IS ON, THE DICT. PTR. IS SEARCHED FOR IN QV     27980021
*      TABLE. WHEN FOUND, THE 1ST GN= AND NN ARE APPENDED TO THE AT     28000021
*      THE NEW ATTR. LENGTH IS INDICATED IN THE COUNT PRECEEDING TH     28020021
*      ATTR. NN=0 IF ELEMENTARY ITEM, NN=GNCT-1 IF GROUP ITEM.          28040021
*                                                                       28060021
DNQ    LA      RWA,WKARSV                                               28080021
       L       RAS,ALTRPT                                               28100021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           28120021
         XC    GNCT(LX2),GNCT                                           28140021
         TM    QBYTE(RWB),MQBIT        IS Q BIT ON                      28160021
       BC      ZERO,ENTII         NO - GO APPEND INTERNAL IDENTIFIE     28180021
*                                                                       28200021
*                                                                       28220021
*      Q BIT ON.                                                        28240021
*      OBTAIN QVAR TABLE VIA COS, MOVE TAMER ADDR FOR COMMON            28260021
*                                                                       28280021
DNQ2   L       RWA,COSADR                                               28300021
       A       RWA,AQVAR                                                28320021
         L     RWA,DX0(RWA)         RWA=A(TAMM)                         28340021
         L     RWA,DX0(RWA)         RWA=A(QVAR)                         28360021
         LA    RWA,DX0(RWA)                                             28380021
       LPR     RWD,RWA             SAVE 1ST ADDR OF QVAR                28400021
         TM    DX1(RWB),MGROUP      ON, IS DN A GROUP FIXED             28420021
       BC      ZERO,DNQ5           YES, GROUP FIXED                     28440021
         TM    DX1(RWB),MGRVAR      NO, IS IT GROUP VARIABLE            28460021
       BC      NOTZER,DNQ21        NO, NOT A GROUP ITEM, MUST BE EL     28480021
*                                                                       28500021
*                                                                       28520021
*                                                                       28540021
*      OBTAIN DICTIONARY POINTER OF THE ENTRY WHICH DELIMITS THE        28560021
*      GROUP OR SECTION FROM DICTIONARY.                                28580021
*                                                                       28600021
*                                                                       28620021
*                                                                       28640021
DNQ5   EQU     *                                                        28660021
         LA    RWA,DX0(RWB)         PT TO 1ST BYTE OF ATTR              28680021
       SR      RWE,RWE                                                  28700021
         IC    RWE,ERAREA+NX1       GET CURRENT ITEM                    28720021
         LA    RWE,DX4(RWE)                                             28740021
       SR    RWA,RWE                                                    28760021
         MVC   WKWORD+NX1(LX3),DX0(RWA)                                 28780021
       L     RWA,WKWORD            GET DELIMITER POINTER ENTRY          28800021
         SLL   RWA,DX10                                                 28820021
         SRL   RWA,DX10             GET RID OFF 1ST 2 BITS              28840021
DNQ7   STM     RWA,RWC,SVDLNY     SAVE DELM,START ADDR,DIC PTR ENTR     28860021
*                                                                       28880021
*                                                                       28900021
*      GROUP ITEM, Q ON, CHECK IF GROUP DIC PTR LESS THAN QVAR ENTR     28920021
*      AND QVAR ENTRY LESS THAN GROUP DELIMITER. IF GROUP DELIMITER     28940021
*      DIC PTR IS LESS THAN OR EQUAL TO QVAR ENTRY STOP SEARCHING A     28960021
*      PROCESSING.                                                      28980021
*                                                                       29000021
*                                                                       29020021
DNQ9   EQU     *                                                        29040021
       LPR     RWA,RWD             STORE ADDR. OF QVAR BACK IN RWA      29060021
DNQ10  EQU     *                                                        29080021
         CLC   SVDLNY+NX9(LX3),DX1(RWA) IS GR DIC PTR LESS THAN QVAR EN 29100021
       BC      LO,DNQ11            YES                                  29120021
         LA    RWA,DX6(RWA)         HIGER OR EQUAL, ADVANCE QVAR TAB    29140021
       BC      UNCOND,DNQ10       LOOP AND SEARCH QVAR                  29160021
DNQ11    MVC   SAVGN(LX2),DX4(RWA)   SAVE 1ST GN=                       29180021
       LPR     RWD,RWA             SAVE THIS ENTRY PT.                  29200021
DNQ13  EQU     *                                                        29220021
         CLC   SVDLNY+NX1(LX3),DX1(RWA) IS GR DELM GREATER THAN QVARS   29240021
         BC    HI,DNQ16            BRANCH                               29260021
*                                                                       29280021
*      GR DIC PTR LESS THAN QVAR ENTRY, GR DELM DIC PTR IS LESS OR      29300021
*      EQUAL QVAR ENTRY. GOOD GN= FOUND, PROCESS NN.                    29320021
*                                                                       29340021
*                                                                       29360021
DNQ14  EQU     *                                                        29380021
       ST      RWA,SVPRWA                                               29400021
       SR    RA0,RA0                                                    29420021
       SLR     RWA,RWD             CURRENT QVAR ENTRY MINUS 1ST ENT     29440021
       D     RA0,N6               DIVIDED BY 6                          29460021
       BCTR  RWA,RA0              SUBTRACT 1 FROM ACTUAL COUNT          29480021
       STH     RWA,GNCT           STORE NN IN GNCNT                     29500021
       L       RWA,SVPRWA                                               29520021
       BC      UNCOND,DNQ23        GO TO GENERATE                       29540021
DNQ16    CLC   DX0(LX4,RWA),GZEROS   IS END OF QVAR TABLE               29560021
       BC      EQ,DNQ14            GO TO PROCESS                        29580021
         LA    RWA,DX6(RWA)         ADVANCE QVAR                        29600021
       BC      UNCOND,DNQ13        CONTINUE TO SEARCH                   29620021
*                                                                       29640021
*                                                                       29660021
*      ELEMENTARY ITEM WITH Q BIT ON, SEARCH FOR MATCHED DIC PTR IN     29680021
*      QVAR TABLE                                                       29700021
*                                                                       29720021
*                                                                       29740021
DNQ21  STM     RWA,RWC,SVDLNY                                           29760021
         CLC   SVDLNY+NX9(LX3),DX1(RWA) DOES DIC PTR EQUAL QVAR DIC PTR 29780021
       BC      LO,DNQ27            COMPILER ERROR                       29800021
         BC    HI,DNQ25            BRANCH                               29820021
*                                                                       29840021
*      MATCHED DIC PTR FOR ELEM ITEM IS FOUND IN QVAR TABLE             29860021
*                                                                       29880021
         MVC   SAVGN(LX2),DX4(RWA)   SAVE GN FOR O/P                    29900021
         NI    GNCT+NX1,XX00        ZERO TO NN - (GN CT)                29920021
DNQ23    LA    RWE,WKAREA+NX10                                          29940021
       AR      RWE,RWF            POINT RWE TO END OF ATTRIBUTES        29960021
         MVC   DX0(LX1,RWE),GNCT+NX1  ENTER GN-COUNT                    29980021
         MVC   DX1(LX2,RWE),SAVGN      GN NUMBER                        30000021
         LA    RWF,DX3(RWF)        3 EXTRA BYTES NOW                    30020021
       BC      UNCOND,ENTII        GO TO GENERATE DATA OPERAND          30040021
*                                                                       30060021
*                                                                       30080021
DNQ25    LA    RWA,DX6(RWA)         ADVANCE QVAR 1 STEP                 30100021
         CLC   DX0(LX4,RWA),GZEROS   IS END OF QVAR TABLE               30120021
         BC    NOTEQ,DNQ21         BRANCH                               30140021
       BC      UNCOND,DNQ29        EOT  COMPILER ERROR                  30160021
*                                                                       30180021
*                                                                       30200021
*                                                                       30220021
*                                                                       30240021
*                                                                       30260021
*=E    0013    Q ON, ELEM ITEM, DIC PTR LESS THAN QVAR ENTRY            30280021
*              FOR -- IN -- STATEMENT.                                  30300021
*                                                                       30320021
*                                                                       30340021
DNQ27  EQU     *                                                        30360021
       CNOP    2,4                                                      30380021
         BAL   RCS,ERROR           GO HANDE ERROR CONDITION             30400021
       DC     X'0D80'                                                   30420021
         BC    UNCOND,EOF          EWD OR FILE PROCEDURE                30440021
*                                                                       30460021
*                                                                       30480021
*                                                                       30500021
*                                                                       30520021
*=E    0014    Q ON, ELEM ITEM, NO MATCHED DIC PTR -- FOUND IN          30540021
*=             -- STATEMENT.                                            30560021
*                                                                       30580021
*                                                                       30600021
DNQ29  EQU     *                                                        30620021
       CNOP    2,4                                                      30640021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            30660021
       DC    X'0E80'                                                    30680021
         BC    UNCOND,EOF          END OF FILE PROCEDURE                30700021
*                                                                       30720021
*                                                                       30740021
*                                                                       30760021
*                                                                       30780021
* IF CURRENT ITEM IS SUBORDINATE TO ONE OR MORE GROUP ITEMS HAVING      30800021
* OCCURS CLAUSES, APPEND LENGTHS OF THOSE GROUPS, MOST IMMEDIATE        30820021
* GROUP FIRST.                                                          30840021
*                                                                       30860021
TIFGOC BAL   RCS,ISGROC            IS THERE PTR TO GROUP WITH OCCUR     30880021
       BC      UNCOND,DNQ         NO - SEE IF Q BIT ON                  30900021
         MVC   LPTPRM+NX1(LX3),END(RWB)  NOTE PTR TO LATPTR PARM        30920021
         LA    RWE,WKAREA+NX10                                          30940021
       AR    RWE,RWF               POINT RWE TO NEXT AVAILABLE BYTE     30960021
       L     RWA,ALPTPR                                                 30980021
       L     RAS,ALTRPT                                                 31000021
       BALR  RCS,RAS               CALL LATRPT TO LOCATE GROUP ITEM     31020021
         TM    DX1(RWB),MGROUP      IS IT GROUP FIXED                   31040021
       BC    NOTZER,GETVLC         NO-GO GET VLC                        31060021
         MVC   FRST(LX3,RWE),LNGTH(RWB)  MOVE IN LENGTH                 31080021
         NI    DX0(RWE),XX01        ZERO HI 7 BITS (ALLOW 17 FOR LEN    31100021
       BC    UNCOND,GETVL1         GO UPDATE COUNT                      31120021
GETVLC   MVI   DX0(RWE),XX80        SET VLC FLAG                        31140021
         MVC   DX1(LX2,RWE),LENGTH(RWB)  ENTER VLC                      31160021
GETVL1   LA    RWF,DX3(RWF)         UPDATE COUNT                        31180021
       BC    UNCOND,TIFGOC         GO CHECK IF ANOTHER LEVEL OF OCC     31200021
*                                                                       31220021
* ENTER INTERNAL IDENTIFIER AND COUNT                                   31240021
*                                                                       31260021
ENTII    LA    RWE,WKAREA+NX10                                          31280021
       AR    RWE,RWF               POINT RWE TO NEXT AVAILABLE BYTE     31300021
       ST    RWC,WKWORD                                                 31320021
         MVC   DX0(LX3,RWE),WKWORD+NX1 ENTER I.I. (DIC PTR)             31340021
         LA    RWF,DX11(RWF)        ADD 11 FOR FIXED ATTRIBUTES,I.I.    31360021
         STC   RWF,WKAREA+NX1       ENTER IC-TEXT COUNT BYTE.           31380021
*                                                                       31400021
* GENERATE DATA OPERAND                                                 31420021
*                                                                       31440021
ENTIII LA      RWB,WKAREA                                               31460021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                31480021
         TM    CONDSW,XX10              CONDITION NAME                  31500021
       BC    NOTONE,GENOP1             RETURN                           31520021
       L     R14,CONSAV                RETURN TO CONDITION NAME RTN     31540021
       BR    R14                             TO PROCESS REST            31560021
SORTNM DS    0H                                                         31580021
       MVI   WKAREA,MFDREF             ENTER HEADER                     31600021
         MVI   WKAREA+NX1,XX0B          STORE COUNT                     31620021
         MVC   WKAREA+NX2(LX8),DX0(R2)   MOVE ATTRIBUTES                31640021
       ST    RWC,WKWORD                                                 31660021
         TM    DX1(RWB),MFQBIT          IS Q-BIT ON               39847 31680021
         BC    ONES,SORTQ               YES, SEARCH QFILE TBL     39847 31700021
         MVC   WKAREA+NX10(LX3),WKWORD+NX1 ADD DICT PTR                 31720021
SORTNM1  LA    RWB,WKAREA               ADDR OF WKAREA            39847 31740021
       LA    RWB,WKAREA                                                 31760021
       BAL   RCS,GENDAT                GO GENERATE SD                   31780021
       B     GENOP1                    RETURN                           31800021
*        QFILE  TEST ENTRIES FOR SD                               39847 31820021
SORTQ    EQU   *                                                  39847 31840021
         MVI   WKAREA+NX1,XX0E          COUNT FOR THE ENTRY       39847 31860021
         L     RWA,COSADR               ADDR OF PHASE 0           39847 31880021
         A     RWA,AQFILE               GET QFILE ABSOLUTE ADDR   39847 31900021
         L     RWA,DX0(RWA)             RWA = A(TAMM)             39847 31920021
         LTR   RWA,RWA             IS TABLE EMPTY                 59701 31940021
         BZ    SORTQ3              IF SO, SKIP LOOKUP             59701 31960021
         L     RWA,DX0(RWA)             RWA = A(TABLE)            39847 31980021
SORTQ0   CLI   DX0(RWA),XX09            IS THIS AN SD ENTRY       39847 32000021
         BC    EQ,SORTQ2                YES, CHK FOR MATCHING BLL 39847 32020021
         CLC   DX0(LX2,RWA),GZEROS      NO, AT END OF TBL ...     39847 32040021
         BC    EQ,SORTQ3                YES, STORE ZEROS          39847 32060021
SORTQ1   LA    RWA,DX4(RWA)             NO, INCR QFILE TBL PTR    39847 32080021
         BC    UNCOND,SORTQ0            LOOP & MATCH SD           39847 32100021
SORTQ2   CLC   DX2(LX1,RWB),DX1(RWA)       DO BLL'S MATCH         39847 32120021
         BC    EQ,SORTQ4                YES-APPEND GN NUMBER      39847 32140021
         BC    UNCOND,SORTQ1             SEARCH FURTHER           39847 32160021
*   Q-BIT ON, NO MATCHING BLL, GIVE NUMBER 0 AS SIGNAL TO PHASE5  39847 32180021
SORTQ3   EQU   *                                                  39847 32200021
         LA    RWA,GZEROS                                         39847 32220021
*   MATCHED BLL FOR SD IS FOUND IN TABLE                          39847 32240021
SORTQ4   EQU   *                                                  39847 32260021
         MVC   WKAREA+NX10(LX1),GZEROS   GN CNT = 0               39847 32280021
         MVC   WKAREA+NX11(LX2),DX2(RWA)   GN NUMBER              39847 32300021
         MVC   WKAREA+NX13(LX3),WKWORD+NX1 DICT PTR               39847 32320021
         BC    UNCOND,SORTNM1            GENERATE OPERAND         39847 32340021
*                                                                       32360021
*                                                                       32380021
*                                                                       32400021
*   FOR CONDITION NAME SUBSTITUTE CONDITIONAL VARIABLE                  32420021
*   RELATIONAL AND LITERAL                                              32440021
*                                                                       32460021
CONDNM EQU   *                                                          32480021
COND00 DS    0H                                                         32500021
         TM    DX5(RWB),THRUSW          VALUE IS SERIES                 32520021
       BZ    COND10                     NO                              32540021
         MVC   CONPTR(LX2),DX7(RWB)      DISPL PTR TO TABLE             32560021
       OI    CONDSW,SWON                TURN ON SW                      32580021
       LR    RWC,RWB                                                    32600021
       LA    RWB,LPAREN                                                 32620021
       BAL   RCS,GENDAT                GENERATE LEFT PAREN              32640021
       LR    RWB,RWC               RESTORE RWB                          32660021
         B     COND20              GO SAVE DICTIONARY PTR               32680021
COND10   MVC   CONPTR(LX4),WKARSV       SAVE PTR TO 88                  32700021
COND20   MVC   WKARSV(LX4),DX1(RWB)       DICT PTR FOR LD               32720021
       L     RWC,WKARSV                FOR DATANM                       32740021
         MVC   LPTPRM+NX1(LX3),WKARSV+NX1 PUT IN LATRPT PARAM           32760021
         MVI   WKARSV,XX04               SET 1ST BYTE                   32780021
       L     RWA,ALPTPR                                                 32800021
       L     RAS,ALTRPT                                                 32820021
       BALR  RCS,RAS                    LOCATE ENTRY                    32840021
         OI    CONDSW,XX10               COND NAME SW                   32860021
       BAL   R14,DATANM                 GO GENERATE DATA OPERAND        32880021
       BAL   RCS,GETNXT                CHECK IF SUBSCRIPTED             32900021
         CLC   GOTTEN(LX2),LPAREN       IS IT LEFT PAREN                32920021
       BNE   COND30                    NO                               32940021
         NI    CONDSW,XXEF          TURN OFF SW                         32960021
       BAL   RCS,COPREN                YES, GO PROCESS SUBSCRIPT        32980021
         OI    CONDSW,XX10              TURN BACK ON                    33000021
COND30 TM    CONDSW,SWON               VALUE IS SERIES                  33020021
       BO    COND50                     YES, GO PROCESS                 33040021
       LA    RWB,EQUALS                 NO, FINISH STRING               33060021
       BAL   RCS,GENDAT                 GENERATE EQUALS                 33080021
         MVC   LPTPRM+NX1(LX3),CONPT1    MOVE 88 PTR                    33100021
       L     RWA,ALPTPR                                                 33120021
       L     RAS,ALTRPT                                                 33140021
       BALR  RCS,RAS                    LOCATE 88                       33160021
         LA    RWD,DX7(RWB)              ADD OF LITERAL                 33180021
       LR    RWB,RWD                                                    33200021
       BAL   RCS,GENDAT                 GENERATE LITERAL                33220021
         XC    CONDSW(LX1),CONDSW                                       33240021
       B     PHCTR1                    RETURN WITH NEXT ELEMENT         33260021
COND50 L     RWA,COSADR                                                 33280021
       A     RWA,AVALTR                                                 33300021
         L     RWA,DX0(RWA)                                             33320021
         L     RWA,DX0(RWA)                                             33340021
       AH    RWA,CONPTR                POINT TO PROPER ENTRY            33360021
         TM    DX0(RWA),XX80             THRU OPTION                    33380021
       BZ    COND80                    NO                               33400021
       ST    RWB,VALSV1                                                 33420021
COND60 LA    RWB,LPAREN                                                 33440021
       BAL   RCS,GENDAT                GENERATE LEFT PAREN              33460021
       LA    RWB,NOT                                                    33480021
       BAL   RCS,GENDAT                GENERATE NOT                     33500021
       LA    RWB,LESSTH                                                 33520021
       BAL   RCS,GENDAT                GENERATE LESS THAN               33540021
         NI    DX0(RWA),XX7F             TURN OFF THRU                  33560021
         LA    RWB,DX1(RWA)             GET ADDRESS OF LITERAL          33580021
       BAL   RCS,GENDAT                 GO GENERATE                     33600021
       LA    RWB,AND                                                    33620021
       BAL   RCS,GENDAT                 GENERATE AND                    33640021
       SR    RWD,RWD                                                    33660021
         IC    RWD,DX0(RWA)                                             33680021
         OI    DX0(RWA),XX80            TURN BACK ON                    33700021
         LA    RWA,DX1(RWD,RWA)          POINT TO NEXT LITERAL          33720021
       ST    RWA,VALSAV                                                 33740021
*                                                                       33760021
*                                                                       33780021
       LA    RWB,NOT                                                    33800021
       BAL   RCS,GENDAT                GENERATE NOT                     33820021
       LA    RWB,GRTRTH                                                 33840021
       BAL   RCS,GENDAT                GENERATE GREATER THAN            33860021
       L     RWA,VALSAV                GET ADDRESS OF LITERAL           33880021
         LA    RWB,DX1(RWA)              STARTING ADDRESS OF LITERAL    33900021
       BAL   RCS,GENDAT                 GO GENERATE LITERAL             33920021
       LA    RWB,RPAREN                                                 33940021
         BAL   RCS,GENDAT          GENERATE INTERPH CODE                33960021
       SR    RWD,RWD                                                    33980021
         IC    RWD,DX0(RWA)                                             34000021
         LA    RWA,DX1(RWD,RWA)          POINT TO NEXT ENTRY            34020021
         CLI   DX0(RWA),XXFF             END OF THIS ENTRY              34040021
         BNE   COND70                  NO, GO PROCESS                   34060021
         XC    CONDSW(LX1),CONDSW                                       34080021
       LA    RWB,RPAREN                                                 34100021
       BAL   RCS,GENDAT                GENERATE RIGHT PAREN             34120021
       B     PHCTR1                    RETURN WITH NEXT ELEMENT         34140021
COND70 LA    RWB,OR                                                     34160021
       BAL   RCS,GENDAT                 GO GENERATE OR                  34180021
*                                                                       34200021
*                                                                       34220021
         TM    DX0(RWA),XX80             NO, VALUE IS SERIES            34240021
       BZ    COND80                     NO                              34260021
       B     COND60                     YES                             34280021
COND80 LA    RWB,EQUALS                                                 34300021
       BAL   RCS,GENDAT                 GO GENERATE EQUALS              34320021
         LA    RWB,DX1(RWA)              ADDRESS OF LITERAL             34340021
       BAL   RCS,GENDAT                 GO GENERATE LITERAL             34360021
       SR    RWD,RWD                                                    34380021
         IC    RWD,DX0(RWA)              COUNT OF ENTRY                 34400021
         LA    RWA,DX1(RWD,RWA)          POINT TO NEXT ENTRY            34420021
         CLI   DX0(RWA),XXFF             END OF ENTRY                   34440021
       BNE     COND70                          K ON                     34460021
         XC    CONDSW(LX1),CONDSW                                       34480021
       LA    RWB,RPAREN                                                 34500021
       BAL   RCS,GENDAT                GENERATE RIGHT PAREN             34520021
       B     PHCTR1                    RETURN WITH NEXT ELEMENT         34540021
*                                                                       34560021
*                                                                       34580021
* =E   0029  CONDITION NAME ILLEGAL AS USED IN **** STATEMENT. ****     34600021
*                                                                       34620021
*                                                                       34640021
CONDER EQU   *                                                          34660021
       CNOP  2,4                                                        34680021
       BAL   RCS,ERROR                  GEN MSG 29                      34700021
       DC    X'1D21'                                                    34720021
       DC    A(COVERB)                  PUT IN PARAMETER                34740021
       LA    RWB,ERSYM1                                                 34760021
       BAL   RCS,GENDAT                 GEN ERROR SYMBOL                34780021
       B     PHCTRL                     RETURN TO PROCESS  NEXT         34800021
*                                                                       34820021
*                                                                       34840021
*=2    PRONAM      GENERATES PROCEDURE-NAME OPERAND                     34860021
*                                                                       34880021
*                             PROCEDURE NAME                            34900021
*                                                                       34920021
PRONAM EQU   *                                                          34940021
       STM   RWB,RWC,SAVREG                                             34960021
         MVC   SECNUM(LX2),SECTNO(RWB)  SAVE SECTION NUM                34980021
       L     RWA,COSADR                                                 35000021
       TM    PHZSW1,XREF               IS XREF SPECIFIED                35020021
         BZ    PROCNM              CHECK OUT SEGMENTATION               35040021
       CLI   GOTTEN,MLHPNI             IS IT LEFT-HAND NAME             35060021
       BC    NOTEQ,PROCNM              NO                               35080021
         TM    DX2(RWB),DUMYPN          IS IT DUMMY PN                  35100021
       BO    PROCNM                    YES                              35120021
*                                                                       35140021
*                                                                       35160021
*WRITE PN DEF XREF ELEMENT FOR PHASE6                                   35180021
*                                                                       35200021
*                                                                       35220021
       SR    RWC,RWC                                                    35240021
         IC    RWC,GOTTEN+NX1           GET NAME COUNT                  35260021
       EX    RWC,SAVNM                 SAVE EXTERNAL NAME               35280021
       MVI   WKAREA,XREFHDR            MOVE HEADER                      35300021
         MVC   WKARE1(LX2),SECTNO(RWB)  PN NUMBER                       35320021
       L     RWA,COSADR                                                 35340021
         MVC   WKAREA+NX3(LX2),CURCRD    MOVE CARD NUMBER               35360021
       EX    RWC,MOVBCK                                                 35380021
         LA    RWC,DX6(RWC)             UPDATE COUNT                    35400021
       L     RWA,COSADR                                                 35420021
       LA    RWB,WKAREA                                                 35440021
       BALR  RA0,RWA                   GO WRITE ON F4                   35460021
       DC    X'14'                                                      35480021
       LM    RWB,RWC,SAVREG            RESTORE REGS                     35500021
PROCNM   LA    RWD,DX6                  INIT COUNT TO 6                 35520021
         TM    DX1(RWB),MSECNM                                          35540021
         BZ    PRONB               SAVE SECTION POINTERS                35560021
         MVC   SAVSEC(LX2),NEXTSC(RWB)  SAVE IN CASE 1ST                35580021
*                                                                       35600021
* SEE IF PROGRAM SEGMENTED. IF SO, SEE IF PRIORITY NUMBER               35620021
* IS DIFFERENT. IF SO GENERATE CONTROL BREAK.                           35640021
*                                                                       35660021
       TM    CARDSW,SEGT               SEGMENTED                        35680021
       BZ    SECA                      NO                               35700021
         CLC   PRTYNO(LX1,RWB),CURRPTY  IN SAME SEGMENT                 35720021
         BE    SECA                CHECK SECTION NUMBER                 35740021
         MVC   CURRPTY(LX1),PRTYNO(RWB)     NEW PRIORITY NUMBER         35760021
       L     RWF,SAVREG                INSERT DESTROYS RWB              35780021
       LA    RWB,CNTRLBK                                                35800021
       BAL   RCS,GENDAT                GENERATE CONTROL BREAK           35820021
       LM    RWB,RWC,SAVREG                                             35840021
* SECTION NAME                                                          35860021
SECA   EQU   *                                                          35880021
         CLC   NXTSEC(LX2),ZEROS         IS THIS 1ST SECTION NAME       35900021
         BNE   NOTSAV                   NO                              35920021
         ST    RWC,SAVPNP               PTR TO 1ST                      35940021
         MVC   NXTSEC(LX2),SAVSEC       NEXT SECTION NUMBER             35960021
         LR    R2,RWC                                                   35980021
         L     R15,DLDINC               ADD. DINCOR                     36000021
         BALR  R14,R15             GO TO REG ADDRESS                    36020021
         TM    FIRST(R2),DMPFT1         IS THERE DICT PTR               36040021
         BZ    SEC1                     NO                              36060021
         LA    R2,DX3(R2)                UPDATE PAST DICT PTR           36080021
SEC1     MVC   SAVPN3(LX3),FIRST(R2)     SAVE DELM. PTR.                36100021
NOTSAV   LA    RWD,DX2(RWD)              ADD 2 TO COUNT                 36120021
       CLI   GOTTEN,MLHPNI         IS IT LEFT-HAND NAME                 36140021
       BC    NOTEQ,PRON3           NO                                   36160021
       ST    RWC,SECPTR            YES-SAVE PTR TO CHK IMPLICIT QUA     36180021
         BC    UNCOND,PRON2        HANDLE PNDEF HEADER                  36200021
SAVNM    MVC   QERPRM(LX1),WKARE1                                       36220021
MOVBCK   MVC   WKAREA+NX5(LX1),QERPRM                                   36240021
*                                                                       36260021
* PARAGRAPH NAME                                                        36280021
*                                                                       36300021
PRONB    LR    RWF,RWB                 SAVE PTR TO CURRENT SECT         36320021
         LR    RWE,RWC           SAVE DICT PTR FOR COMPARISON           36340021
         CLC   SECTNO(LX2,RWB),NXTSEC    IN 1ST SECTION                 36360021
         BL    GETPTY                   YES                             36380021
         L     R2,SAVPN2                PTR TO NEXT SECTION             36400021
         MVC   LPTPR1(LX3),SAVPN3           SAVE DELIM PTR IN CASE 2ND  36420021
         NI    LPTPR1,XX3F          TURN OFF DELIM BIT                  36440021
GETPN    L     R15,DLDINC              ADDRESS OF DINCOR                36460021
         BALR  R14,R15                  GET ADD. ENTRY                  36480021
         TM    FIRST(R2),DMPFT1         IS THERE DICT PTR               36500021
         BZ    PRONA                    NO                              36520021
         LA    R2,DX3(R2)                UPDATE PAST DICT PTR           36540021
PRONA    MVC   PTRTEMP+NX1(LX3),DX0(R2)       PTR TO NEXT SECTION       36560021
         NI    PTRTEMP+NX1,XX3F        TURN OFF DELIM BIT               36580021
         C     RWE,PTRTEMP         IS THE PRGPH NAME IN THIS SEC        36600021
         BL    GETPTY1               YES                                36620021
         L     R2,PTRTEMP                PTR TO NEXT SECTION            36640021
         MVC   LPTPR1(LX3),PTRTEMP+NX1                                  36660021
         B     GETPN              GET PTR TO NEXT SECTION               36680021
GETPTY   MVC   LPTPR1(LX3),SAVPN1        PTR TO FIRST                   36700021
GETPTY1  L     RWA,ALPTPR               ADD PARAM                       36720021
         L     RAS,ALTRPT               ADD. LATRPT                     36740021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           36760021
PRON     MVC   WKARE7(LX1),PRTYNO(RWB)   APPEND PRIORITY NO.            36780021
PRON1  CLI   GOTTEN,MLHPNI         IS IT LEFT HAND NAME                 36800021
       BC    NOTEQ,PRON3           NO                                   36820021
PRON2  MVI   WKAREA,MLHPNO         YES-ENTER PNDEF HEADER               36840021
         BC    UNCOND,PRON4        CHK IF CARD NO. HELD                 36860021
PRON3  MVI   WKAREA,MRHPNO         RT HAND NAME-ENTER PNREF HEADER      36880021
PRON4    STC   RWD,WKAREA+NX1       ENTER COUNT                         36900021
       TM    CARDSW,SEGT               WAS CARD NUMBER HELD             36920021
         BZ    PRON5               HANDLE SECT OR PROC NAME             36940021
       LA    RWB,GENCRD                                                 36960021
         BAL   RCS,GENDAT          GENERATE INTERPHASE CODE             36980021
         XC    CARDSW(LX1),CARDSW       TURN OFF                        37000021
         TM    ATXTSW,SWON         IS A 37 ITEM SAVED                   37020021
         BNO   PRON5               NO                                   37040021
         LA    RWB,ATXTSVD         ADR OF SAVED 37 ITEM                 37060021
         NI    ATXTSW,X'FF'-SWON   TURN SW OFF                          37080021
         BAL   RCS,GENDAT          COPY 37 ITEM                         37100021
PRON5    BCTR  RWD,RA0             BRANCH ON REG0 ADDR                  37120021
         C     RWD,SIX                 SECTION OR PROC NAME             37140021
         BNE   MOV                     SECTION NAME                     37160021
         BCTR  RWD,RA0             BRANCH ON REG0 ADDR                  37180021
MOV    LA    RWA,WKARSV                                                 37200021
       L     RAS,ALTRPT                                                 37220021
       BALR  RCS,RAS                   MAKE SURE NAME IS CORRECT        37240021
       EX    RWD,PNMOVE                                                 37260021
       LA    RWB,WKAREA                                                 37280021
       BAL   RCS,GENDAT            GENERATE P1 OPERAND                  37300021
         BC    UNCOND,GENOP1       GO TO RETURN FROM ALL BRANCHES       37320021
PNMOVE   MVC   WKAREA+NX2(LX1),DX1(RWB)                                 37340021
*                                                                       37360021
*                                                                       37380021
*                                                                       37400021
*=2    OVFLNM  OVERFLOW-NAME ROUTINE                                    37420021
*                                                                       37440021
*                                                                       37460021
*                                                                       37480021
OVFLNM EQU     *                                                        37500021
         MVC   WKAREA(LX2),MOVFNM                                       37520021
         MVC   WKAREA+NX2(LX1),DX1(RWB)                                 37540021
         BC    UNCOND,ENTIII       HANDLE CONDITION NAME                37560021
*                                                                       37580021
*                                                                       37600021
*                                                                       37620021
*                                                                       37640021
*                                                                       37660021
*                                                                       37680021
*                                                                       37700021
*                                                                       37720021
*                                                                       37740021
*=2    FILENM      GENERATES FILE-NAME OPERAND                          37760021
*                                                                       37780021
*                             FILE NAME                                 37800021
*                                                                       37820021
*                                                                       37840021
*   THE QFILE TABLE EACH ENTRY HAS 4 BYTES LENGTH. THE DCB= (2 BYTE     37860021
*   AND GN= (2 BYTES).  ZEROS INDICATES END OF QFILE TABLE.             37880021
*                                                                       37900021
*                                                                       37920021
*                                                                       37940021
FILENM EQU   *                                                          37960021
         CLI   COVERB+NX1,MSORT         IS VERB SORT                    37980021
       BNE   FILNM1                    NO                               38000021
       TM    READSW,SWON               CALLED BY READFN                 38020021
       BZ    RDFN5                     NO                               38040021
FILNM1 MVI   WKAREA,MFDREF             ENTER HEADER                     38060021
         ST    RWC,SAVPTR              SAVE DICT PRT                    38080021
         SR    RWD,RWD                                                  38100021
         IC    RWD,CNT(RWB)            GET VARIABLE COUNT               38120021
         SRL   RWD,DX4                  GET RID OF SAME RECORD          38140021
         LA    RWD,DX8(RWD)             FIXED LENGTH -1 FOR EX          38160021
         EX    RWD,ATTCH               MOVE ATTRIBUTES                  38180021
         LA    RWC,WKAREA+NX3                                           38200021
         AR    RWC,RWD                 POINT TO NEXT BYTE               38220021
*                                                                       38240021
*      OCCURS DEPENDING PROCESSING: TEST IF FQ BIT OF ATTRIBUTE IS      38260021
*      ON, THE DCB= IS SEARCHED FOR IN THE QFILE TABLE. WHEN FOUND,     38280021
*      NN ARE APPENDED TO THE ATTRIBUTES. THE LENGTHENED ATTRIBUTES     38300021
*      REFLECTED IN THE COUNT PRECEDING THE ATTRIBUTES.      NN = 0     38320021
*                                                                       38340021
*                                                                       38360021
         TM    DX1(RWB),MFQBIT      IS FQ BIT ON                        38380021
       BC      ONES,FILEQ          ON, GO TO SEARCH QFILE TABLE         38400021
ENTCNT   CLI   COVERB+NX1,MOPEN                                         38420021
       BNE   ENTFD                     NO                               38440021
       BAL   RCS,GETNXT                SHOULD BE K GN'S                 38460021
       L     RWB,PNTIN                 ADDRESS OF NEXT ELEMENT          38480021
         MVC   FRST(LX10,RWC),DX2(RWB)   APPEND GN'S                    38500021
         LA    RWC,DX10(RWC)            UPDATE PTR                      38520021
         LA    RWD,DX10(RWD)            UPDATE COUNT                    38540021
ENTFD    MVC   FRST(LX3,RWC),SAVPT1     APPEND PTR                      38560021
         LA    RWD,DX4(RWD)             UPDATE COUNT                    38580021
         STC   RWD,WKARE1              ENTER COUNT                      38600021
FILEQ0 LA      RWB,WKAREA          OFF, NO OCCURS-DEPENDING-ON INVO     38620021
       BAL   RCS,GENDAT            GENERATE OPERAND                     38640021
         BC    UNCOND,GENOP1       GO TO RETURN FROM ALL BRANCHES       38660021
*                                                                       38680021
*                                                                       38700021
*      FQ BIT IS ON, COMPARE FD ATTRIBUTE'S DCB= AGAINST THE DCB= I     38720021
*      QFILE TABLE.                                                     38740021
*      OBTAIN QFILE TABLE VIA COS,  MOVE TAMER ADDRESS FOR COMMON.      38760021
*                                                                       38780021
FILEQ  L       RWA,COSADR                                               38800021
       A       RWA,AQFILE          GET QFILE TABLE ABSOLUTE ADDRESS     38820021
         L     RWA,DX0(RWA)         RWA=A(TAMM)                         38840021
         LTR   RWA,RWA             IS TABLE EMPTY                 05936 38860021
         BZ    FILEQ4               IF SO, SKIP LOOKUP            05936 38880021
         L     RWA,DX0(RWA)         RWA=A(TABLE)                        38900021
FILEQ1 EQU     *                                                        38920021
         CLI   DX0(RWA),XX09             SD ENTRY ....            39847 38940021
         BC    EQ,FILEQ2                YES, ADVANCE PTR          39847 38960021
         CLC   DX3(LX1,RWB),DX1(RWA) IS FD'S DCB IN QFILE TABLE         38980021
       BC      EQ,FILEQ5           YES                                  39000021
         CLC   DX0(LX2,RWA),GZEROS   NO, IS END OF THE QFILE TABLE      39020021
       BC    EQ,FILEQ4              YES                                 39040021
FILEQ2   EQU   *                                                  39847 39060021
         LA    RWA,DX4(RWA)         NO, ADVANCE QFILE TABLE POINTER     39080021
       BC      UNCOND,FILEQ1       LOOP AND SEARCH MATCHED DCB=         39100021
ATTCH    MVC   DNMATT(LX1),FRST(RWB)                                    39120021
*                                                                       39140021
*      FILE-Q ON, NO MATCHED DCB. THIS IS A FILE WITH AN ODO VARIAB     39160021
*        BUT NO ODO ITSELF.  GIVE GN NUMBER 0 AS SIGNAL TO PHASE 5      39180021
*                                                                       39200021
FILEQ4 LA    RWA,GZEROS                                                 39220021
*                                                                       39240021
*      MATCHED DCB= IS FOUND IN QFILE TABLE.                            39260021
*                                                                       39280021
FILEQ5   MVC   FRST(LX1,RWC),GZEROS     GNCT=0                          39300021
         MVC   DX1(LX2,RWC),DX2(RWA)     GN#                            39320021
         LA    RWC,DX3(RWC)             UPDATE PTR                      39340021
         LA    RWD,DX3(RWD)             UPDATE COUNT                    39360021
         B     ENTCNT              GO TO RTN                            39380021
*                                                                       39400021
*DEL                                                                    39420021
*                                                                       39440021
       EJECT                                                            39460021
IKF303 CSECT                                                            39480021
COMON2 EQU   *                                                          39500021
*=1    CORRTN      CORRESPONDING ANALYZER                               39520021
*******************************************************************     39540021
*                                                                       39560021
*                                                                       39580021
*                                                                       39600021
*                          C O R R T N                                  39620021
*                                                                       39640021
*FUNCTION                                                               39660021
*   PROCESSES ADD, SUBTRACT, AND MOVE STATEMENTS WITH CORRESPONDING     39680021
*   OPTION, BREAKING THEM DOWN TO AS MANY SIMILAR STATEMENTS AS THE     39700021
*   ARE CORRESPONDING PAIRS IN THE OPERAND-1 AND OPERAND-2.             39720021
*                                                                       39740021
*SUBROUTINES CALLED                                                     39760021
*   GETNXT, ISTBCD, SEARCH, GETLVL, GENOP, COPREN, ERROR, COPYIN, C     39780021
*   GENDAT, ISTDLM, LOCNXT AND LATGRP                                   39800021
*                                                                       39820021
*EXIT POINTS                                                            39840021
*   PHCTRL, PHCTR1, EOF                                                 39860021
*                                                                       39880021
*                                                                       39900021
*   CORRESPONDING OPTION ADD OR SUBTRACT STATEMENT                      39920021
*                                                                       39940021
*   P0-TEXT    ADD CORRESPONDING X TO Y.                                39960021
*   (INPUT)                                                             39980021
*                                                                       40000021
*   P1-TEXT    ADD CORRESPONDING X TO Y                                 40020021
*   (OUTPUT)                                                            40040021
*              ADD X1 TO Y1                                             40060021
*              ADD X2 TO Y2                                             40080021
*               .         .                                             40100021
*               .         .                                             40120021
*              ADD XN TO YN                                             40140021
*              CORRESPONDING                                            40160021
*                                                                       40180021
*                                                                       40200021
*   CORRESPONDING OPTION MOVE STATEMENT                                 40220021
*                                                                       40240021
*   P0-TEXT    MOVE CORRESPONDING A(1) TO B, UNDEFINED (C), D.          40260021
*   (INPUT)                                                             40280021
*                                                                       40300021
*   P1-TEXT    MOVE CORRESPONDING A(1) TO B                             40320021
*   (OUTPUT)                                                            40340021
*              MOVE A1 TO B1                                            40360021
*               .         .                                             40380021
*               .         .                                             40400021
*              MOVE AN TO BN                                            40420021
*              CORRESPONDING                                            40440021
*                                                                       40460021
*              MOVE SAME TO ERSYM1 (C UNDEFINED)                        40480021
*              MOVE ERSYM1 TO ERSYM1                                    40500021
*              CORRESPONDING                                            40520021
*                                                                       40540021
*              MOVE SAME TO D                                           40560021
*              MOVE A1 TO R1                                            40580021
*              MOVE A2 TO R2                                            40600021
*               .         .                                             40620021
*               .         .                                             40640021
*              MOVE AN TO DN                                            40660021
*              CORRESPONDING                                            40680021
*                                                                       40700021
*                                                                       40720021
*NOTES                                                                  40740021
*   THE 'CORRESPONDING' WORD IS A SIGNAL TO PHASE 4 THAT A SERIES       40760021
*   OF THIS SET IS FINISHED.                                            40780021
*                                                                       40800021
*   OP2ESW - IF ON, OP-2 ERROR                                          40820021
*   CGENSW - IF ON, STATEMENT WAS GENERATED                             40840021
*   CRVRSW - IF ON, REVERSE OPERANDS IN GENERATED ELEMENTARY STATEM     40860021
*   CELCNT - ELEMENTARY ITEM COUNTER                                    40880021
*            =1 OBJECT HIERARCHY ITEM IS AN ELEMENTARY ITEM             40900021
*            =2 SUBJECT HIERARCHY ITEM IS AN ELEMENTARY ITEM            40920021
*            =3 BOTH ITEMS ARE ELEMENTARY ITEMS                         40940021
*                                                                       40960021
*ERROR PROCESSING                                                       40980021
*   IF OPERAND-1 IS NOT A BCD NAME OR DATA NAME, NO MORE PROCESSING     41000021
*   IS DONE AND NO ERROR MESSAGE IS PUT OUT CONTROL TRANSFERED TO       41020021
*   PHCTR1.  PHASE 4 WILL CATCH THE ERROR.                              41040021
*                                                                       41060021
*   IF OPERAND-1 IS A DATA NAME, BUT NOT A GROUP ITEM, SINCE THIS       41080021
*   ERROR CAN BE FOUND BY PHASE 3 ONLY, ERSYM1 IS SUBSTITUTED FOR       41100021
*   OPERAND-1.  GIVES AN ERROR MESSAGE, TRANSFERS TO PHASE CONTROLL     41120021
*   THE NEXT PO-TEXT IS READ IN.                                        41140021
*                                                                       41160021
*   IF OPERAND-1 IS VALID, AND OPERAND-2 IS INVALID, ERSYM1 IS          41180021
*   SUBSTITUTED FOR OPERAND-2 IN SOURCE STATEMENT.  A PSEUDO            41200021
*   STATEMENT IS GENERATED AND FOLLOWED BY 'CORRESPONDING'.             41220021
*                                                                       41240021
*                                                                       41260021
*                                                                       41280021
*                                                                       41300021
*******************************************************************     41320021
       SPACE   3                                                        41340021
CORRTN EQU   *                                                          41360021
*                                                                       41380021
* CHECK FIRST OPERAND                                                   41400021
*                                                                       41420021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     41440021
       BAL   RCS,ISTBCD            IS IT BCD NAME OR QUALIFIER          41460021
       BC    UNCOND,COR15          NO-ERROR                             41480021
*                                                                       41500021
* OPERAND IS BCD NAME.  CHECK IF IT IS GROUP DATA ITEM.                 41520021
COR13    MVI   MVCRSPRG,XX08       CORR-RTN SP REG ON FOR TESTING 47031 41540021
         BAL   RCS,SEARCH         SEARCH DICTIONARY               47031 41560021
         BC    UNCOND,PHCTR1       ERROR-NO SPECIAL PROCESSING          41580021
         TM    MVCRSPRG,XX80      IS IT SPECIAL REG               47031 41600021
         MVI   MVCRSPRG,XX00                                      47031 41620021
         BO    COR16              YES,ERROR                       47031 41640021
         TM    DX0(RWB),MDATAT      FOUND-IS IS DATA ITEM.              41660021
       BC    NOTZER,PHCTR1         NO                                   41680021
         TM    DX1(RWB),MGROUP      YES-IS IT GROUP FIXED               41700021
       BC    ZERO,COR14            YES                                  41720021
         TM    DX1(RWB),MGRVAR      NO-IS IT GROUP VARIABLE             41740021
       BC    NOTZER,COR16          NO                                   41760021
*                                                                       41780021
* OPERAND IS GROUP DATA ITEM.  SAVE PTR, LVL.  GENERATE P1 OPERAND      41800021
*                                                                       41820021
COR14  ST    RWC,DN1PTR            SAVE DICTIONARY POINTER              41840021
       BAL   RCS,GETLVL            GET LEVEL NUMBER                     41860021
       STH   RWD,DN1LVL            SAVE LEVEL NUMBER                    41880021
       BAL   RCS,GENOP             GENERATE P1 OPERAND                  41900021
*                                                                       41920021
* CHECK FOR SUBSCRIPTING                                                41940021
*                                                                       41960021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     41980021
         CLC   GOTTEN(LX2),LPAREN   IS IT LEFT PAREN                    42000021
       BC    NOTEQ,COR20           NO                                   42020021
       BAL   RCS,COPREN            YES-PROCESS CONTENTS, GET NEXT       42040021
       BC    UNCOND,COR20          GO CHECK FOR PREPOSITION.            42060021
*                                                                       42080021
* FIRST OPERAND INVALID                                                 42100021
*                                                                       42120021
COR15  TM    GOTTEN,MDATIC         IS IT DATA ELEMENT (MAJOR 3)         42140021
       BC    NOTONE,PHCTR1         NO-GO OUT. PH4 WILL CATCH ERROR.     42160021
*                                                                       42180021
*                                                                       42200021
*                                                                       42220021
*                                                                       42240021
*=E    0008    -- NOT VALID AS DATA-NAME-1 IN -- CORRESPONDING          42260021
*=             STATEMENT.                                               42280021
*                                                                       42300021
*                                                                       42320021
COR16  EQU   *                                                          42340021
       BAL   RCS,GETALL                MOVE ITEM TO WORKAREA            42360021
       CNOP  2,4                                                        42380021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            42400021
       DC    X'0822'                                                    42420021
       DC    A(WKAREA)                                                  42440021
       DC    A(COVERB)                                                  42460021
       LA      RWB,ERSYM1                                               42480021
         BAL   RCS,GENDAT          HANDLE ELEMENT                       42500021
         BC    UNCOND,PHCTRL       DETERMINE PHASE BRANCH               42520021
*                                                                       42540021
* PASS ON PREPOSITION, IF PRESENT.                                      42560021
*                                                                       42580021
COR20    CLC   GOTTEN(LX2),CBTO     IS IT 'TO'                          42600021
       BC    EQ,COR21              YES                                  42620021
         CLC   GOTTEN(LX2),CBFROM   IS IT 'FROM'                        42640021
       BC    NOTEQ,COR22           NO                                   42660021
COR21  BAL   RCS,COPYIN            COPY PREPOSITION                     42680021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     42700021
*                                                                       42720021
* CHECK SECOND OPERAND                                                  42740021
*                                                                       42760021
COR22  EQU   *                                                          42780021
       NI    OP2ESW,MSWOFF         INITIALIZE OP 2 ERROR SW             42800021
       NI    CGENSW,MSWOFF         INITIALIZE STATEMENT GENERATION      42820021
       BAL   RCS,ISTBCD            IS IT BCD NAME OR QUALIFIER          42840021
       BC    UNCOND,COR25          NO                                   42860021
*                                                                       42880021
* OPERAND IS BCD NAME-IS IT GROUP DATA ITEM.                            42900021
*                                                                       42920021
         MVI   MVCRSPRG,XX08      CORR-RTN SP. REG ON FOR TESTING 47031 42940021
       BAL   RCS,SEARCH            SEARCH DICTIONARY                    42960021
         BC    UNCOND,COR25X           YES- OP 2 MISSING           8836 42980021
         TM    MVCRSPRG,XX80      IS IT A SPECIAL REG             47031 43000021
         MVI   MVCRSPRG,XX00                                      47031 43020021
         BO    COR26                                              47031 43040021
         TM    DX0(RWB),MDATAT      FOUND-IS IS DATA ITEM.              43060021
       BC    ZERO,COR23            YES-GO CHECK IF GROUP                43080021
       BAL   RCS,GENOP             NO-GENERATE P1 OPERAND-PH4 FINDS     43100021
       BC    UNCOND,COR27          GO INDICATE OP 2 ERROR               43120021
COR22X   LA    RWB,ERSYM1                                               43140021
         BAL   RCS,GENDAT          HANDLE ELEMENT                       43160021
         OI    OP2ESW,MSWON                                             43180021
         BC    UNCOND,COR30X       FORMAT MESSAGE CHECK                 43200021
COR23    TM    DX1(RWB),MGROUP      IS IT GROUP FIXED                   43220021
       BC    ZERO,COR24            YES                                  43240021
         TM    DX1(RWB),MGRVAR      NO-IS IT GROUP VARIABLE             43260021
       BC    NOTZER,COR26          NO                                   43280021
*                                                                       43300021
* SECOND OPERAND IS GROUP DATA ITEM                                     43320021
*                                                                       43340021
COR24  ST    RWC,DN2PTR            SAVE DICTIONARY POINTER              43360021
       ST    RWC,DN2EPR            SAVE AS ERROR PARAM                  43380021
       BAL   RCS,GETLVL            GET LEVEL NUMBER                     43400021
       STH   RWD,DN2LVL            SAVE LEVEL NUMBER                    43420021
       BAL   RCS,GENOP             GENERATE P/ OPERAND                  43440021
       BC    UNCOND,COR30          GO CHECK FOR SUBSCRIPTING.           43460021
*                                                                       43480021
* SECOND OPERAND INVALID                                                43500021
*                                                                       43520021
COR25  BAL   RCS,ISTDLM            NOT DATA ITEM-IS IT DELIMITOR        43540021
         B     COR25X              YES-OP2 MISSING-GO INDICATE ERR56181 43560021
       BAL   RCS,COPYIN            NO-COPY AS OP 2 (PH4 WILL CATCH)     43580021
       BAL   RCS,GETNXT            GET NEXT ELEMENT                     43600021
       BC    UNCOND,COR27          GO INDICATE OP 2 ERROR.              43620021
*                                                                  8836 43640021
*                                                                  8836 43660021
*=E      0026  SECOND OPERAND OMITTED                              8836 43680021
*                                                                  8836 43700021
*                                                                  8836 43720021
*                                                                  8836 43740021
         CNOP  2,4                                                 8836 43760021
COR25X   EQU   *                                                   8836 43780021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            43800021
         DC    X'1A21'                                             8836 43820021
         DC    A(COVERB)                                           8836 43840021
         BC    UNCOND,COR22X       FORMAT MESSAGE CHECK                 43860021
*                                                                  8836 43880021
*                                                                       43900021
*                                                                       43920021
*                                                                       43940021
*                                                                       43960021
*                                                                       43980021
*=E    0009    -- NOT VALID AS DATA-NAME-2 IN -- CORRESPONDING          44000021
*=             STATEMENT.                                               44020021
*                                                                       44040021
*                                                                       44060021
*                                                                       44080021
       CNOP  2,4                                                        44100021
COR26  EQU     *                                                        44120021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            44140021
       DC    X'0922'                                                    44160021
       DC    A(WKAREA)                                                  44180021
       DC    A(COVERB)                                                  44200021
COR27  EQU     *                                                        44220021
       LA      RWB,ERSYM1                                               44240021
         BAL   RCS,GENDAT          HANDLE ELEMENT                       44260021
COR28  OI    OP2ESW,MSWON                                               44280021
*                                                                       44300021
* CHECK FOLLOWING SECOND OPERAND DEPENDS ON VERB                        44320021
*                                                                       44340021
COR30  BAL   RCS,GETNXT            GET NEXT ELEMENT                     44360021
COR30X   CLC   COVERB(LX2),CBSUB                                        44380021
         BC    NOTEQ,COR30A        FORMAT MESSAGE                       44400021
         MVC   COPREP(LX2),CBFROM   SUBTRACT-MAKE PREPOSITION 'FROM'    44420021
         BC    UNCOND,COR31        CORRPESPONDING CHECK                 44440021
COR30A   MVC   COPREP(LX2),CBTO     ADD OR MOVE-MAKE PREPOSITION 'TO    44460021
         CLC   COVERB(LX2),CBMOVE   IS VERB MOVE                        44480021
       BC    EQ,COR34              YES-GO CHECK FOR SUBSCRIPTING        44500021
*                                                                       44520021
* VERB IS ADD OR SUBTRACT.  PASS ON, AS P1 TEXT, EVERYTHING UP TO       44540021
* NEXT DELIMITOR.  THIS WILL INCLUDE SUBSCRIPTS, ROUNDED AND ON         44560021
* SIZE ERROR CLAUSES WHERE PRESENT.                                     44580021
*                                                                       44600021
COR31  BAL   RCS,ISTDLM            IS IT DELIMITOR                      44620021
       BC    UNCOND,COR40          YES-GO PROCESS                       44640021
       BAL   RCS,ISTBCD            NO-IS IT BCD NAME OR QUALIFIER       44660021
       BC    UNCOND,COR32          NO                                   44680021
       BAL   RCS,SEARCH            YES-SEARCH DICTIONARY                44700021
         BC    UNCOND,COR31        ERROR-ER SYMBOL SUBSTITUTED          44720021
       BAL   RCS,GENOP             FOUND-GENERATE P1 OPERAND            44740021
         BC    UNCOND,COR33        CORRESPONDING CHECK                  44760021
COR32  BAL   RCS,COPYIN            NOT BCD-COPY                         44780021
COR33  BAL   RCS,GETNXT            GET NEXT ELEMENT                     44800021
         BC    UNCOND,COR31        CORRESPONDING CHECK                  44820021
*                                                                       44840021
* VERB IS MOVE.  CHECK FOR SUBSCRIPTING                                 44860021
*                                                                       44880021
COR34    CLC   GOTTEN(LX2),LPAREN   IS IT LEFT PAREN                    44900021
       BC    NOTEQ,COR35           NO                                   44920021
       BAL   RCS,COPREN            YES-PROCESS CONTENTS, GET NEXT       44940021
COR35    CLC   GOTTEN(LX2),CBTO     IS THERE A SUPERFLUOUS 'TO'         44960021
       BC    NOTEQ,COR40           NO                                   44980021
*                                                                       45000021
*                                                                       45020021
*                                                                       45040021
*                                                                       45060021
*                                                                       45080021
*=E    0010    SUPERFLUOUS 'TO' IGNORED IN -- CORRESPONDING STATEME     45100021
*                                                                       45120021
*                                                                       45140021
*                                                                       45160021
       CNOP  2,4                                                        45180021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            45200021
       DC    X'0A01'                                                    45220021
       DC    A(COVERB)                                                  45240021
         BAL   RCS,GETNXT          GET NEXT RECORD                      45260021
*                                                                       45280021
* IF SECOND OPERAND VALID, INITIALIZE CHECK FOR CORRESPONDING ITEMS     45300021
* I.E., SERIAL SCAN OF SUBJECT HIERARCHY, LOOKING FOR MATCHES IN        45320021
* OBJECT HIERARCHY.  ACCESS GETS LATEST ENTRIES FIRST, VIA HASH TAB     45340021
* SO OPTIMIZE BY MAKING OBJECT HIERARCHY THAT OF DATA NAME WITH HIG     45360021
* DICTIONARY POINTER.                                                   45380021
*                                                                       45400021
COR40  TM    OP2ESW,MSWON          WAS OP 2 VALID                       45420021
       BC    ONES,COR101           NO-GO GENERATE PSEUDO-STATEMENT      45440021
       NI    CRVRSW,MSWOFF         YES-INITIALIZE REVERSE SWITCH        45460021
       L     RWD,DN1PTR                                                 45480021
       C     RWD,DN2PTR                                                 45500021
       BC    NOTHI,COR41           DATA NAME 1 NOT HIGHER               45520021
       LM    RWD,RWE,DN1PTR        DN1 HIGHER-MAKE IT OBJECT HIERAR     45540021
         MVC   DN1PTR(LX6),DN2PTR   BY EXCHANGING ITS DIC PTR, LVL W    45560021
       STM   RWD,RWE,DN2PTR        THOSE OF DN2.                        45580021
       OI    CRVRSW,MSWON          REVERSE OPS IN GENRTD EL. STMENT     45600021
*                                                                       45620021
* INSERT CODING OF HOLD FOR DN2 HIERARCHY                   *****       45640021
*                                                                       45660021
COR41  LH    RWD,DN1LVL                                                 45680021
         BCTR  RWD,RA0             BRANCH ON REG0 ADDR                  45700021
         SLA   RWD,DX2                                                  45720021
       A     RWD,ACTABL                                                 45740021
         MVC   DX0(LX4,RWD),DN2PTR   DN2PTR TO CTABLE+(DN1LVL-1)4       45760021
       LH    RWD,DN2LVL                                                 45780021
       SH    RWD,DN1LVL                                                 45800021
       STH   RWD,LVLDIF            DN2LVL-DN1LVL TO LVLDIF              45820021
         MVI   SKPLVL+NX1,MFF       SET SKPLVL FOR NO SKIP              45840021
       L     RWA,DN1PTR            PICK UP DN1PTR AS LOCNXT PARAM       45860021
*                                                                       45880021
* SERIAL SCAN OF SUBJECT HIERARCHY                                      45900021
*                                                                       45920021
COR50  L     RAS,ALCNXG            CALL LOCNXT-GET NEXT ITEM UNDER      45940021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           45960021
         TM    DX0(RWB),MDATAT      IS IT A DATA ITEM                   45980021
       BC    NOTZER,COR54          NO                                   46000021
       ST    RWA,DN1SFP            YES-SAVE DICTIONARY POINTER          46020021
       ST    RWB,DN1SFA            SAVE A(ATTRIBUTES)                   46040021
         BAL   RCS,GETLVL          OBTAIN LVL NUMBER                    46060021
       STH   RWD,DN1SFL            SAVE LEVEL NUMBER                    46080021
       CH    RWD,SKPLVL            IS ITEM IN GROUP TO BE SKIPPED       46100021
       BC    HI,COR53              YES-SKIP                             46120021
       CH    RWD,DN1LVL            NO-ARE WE BEYOND SUBJECT HIERARC     46140021
       BC    NOTHI,COR100          YES-GO CHK IF ANY GENERATION         46160021
         CLC   AFILER(LX7),DX0(RWC)      IS IT FILLER             52753 46180021
         BC    EQ,COR51                     YES, SKIP             52753 46200021
         TM    DX1(RWB),XX03        NO-IS THERE OCCURS OR REDEFINES     46220021
         BC    NOTZER,COR56A            YES, GEN WARNING IF MATCH 40609 46240021
       TM    ONE(RWB),USGIND           IS USAGE INDEX                   46260021
         BO    COR56A                   YES, GEN WARNING IF MATCH 40609 46280021
         CLI   DN1SFL+NX1,XX39          LEVEL 66                        46300021
         BE    COR56A                   YES, GEN WARNING IF MATCH 40609 46320021
         B     COR55                    DATA NAME OK              52753 46340021
COR51    MVC   SKPLVL(LX2),DN1SFL   YES-SET TO SKIP SUBFIELDS, IF AN    46360021
COR52    EQU   *                                                  40609 46380021
         NI    CORERR,MSWOFF            TURN OFF SW FOR NEXT      40609 46400021
         L     RWA,DN1SFP               PICK UP CURR DIC PTR      40609 46420021
COR53  L     RWF,COSADR                                                 46440021
       C     RWA,DICND2-COS(RWF)       END OF DICTIONARY                46460021
       BC    NOTEQ,COR50           NO-GO GET NEXT ITEM IN HIERARCHY     46480021
       BC    UNCOND,COR100         YES-GO CHK IF ANY GENERATION         46500021
COR54    CLI   DX0(RWB),MMJCND      NON-DATA.  IS IT CONDITION NAME     46520021
       BC      EQ,COR53            YES, SKIP                            46540021
         CLI   DX0(RWB),MIDNM           IS IT INDEX NAME          49565 46560021
         BC    EQ,COR53                  YES, SKIP                49565 46580021
       BC    UNCOND,COR100         NO-MUST BE END OF HIERARCHY.         46600021
*                                                                       46620021
* CURRENT SUBJECT HIERARCHY ITEM O.K.  CHK IF ELEMENTARY                46640021
*                                                                       46660021
COR55    NI    CELCNT,XX00          INIT EL. ITEM COUNTER TO 0.         46680021
         TM    DX1(RWB),MGROUP      IS IT GROUP                         46700021
         BC    ZERO,COR60          CORRESPONDING CHECK                  46720021
         TM    DX1(RWB),MGRVAR                                          46740021
         BC    ZERO,COR60          CORRESPONDING CHECK                  46760021
         OI    CELCNT,XX02          NO-INDICATE ITEM IS ELEMENTARY.     46780021
         B     COR60               CORRESPONDING CHECK                  46800021
*                                                                       46820021
*                                                                       46840021
*=E 0023  ITEMS CONTAINING THE USAGE IS INDEX, REDEFINES, RENAMES       46860021
*         OR OCCURS CLAUSES DO NOT QUALIFY AS CORRESPONDING             46880021
*         DATANAMES.                                                    46900021
*                                                                       46920021
*                                                                       46940021
COR56  EQU   *                                                          46960021
       CNOP  2,4                                                        46980021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            47000021
       DC    X'1700'                                                    47020021
       B     COR51                      PROCESS NEXT                    47040021
COR56A   EQU   *                                                  40609 47060021
         OI    CORERR,MSWON             CI HAS REDEF, OCCURS...   40609 47080021
         BC    UNCOND,COR55             LOOK FOR MATCHING PAIR    40609 47100021
CORERR   DC    X'00'                    CORRESPONDING ERROR SW    40609 47120021
*                                                                       47140021
* LOOK FOR MATCHING ITEM SUBORDINATE TO ITEM WHOSE DICTIONARY POINT     47160021
* IS AT CTABLE+(DNISFL-2)4.  (THIS IS OBJECT HIERARCHY MATCH OF         47180021
* CURRENT SUBJECT HIERARCHY'S IMMEDIATE GROUP).                         47200021
*                                                                       47220021
COR60    DS    0H                                                 46200 47240021
         B     COR60A             BRANCH AROUND BAD FIX - 46200   58353 47260021
         SR    RWE,RWE                      CLEAR REG             46200 47280021
         IC    RWE,DX0(RWC)             GET CNT OF NAME           46200 47300021
         EX    RWE,CORMOV               MOVE NAME TO WKAREA       46200 47320021
         A     RWE,PADLOC                   PAD WITH              46200 47340021
         MVC   DX1(LX3,RWE),ZEROES         ZEROES                 46200 47360021
         MVC   CLTGP2+NX1(LX3),DN1PTR+NX1 SEARCH ON DN1PTR        46200 47380021
         LA    RWA,CLTGP1                 ADDR OF WKAREA          46200 47400021
         L     RAS,ALTGRP               ADDR OF LATGRP            46200 47420021
         BALR  RCS,RAS                   BR TO ACCESS             46200 47440021
         C     RAS,N8                   IS NM DUPLICATE           46200 47460021
         BC    EQ,COR65                    YES, BR                46200 47480021
         BC    HI,COR61A                 ALMOST IMPOSSIBLE        46200 47500021
COR60A   EQU   *                        CURRENT ITEM IS OK        46200 47520021
*   IN ITS OWN GROUP; NOW CHECK OTHER GROUP                       46200 47540021
         BCTR  RWD,RA0                      DECR                  46200 47560021
         BCTR  RWD,RA0             GO TO TABLE LOC                      47580021
         SLA   RWD,DX2                                                  47600021
       A     RWD,ACTABL                                                 47620021
         MVC   CLTGP2+NX1(LX3),DX1(RWD) PUT PTR IN LATGRP PARAM         47640021
         SR    RWE,RWE                                            58353 47660021
         IC    RWE,DX0(RWC)       GET CO0NT OF BCD NAME           58353 47680021
         EX    RWE,CORMOV         MOVE NAME TO WORKAREA           58353 47700021
         A     RWE,PADLOC                                         58353 47720021
         MVC   DX1(LX3,RWE),ZEROES  PAD WITH ZEROES               58353 47740021
       LA    RWA,CLTGP1                                                 47760021
       L     RAS,ALTGRP                                                 47780021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           47800021
         BC    UNCOND,COR61(RAS)   CORRESPONDING CHECK                  47820021
CORMOV   MVC   WKAREA+NX1(LX1),DX0(RWC)                                 47840021
COR61  BC    UNCOND,COR70          UNIQUE MATCH WITHIN GROUP            47860021
       BC    UNCOND,COR51          NO MATCH                             47880021
         BC    UNCOND,COR65        CORRESPODNING CHECK                  47900021
*                                                                       47920021
*                                                                       47940021
*                                                                       47960021
*=E    0016    IMPOSSIBLE -- COMPILER ERROR.                            47980021
*                                                                       48000021
*                                                                       48020021
*                                                                       48040021
COR61A   EQU   *                                                  46200 48060021
       CNOP    2,4                                                      48080021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            48100021
       DC      X'1081'                                                  48120021
       DC      A(WKAREA)                                                48140021
         BC    UNCOND,EOF          END FILE RTN                         48160021
*                                                                       48180021
*                                                                       48200021
*=E       0021 --NOT UNIQUE IN ITS GROUP. DISCARDED.                    48220021
*                                                                       48240021
*                                                                       48260021
*                                                                       48280021
COR65    MVI   WKAREA,XX23                                              48300021
         CNOP  2,4                                                      48320021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            48340021
         DC    X'1511'                                                  48360021
         DC    A(WKAREA)                                                48380021
         BC    UNCOND,COR51        CORRESPONDING CHECK                  48400021
*                                                                       48420021
* MATCHING ITEM FOUND.  CHECK IF IT QUALIFIES AS CORRESPONDING ITEM     48440021
*                                                                       48460021
COR70    TM    DX0(RWB),MDATAT      IS IT A DATA ITEM                   48480021
       BC    NOTZER,COR51          NO                                   48500021
         TM    CORERR,MSWON             ERROR WITHIN MATCH...     40609 48520021
         BO    COR56                    YES, GEN ERROR MSG        40609 48540021
       BAL   RCS,GETLVL            YES                                  48560021
       SH    RWD,DN1SFL                                                 48580021
       CH    RWD,LVLDIF            DOES DN2SFL-DN1SFL=LVLDIF            48600021
       BC    NOTEQ,COR51           NO-LVL BREAK-SKIP ANY SUBFIELDS      48620021
         TM    DX1(RWB),XX03        YES-IS THERE OCCURS OR REDEFINES    48640021
       BC    NOTZER,COR56               YES, GENERATE WARNING           48660021
       TM    ONE(RWB),USGIND           IS USAGE INDEX                   48680021
         BO    COR56               CORRESPONDING CHECK                  48700021
       CH    RWD,LVNM66                 IS IT 66                        48720021
         BE    COR56               CORRESPONDING CHECK                  48740021
       ST    RWC,DN2SFP            NO-SAVE DICTIONARY POINTER           48760021
       ST    RWB,DN2SFA            SAVE A(ATTRIBUTES)                   48780021
         TM    DX1(RWB),MGROUP      IS IT GROUP                         48800021
         BC    ZERO,COR80          CORRESPONDING CHECK                  48820021
         TM    DX1(RWB),MGRVAR                                          48840021
         BC    ZERO,COR80          CORRESPONDING CHECK                  48860021
         OI    CELCNT,XX01          NO-INDICATE ITEM IS ELEMENTARY      48880021
*                                                                       48900021
* CHECK WHETHER 0,1 OR 2 OF THE MATCHING ITEMS ARE ELEMENTARY           48920021
*                                                                       48940021
COR80    TM    CELCNT,XX03                                              48960021
       BC    ONES,COR90          BOTH                                   48980021
       BC    MIXED,COR81           ONE-GO CHECK IF MOVE                 49000021
       AH    RWD,DN1SFL            NONE-RWD HAS LVLDIF.  RESTORE DN     49020021
       SH    RWD,LVLDIF                                                 49040021
         BCTR  RWD,RA0             GO TO TABLE LOC                      49060021
         SLA   RWD,DX2                                                  49080021
       A     RWD,ACTABL                                                 49100021
         ST    RWC,DX0(RWD)         DN2SFP TO CTABLE+(DN1SFL-1)4        49120021
         MVI   SKPLVL+NX1,MFF       SET SKPLVL FOR NO SKIP              49140021
         BC    UNCOND,COR52        CORRESPODNING CHECK                  49160021
*                                                                       49180021
COR81    CLC   COVERB(LX2),CBMOVE   ONE-IS IT MOVE                      49200021
       BC    NOTEQ,COR51           NO                                   49220021
*                                                                       49240021
* BOTH ELEMENTARY, OR, IF MOVE, AT LEAST 1.  GENERATE STATEMENT         49260021
*                                                                       49280021
COR90  TM    CRVRSW,MSWON          WAS DATA NAME 1 MADE OBJ. HIERAR     49300021
       BC    ZERO,COR91            NO                                   49320021
       LM    RWD,RWE,DN1SFP        YES-REVERSE OPS IN GENRTD STATEM     49340021
         MVC   DN1SFP(LX8),DN2SFP                                       49360021
       STM   RWD,RWE,DN2SFP                                             49380021
COR91  LA    RWB,COVERB                                                 49400021
       BAL   RCS,GENDAT            GENERATE VERB                        49420021
       L     RWB,DN1SFA                                                 49440021
       L     RWC,DN1SFP                                                 49460021
         BAL   RCS,GENOP           CREATE MODIFIED ELEMENT              49480021
       LA    RWB,COPREP                                                 49500021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     49520021
       L     RWB,DN2SFA                                                 49540021
       L     RWC,DN2SFP                                                 49560021
         BAL   RCS,GENOP           CREATE MODIFIED ELEMENT              49580021
       OI    CGENSW,MSWON                                               49600021
       TM    CRVRSW,MSWON          WAS DATA NAME 1 MADE OBJ. HIERAR     49620021
         BC    ZERO,COR51          CORRESPONDING CHECK                  49640021
         MVC   DN1SFP(LX4),DN2SFP   YES-RESTORE CUR DIC PTR TO DN1SF    49660021
         BC    UNCOND,COR51        CORRESPONDING CHECK                  49680021
*                                                                       49700021
* SCAN OF SUBJECT HIERARCHY COMPLETED.  CHECK IF ANY GENERATION.        49720021
*                                                                       49740021
COR100 TM    CGENSW,MSWON          ANY STATEMENTS GENERATED             49760021
       BC    ONES,COR102           YES                                  49780021
*                                                                       49800021
*                                                                       49820021
*                                                                       49840021
*                                                                       49860021
*=E    0011    NO CORRESPONDENCES FOUND BETWEEN DATA-NAME-1 AND --.     49880021
*                                                                       49900021
*                                                                       49920021
*                                                                       49940021
         MVI   DN2EPR,XXFE          ENTER I.I. HEADER                   49960021
       CNOP  2,4                   NO                                   49980021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            50000021
       DC      X'0B01'                                                  50020021
       DC    A(DN2EPR)                                                  50040021
COR101 LA    RWB,COVERB            GENERATE PSEUDO-STATEMENT            50060021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50080021
       LA    RWB,ERSYM1                                                 50100021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50120021
       LA    RWB,COPREP                                                 50140021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50160021
       LA    RWB,ERSYM1                                                 50180021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50200021
COR102 LA    RWB,CBCORR            PUT OUT 'CORRESPONDING' TRAILER      50220021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50240021
*                                                                       50260021
* IF CURRENT INPUT ELEMENT IS A DELIMITOR EXIT. IF NOT, ASSUME IT I     50280021
* ANOTHER RECEIVING FIELD IN A MOVE.  GENERATE 'MOVE SAME TO' AND G     50300021
* BACK AND PROCESS CURRENT ELEMENT AS SECOND OPERAND.                   50320021
*                                                                       50340021
       BAL   RCS,ISTDLM            IS CURRENT ELEMENT A DELIMITOR       50360021
       BC    UNCOND,PHCTR1         YES-EXIT                             50380021
         CLI   GOTTEN,MWORD           COBOL WORD NOT A VERB             50400021
         BC    EQ,PHCTR1           GO ELEMENT ANALYZER                  50420021
       LA    RWB,CBMOVE            NO                                   50440021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50460021
       LA    RWB,CSAME                                                  50480021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50500021
       LA    RWB,CBTO                                                   50520021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     50540021
       TM    CRVRSW,MSWON          WAS DATA NAME 1 MADE OBJ. HIERAR     50560021
       BC    ZERO,COR22            NO                                   50580021
         MVC   DN1PTR(LX6),DN2PTR   YES-REPLACE DIC PTR, LVL            50600021
         BC    UNCOND,COR22        CORRESPONDING CHECK                  50620021
*                                                                       50640021
       EJECT                                                            50660021
*=1    GLOSRY                      GENERATES DATA LISTING               50680021
*******************************************************************     50700021
*                                                                       50720021
*                             G L O S R Y                               50740021
*                                                                       50760021
*FUNCTION                                                               50780021
*   GENERATES A DATA DIVISION LISTING, OR GLOSSARY, WITH A LINE FOR     50800021
*   EACH DATA ITEM IN THE DICTIONARY.                                   50820021
*                                                                       50840021
*SUBROUTINES CALLED                                                     50860021
*   LOCNXT, ERROR, DECSU1, ENTRPD, DECSUP, ISPTR                        50880021
*                                                                       50900021
*EXTERNAL REFERENCE                                                     50920021
*   COS                                                                 50940021
*                                                                       50960021
*EXIT POINTS                                                            50980021
*   GLORET, EOF                                                         51000021
*                                                                       51020021
*NOTES                                                                  51040021
*   SWRONL - IF ON, INDICATES WRITE ONLY CLAUSE CHANGES MAJOR CODE      51060021
*   TO 07.                                                              51080021
*                                                                       51100021
*   ALSO STORES COUNT OF ALL NON-88 LD'S IN FIRST 4 BYTES OF            51120021
*   DATE FIELD IN COMMON.                                               51140021
*                                                                       51160021
*   HDRSW - IF ON, A NEW PAGE STARTS, PRINTS PAGE HEADER                51180021
*******************************************************************     51200021
       SPACE   3                                                        51220021
GLOSRY EQU   *                                                          51240021
*                                                                       51260021
*                                                                       51280021
* SCAN DATA DIVISION ENTRIES IN DICTIONARY                              51300021
*                                                                       51320021
       L     RWF,COSADR                                                 51340021
       L     RWA,DICND1-COS(RWF)       PTR OF LAST PROCED. EMTRY        51360021
       C     RWA,DICND2-COS(RWF)                                        51380021
       BC    NOTLO,GLORET          NO DATA DIVISION-GO OUT       **     51400021
DICSCN L     RAS,ALCNXG                                                 51420021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           51440021
       ST    RWA,SAVPTR                                                 51460021
       STH   RWA,SVHPTR                                                 51480021
         CLI   DX0(RWB),MMJCND      IS IT CONDITION NAME                51500021
       BC      EQ,TESTHD           YES                                  51520021
         TM    DX0(RWB),XX88        ARE THEY FD,SD,SA, OR RD            51540021
       BC    ONES,NEWFD            YES                                  51560021
         TM    DX0(RWB),XX0F            INEDX NAME                      51580021
       BO    TESTHD                    YES                              51600021
         TM    DX0(RWB),XX08        IS IT A DATA OPERAND                51620021
       BC    NOTZER,DICSCN         N/-GET NEXT ENTRY                    51640021
         TM    DX0(RWB),XX07       IS IT WITHIN FILE SECTION            51660021
         BC    ZERO,*+NX8           YES                                 51680021
NEWFD  NI    SWRONL,MSWOFF         NO - TURN OFF WRITE-ONLY SWITCH      51700021
TESTHD   TM    HDRSW,XX01           YES, CHECK IF HEADER NEEDED         51720021
         BC    ONES,PRINIT         INSERT NAME IN PRINT LINE            51740021
       STM   RWA,RWC,SAVABC                                             51760021
       L     RWA,COSADR            WRITE PAGE HEADER                    51780021
       LA    RWB,HDRLIN                                                 51800021
         LA    RWC,DX120                                                51820021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 51840021
       DC    X'16'                                                      51860021
       L     RWA,COSADR                                                 51880021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 51900021
       DC    X'86'                                                      51920021
       L     RWA,COSADR            SKIP LINE BY WRITING BLANK LINE      51940021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 51960021
       DC    X'86'                                                      51980021
         OI    HDRSW,XX01           CAUSE NO HDR TIL NEXT PAGE          52000021
       LM    RWA,RWC,SAVABC                                             52020021
PRINIT   MVI   PRLINE,XX40                                              52040021
         MVC   PRLINE+NX1(LX120),PRLINE                                 52060021
*                                                                       52080021
* INSERT INTERNAL NAME IN PRINT-LINE                                    52100021
*                                                                       52120021
         MVC   PRIN1(LX4),DNM                                           52140021
*                                                                       52160021
         SRA   RWA,DX9              SECTION NO. IN LOW ORDER 13 BITS    52180021
         LA    RWD,PRIN1+NX4        INITIALIZE TARGET POINTER           52200021
       BAL   RCS,DECSU1            INSERT SEC. NO., ZEROES SUPPRESS     52220021
       AR    RWD,RWF               UPDATE TARGET POINTER                52240021
         MVI   DX1(RWD),XX60        ENTER HYPHEN                        52260021
         NI    SVHPTR,XX01          LEAVE LOW ORDER 9 BITS              52280021
       LH    RWA,SVHPTR                                                 52300021
       CVD   RWA,DECFLD            CONVERT TO DECIMAL                   52320021
         UNPK  DECFLD(LX5),DECFLD+NX6(LX3) UNPK EXTRA BYTE TO ELIM SIGN 52340021
         MVC   DX2(LX3,RWD),DECFLD   ENTER DISPLACEMENT PART            52360021
         MVC   PRIN2(LX12),PRIN1    REPEAT INTERNAL NAME IN MID-LINE    52380021
*                                                                       52400021
*                                                                       52420021
*      ENTER LEVEL CODE                                                 52440021
*                                                                       52460021
*                                                                       52480021
         CLI   DX0(RWB),MMJCND      IS IT 88                            52500021
       BC      EQ,ENT88            YES, ENTER 88 TO LEVEL               52520021
         CLI   DX0(RWB),MIDNM       IS IT INDEX NAME                    52540021
         BE    IDNAME              MOVE USAGE FIELD                     52560021
         TM    DX0(RWB),XX88            IS IT FD, SD,SA OR RD     47047 52580021
         BC    ONES,NONDNS              YES, BR                   47047 52600021
       SR    RWA,RWA                                                    52620021
         IC    RWA,LEVLNO(RWB)          GET LEVEL NO.                   52640021
         SRA   RWA,DX2                                                  52660021
       ST      RWA,LVLSTG                                               52680021
         CLI   LVLSTG+NX3,XX39          IS IT 66                        52700021
       BE    ENT66                     YES                              52720021
         CLI   LVLSTG+NX3,XX32      IS IT LEVEL 77                      52740021
       BC      EQ,ENT77            YES, ENTER 77                        52760021
*DEL                                                               4704 52780021
*DEL                                                               4704 52800021
*DEL                                                               4704 52820021
*DEL                                                               4704 52840021
*DEL                                                               4704 52860021
*DEL                                                               4704 52880021
         CLI   LVLSTG+NX3,XX01      IS LVEVEL 01 TO 49                  52900021
         BC    LO,BADLVL           ILLEGAL LEVEL                        52920021
         CLI   LVLSTG+NX3,XX32                                          52940021
       BC      LO,ENTLVL           YES, ENTER NORMALIZED LEVEL NUMB     52960021
*                                                                       52980021
*                                                                       53000021
BADLVL EQU     *                                                        53020021
*                                                                       53040021
*=E    0019    ILLEGAL LEVEL FOR -- .                                   53060021
*                                                                       53080021
*                                                                       53100021
       CNOP    2,4                                                      53120021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            53140021
       DC      X'1381'                                                  53160021
       DC      A(WKAREA)                                                53180021
         BC    UNCOND,EOF          GO END FILE RTN                      53200021
*                                                                       53220021
* INDEX NAME                                                            53240021
IDNAME   MVC   PRUSG(LX8),INDEXN        MOVE USAGE FIELD                53260021
         B     ENTSNM              GET BYTE COUNT                       53280021
*                                                                       53300021
*      IF IT IS NEITHER A 77, 88 NOR A DN, SHOULD BE EITHER A FD, S     53320021
*      SA,OR A RD -- (NON DATA OPERANDS).  ENTER CODE INTO LEVEL        53340021
*                                                                       53360021
*                                                                       53380021
NONDNS EQU     *                                                        53400021
       SR      RWA,RWA                                                  53420021
         MVC   WKWORD+NX3(LX1),DX0(RWB) NON-DATA OPERAND                53440021
         NI    WKWORD+NX3,XX07      ZERO OUT HIGHER ORDER 5 BITS        53460021
         IC    RWA,WKWORD+NX3                                           53480021
         SLA   RWA,DX1                                                  53500021
       LA      RWF,LVCODE                                               53520021
       AR      RWA,RWF                                                  53540021
         MVC   PRLVL(LX2),DX0(RWA)   ENTER CODE INTO LEVEL              53560021
         BC    UNCOND,ENTSNM       GET BYTE COUNT                       53580021
*                                                                       53600021
*      LEVEL NO. 66                                                     53620021
*                                                                       53640021
ENT66  EQU   *                                                          53660021
         MVC   PRLVL(LX2),LVL66         ENTER LEVEL NO. 66              53680021
       B     ENTSNM                    GO ENTER SOURCE NAME             53700021
*                                                                       53720021
*      LEVEL NO. 77                                                     53740021
*                                                                       53760021
ENT77  EQU     *                                                        53780021
         MVC   PRLVL(LX2),LVL77     ENTER LEVEL NO. 77                  53800021
       BC      UNCOND,ENTSNM       GO TO ENTER SOURCE NAME              53820021
*                                                                       53840021
*      LEVEL NO. 88                                                     53860021
*                                                                       53880021
ENT88  EQU     *                                                        53900021
         MVC   PRLVL(LX2),LVL88     ENTER LEVEL NO. 88                  53920021
       BC      UNCOND,ENTSNM       GO TO ENTER SOURCE NAME              53940021
       SPACE   3                                                        53960021
       SPACE   3                                                        53980021
*                                                                       54000021
*                                                                       54020021
*      ENTER DCB= AND/OR DECB=                                          54040021
*                                                                       54060021
*                                                                       54080021
FDDCB  EQU     *                                                        54100021
         MVC   PRBASE(LX4),DCBS     DCB=                                54120021
       SR      RWA,RWA                                                  54140021
         IC    RWA,DX3(RWB)                                             54160021
       CVD     RWA,DECFLD                                               54180021
         UNPK  DECFLD(LX5),DECFLD+NX6(LX3)                              54200021
         MVC   PRBASE+NX4(LX2),DECFLD+NX1                               54220021
*                                                                       54240021
*                                                                       54260021
         CLI   DX5(RWB),XX00        IS DECB=0                           54280021
       BE    ENTACS                    YES, SKIP TO ENTER ACCESS ME     54300021
         MVC   PRDISP(LX4),DECBS    DEC=                                54320021
       SR      RWA,RWA                                                  54340021
         IC    RWA,DX5(RWB)                                             54360021
       CVD     RWA,DECFLD                                               54380021
         UNPK  DECFLD(LX5),DECFLD+NX6(LX3)                              54400021
         MVC   PRDISP+NX4(LX2),DECFLD+NX1                               54420021
*                                                                       54440021
*                                                                       54460021
*                                                                       54480021
*      ENTER ACCESS METHOD TO USAGE                                     54500021
*                                                                       54520021
ENTACS EQU     *                                                        54540021
       SR      RWA,RWA                                                  54560021
         IC    RWA,DX4(RWB)           GET ACCESS METHOD                 54580021
         SRL   RWA,DX4                GET RID OFF LOWER 4 BITS          54600021
       C     RWA,ZEROS                 IS IT QSAM                       54620021
       BNE   ENTAC2                    NO                               54640021
         TM    DX4(RWB),XX02                                            54660021
       BC    NOTONE,ENTAC2         NO                                   54680021
       OI    SWRONL,MSWON          YES, SW SAYS SET DN LEVELS TO 63     54700021
ENTAC2 EQU   *                                                          54720021
         SLL   RWA,DX3              MULTIPLY BY 8                       54740021
       A       RWA,AAKCES            GET CURRENT ENTITY                 54760021
         MVC   PRUSG(LX8),DX0(RWA)     PUT ACCESS METHOD TO PRINT-LIN   54780021
TSTMOD TM    ONE(RWB),MODES        IS MODE S                            54800021
       BO    MODS                      YES                              54820021
       TM    ONE(RWB),MODEF            IS MODE F                        54840021
       BZ    NOTF                      NO                               54860021
         MVI   PRM,XCF                  YES                             54880021
         B     GOWRIT              ENTER NORMALIZED LVL NO.             54900021
NOTF   TM    ONE(RWB),MODEV            IS MODE V                        54920021
         BO    MODEU               ENTER NORMALIZED LVL NO.             54940021
         MVI   PRM,XCV                                                  54960021
         B     GOWRIT              ENTER NORMALIZED LVL NO.             54980021
MODS     MVI   PRM,XCS                  MODE IS SCANNED                 55000021
         B     GOWRIT              ENTER NORMALIZED LVL NO.             55020021
MODEU    MVI   PRM,XCU                                                  55040021
GOWRIT   B     PRINT               GO PRINT RTN                         55060021
*                                                                       55080021
*                                                                       55100021
*                                                                       55120021
*                                                                       55140021
* ENTER NORMALIZED LEVEL NUMBER                                         55160021
*                                                                       55180021
ENTLVL SR    RWA,RWA                                                    55200021
         IC    RWA,LEVLNO(RWB)          GET LEVEL NO.                   55220021
         SRA   RWA,DX2              LEVEL NO. IN LOW ORDER BITS         55240021
       CVD   RWA,DECFLD            CONVERT TO DECIMAL                   55260021
         UNPK  DECFLD(LX5),DECFLD+NX6(LX3) UNPACK EXTRA BYTE TO ELIM SI 55280021
         MVC   PRLVL(LX2),DECFLD+NX1 INSERT IN PRINT-LINE               55300021
       TM    SWRONL,MSWON         IS THIS UNDER A WRITE-ONLY FD         55320021
       BC    NOTONE,ENTSNM         NO                                   55340021
         OI    DX0(RWB),MAJWRO     YES - CHANGE MAJOR TO 7 FOR PH4      55360021
       BAL     RCS,DCOTBT         ENTER UPDATE BIT IN DICOT TABLE       55380021
*                                                                       55400021
* ENTER SOURCE NAME                                                     55420021
*                                                                       55440021
ENTSNM SR    RWA,RWA                                                    55460021
         IC    RWA,DX0(RWC)         GET BYTE COUNT                      55480021
         BCT   RWA,*+NX4           ADVANCE 4 BYTES                      55500021
       EX    RWA,MOVSNM            ENTER NAME                           55520021
         BC    UNCOND,*+NX10       ADVANCE 10 BYTES                     55540021
MOVSNM   MVC   PRSNAM(LX1),DX1(RWC)                                     55560021
*                                                                       55580021
*      IF A DATA OPERAND LEVEL IS 01-49 OR A 77, ENTER BASE AND         55600021
*      DISPLACEMENT (THE LATTER IN HEXADECIMAL).  IF A NON-OPERAND,     55620021
*      FD,ENTER DCB=XX AND DEC=XX UNDER BASE AND DISPLACEMENT.          55640021
*                                                                       55660021
*                                                                       55680021
         CLI   DX0(RWB),MMJCND      IS IT CONDITION NAME                55700021
       BC      EQ,PRINT            YES, SKIP REST AND GO TO PRINT       55720021
         CLI   DX0(RWB),MIDNM           INDEX NAME                      55740021
       BE    PRINT                     YES, SKIP REST                   55760021
         CLI   DX0(RWB),XX8B        IS IT SA                            55780021
       BE    PRINT                     YES                              55800021
         CLI   FRST(RWB),MAJCFD        IS IT FD                         55820021
       BC      EQ,FDDCB            YES                                  55840021
         CLI   FRST(RWB),RANPFD        RANDOM PROC. FD                  55860021
       BC      EQ,FDDCB            YES                                  55880021
         MVC   BASSTG(LX1),DX0(RWB)                                     55900021
         NI    BASSTG,XX0F                                              55920021
         CLI   BASSTG,XX09          IS IT RD OR SD                      55940021
         BL    ENTBAS              ENTER BASE                           55960021
         TM    BASSTG,XX01              IS IT SD                        55980021
         BZ    PRINT               DO PRINT RTN                         56000021
       B     TSTMOD                    YES, GO ENTER MODE               56020021
*                                                                       56040021
*                                                                       56060021
*                                                                       56080021
*      LEVERL 01-49 OR 77,  ENTER BASE AND DISPLACEMENT DERIVED FRO     56100021
*      THE ADDRESSING ATTRIBUTES.                                       56120021
*                                                                       56140021
*                                                                       56160021
*                                                                       56180021
ENTBAS EQU     *                                                        56200021
         MVC   DECFLD(LX1),DX2(RWB)  GET I FIELD                        56220021
         NI    DECFLD,XXF0          MASK OUT EXTRANEOUS BITS            56240021
       IC    RWA,DECFLD                                                 56260021
         SRA   RWA,DX2              RIGHT JUSTIFIED, DIVIDED BY 4       56280021
       A     RWA,ABASE             ADD ADDRESS OF BASE TYPE TABLE       56300021
         MVC   PRBASE(LX4),DX0(RWA)  ENTER BASE TYPE                    56320021
       SR    RWA,RWA                                                    56340021
         IC    RWA,DX4(RWB)         GET BASE NUMBER                     56360021
         LA    RWD,PRBASE+NX4       INITIALIZE TARGET POINTER           56380021
       BAL   RCS,DECSU1            ENTER DEC NUMBER, ZEROES SUPPRES     56400021
         LA    RWD,DX4(RWD)             UPDATE PTR                      56420021
         UNPK  DECFLD(LX5),DX2(LX3,RWB)                                 56440021
         TR    DECFLD+NX1(LX3),EXTHEX-NX240 CONVERT TO EXTERNAL HEX     56460021
         MVC   DX2(LX3,RWD),DECFLD+NX1 ENTER DISPLACEMENT               56480021
*                                                                       56500021
* ENTER USAGE AND DEFINITION                                            56520021
*                                                                       56540021
         MVC   HEX(LX4),GZEROS                                          56560021
         MVC   PRDS(LX2),DS                                             56580021
       SR    RWA,RWA                                                    56600021
         IC    RWA,DX1(RWB)                                             56620021
         SRA   RWA,DX4              CLEAR LOW ORDER BITS                56640021
         SLA   RWA,DX3              MULTIPLY BY 8                       56660021
       LA    RWF,USAGE                                                  56680021
       AR    RWA,RWF                                                    56700021
         MVC   PRUSG(LX8),DX0(RWA)   ENTER USAGE                        56720021
       SR    RWA,RWF                                                    56740021
         SRA   RWA,DX1              DIVIDE BY 2                         56760021
       LA    RWD,PRDEF                                                  56780021
       BC    UNCOND,DEFRTN(RWA)    GO TO APPROPRIATE DEFINITION ROU     56800021
DEFRTN EQU   *                                                          56820021
       BC    UNCOND,CMPLER         UNASSIGNED                           56840021
       BC    UNCOND,DEFR1          GROUP FIXED                          56860021
       BC    UNCOND,DEFR2          ALPHABETIC                           56880021
       BC    UNCOND,DEFR2          AN                                   56900021
       BC    UNCOND,DEFR3          GROUP VAR                            56920021
       BC    UNCOND,DEFR4          RPT                                  56940021
       BC    UNCOND,DEFR4          STERLING RPT                         56960021
       B     DEFR7                     INDEX-DATA NAME                  56980021
       BC    UNCOND,DEFR5          EXT. DEC.                            57000021
       BC    UNCOND,DEFR5          EXT. FLTG. PT.                       57020021
       BC    UNCOND,DEFR6          INT. FLTG. PT.                       57040021
       BC    UNCOND,DEFR7          BINARY                               57060021
       BC    UNCOND,DEFR8          INT. DEC.                            57080021
       BC    UNCOND,DEFR9          STERLING NON-RPT                     57100021
       B     DEFR10                    ALPHANUMERIC EDITED              57120021
       BC    UNCOND,CMPLER         UNASSIGNED                           57140021
CMPLER EQU     *                                                        57160021
*                                                                       57180021
*                                                                       57200021
*                                                                       57220021
*=E    0017    COMPILER ERROR,  --  MINOR CODE IS ILLEGAL.              57240021
*                                                                       57260021
*                                                                       57280021
*                                                                       57300021
       CNOP    2,4                                                      57320021
         BAL   RCS,ERROR           GO HANDLE ERROR CONDITION            57340021
       DC      X'1181'                                                  57360021
       DC      A(WKAREA)                                                57380021
         BC    UNCOND,EOF          GO END FILE RTN                      57400021
*                                                                       57420021
*                                                                       57440021
*                                                                       57460021
*                                                                       57480021
*                                                                       57500021
*            DEFINITION ROUTINES                                        57520021
*                                                                       57540021
* GROUP FIXED LENGTH                                                    57560021
*                                                                       57580021
DEFR1  EQU   *                     LENGTH IN BITS 47-63                 57600021
         MVC   HEX1(LX3),LNGTH(RWB)      LENGTH IN BITS 55-71           57620021
         NI    HEX+NX1,XX01         MASK OUT 40-46                      57640021
         MVC   PRDEF(LX3),OCL       ENTER GROUP FIXED DEF. HDR          57660021
         LA    RWD,DX3(RWD)         UPDATE RWD                          57680021
       BAL   RCS,DECSUP            ENTER DEC LENGTH, ZEROES SUPPRES     57700021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               57720021
*                                                                       57740021
* ALPHABETIC, ALPHANUMERIC                                              57760021
*                                                                       57780021
DEFR2  EQU   *                     LENGTH IN BITS 48-63                 57800021
         MVC   HEX2(LX2),LENGTH(RWB)     LENGTH IN BITS 56-71           57820021
         BC    UNCOND,DFCOM        ENTER REDEFINE,DEP,OCCURS            57840021
*                                                                       57860021
* GROUP VARIABLE LENGTH                                                 57880021
*                                                                       57900021
DEFR3  EQU   *                     VLC NO. IN BITS 52-63                57920021
         TM    DX2(RWB),MEIGHT    IS VARI. GR ITEM OUT OF LINE          57940021
       BC      ONES,DEFR3B       YES                                    57960021
         MVC   PRDEF(LX4),VLCN    ENTER HEADER VLI=                     57980021
DEFR3A   LA    RWD,DX4(RWD)       UPDATE RWD                            58000021
         MVC   HEX2(LX2),LENGTH(RWB)     VLC NO. IN BITS 60-63          58020021
         NI    HEX+NX2,XX0F                                             58040021
       BAL   RCS,DECSUP            ENTER DEC VLC NO., ZEROES SUPPRE     58060021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               58080021
DEFR3B   MVC   PRDEF(LX4),VLCO    ENTER HEADER VLO=                     58100021
         BC    UNCOND,DEFR3A       BRANCH*                              58120021
*                                                                       58140021
* REPORT                                                                58160021
*                                                                       58180021
DEFR4  EQU   *                                                          58200021
       BAL   RCS,ISPTR             IS GROUP POINTER PRESENT             58220021
       BC    UNCOND,DEFR4B         NO                                   58240021
DEFR4A   MVC   HEX3(LX1),RPTLGH(RWB)     LENGTH IN BITS 112-119         58260021
         BC    UNCOND,DFCOM        ENTER REDEFINE,DEP,OCCRS             58280021
DEFR4B   MVC   HEX3(LX1),RPTLTH(RWB)     LENGTH IN BITS 88-95           58300021
         BC    UNCOND,DFCOM        ENTER REDEFINE,DEP,OCCURS            58320021
*                                                                       58340021
* EXT. DECIMAL, EXT. FLTG. PT.                                          58360021
*                                                                       58380021
DEFR5  EQU   *                     LENGTH IN BITS 56-63                 58400021
         MVC   HEX3(LX1),EXTDEC(RWB)     LENGTH IN BITS 64-71           58420021
         BC    UNCOND,DFCOM        ENTER REDEFINE,DEP,OCCURS            58440021
*                                                                       58460021
* INT. FLTG. PT.                                                        58480021
*                                                                       58500021
DEFR6  EQU   *                     LENGTH IN BITS 56-63                 58520021
       TM    FL6BYT(RWB),SYNCHR         SYNCHRONIZED                    58540021
       BZ    DEFR6B                     NO, ENTER OTHER FIELDS          58560021
         MVI   PRDEF,XC1            ENTER 1                             58580021
         TM    WORDLT(RWB),DOUBLE       DOUBLE PRECISION                58600021
         BC    ONES,DEFR6A         BRANCH                               58620021
         MVI   PRDEF+NX1,XCF        SINGLE PRECISION-ENTER F            58640021
         MVI   PRUSG+NX5,XC1        MAKE USAGE COMP-1                   58660021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               58680021
DEFR6A   MVI   PRDEF+NX1,XCD        DOUBLE PRECISION-ENTER D            58700021
         MVI   PRUSG+NX5,XC2        MAKE USAGE COMP-2                   58720021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               58740021
DEFR6B TM    WORDLT(RWB),DOUBLE         DOUBLE PRECISION                58760021
       BO    DEFR6C                     YES                             58780021
         MVC   PRDEF(LX2),COMP1          SINGLE PREC LNGTH 4            58800021
         MVI   PRUSG+NX5,XC1             MAKE COMP-1                    58820021
         B     ROQ                 CHECK FOR REDEFINITION               58840021
DEFR6C   MVC   PRDEF(LX2),COMP2          DOUBLE PREC                    58860021
         MVI   PRUSG+NX5,XC2             MAKE COMP-2                    58880021
         B     ROQ                 CHECK FOR REDEFINITION               58900021
*                                                                       58920021
* BINARY                                                                58940021
*                                                                       58960021
DEFR7  EQU   *                     UP TO 4,1H.  4 TO 9,1F.  OVER 9,     58980021
       TM    FL6BYT(RWB),SYNCHR         SYNCHRONIZED                    59000021
       BZ    DEFR7D                     NO                              59020021
         CLI   WORDLT(RWB),HALFWD       HALFWORD                        59040021
         BC    HI,DEFR7A           BRANCH                               59060021
         MVI   PRDEF+NX1,XCH                                            59080021
         BC    UNCOND,DEFR7B       BRANCH                               59100021
DEFR7A   MVI   PRDEF+NX1,XCF                                            59120021
         CLI   WORDLT(RWB),ONEWD        FULL WORD                       59140021
         BC    HI,DEFR7C           BRANCH                               59160021
DEFR7B   MVI   PRDEF,XC1                                                59180021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               59200021
DEFR7C   MVI   PRDEF,XC2                                                59220021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               59240021
DEFR7D CLI   WORDLT(RWB),HALFWD                                         59260021
       BH    DEFR7E                     NO                              59280021
         MVC   PRDEF(LX2),COMP           MAKE 2C                        59300021
         B     ROQ                 CHEKC FOR REDEFINITION               59320021
DEFR7E CLI   WORDLT(RWB),ONEWD          ONE WORD                        59340021
       BH    DEFR7F                     NO                              59360021
         MVC   PRDEF(LX2),COMP1          YES, MAKE 4C                   59380021
         B     ROQ                 CHECK FOR REDEFINITION               59400021
DEFR7F   MVC   PRDEF(LX2),COMP2          MAKE 8C                        59420021
         B     ROQ                 CHECK FOR REDEFINITION               59440021
*                                                                       59460021
* INTERNAL DECIMAL                                                      59480021
*                                                                       59500021
DEFR8  EQU   *                                                          59520021
       SR    RWA,RWA                                                    59540021
         IC    RWA,INTDEC(RWB)                                          59560021
         LA    RWA,DX2(RWA)                                             59580021
         SRA   RWA,DX1              L=(C+2)/2                           59600021
         BAL   RCS,DECSU1          BRANCH                               59620021
       AR    RWD,RWF                                                    59640021
         MVI   DX1(RWD),XCP                                             59660021
         BC    UNCOND,ROQ          CHECK FOR REDEFINITION               59680021
*                                                                       59700021
* STERLING NON-REPORT                                                   59720021
*                                                                       59740021
DEFR9  EQU   *                                                          59760021
       BAL   RCS,ISPTR             IS GROUP POINTER PRESENT             59780021
       BC    UNCOND,DEFR9B         N/                                   59800021
DEFR9A   MVC   HEX3(LX1),STRLNR(RWB)     LENGTH IN BITS 99-103          59820021
         NI    HEX+NX3,XX1F         ZERO 3 HIGH ORDER BITS 88-90        59840021
         BC    UNCOND,DFCOM        ENTER REDEFINE,DEP,OCCURS            59860021
DEFR9B   MVC   HEX3(LX1),STRNRT(RWB)     LENGTH IN BITS 75-79           59880021
         NI    HEX+NX3,XX1F         ZERO 64-66 THREE HIGH ORDER BITS    59900021
         B     DFCOM               ENTER REDEFINE,DEP,OCCURS            59920021
*                                                                       59940021
*  ALPHANUMERIC EDITED                                                  59960021
*                                                                       59980021
DEFR10 EQU   *                                                          60000021
       BAL   RCS,ISPTR                 IS GROUP PTR PRESENT             60020021
       B     DEFR1A                    NO                               60040021
         MVC   HEX3(LX1),DX13(RWB)       YES, MOVE LENGTH               60060021
         B     DFCOM               ENTER REDEFINE,DEP,OCCURS            60080021
DEFR1A   MVC   HEX3(LX1),DX10(RWB)       MOVE LENGTH                    60100021
DFCOM  EQU   *                     USED WHERE DEF HAS FORM NC           60120021
         BAL   RCS,DECSUP          BRANCH                               60140021
       AR    RWD,RWF                                                    60160021
         MVI   DX1(RWD),XCC                                             60180021
*                                                                       60200021
*                                                                       60220021
*      ENTER R (REDEFINE), O (OCCURS), AND Q (OCCURS DEPENDING ON).     60240021
*                                                                       60260021
ROQ    EQU     *                                                        60280021
         TM    DX1(RWB),XX01        IS R ON                             60300021
       BC      ONES,ROQR           YES, A REDEFINE ITEM                 60320021
ROQ1     TM    DX1(RWB),XX02        IS O ON                             60340021
       BC      ONES,ROQO           YES, A OCCURS CLAUSE                 60360021
ROQ2     TM    QBYTE(RWB),QBIT          IS QBIT ON                      60380021
       BC      ZERO,PRINT          NO                                   60400021
         MVI   PRQ,XCQ                  YES, ODO CLAUSE                 60420021
       BC      UNCOND,PRINT        ENTER * TO Q                         60440021
ROQR     MVI   PRR,XCR                  ENTER R                         60460021
         BC    UNCOND,ROQ1         REDEFINITION                         60480021
ROQO     MVI   PRO,XCO                  ENTER O                         60500021
         BC    UNCOND,ROQ2         REDEFINITION                         60520021
*                                                                       60540021
*                                                                       60560021
PRINT  EQU   *                                                          60580021
       L     RWA,COSADR                                                 60600021
       LA    RWB,PRLINE                                                 60620021
         LA    RWC,DX120                                                60640021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 60660021
       DC    X'16'                 PUTN PRLINE TO PRINT BUFFER          60680021
*                                                                       60700021
       L     RWA,COSADR                                                 60720021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 60740021
       DC    X'86'                 WRITE ON SYSOU                       60760021
*                                                                       60780021
       BC    NOTZER,CHKEND         NOT END OF PAGE                      60800021
         NI    HDRSW,XX00           END OF PAGE-CAUSE HDR IF NEW PAG    60820021
CHKEND L     RWA,SAVPTR                                                 60840021
       L     RWF,COSADR                                                 60860021
       C     RWA,DICND2-COS(RWF)       LAST DATA ENTRY                  60880021
         BC    NOTEQ,DICSCN        NON-CONTINUANCE                      60900021
       BC    UNCOND,GLORET                                 ********     60920021
*                                                                       60940021
*              SUBROUTINE TO FLAG DICOT TABLE WHEN CHANGE IS MADE       60960021
*                  IN DICTIONARY FOR WRITE-ONLY ITEMS                   60980021
*                                                                       61000021
DCOTBT EQU     *                                                        61020021
       STM     RWD,RWE,SAVERR                                           61040021
       L       RWE,SAVPTR          RWE GETS DICT POINTER                61060021
       N       RWE,DMSECT                   SEGMENT NUMBER              61080021
       S       RWE,DSUBVL                                 - 1           61100021
         SRL   RWE,DX9                                                  61120021
       M       RWD,DCENLG             * 12 = DISPL. IN DICOT TABLE      61140021
       L       RWD,COSADR                                               61160021
       LA      RWD,LDICOT(RWD)     RWD GETS A(DICOT TIB)                61180021
         L     RWD,DX0(RWD)                  A(DICOT TAMM)              61200021
         L     RWD,DX0(RWD)                  A(DICOT-TABLE START)       61220021
         LA    RWD,DX0(RWD,RWE)              A(CURRENT DICOT ENTRY)     61240021
         OI    DX0(RWD),MDCOTB      TURN ON UPDATED-BIT                 61260021
       LM      RWD,RWE,SAVERR                                           61280021
         BCR   UNCOND,RCS          PREPARE PHASE TRANSFER               61300021
         EJECT                                                          61320021
*                                                                       61340021
*                                                                       61360021
*                       T S T W R O                                     61380021
*                                                                       61400021
*                                                                       61420021
*                                                                       61440021
*                                                                       61460021
*      CALLED FROM PHASE INITIALIZATION WHEN NO-GLOSSARY-OPTION         61480021
*       IS ON IN COMMON                                                 61500021
*                                                                       61520021
*FUNCTIONS                                                              61540021
*    GO THROUGH DICTIONARY AND CHANGE MAJOR-CODE                        61560021
*        OF EVERY DATA-NAME UNDER A WRITE-ONLY FD TO 7.  THIS ALLOW     61580021
*       PHASE 4 TO RECOGNIZE ITS PROVENIENCE AND REJECT IT IN ALL       61600021
*       STATEMENTS EXCEPT WRITE.                                        61620021
*                                                                       61640021
*                                                                       61660021
*                                                                       61680021
       DS      0H                                                       61700021
TSTWRO EQU   *                                                          61720021
       L     RWF,COSADR                                                 61740021
       L     RWA,DICND1-COS(RWF)                                        61760021
       C     RWA,DICND2-COS(RWF)                                        61780021
       BC    NOTLO,GLORET         EXIT IF NO DATA DIVISION              61800021
*                                                                       61820021
TSTWR2 L     RAS,ALCNXG           LOCATE NEXT                           61840021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           61860021
         CLI   FRST(RWB),MAJCFD        IS IT FD                         61880021
       BC    NOTEQ,TSTWR4           NO                                  61900021
         TM    DX4(RWB),XX02       IS IT WRITE-ONLY                     61920021
       BC    NOTONE,TSTWR6         NO                                   61940021
         TM    DX4(RWB),XXF0                                            61960021
       BC    NOTZER,TSTWR6         NO                                   61980021
       OI    SWRONL,MSWON       YES - SW ON TO CATCH DN'S TILL NEXT     62000021
         BC    UNCOND,TSTWR8       BRANCH                               62020021
TSTWR4   TM    DX0(RWB),XX07       IS IT DATA-NAME IN FILE SECTION      62040021
       BC    ZERO,TSTWR5            YES- SEE IF UNDER WRITE-ONLY        62060021
         CLI   DX0(RWB),XX0C                                            62080021
       BC    EQ,TSTWR8            CONDITION NAME, GET NEXT              62100021
       B     TSTWR8                    PROCESS REST                     62120021
TSTWR5 EQU    *                                                         62140021
       TM    SWRONL,MSWON              IS IT UNDER WRITE ONLY           62160021
       BC    ZERO,TSTWR8           NO                                   62180021
         OI    DX0(RWB),MAJWRO                                          62200021
       ST      RWA,SAVPTR                                               62220021
       BAL     RCS,DCOTBT         ENTER UPDATE BIT IN DICOT TABLE       62240021
       BC    UNCOND,TSTWR8          GET NEXT                            62260021
TSTWR6 NI    SWRONL,MSWOFF        FD, NOT WRITE-ONLY - SW OFF           62280021
TSTWR8 C     RWA,DICND2-COS(RWF)                                        62300021
       BC    NOTEQ,TSTWR2         RETURN FOR NEXT                       62320021
       BC    UNCOND,GLORET         EXIT AT END OF DATA DIVISION         62340021
       EJECT                                                            62360021
*=1    ERROR                       ERROR MESSAGE ROUTINE                62380021
*******************************************************************     62400021
*                                                                       62420021
*                                                                       62440021
*                             E R R O R                                 62460021
*                                                                       62480021
*                                                                       62500021
*                                                                       62520021
*                                                                       62540021
*      CNOP  0,4                                                        62560021
*      BAL   RCS,ERROR                                                  62580021
*      DC    X'MMSN'               MM=MSG.NO. S=SEVERITY N=NO.PARAM     62600021
*      DC    A(ADDRP1)             ADDRP1=ADDRESS OF PARAMETER 1        62620021
*      DC    A(ADDRP2)                                                  62640021
*      .                                                                62660021
*      .                                                                62680021
*      .                                                                62700021
*      DC    A(ADDRPN)             ADDRPN=ADDRESS OF PARAMETER N        62720021
*      (RETURN)                                                         62740021
*                                                                       62760021
*                                                                       62780021
*FUNCTION                                                               62800021
*  BUILDS ERROR MESSAGE IN ERMSG AND GENERATES IT ON P1 FILE.  THEN     62820021
*  IF PARAMETER LIST PRESENT, BUILDS AND GENERATES PARAMETERS, ONE      62840021
*  AT A TIME.                                                           62860021
*                                                                       62880021
*                                                                       62900021
*      ERROR MESSAGE FORMAT-8 BYTES                                     62920021
*                                                                       62940021
*            //00 06 00 MMMM CCCC S P//                                 62960021
*                                                                       62980021
*            MMMM=MESSAGE NUMBER                                        63000021
*            CCCC=CARD NUMBER                                           63020021
*            S   =SEVERITY CODE (4 BITS)                                63040021
*            P   =PHASE NUMBER (4 BITS)                                 63060021
*                                                                       63080021
*                                                                       63100021
*      PARAMETER FORMAT                                                 63120021
*                                                                       63140021
*            //00 NN PARAM//                                            63160021
*                                                                       63180021
*            PARAM IS AN IC-TEXT ELEMENT.                               63200021
*                                                                       63220021
*                                                                       63240021
*SUBROUTINE CALLED                                                      63260021
*   COUNT                                                               63280021
*                                                                       63300021
*                                                                       63320021
*EXTERNAL REFERENCE                                                     63340021
*   COS                                                                 63360021
*                                                                       63380021
*******************************************************************     63400021
       SPACE   3                                                        63420021
       DS    0F                                                         63440021
ERROR  EQU   *                                                          63460021
       STM   RAS,RWF,SAVERR                                             63480021
         MVC   ERMSG+NX4(LX1),DX0(RCS) ENTER MESSAGE NUMBER             63500021
       L     RWA,COSADR                                                 63520021
         MVC   ERMSG+NX5(LX2),CURCRD     MOVE CARD NUMBER               63540021
         MVZ   ERMSG+NX7(LX1),DX1(RCS) ENTER SEVERITY CODE              63560021
       LA    RWB,ERMSG                                                  63580021
       L     RWA,COSADR                                                 63600021
       BALR  RA0,RWA                   GENERATE MESSAGE                 63620021
       DC    X'23'                                                      63640021
         LA    RWD,DX2(RCS)         RWD STEPS DOWN PARAMETER LIST       63660021
         TM    DX1(RCS),XX0F        ANY PARAMETERS                      63680021
       BC    ZERO,ERROR3           NO-GO OUT                            63700021
         LA    RWB,WKAREA-NX2                                           63720021
       SR    RWC,RWC                                                    63740021
         MVN   EWKBYT,DX1(RCS)                                          63760021
       IC    RWC,EWKBYT            RWC GETS PARAM COUNT, CONTROLS L     63780021
ERROR2   L     RWE,DX0(RWD)         RWE GETS PARAM ADDRESS              63800021
       BAL   RCS,COUNT             GET COUNT OF PARAMETER               63820021
         STC   RWF,WKAREA-NX1                                           63840021
         MVI   WKAREA-NX2,MERHDR                                        63860021
       EX    RWF,ERRMOV            APPEND PARAMETER                     63880021
       L     RWA,COSADR                                                 63900021
       BALR  RA0,RWA                   GENERATE PARAMETER               63920021
       DC    X'23'                                                      63940021
         LA    RWD,DX4(RWD)         POINT TO NEXT PARAMETER             63960021
         BCT   RWC,ERROR2          HANDLE ERROR                         63980021
ERROR3 LR    RCS,RWD                                                    64000021
       LM    RAS,RWF,SAVERR                                             64020021
         BCR   UNCOND,RCS          PREPARE PHASE TRANSFER               64040021
*                                                                       64060021
ERRMOV   MVC   WKAREA(LX1),DX0(RWE)                                     64080021
*                                                                       64100021
         EJECT                                                          64120021
*                                                                       64140021
*=1    INCRAV GENERATES NUM LIT EQUAL TO NO OF ADDITIONAL SBLS          64160021
*      ASSOCIATED WITH INCRA VERB                                       64180021
***********************************************************             64200021
*                                                                       64220021
*                            INCRAV                                     64240021
*                                                                       64260021
*FUNCTION                                                               64280021
*      GENERATES NUM LIT - BB00NN - WHERE NN EQUALS NUMBER OF           64300021
*      SBLS ASSOCIATED WITH FIELD                                       64320021
*                                                                       64340021
*SUBROUTINES CALLED                                                     64360021
*      COPYIN, GETNXT, GETALL, GENDAT, ERROR, EOF                       64380021
*                                                                       64400021
*EXIT POINTS                                                            64420021
*      PHCTRL, EOF                                                      64440021
*                                                                       64460021
*ERROR PROCESSING                                                       64480021
*      IF END-OF-TABLE IS ENCOUNTERED, ERROR MESSAGE 16 IS ISSUED       64500021
*                                                                       64520021
***********************************************************             64540021
INCRAV STM   RWB,RWE,S01PTR                                             64560021
         LA    RWC,DX3                                              475 64580021
INCRA1 BAL   RCS,COPYIN            COPY 'INCRA', '30', 'FA'             64600021
       BAL   RCS,GETNXT            GET '30', 'FA', 'FA'                 64620021
         BCT   RWC,INCRA1          HANDLE TABLE ADDRESS                 64640021
       BAL   RCS,GETALL            GET 'FA' WITH SBL NO                 64660021
       BAL   RCS,COPYIN            COPY 'FA'                            64680021
       L     RWC,COSADR                                                 64700021
       A     RWC,AQSBL             GET QSBL TABLE ABSOLUTE ADDRESS      64720021
         L     RWC,DX0(RWC)         RWC=A(TAMM)                     475 64740021
         L     RWC,DX0(RWC)         RWC=A(TABLE)                    475 64760021
INCRA2   CLC   WKAREA+NX3(LX1),DX0(RWC) ARE SBL NOS EQ                  64780021
       BC    EQ,INCRA3             YES                                  64800021
         CLI   DX0(RWC),XX00        NO, END OF TABLE?               475 64820021
       BC    EQ,INCRA5             YES, ERROR                           64840021
         LA    RWC,DX1(RWC)         NO, ADVANCE QSBL TABLE POINTER  475 64860021
         BC    UNCOND,INCRA2       CHECK END OF TABLE                   64880021
INCRA3 SR    RWD,RWD               GET DIFFERENCE BETWEEN THIS SBL      64900021
       SR    RWE,RWE               AND NEXT ONE IN THE TABLE            64920021
         IC    RWD,DX0(RWC)                                         475 64940021
         LA    RWD,DX1(RWD)                                         475 64960021
         IC    RWE,DX1(RWC)                                         475 64980021
       LTR   RWE,RWE               IS NEXT SBL=0                        65000021
       BC    NOTZER,INCRA4         NO                                   65020021
       LH    RWE,HWD256            YES, REALLY IS 256                   65040021
INCRA4 SR    RWE,RWD                                                    65060021
         STC   RWE,SBLBB+NX2                                        475 65080021
       LA    RWB,SBLBB                                                  65100021
       BAL   RCS,GENDAT            GENERATE BBOONN                      65120021
       LM    RWB,RWE,S01PTR                                             65140021
         BC    UNCOND,PHCTRL       DETERMINE PHASE BRANCH               65160021
INCRA5   BAL   RCS,ERROR           GO HANDLE ERR COND                   65180021
       DC    X'1080'                                                    65200021
         BC    UNCOND,EOF          GO TO END OF FILE                    65220021
       EJECT                                                            65240021
*                                                                       65260021
****************************************************************        65280021
*                      GETADD                                           65300021
*                                                                       65320021
*                                                                       65340021
* FUNCTION                                                              65360021
*   LOCATES THE TABLE BUILT BY PHASE2 FOR THE SEARCH VERB AND           65380021
*   POINTS TO THE PROPER ENTRY IN THE TABLE.                            65400021
*                                                                       65420021
*                                                                       65440021
* DISPLACEMENT INTO TABLE IS SAVED BY SRCHVB                            65460021
*                                                                       65480021
* OUTPUT  RWA POINTS TO PROPER ENTRY IN TABLE                           65500021
*                                                                       65520021
* RETURN                                                                65540021
*   B   RCS                                                             65560021
*                                                                       65580021
*****************************************************************       65600021
*                                                                       65620021
*                                                                       65640021
GETADD L     RWA,COSADR                                                 65660021
       A     RWA,IDXTBL                                                 65680021
         L     RWA,DX0(RWA)                                             65700021
         L     RWA,DX0(RWA)                                             65720021
       A       RWA,SAVDSP                                               65740021
         BR    RCS                 PREPARE PHASE TRANSFER               65760021
         BR    RCS                 PREPARE PHASE TRANSFER               65780021
       EJECT                                                            65800021
*                                                                       65820021
*=2      GETNXT              READ ROUTINE                               65840021
*******************************************************************     65860021
*                                                                       65880021
*                                                                       65900021
*                                                                       65920021
*                             G E T N X T                               65940021
*                                                                       65960021
*                                                                       65980021
*      BAL   RCS,GETNXT                                                 66000021
*      (RETURN)                                                         66020021
*                                                                       66040021
*                                                                       66060021
*FUNCTION                                                               66080021
*   UPDATES PNTIN TO POINT TO NEXT P0-TEXT ELEMENT IN BUFFER.           66100021
*   COMPUTES TOTAL NUMBER OF BYTES IN ELEMENT, STORES IT IN BYTCNT      66120021
*   MOVES FIRST-HALF-WORD OF ELEMENT TO GOTTEN.                         66140021
*                                                                       66160021
*SUBROUTINES CALLED                                                     66180021
*   COUNT, COPYIN                                                       66200021
*                                                                       66220021
*EXTERNAL REFERENCE                                                     66240021
*   COS                                                                 66260021
*                                                                       66280021
*                                                                       66300021
*******************************************************************     66320021
       SPACE   3                                                        66340021
*                                                                       66360021
*                                                                       66380021
GETNXT EQU   *                                                          66400021
       STM   RCS,RWB,SAVGET                                             66420021
*                                                                       66440021
* GET NEW ELEMENT                                                       66460021
*                                                                       66480021
GET2   L     RWB,PNTIN             GET ADDRESS OF CURRENT ELEMENT       66500021
       AH    RWB,BYTCNT            ADD ITS BYTE-COUNT                   66520021
       ST    RWB,PNTIN             POINT PNTIN TO NEW ELEMENT           66540021
         MVC   GOTTEN(LX2),DX0(RWB)  NEW FIRST BYTE TO GOTTEN           66560021
       LR    RWE,RWB                                                    66580021
       BAL   RCS,COUNT             GET BYTE-COUNT OF NEW ELEMENT        66600021
       STH   RWF,BYTCNT            SAVE ITS BYTE COUNT                  66620021
       TM    GOTTEN,MFF                                                 66640021
       BC    ZERO,GET4             ERROR MESSAGE                        66660021
       BC    ONES,GET3             END OF BUFFER                        66680021
       LM    RCS,RWB,SAVGET        NO-EXIT                              66700021
         BCR   UNCOND,RCS          PREPARE PHASE TRANSFER               66720021
*                                                                       66740021
* END OF BUFFER                                                         66760021
*                                                                       66780021
GET3   L     RWA,COSADR            READ IN ANOTHER BLOCK                66800021
         BALR  RA0,RWA             PROCESS FROM 1ST BLK                 66820021
       DC    X'02'                                                      66840021
       BC    ZERO,EOF              BRANCH FOR EOF                       66860021
       ST    RA0,PNTIN             REINIT PNTIN                         66880021
         XC    BYTCNT(LX2),BYTCNT   REINIT BYTCNT                       66900021
       BC    UNCOND,GET2           GET 1ST ELEMENT IN BUFFER            66920021
*                                                                       66940021
* ERROR MESSAGE.  COPY ON OUTPUT FILE.                                  66960021
*                                                                       66980021
GET4     BAL   RCS,COPYIN          GET APROPRIATE RECORD                67000021
         BC    UNCOND,GET2         OBTAIN ELEMENT                       67020021
*                                                                       67040021
       EJECT                                                            67060021
*                                                                       67080021
*                                                                       67100021
*=2    GETALL  MOVES ENTIRE ELEMENT FROM BUFFER TO WORK AREA            67120021
*******************************************************************     67140021
*                                                                       67160021
*                                                                       67180021
*                                                                       67200021
*      BAL   RCS,GETALL                                                 67220021
*      (RETURN)                                                         67240021
*                                                                       67260021
*                                                                       67280021
*FUNCTION                                                               67300021
*   MOVES ENTIRE ELEMENT FROM INPUT BUFFER TO WORK-AREA, IN             67320021
*   PREPARATION FOR CALL TO ACCESS                                      67340021
*                                                                       67360021
*SUBROUTINE CALLED                                                      67380021
*   COUNT                                                               67400021
*                                                                       67420021
*                                                                       67440021
*******************************************************************     67460021
       SPACE   3                                                        67480021
*                                                                       67500021
*                                                                       67520021
GETALL EQU   *                                                          67540021
       STM   RCS,RWF,SAVGET                                             67560021
       L     RWE,PNTIN             RWE HAS SOURCE ADDRESS               67580021
         BAL   RCS,COUNT           GO COUNT                             67600021
       BCTR  RWF,RA0                 SET RWF TO EXECUTE MOVE            67620021
       EX    RWF,GTALMV            MOVE ELEMENT                         67640021
       A     RWF,PADLOC            RWF POINTS TO 1ST BYTE AFTER ELE     67660021
         MVC   DX0(LX3,RWF),ZEROES   PAD WITH ZEROES FOR ACCESS.        67680021
       LM    RCS,RWF,SAVGET                                             67700021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 67720021
GTALMV   MVC   WKAREA(LX1),DX0(RWE)                                     67740021
       EJECT                                                            67760021
*                                                                       67780021
*                                                                       67800021
*=2      GENDAT              WRITE ROUTINE                              67820021
*******************************************************************     67840021
*                                                                       67860021
*                            G E N D A T                                67880021
*                                                                       67900021
*                                                                       67920021
*      LA    RWB,SOURCE-FIELD                                           67940021
*      BAL   RCS,GENDAT                                                 67960021
*      (RETURN)                                                         67980021
*                                                                       68000021
*FUNCTION                                                               68020021
*   WRITES IC-TEXT FROM SOURCE FIELD ON OUTPUT FILE                     68040021
*                                                                       68060021
*EXTERNAL REFERENCE                                                     68080021
*   COS                                                                 68100021
*                                                                       68120021
*******************************************************************     68140021
       SPACE   3                                                        68160021
*                                                                       68180021
*                                                                       68200021
GENDAT EQU   *                                                          68220021
       STM   RCS,RWA,SAVGEN                                             68240021
       L     RWA,COSADR                                                 68260021
         BALR  RA0,RWA             OBTAIN ELEMENT                       68280021
       DC    X'23'                                                      68300021
       LM    RCS,RWA,SAVGEN                                             68320021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 68340021
       EJECT                                                            68360021
*                                                                       68380021
*=2      COPYIN              PUTS CURRENT I/P ELEMENT ON O/P FILE       68400021
*******************************************************************     68420021
*                                                                       68440021
*                             C O P Y I N                               68460021
*                                                                       68480021
*                                                                       68500021
*      BAL   RCS,COPYIN                                                 68520021
*      (RETURN)                                                         68540021
*                                                                       68560021
*                                                                       68580021
*FUNCTION                                                               68600021
*   PUTS CURRENT ELEMENT FROM INPUT BUFFER ON OUTPUT FILE.              68620021
*                                                                       68640021
*SUBROUTINE CALLED                                                      68660021
*   GENDAT                                                              68680021
*                                                                       68700021
*                                                                       68720021
*******************************************************************     68740021
       SPACE   3                                                        68760021
*                                                                       68780021
*                                                                       68800021
COPYIN EQU   *                                                          68820021
       STM   RCS,RWB,SAVCOP                                             68840021
       L     RWB,PNTIN                                                  68860021
         BAL   RCS,GENDAT          CHECK OCCURS PTR                     68880021
       LM    RCS,RWB,SAVCOP                                             68900021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 68920021
       EJECT                                                            68940021
*=2    COPREN   PROCESSES BCD NAME, DATA ITEM, AND PARENTHESIS          68960021
*******************************************************************     68980021
*                                  C O P R E N                          69000021
*                                                                       69020021
*      BAL     RCS,COPREN                                               69040021
*      (RETURN)                                                         69060021
*                                                                       69080021
*FUNCTION                                                               69100021
*   PROCESSES BCD NAME, SPECIAL DATA ELEMENT, AND PARENTHESIS, THEN     69120021
*   GETS NEXT PO-TEXT                                                   69140021
*                                                                       69160021
*SUBROUTINES CALLED                                                     69180021
*   COPYIN, GETNXT, ISTBCD, SEARCH, GENOP,                              69200021
*                                                                       69220021
*                                                                       69240021
*******************************************************************     69260021
       SPACE   3                                                        69280021
COPREN EQU   *                                                          69300021
       ST    RCS,SAVCPR                                                 69320021
COPRN1   BAL   RCS,COPYIN          GET APPROPRIATE RECORD               69340021
COPRN2   BAL   RCS,GETNXT          GET NEXT RECORD                      69360021
COPR2X   BAL   RCS,ISTBCD          IS IT BCD NAME                       69380021
       BC    UNCOND,COPRN3         NO                                   69400021
       BAL   RCS,SEARCH            YES-SEARCH DICTIONARY                69420021
         BC    UNCOND,COPR2X       ERROR-PROCESS NEXT ELEMENT           69440021
       BAL   RCS,GENOP             O.K.-GENERATE P1 OPERAND             69460021
       BC    UNCOND,COPRN2         GO GET NEXT ELEMENT                  69480021
COPRN3 TM    GOTTEN,MDATIC         IS IT SPECIAL DATA ELEMENT           69500021
       BC    ONES,COPRN1           YES-GO COPY                          69520021
         CLC   GOTTEN(LX2),RPAREN   NO-IS IT RIGHT PAREN                69540021
         BC    NOTEQ,COPRN5                 NO, BR                49571 69560021
       BAL   RCS,COPYIN            YES-COPY                             69580021
         BAL   RCS,GETNXT          GET NEXT RECORD                      69600021
COPRN4 L     RCS,SAVCPR                                                 69620021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 69640021
COPRN5   CLC   GOTTEN(LX2),PLUS         IS IT PLUS SIGN           49571 69660021
         BC    EQ,COPRN1                   YES, BR                49571 69680021
         CLC   GOTTEN(LX2),MINUS        IS IT MINUS SGN           49571 69700021
         BC    EQ,COPRN1                   YES, BR                49571 69720021
         TM    GOTTEN,MLIT               IS IT A LITERAL          49571 69740021
         BC    EQ,COPRN1                   YES, BR                49571 69760021
         BC    UNCOND,COPRN4             NO, EXIT                 49571 69780021
       SPACE   10                                                       69800021
*=2    ISTDLM         IS IT DELIMITOR                                   69820021
*******************************************************************     69840021
*                                                                       69860021
*                           I S T D L M                                 69880021
*                                                                       69900021
*      BAL     RCS,ISTDLM                                               69920021
*      (YES RETURN)                                                     69940021
*      (NO RETURN)                                                      69960021
*FUNCTION                                                               69980021
*   SCANS VERB, PERIOD, CRITICAL BREAK, LEFT HAND NAME AND CARD NUM     70000021
*                                                                       70020021
*******************************************************************     70040021
       SPACE   3                                                        70060021
*                                                                       70080021
ISTDLM EQU   *                                                          70100021
       CLI   GOTTEN,MVERB                                               70120021
       BCR   EQ,RCS                VERB (INCLUDES PERIOD)               70140021
       CLI   GOTTEN,MBREAK                                              70160021
       BCR   EQ,RCS                CRITICAL BREAK                       70180021
       CLI   GOTTEN,MLHPNI                                              70200021
       BCR   EQ,RCS                LEFT HAND NAME                       70220021
       CLI   GOTTEN,MCARD                                               70240021
       BCR   EQ,RCS                CARD NUMBER                          70260021
         BC    UNCOND,DX4(RCS)     PREPARE PHASE BRANCH                 70280021
       SPACE   10                                                       70300021
*=2   ISTBCD          IS IT BCD NAME                                    70320021
*******************************************************************     70340021
*                                                                       70360021
*                           I S T B C D                                 70380021
*                                                                       70400021
*      BAL     RCS,ISTBCD                                               70420021
*      (NO RETURN)                                                      70440021
*      (YES RETURN)                                                     70460021
*                                                                       70480021
*FUNCTION                                                               70500021
*   SCANS BCD NAME AND QUALIFIED BCD NAME                               70520021
*                                                                       70540021
*******************************************************************     70560021
       SPACE   3                                                        70580021
*                                                                       70600021
ISTBCD EQU   *                                                          70620021
       CLI   GOTTEN,MBCD                                                70640021
         BC    EQ,DX4(RCS)          BCD NAME                            70660021
       CLI   GOTTEN,MQUAL                                               70680021
         BC    EQ,DX4(RCS)          BCD NAME, QUALIFIED                 70700021
       BCR   UNCOND,RCS            OTHER                                70720021
*                                                                       70740021
       SPACE   10                                                       70760021
*=2    GETLVL         GET LEVEL NUMBER                                  70780021
*******************************************************************     70800021
*                                                                       70820021
*                                                                       70840021
*                           G E T L V L                                 70860021
*                                                                       70880021
*      BAL     RCS,GETLVL                                               70900021
*      (RETURN)                                                         70920021
*                                                                       70940021
*FUNCTION                                                               70960021
*   GETS LEVEL NUMBER FOR GLOSSARY                                      70980021
*                                                                       71000021
*******************************************************************     71020021
       SPACE   3                                                        71040021
*                                                                       71060021
GETLVL EQU   *                                                          71080021
       SR    RWD,RWD                                                    71100021
         IC    RWD,LEVLNO(RWB)          GET LEVEL NO.                   71120021
         SRA   RWD,DX2                                                  71140021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 71160021
       EJECT                                                            71180021
*=1    COUNT                       COMPUTES BYTE-COUNT OF ELEMENT       71200021
*******************************************************************     71220021
*                                                                       71240021
*                             C O U N T                                 71260021
*                                                                       71280021
*                                                                       71300021
*        L     RWE,WKWORD                                               71320021
*        .                                                              71340021
*        .                                                              71360021
*        BAL   RCS,COUNT                                                71380021
*        (RETURN)                                                       71400021
*                                                                       71420021
*FUNCTION                                                               71440021
*  COMPUTES TOTAL BYTE-COUNT OF ENTITY AT 0(RWE) AND RETURNS COUNT      71460021
*  IN RWF                                                               71480021
*                                                                       71500021
*******************************************************************     71520021
       SPACE   3                                                        71540021
*                                                                       71560021
COUNT    EQU   *                                                        71580021
         SR    RWF,RWF                                                  71600021
         IC    RWF,DX0(RWE)                                             71620021
         SRA   RWF,DX6              GET COUNT IN 2 HIGH ORDER BITS      71640021
         LA    RWF,DX1(RWF)         ADD 1 FOR CONTROL BYTE              71660021
         BCR   NOTZER,RCS          PREPARE PHASE BRANCH                 71680021
         IC    RWF,DX1(RWE)         IF ZERO, GET COUNT FROM NEXT BYT    71700021
         LA    RWF,DX2(RWF)         ADD 2 FOR CONTROL BYTES             71720021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 71740021
*                                                                       71760021
       EJECT                                                            71780021
*=1    DECSUP      CONVERTS HEX TO DEC, LDING ZEROES SUPPRESSED         71800021
*******************************************************************     71820021
*                                                                       71840021
*                             DECSUP                                    71860021
*                                                                       71880021
*                                                                       71900021
*      BAL   RCS,DECSUP                                                 71920021
*      (RETURN)                                                         71940021
*                                                                       71960021
*FUNCTION                                                               71980021
*                                                                       72000021
*                                                                       72020021
* CONVERTS HEXADECIMAL INTEGER RIGHT-ADUSTED IN HEX(1 FULL WORD) TO     72040021
* DECIMAL AND MOVES IT, WITH LEADING ZEROES SUPPRESSED, TO 0(RWD).      72060021
* ON RETURN RWF CONTAINS NUMBER OF BYTES MOVED LESS 1.                  72080021
*                                                                       72100021
*******************************************************************     72120021
       SPACE   3                                                        72140021
DECSUP EQU   *                                                          72160021
       L     RWA,HEX               GET HEX NUMBER                       72180021
DECSU1 CVD   RWA,DECFLD            CONVERT TO PACKED DECIMAL            72200021
         MVC   PATERN(LX8),SAVPAT   INITIALIZE PATTERN FOR EDMK         72220021
         EDMK  PATERN(LX8),DECFLD+NX4 6 DIGITS MAX NEEDED.  RWA PTS TO  72240021
         BC    ZERO,DECSU2         BRANCH                               72260021
         LA    RWF,PATERN+NX7       GET ADDR OF LOW ORDER DIGIT         72280021
       SR    RWF,RWA               SUB ADDR OF HI ORDER , GIVING L-     72300021
       EX    RWF,DECMOV                                                 72320021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 72340021
DECSU2   MVI   DX0(RWD),XXF0     SUPPLY 0 FOR ERROR CASE                72360021
         BCR   UNCOND,RCS          PREPARE PHASE BRANCH                 72380021
*                                                                       72400021
DECMOV   MVC   DX0(LX1,RWD),DX0(RWA)                                    72420021
       EJECT                                                            72440021
*=1    ISPTR                       CHECKS FOR PTR TO GROUP ITEM         72460021
*******************************************************************     72480021
*                                                                       72500021
*                             I S P T R                                 72520021
*                                                                       72540021
*                                                                       72560021
*      BAL   RCS,ISPTR                                                  72580021
*      (RETURN WHEN POINTER NOT PRESENT)                                72600021
*      (RETURN WHEN POINTER PRESENT)                                    72620021
*                                                                       72640021
*FUNCTION                                                               72660021
* CHECKS FOR PRESENCE, IN ATTRIBUTES, OF DICTIONARY POINTER TO GROU     72680021
* ITEM. (LOCATION OF LENGTH FIELD CHANGES IF POINTER PRESENT).          72700021
* IF MBS FIELD EQUALS O FIELD, POINTER NOT PRESENT.                     72720021
*                                                                       72740021
*******************************************************************     72760021
       SPACE   3                                                        72780021
ISPTR EQU *                                                             72800021
ISGROC EQU   ISPTR                                                      72820021
         TM    DX1(RWB),XX06        CHK OCCURS, LO ORDER BIT OF MBS     72840021
         BC    MIXED,DX4(RCS)       YES  O=0,MBS=1 OR 3  OR  O=1, MB    72860021
         TM    DX1(RWB),XX08                                            72880021
         BC    ONES,DX4(RCS)        YES  O=0,MBS=2  OR  O=1, MBS=3      72900021
       BCR   UNCOND,RCS            NO                                   72920021
*                                                                       72940021
       EJECT                                                            72960021
*=1      CONSTANT AREA                                                  72980021
*****************************************                               73000021
*                                       *                               73020021
*                                       *                               73040021
*              CONSTANTS                *                               73060021
*                                       *                               73080021
*                                       *                               73100021
*****************************************                               73120021
*                                                                       73140021
*                                                                       73160021
*                                                                       73180021
*                                                                       73200021
*                                                                       73220021
*                                                                       73240021
*   ACCESS PARAMETERS                                                   73260021
*                                                                       73280021
*                                                                       73300021
*        LATRNM                                                         73320021
*                                                                       73340021
ALTRNM   DC    A(LATRNM)                                                73360021
ALTNPR   DC    A(LTNPRM)                                                73380021
LTNPRM   DC    A(WKAREA+1)                                              73400021
WKARSV DS      1F                  PARAMETER AREA                       73420021
*        LDELNM                                                         73440021
*                                                                       73460021
ALDLNM   DC    A(LDELNM)           ACCESS PARAMETER AREA                73480021
ALDEPR   DC    A(LDEPRM)                                                73500021
LDEPRM   DC    X'10'                                                    73520021
         DC    AL3(WKAREA+1)                                            73540021
*                                                                       73560021
*        LATACP                                                         73580021
*                                                                       73600021
ALTACP   DC    A(LATACP)                                                73620021
ALACPR   DC    A(LACPRM)                                                73640021
LACPRM   DC    X'08'                                                    73660021
         DC    AL3(WKAREA+1)                                            73680021
*                                                                       73700021
*                                                                       73720021
*                                                                       73740021
*                                                                       73760021
COSADR DC    A(0)                                                       73780021
AQFILE DC      A(QFILE)            PARAMETER FOR CALLING QFILE TABL     73800021
AQVAR  DC      A(QVAR)             PARAMETER FOR CALLING QVAR TABLE     73820021
AQSBL    DC    A(QSBL)             PARM FOR CALLING QSBL TABLE     4758 73840021
APNTBL DC    X'03'                                                      73860021
       DC    AL3(PNTBL)                                                 73880021
       DC    H'50'                                                      73900021
       DC    H'20'                                                      73920021
       DS    0F                                                         73940021
PRIME  DS    F    90                                                    73960021
INSRT  DS    F                                                          73980021
ASTATC DS    F                                                          74000021
ADPRST DC    A(DPARST)                                                  74020021
AINTAC DC    A(INTACC)                                                  74040021
N3     DC    X'00000003'           CONSTANT FOR 3                       74060021
N4       DC    X'00000004'         CONSTANT FOR 4                       74080021
*                                                                       74100021
ZEROES   DC    X'000000'                                                74120021
EQUALS DC    X'5006'                                                    74140021
GRTRTH DC    X'5008'               FOR                                  74160021
LESSTH DC    X'500A'               CONDITION                            74180021
NOT    DC    X'545C'               NAME                                 74200021
AND    DC    X'545D'               TEXT                                 74220021
OR     DC    X'545E'               GENERATION                           74240021
ERSYM1 DC      X'B90000'           FILLER FOR E-TEXT                    74260021
*                                      UNDEFINED DATA NAMES,            74280021
*                                      NON-UNIQUE R.H. PRO. NAMES       74300021
ERSYM2 DC    X'0604FF000000'       FOR NON-UNIQUE LEFT-HAND NAMES       74320021
WKLOC  DC      A(WKAREA)                                                74340021
PADLOC DC      A(WKAREA+1)                                              74360021
ADNAT2   DC    A(DNMAT2)                                                74380021
AWK    DC    A(WKAREA)                                                  74400021
AERMSG DC    A(ERMSG)                                                   74420021
ALCNXT DC    A(LOCNXT)                                                  74440021
ERMSG  DC    X'0006000000000003'   E-TEXT                               74460021
CBMOVE DC    X'441D'                                                    74480021
CBREAD DC    X'4420'                                                    74500021
CBADD  DC    X'4400'                                                    74520021
ACTABL DC    A(CTABLE)                                                  74540021
CSAME  DC    X'5410'                                                    74560021
CBSUB  DC    X'4401'                                                    74580021
CBCORR DC    X'547A'                                                    74600021
LPAREN DC    X'5200'                                                    74620021
RPAREN DC    X'5201'                                                    74640021
PLUS     DC    X'5300'                    PLUS SIGN               49571 74660021
MINUS    DC    X'5301'                       MINUS SIGN           49571 74680021
CBFROM DC    X'549D'                                                    74700021
CBTO   DC    X'549B'                                                    74720021
CBEOS    DC    X'4406'                                                  74740021
CBIN     DC    X'54A6'                                                  74760021
MOVFNM DC      X'2501'            1ST 2 BYTES OF OVERFLOW-NAME          74780021
DNM    DC    C'DNM='               CONSTANS FOR GLOSSARY ROUTINE        74800021
VLCN   DC    C'VLC='                                                    74820021
VLCO   DC      C'VLO='           VARIABLE LENGTH GROUP OUT OF LINE      74840021
DS     DC    C'DS'                                                      74860021
OCL    DC    C'0CL'                                                     74880021
LVL66 DC     C'66'                                                      74900021
LVL77  DC    C'77'                                                      74920021
LVL88  DC      C'88'                                                    74940021
*                                                                       74960021
GZEROS DC    X'00000000'                                                74980021
SAVPAT DC    X'4020202020202020'   INITIALIZATION FOR DESCUP            75000021
*                                                                       75020021
AAKCES DC      A(AKCESS)                                                75040021
ALCNXG DC    A(LOCNXT)                                                  75060021
ABASE  DC    A(BASE)                                                    75080021
*                                                                       75100021
*      PAGE-HEADER LINE                                                 75120021
*                                                                       75140021
HDRLIN EQU   *                                                          75160021
       DC    7CL1' '               GLOSSARY RTN SET UP AREA             75180021
       DC    C'INTRNL NAME'                                             75200021
       DC    3CL1' '                                                    75220021
       DC    C'LVL'                                                     75240021
       DC    C' '                                                       75260021
       DC    C'SOURCE NAME'                                             75280021
       DC    21CL1' '                                                   75300021
       DC      C'BASE'                                                  75320021
       DC    3CL1' '                                                    75340021
       DC      C'DISPL'                                                 75360021
       DC      3CL1' '                                                  75380021
       DC    C'INTRNL NAME'                                             75400021
       DC    3CL1' '                                                    75420021
       DC    C'DEFINITION'                                              75440021
       DC    3CL1' '                                                    75460021
       DC    C'USAGE'                                                   75480021
       DC      6CL1' '                                                  75500021
       DC      C'R'                REDEFINE                             75520021
       DC      2CL1' '                                                  75540021
       DC      C'O'                OCCURS                               75560021
       DC      2CL1' '                                                  75580021
       DC      C'Q'                OCCURS DEPENDING ON                  75600021
       DC      2CL1' '                                                  75620021
       DC    C'M '                                                      75640021
*                                                                       75660021
*      TABLES                                                           75680021
*                                                                       75700021
BASE   DC      C' BL='                                                  75720021
       DC      C'BLL='                                                  75740021
       DC      C'BLS='                                                  75760021
       DC      X'00000000'                                              75780021
         DC    C'SBL='                                                  75800021
       DC      X'00000000'                                              75820021
       DC      X'00000000'                                              75840021
       DC      X'00000000'                                              75860021
       DC      C'BLO='                                                  75880021
       DC      X'00000000'                                              75900021
       DC      C'BLS='                                                  75920021
       DC      X'00000000'                                              75940021
       DC      C'SBO='                                                  75960021
       DC      X'00000000'                                              75980021
*                                                                       76000021
LVCODE EQU     *                                                        76020021
       DC      C'FD'                                                    76040021
       DC      C'SD'                                                    76060021
       DC      C'FD'                                                    76080021
       DC      C'SA'                                                    76100021
       DC      X'00000000'                                              76120021
       DC      C'RD'                                                    76140021
       DC      X'000000'                                                76160021
*                                                                       76180021
EXTHEX DC    C'0123456789ABCDEF'                                        76200021
*                                                                       76220021
USAGE  DC    C'        '           USAGE FIELDS FOR GLOSSARY            76240021
       DC    C'GROUP   '                                                76260021
       DC    C'DISP    '                                                76280021
       DC    C'DISP    '                                                76300021
       DC    C'GROUP   '                                                76320021
       DC    C'NM-EDIT '                                                76340021
       DC    C'RPT-ST  '                                                76360021
INDEXN DC    C'INDEX-NM'                                                76380021
       DC    C'DISP-NM '                                                76400021
       DC    C'DISP-FP '                                                76420021
       DC    C'COMP-   '                                                76440021
       DC    C'COMP    '                                                76460021
       DC    C'COMP-3  '                                                76480021
       DC    C'DISP-ST '                                                76500021
       DC    C'AN-EDIT '                                                76520021
DCBS   DC      C'DCB='                                                  76540021
DECBS  DC      C'DEC='                                                  76560021
*                                                                       76580021
*                                                                       76600021
AKCESS EQU     *                                                        76620021
       DC      C'QSAM'                                                  76640021
       DC      4CL1' '                                                  76660021
       DC      C'QISAM'                                                 76680021
       DC      3CL1' '                                                  76700021
       DC      C'BISAM'                                                 76720021
       DC      3CL1' '                                                  76740021
       DC      8CL1' '                                                  76760021
       DC      C'BSAM'                                                  76780021
       DC      4CL1' '                                                  76800021
       DC      24CL1' '                                                 76820021
       DC      C'BDAM'                                                  76840021
         DC    4CL1' '                                             4070 76860021
SWON     EQU   X'01'                                                    76880021
READSW DC    X'00'                                                      76900021
QBCDNM   EQU   X'22'                                                    76920021
         DS    0F                                                       76940021
SAVQPT   DS    F                                                        76960021
       EJECT                                                            76980021
*                                                                       77000021
*=1    PHINIT      PHASE 3 INITIALIZATION                               77020021
*******************************************************************     77040021
*                                                                       77060021
*                             P H I N I T                               77080021
*                                                                       77100021
*                                                                       77120021
*FUNCTION                                                               77140021
*   INITIALIZES PHASE 3.                                                77160021
*                                                                       77180021
*                                                                       77200021
*SUBROUTINES CALLED                                                     77220021
*   INTACC                                                              77240021
*                                                                       77260021
*EXTERNAL REFERENCE                                                     77280021
*   PHASE 00                                                            77300021
*                                                                       77320021
*                                                                       77340021
*EXITS POINTS                                                           77360021
*   GLOSRY, PHCTRL                                                      77380021
*                                                                       77400021
*                                                                       77420021
*                                                                       77440021
*NOTES                                                                  77460021
*   IF PHZSW IN COMMON MAP BIT IS ON, INDICATES A GLOSSARY IS REQUI     77480021
*                                                                       77500021
*   PNTIN POINTS THE CURRENT INPUT ENTITY.                              77520021
*                                                                       77540021
*******************************************************************     77560021
       SPACE   3                                                        77580021
PH3    EQU   *                                                          77600021
CBLIEQ30 EQU   *                                                        77620021
         ENTRY CBLIEQ30                                                 77640021
PHASE3 EQU   *                                                          77660021
         ENTRY PHASE3                                                   77680021
PHINIT EQU   *                                                          77700021
IKFCBL30 EQU   PH3                                                      77720021
         STM   RCS,RBF,DX12(R13)  SAVE REGISTERS IN PH0 SAVE AREA       77740021
       CNOP  0,4                                                        77760021
       LR    RWB,R13             SAVE ADDR OF PH0 SAVE AREA IN R2       77780021
         BALR  RAS,RA0             BASE FOR CONTROL CHANGE              77800021
PHINT1 EQU   *                                                          77820021
       USING   *,RAS                                                    77840021
         BC    R15,DX8(RAS)         GO TO TABLE LOC                     77860021
       DC    A(PH3SAV)                                                  77880021
         L     R13,DX4(RAS)      SET R13 TO ADDR OF PHASE  SAVE AREA    77900021
         ST    RCS,DX12(R13)     SAVE SYSTEM RETURN ADR IN PHASE SV     77920021
         ST    RWB,DX4(R13)       PUT PTR TO PH0 SV AREA IN PHASE SV    77940021
         ST    R13,DX8(RWB)       PUT PTR TO PHASE SV AREA IN PH0 SV    77960021
       L       RBF,APBG12                                               77980021
         LM    RBA,RBD,ACOMN1             LOAD REGS               39847 78000021
         L     RWA,DX0(RWA)                                             78020021
       ST    RWA,COSADR                                                 78040021
       L     RWB,ADPRST                                                 78060021
         ST    RWA,DX0(RWB)                                             78080021
         L     RWA,BEGPH3                                               78100021
            L     RAS,COSADR                                            78120021
         BALR  RA0,RAS             BASE INTERPHASE/INFREQUENT           78140021
            DC    X'06'                                                 78160021
            L     RWA,COSADR                                            78180021
       L     RAS,AINTAC                                                 78200021
         BALR  RCS,RAS             BASE INTERPHASE/INFREQUENT           78220021
*                                                                       78240021
       L     RAS,APINIT                                                 78260021
         MVC   SGLMT(LX1),SEGLMT                                        78280021
NSEGT    TM    PHZSW1,XX20              DMAP                            78300021
         BC    ONES,GLOSRY         SCAN DATA DIV ENTRIES                78320021
         BC    UNCOND,TSTWRO       CHECK FOR DATA DIVISION              78340021
*                                                                       78360021
ACOMN1 DC      A(COMON1)                                                78380021
       DC      A(COMON2)                                                78400021
       DC      A(COMON3)                                                78420021
         DC    A(COMON2A)               CSECT NUM = 4             39847 78440021
APBG12 DC      A(PBEG12)                                                78460021
BEGPH3   DC    A(ENTPH3)                                                78480021
       DROP  RAS                                                        78500021
       EJECT                                                            78520021
       EJECT                                                            78540021
*****************************************************************       78560021
*                                                                       78580021
*                                                                       78600021
*                                                                       78620021
*                                                                       78640021
*                  P H A S E    3   T A B L E S                         78660021
*                                                                       78680021
*                                                                       78700021
*                                                                       78720021
*      PTYTBL                                                           78740021
*                                                                       78760021
*          PRIORITY NUMBER TABLE FOR SYNTAX CHECKING TO BE DONE         78780021
*          BY PHASE 4 FOR PN'S.                                         78800021
*                                                                       78820021
*                                                                       78840021
*      TIB19                                                            78860021
*      PRIMED FOR 50 BYTES                                              78880021
*      ENTRY LENGTH 3 BYTES                                             78900021
*      GROWTH FACTOR 20 BYTES                                           78920021
*                                                                       78940021
*                                                                       78960021
*      FORMAT                                                           78980021
*          BYTE                                                         79000021
*          0-1     SECTION NUMBER FOR PN                                79020021
*          2       PRIORITY NUMBER FOR PN                               79040021
*                                                                       79060021
*                                                                       79080021
*      ENTRIES ARE MADE AFTER 'INSERT' GETS SPACE                       79100021
*                                                                       79120021
*                                                                       79140021
       EJECT                                                            79160021
*                                                                       79180021
*                                                                       79200021
*                                                                       79220021
*  THE FOLLOWING TABLES ARE BUILT BY PHASE 2 AND PASSED TO              79240021
*   PHASE 3.                                                            79260021
*                                                                       79280021
*                                                                       79300021
*                                                                       79320021
*                                                                       79340021
*      QFILE                                                            79360021
*                                                                       79380021
*          FOR QSAM, QISAM OR BISAM AT LEAST ONE OF WHOSE RECORDS       79400021
*          CONTAINS AN OCCURS ... DEPENDING ON CLAUSE.                  79420021
*          PHASE 3 USES TO APPEND GNCT AND GN NUMBER TO                 79440021
*          ATTRIBUTES OF FD'S OF CORRESPONDING FILES.                   79460021
*                                                                       79480021
*                                                                       79500021
*      TIB23                                                            79520021
*                                                                       79540021
*                                                                       79560021
*      FORMAT                                                           79580021
*                                                                       79600021
*          BYTE                                                         79620021
*          0-1     DCB NUMBER ASSIGNED TO THE FILE                      79640021
*          2-3     Q-ROUTINE GN NUMBER                                  79660021
*                                                                       79680021
*                                                                       79700021
*      TABLE IS RELEASED AT END OF PHASE                                79720021
*      THE LAST ENTRY IS FOLLOWED BY 2 BYTES OF ZEROS.                  79740021
*                                                                       79760021
*                                                                       79780021
       EJECT                                                            79800021
*                                                                       79820021
*                                                                       79840021
*                                                                       79860021
*                                                                       79880021
*      QVAR                                                             79900021
*                                                                       79920021
*          FOR ITEMS WITH OCCURS ... DEPENDING ON CLAUSES.              79940021
*          PHASE 3 USES TO APPEND THE GN NUMBER TO THE                  79960021
*          ATTRIBUTES OF THE OBJECT OF THE ODO CLAUSE.                  79980021
*                                                                       80000021
*                                                                       80020021
*                                                                       80040021
*      TIB24                                                            80060021
*                                                                       80080021
*      FORMAT                                                           80100021
*                                                                       80120021
*          BYTE                                                         80140021
*          0-3     DICT PTR TO OBJECT OF ODO CLAUSE.                    80160021
*          4-5     GN NUMBER FOR THE Q-ROUTINE FOR THIS ITEM.           80180021
*                                                                       80200021
*                                                                       80220021
*          TABLE IS RELEASED AT END OF PHASE                            80240021
*      THE LAST ENTRY IS FOLLOWED BY 6 BYTES OF ZEROS.                  80260021
*                                                                       80280021
*                                                                       80300021
*                                                                       80320021
       EJECT                                                            80340021
*                                                                       80360021
*                                                                       80380021
*                                                                       80400021
*                                                                       80420021
*      TBSERCH                                                          80440021
*                                                                       80460021
*                                                                       80480021
*          FOR ITEMS WITH OCCURS CLAUSES AND KEY CLAUSES.               80500021
*          PHASE 3 USES TO CHECK FOR THE VALIDITY OF IDENTOFIER-1       80520021
*          IN THE SEARCH AND SEARCH ALL STATEMENTS AND TO               80540021
*          APPEND ADDITIONAL INFORMATION FOR SYNTAX CHECKING            80560021
*          TO BE DONE BY PHASE 4.                                       80580021
*                                                                       80600021
*                                                                       80620021
*      TIB                                                              80640021
*                                                                       80660021
*                                                                       80680021
*      FORMAT                                                           80700021
*                                                                       80720021
*          NUMBER OF BYTES                                              80740021
*          1       COUNT OF ENTRY                                       80760021
*          3       DICT PTR TO IDENTIFIER-1                             80780021
*          1       FLAG BYTE IF 1 NEXT BYTE DICT PTR TO OBJECT          80800021
*                      OF ODO                                           80820021
*          3       DICT PTR TO OBJECT OF ODO OR MAXIMUM                 80840021
*                      NUMBER OF OCCURENCES                             80860021
*          3       MINIMUN NUMBER OF OCCURENCES                         80880021
*          1       CT   NUMBER OF INDEX NAMES                           80900021
*          CT*3    DICT PTRS TO INDEX NAMES                             80920021
*          1       CT    NUMBER OF KEYS                                 80940021
*          CT*3    DICT PTRS TO KEYS                                    80960021
*                                                                       80980021
*****************************************************************       81000021
       EJECT                                                            81020021
IKF304 CSECT                                                            81040021
COMON3 EQU     *                                                        81060021
*=1      DATA AREAS                                                     81080021
*****************************************                               81100021
*                                       *                               81120021
*                                       *                               81140021
*              DATA AREAS               *                               81160021
*                                       *                               81180021
*                                       *                               81200021
*****************************************                               81220021
*                                                                       81240021
*                                                                       81260021
         DS    0F                                                       81280021
DATA   EQU     *                                                        81300021
USGIND EQU   X'70'                                                      81320021
PH3SAV DS    18F                   PHASE 3 SAVE AREA                    81340021
         DS    CL3                      TO POSITION WKAREA+1 ON FUL     81360021
*                                       WORD AS REQUIRED BY ACCESS      81380021
WKAREA   DS    CL100                    WORK-AREA                       81400021
DNMATT   EQU   WKAREA+2                 ATTRIBUTES ARE MOVED IN HER     81420021
DNMAT2   EQU   WKAREA+10                                                81440021
WKWORD   DS    1F                  USED BY VARIOUS CONVERSION ROUTI     81460021
WKBYTE   DC    X'00'               NES                                  81480021
       DC    X'00'                 MUST FOLLOW WKBYTE                   81500021
*                                                                       81520021
GENCRD DC    X'810000'             CURRENT CARD NUMBER                  81540021
       DS    0F                                                         81560021
QERPRM DS    8F                    SAVE AREA FOR E-TEXT                 81580021
PNTIN  DS    1F                    BUFFER POINTER                       81600021
BYTCNT DC    X'0000'               BYTE COUNT FOR CURRENT ITEM          81620021
GOTTEN DS    1H                    FIRST TWO BYTES OF CURRENT ELEME     81640021
SAVGNP DS    1F                    SAVES DICT PTR FOR GENOP             81660021
SAVGET DS    9F                    SAVE AREA FOR SUBROUTINES            81680021
SAVGEN DS    5F                                                         81700021
SAVCOP DS    5F                    SAVE AREA FOR COPYIN                 81720021
SAVSCH DS    1F                    SAVES DICT PTR FOR SEARCH ROUTIN     81740021
SAVERR DS      9F                  E                                    81760021
SVPRWA DS      1F                                                       81780021
SAVRCS DS      1F                                                       81800021
N1     DC      XL4'1'              CONSTANT FOR 1                       81820021
N6     DC      XL4'6'              CONSTANT FOR 6                       81840021
N8       DC    F'8'                      CONSTANT FOR 8           46200 81860021
PTRTEMP  DC    F'0'          TEMP STORAGE FOR DELIMITER PTR             81880021
       DS    0F                                                         81900021
XX3F     EQU   X'3F'                                                    81920021
SAVREG DS    2F                                                         81940021
       DS    0F                                                         81960021
*                                                                       81980021
*   NON-CONSTANT ACCESS PARAMETERS                                      82000021
*                                                                       82020021
*        LATGRP                                                         82040021
*                                                                       82060021
ALTGRP   DC    A(LATGRP)                                                82080021
ALTGPR   DC    A(LTGPRM)                                                82100021
LTGPRM   DC    X'0C'                                                    82120021
         DC    AL3(WKAREA+1)                                            82140021
SECPTR DC      XL4'200'           HAS DICT. PTR OF CURRENT SECTION      82160021
*                                                                       82180021
*        LATRPT                                                         82200021
*                                                                       82220021
ALTRPT   DC    A(LATRPT)                                                82240021
ALPTPR   DC    A(LPTPRM)                                                82260021
LPTPRM   DC    X'04'                                                    82280021
         DC    X'000000'                                                82300021
AVALTR DC    A(VALTRU)                                                  82320021
CURRPTY  DC    X'FF'               CURRENT PRIOITY NUMBER               82340021
CARDSW   DC    X'00'               SET ON IF GENOP RTN NEEDS TO GEN     82360021
SEGT     EQU   X'FF'                CARD NUMBER                         82380021
SGLMT    DC    X'00'               SEGMENT LIMIT FROM PHASE 00 CELL     82400021
ATXTSW   DC    X'00'               SET ON WHEN 37 ITEM IS SAVED         82420021
ATXTSVD  DC    36X'00'             37 ITEM SAVE AREA                    82440021
ISTPRO EQU   X'05'                                                      82460021
         DS    0F                                                       82480021
SVDPTR DS    F                                                          82500021
S01PTR DS    15F                                                        82520021
S01LNG DS    H                                                          82540021
OHONE DS    CL1                                                         82560021
         DS    0F                                                       82580021
SAVLVL DS    H                                                          82600021
LVNM66 DC    X'0039'                                                    82620021
APINIT DC    A(PHINT1)                                                  82640021
CNTRLBK  DC    X'420D'             CONTROL BREAK FOR SEGMENTATION       82660021
         EJECT                                                          82680021
*                                                                       82700021
*      PRINT-LINE                                                       82720021
*                                                                       82740021
       DS    0F                                                         82760021
PRLINE DS      CL122               SET UP AREA FOR GLOSSARY             82780021
PRIN1   EQU  PRLINE+7                                                   82800021
PRLVL  EQU   PRLINE+21                                                  82820021
PRSNAM EQU   PRLINE+25                                                  82840021
PRBASE EQU   PRLINE+56                                                  82860021
PRDISP EQU   PRLINE+63                                                  82880021
PRIN2  EQU   PRLINE+72                                                  82900021
PRDS   EQU   PRLINE+86                                                  82920021
PRDEF  EQU   PRLINE+89                                                  82940021
PRUSG  EQU   PRLINE+99                                                  82960021
PRR    EQU   PRLINE+110                                                 82980021
PRO    EQU   PRR+3                                                      83000021
PRQ    EQU   PRO+3                                                      83020021
PRM    EQU   PRQ+3                                                      83040021
MODEF  EQU   X'20'                                                      83060021
MODEV  EQU   X'40'                                                      83080021
MODES  EQU   X'60'                                                      83100021
*                                                                       83120021
*                                                                       83140021
MIDNM  EQU   X'6F'                                                      83160021
*                                                                       83180021
RPTCOD EQU   X'24'                                                      83200021
WTHCOD EQU   X'80'                                                      83220021
MSORT  EQU   X'36'                                                      83240021
MRETRN EQU   X'2A'                                                      83260021
SORTSW DC    X'00'                                                      83280021
DECFLD DS    1D                                                         83300021
HEX    DS    1F                                                         83320021
SVHPTR DC    X'0000'                                                    83340021
SAVPTR DS    1F                                                         83360021
PATERN DS    CL8                                                        83380021
*                                                                       83400021
HDRSW  DC    X'00'                 IF GLOSSARY NEEDS PAGE READER        83420021
SAVRPD DS      1F                                                       83440021
SAVABC DS    3F                                                         83460021
EWKBYT DC    X'00'                                                      83480021
CRVRSW DC    X'00'                                                      83500021
SWRONL DC    X'0'            ON SAYA TO FLAG DATA-NAMES AS WRITE-ON     83520021
CTABLE DS    49F                                                        83540021
DN1SFP DS    1F                                                         83560021
DN1SFA DS    1F                    ADD SAVE FOR CORRTN   DATA NAME      83580021
DN2SFP DS    1F                    1                                    83600021
DN2SFA DS    1F                    ADD SAVE FOR CORRTN   DATA NAME      83620021
LVLDIF DS    1H                    LEVEL NUM DIFF BETWEEN DATA NAME     83640021
COPREP DS    1H                    S                                    83660021
CELCNT DC    X'00'                                                      83680021
       DS    0F                                                         83700021
CLTGP1 DC    X'0C'                                                      83720021
       DC    AL3(WKAREA+1)                                              83740021
CLTGP2 DC    X'00000000'                                                83760021
DN1PTR DS    1F                    PTR SAVE FOR CORRTN Ý DATA NAME      83780021
DN1LVL DS    1H                    LEVEL SAVE FOR DATA NAME 1           83800021
DN2PTR DS    1F                    PTR SAVE FOR CORRTN   DATA NAME      83820021
DN2LVL DS    1H                    LEVEL SAVE FOR DATA NAME 2           83840021
SAVCPR DS    1F                                                         83860021
DN1SFL DS    1H                                                         83880021
COVERB DS    1H                                                         83900021
COVER1 EQU   COVERB+1                                                   83920021
SECNUM DS    H                     SECTION NUMBER FOR PROCEDURE NAM     83940021
SAVSEC DS    H                     E                                    83960021
OP2ESW DC    X'00'                                                      83980021
CGENSW DC    X'00'                                                      84000021
XREFHDR EQU  X'4C'                                                      84020021
DUMYPN EQU   X'20'                                                      84040021
SKPLVL DC    X'0000'                                                    84060021
DN2EPR DS    1F                                                         84080021
GNCT     DC    H'0'                                               47031 84100021
MVCRSPRG DC    X'00'              MOVE CORRESPONDING - SPEC REG   47031 84120021
*                                                                       84140021
         DS    0F                                                       84160021
LEV77    DC    X'00000031'                                              84180021
BIT4     EQU   X'08'                                                    84200021
BIT5     EQU   X'04'                                                    84220021
DNMAT5   EQU   DNMATT+5                                                 84240021
DNMAT6   EQU   DNMATT+6                                                 84260021
END      EQU   9                                                        84280021
SAVPT1   EQU   SAVPTR+1                                                 84300021
MAJCFD   EQU   X'98'                                                    84320021
RANPFD   EQU   X'9A'                                                    84340021
CNT      EQU   8                                                        84360021
*                                                                       84380021
*MASKS FOR DELETING BYTE #6 OF LD ENTRY                                 84400021
*                                                                       84420021
*                                                                       84440021
MSKFST   EQU   X'03'                    PRESERVE BITS 6&7               84460021
*                                                                       84480021
*MASKS AND EQU'S FOR GLOSRY ROUTINE                                     84500021
*WHERE TO FIND THE LENGTH OF THE DATA NAME                              84520021
*                                                                       84540021
*                                                                       84560021
DOUBLE   EQU   X'01'                    DOUBLE PRECISION ENTRY          84580021
HALFWD   EQU   X'04'                    HALF WORD                       84600021
FRST     EQU   0                                                        84620021
ONEWD    EQU   X'09'                    FULL WORD                       84640021
QBIT     EQU   X'02'                    TESTS IF Q-BIT ON               84660021
*   LENGTH BYTE  DIFFERS DEPENDING ON TYPE OF DATA-NAME                 84680021
LEVLNO   EQU   6                        FIXED GROUP                     84700021
QBYTE    EQU   LEVLNO                                                   84720021
LNGTH    EQU   QBYTE                                                    84740021
*                                                                       84760021
LENGTH   EQU   7                                                        84780021
*                                                                       84800021
EXTDEC   EQU   8                        EXTERNAL DECIMAL                84820021
INTDEC   EQU   EXTDEC                   INTERNAL DECIMAL                84840021
WORDLT   EQU   INTDEC                                                   84860021
*                                                                       84880021
STRNRT   EQU   9                        STERLING NON-REPORT NOT GRO     84900021
*                                                                       84920021
RPTLTH   EQU   11                       REPORT NOT GROUP                84940021
*                                                                       84960021
STRLNR   EQU   12                       STERLING NON-REPORT GROUP       84980021
*                                                                       85000021
RPTLGH   EQU   14                       REPORT GROUP                    85020021
*                                                                       85040021
HEX1     EQU   HEX+1                                                    85060021
HEX2     EQU   HEX1+1                                                   85080021
HEX3     EQU   HEX2+1                                                   85100021
SAVGN  DC      X'0000'      SAVE THE GN WITH MATCHED DIC PTR            85120021
SVDLNY DS      3F           SAVE SEC + DISPL,START ADDR,DIC PTR ENT     85140021
ERAREA DS      9F                                                       85160021
BASSTG DC      X'00000000'                                              85180021
ATTPTR DS      1F                                                       85200021
LVLSTG DS      1F                                                       85220021
AFILER DC    X'06C6C9D3D3C5D9'       'FILLER' AND COUNT                 85240021
*                                                                       85260021
*                                                                       85280021
*                                                                       85300021
LPTPR1   EQU   LPTPRM+1                                                 85320021
WKARE1   EQU   WKAREA+1                                                 85340021
WKARE7   EQU   WKAREA+7                                                 85360021
*                                                                       85380021
FIRST    EQU   0                                                        85400021
ONE      EQU   1                                                        85420021
SECTNO   EQU   3                                                        85440021
NAME3    EQU   3                                                        85460021
NEXTSC   EQU   7                                                        85480021
PRTYNO   EQU   6                                                        85500021
COMP1    DC    C'4C'                                                    85520021
COMP   DC    C'2C'                                                      85540021
COMP2  DC    C'8C'                                                      85560021
SYNCHR   EQU   X'40'                                                    85580021
FL6BYT EQU   5                                                          85600021
       DS    0F                                                         85620021
VALSAV DS    F                                                          85640021
VALSV1 DS    F                                                          85660021
CONPTR DS    F                                                          85680021
CONSAV DS    F                                                          85700021
CONPT1 EQU   CONPTR+1                                                   85720021
THRUSW EQU   X'80'                                                      85740021
CONDSW DC    X'00'                                                      85760021
*                                                                       85780021
         DS    0F                                                       85800021
SAVPNP   DS    F                                                        85820021
SAVPN2   DC    F'0'                                                     85840021
SIX      DC    X'00000005'                                              85860021
SAVPN1   EQU   SAVPNP+1                                                 85880021
SAVPN3   EQU   SAVPN2+1                                                 85900021
ZEROS    DC    X'0000'                                                  85920021
NXTSEC   DC    X'0000'                                                  85940021
*                                                                       85960021
*                                                                       85980021
*                                                                       86000021
REGATT DC    X'04B0FF000B050004000000' SORT-RETURN                      86020021
       DC    X'04B0FF000C050008000000' SORT-CORE-SIZE                   86040021
       DC    X'04B0FF000D050008000000' SORT-FILE-SIZE                   86060021
       DC    X'04B0FF000E050005000000' SORT-MODE-SIZE                   86080021
       DC    X'0430FF0008040008000000'  CURRENT-DATE                    86100021
       DC    X'0480FF0009040006000000'  TIME-OF-DAY                     86120021
       DC    X'0430FF000F040001000000' LABEL-RETURN                     86140021
         DC    X'04B0FF0010050004000000'          RETURN-CODE           86160021
SPCREG DC    X'0B'                                                      86180021
SORTRTRN EQU   *                                                  42047 86200021
       DC    C'SORT-RETURN   '                                          86220021
       DC    X'0E'                                                      86240021
       DC    C'SORT-CORE-SIZE'                                          86260021
       DC    X'0E'                                                      86280021
       DC    C'SORT-FILE-SIZE'                                          86300021
       DC    X'0E'                                                      86320021
       DC    C'SORT-MODE-SIZE'                                          86340021
       DC    X'0C'                                                      86360021
       DC    C'CURRENT-DATE  '                                          86380021
       DC    X'0B'                                                      86400021
       DC    C'TIME-OF-DAY   '                                          86420021
       DC    X'0C'                                                      86440021
       DC    C'LABEL-RETURN  '                                          86460021
       DC    X'0B'                                                      86480021
       DC    C'RETURN-CODE   '                                          86500021
*                                                                       86520021
       DS    0F                                                         86540021
TEMPT  DC    F'0'                                                       86560021
IDXTBL DC    A(INDKEY)                                                  86580021
TEMPTR EQU   TEMPT+1                                                    86600021
ID1PTR DS    F                                                          86620021
SAVSTR DS    F                                                          86640021
SAVCTR DS    H                                                          86660021
SAVDSP EQU SAVSTR                                                       86680021
ID2PTR EQU   ID1PTR                                                     86700021
SAVRWC EQU   ID2PTR                                                     86720021
SAVLTH DS    H                                                          86740021
ODO    EQU   4                                                          86760021
NUMOCC DC    X'3203000000'                                              86780021
MAX    EQU   5                                                          86800021
FRSTID EQU   8                                                          86820021
VARYING DC   X'5488'                                                    86840021
INDNM  EQU   X'0F'                                                      86860021
IDCT   EQU   FRSTID                                                     86880021
IDPTR  EQU   IDCT+1                                                     86900021
KEYCT  EQU   0                                                          86920021
MSRCH  EQU   X'5E'                                                      86940021
KEYCNT DC    X'BB0000'                                                  86960021
MSRCHAL EQU  X'5F'                                                      86980021
MOPEN  EQU   X'21'                                                      87000021
OPVB   DC    X'00'                                                      87020021
HWD1     DC    H'1'                                                4758 87040021
HWD256   DC    H'256'                                              4758 87060021
SBLBB    DC    X'BB0000'                                           4758 87080021
SBLERR   DC    X'2207'                                             4758 87100021
         DC    C'SBL NO.'                                          4758 87120021
P3PTCH   DS    0F               PATCH SPACE                             87140021
IKFPATCH DS    0H                                                       87160021
PATCH    B     IKFPATCH                                                 87180021
         DC    800X'FF'            PATCH SPACE                    PATCH 87200021
*                                                                       87220021
LASTIN EQU     DATA+4095                                                87240021
*                                                                       87260021
*                                                                       87280021
FIN    EQU     *                                                        87300021
DX1      EQU   1                                                        87320021
DX2      EQU   2                                                        87340021
NX2      EQU   2                                                        87360021
LX2      EQU   2                                                        87380021
DX3      EQU   3                                                        87400021
NX3      EQU   3                                                        87420021
LX3      EQU   3                                                        87440021
DX4      EQU   4                                                        87460021
NX4      EQU   4                                                        87480021
DX5      EQU   5                                                        87500021
NX5      EQU   5                                                        87520021
LX5      EQU   5                                                        87540021
DX6      EQU   6                                                        87560021
NX6      EQU   6                                                        87580021
DX7      EQU   7                                                        87600021
NX7      EQU   7                                                        87620021
DX8      EQU   8                                                        87640021
NX8      EQU   8                                                        87660021
DX9      EQU   9                                                        87680021
NX9      EQU   9                                                        87700021
DX10     EQU   10                                                       87720021
NX10     EQU   10                                                       87740021
DX11     EQU   11                                                       87760021
NX11     EQU   11                                                 39847 87780021
DX12     EQU   12                                                       87800021
DX13     EQU   13                                                       87820021
NX13     EQU   13                                                 39847 87840021
DX14     EQU   14                                                       87860021
NX16     EQU   16                                                       87880021
DX120    EQU   120                                                      87900021
NX240    EQU   240                                                      87920021
XX05     EQU   X'05'                                                    87940021
XX89     EQU   X'89'                                                    87960021
XX80     EQU   X'80'                                                    87980021
XX02     EQU   X'02'                                                    88000021
XX01     EQU   X'01'                                                    88020021
XX04     EQU   X'04'                                                    88040021
XX00     EQU   X'00'                                                    88060021
XX5E     EQU   X'5E'                                                    88080021
XX10     EQU   X'10'                                                    88100021
XX32     EQU   X'32'                                                    88120021
XXFF     EQU   X'FF'                                                    88140021
XXF0     EQU   X'F0'                                                    88160021
XX03     EQU   X'03'                                                    88180021
XXFE     EQU   X'FE'                                                    88200021
XX0B     EQU   X'0B'                                                    88220021
XX08     EQU   X'08'                                                    88240021
XX36     EQU   X'36'                                                    88260021
XX37     EQU   X'37'                                                    88280021
XXEF     EQU   X'EF'                                                    88300021
XX7F     EQU   X'7F'                                                    88320021
XX39     EQU   X'39'                                                    88340021
XX23     EQU   X'23'                                                    88360021
XX88     EQU   X'88'                                                    88380021
XX0E     EQU   X'0E'                                              39847 88400021
XX0F     EQU   X'0F'                                                    88420021
XX07     EQU   X'07'                                                    88440021
XX40     EQU   X'40'                                                    88460021
XX60     EQU   X'60'                                                    88480021
XX8B     EQU   X'8B'                                                    88500021
XX09     EQU   X'09'                                                    88520021
XX1F     EQU   X'1F'                                                    88540021
XX0C     EQU   X'0C'                                                    88560021
XX06     EQU   X'06'                                                    88580021
XX20     EQU   X'20'                                                    88600021
XC0      EQU   C'0'                                                     88620021
XCT      EQU   C'T'                                                     88640021
XCC      EQU   C'C'                                                     88660021
XCF      EQU   C'F'                                                     88680021
XCV      EQU   C'V'                                                     88700021
XCS      EQU   C'S'                                                     88720021
XCU      EQU   C'U'                                                     88740021
XC1      EQU   C'1'                                                     88760021
XCD      EQU   C'D'                                                     88780021
XC2      EQU   C'2'                                                     88800021
XCH      EQU   C'H'                                                     88820021
XCP      EQU   C'P'                                                     88840021
XCQ      EQU   C'Q'                                                     88860021
XCR      EQU   C'R'                                                     88880021
XCO      EQU   C'O'                                                     88900021
LX4      EQU   4                                                        88920021
LX6      EQU   6                                                        88940021
LX7      EQU   7                                                        88960021
LX8      EQU   8                                                        88980021
LX9      EQU   9                                                        89000021
LX10     EQU   10                                                       89020021
LX11     EQU   11                                                       89040021
LX12     EQU   12                                                       89060021
LX32     EQU   32                                                       89080021
LX120    EQU   120                                                      89100021
       END     PHASE3                                                   89120021
