*$MODULE       IKFCBL00                                                 00020021
PH00     TITLE 'IKFCBL00'                                               00040021
       PRINT ON,GEN,DATA                                                00060021
*                                                                       00080021
*                                                                       00100021
*TITLE:                                                                 00120021
*                                                                       00140021
*              'IKFCBL00'                                               00160021
*                                                                       00180021
*STATUS:                                                                00200021
*                                                                       00220021
*   CHANGE LEVEL 000                                                    00240021
*                                                                       00260021
*FUNCTION/OPERATION : ACTS AS THE INTERFACE BETWEEN COMPILER AND TH     00280021
*   OPERATING SYSTEM.  HANDLES I/O CONTROL.  PERFORMS PROCESSING AF     00300021
*   EACH OF THE OTHER PHASES.  RECEIVES CONTROL FROM OPERATING SYST     00320021
*   AND, AT THE END OF COMPILATION, RETURNS CONTROL TO IT.  MANIPUL     00340021
*   TABLES AND PROVIDES (COMMON) A COMMUNICATION AREA.                  00360021
*                                                                       00380021
*ENTRY POINTS                                                           00400021
*                                                                       00420021
*              'IKFCBL00'                                               00440021
*                                                                       00460021
*                                                                       00480021
*INTERNAL INPUT:                                                        00500021
*                                                                       00520021
*                                                                       00540021
*   THE CALLING SEQUENCES FROM THE PHASES, EXCEPT FOR TAMER ROUTINE     00560021
*   CALLS.  THE CALLING SEQUENCE ARE:                                   00580021
*                                                                       00600021
*   L    REGISTER,A=(COS)      BALR    0,REGISTER      DC    X'XY'      00620021
*   X = FUNCTION PHASE WANTED        Y = DATA SET SPECIFIED             00640021
*                                                                       00660021
*EXTERNAL INPUT:                                                        00680021
*                                                                       00700021
*   THE PARAMETERS FROM THE EXEC CONTROL CARD OR FROM THE CALL, LIN     00720021
*   ATTACN, OR XCTL MACRO.                                              00740021
*                                                                       00760021
*OUTPUT                                                                 00780021
*                                                                       00800021
*   NO OUTPUT                                                           00820021
*                                                                       00840021
*EXTERNAL ROUTINES                                                      00860021
*                                                                       00880021
*   NONE                                                                00900021
*                                                                       00920021
*EXITS-NORMAL:                                                          00940021
*                                                                       00960021
*   RETURN TO OPERATING SYSTEM BY RETURN MACRO                          00980021
*                                                                       01000021
*EXITS-ERROR:                                                           01020021
*   RETURN MACRO, STOP COMPILATION AND PRINT REASON FOR TERMINATION     01040021
*                                                                       01060021
*TABLE/WORK AREAS:                                                      01080021
*                                                                       01100021
*   NOT REQUIRE ANY TABLE AREA. SMALL WORK AREAS START AT 'FORMAT'      01120021
*   SCATTERED ALL OVER IN PHASE 00.                                     01140021
*                                                                       01160021
*ATTRIBUTES:                                                            01180021
*                                                                       01200021
*   NOT REUSABLE.                                                       01220021
*                                                                       01240021
*                                                                       01260021
*NOTES:                                                                 01280021
*                                                                       01300021
*   GENERAL ORGANIZATION:                                               01320021
*   1. EQU'S                                                            01340021
*   2. TAMER-ACCESS CONSTANTS, AND TAMER ADCONS                         01360021
*   3. COMMON TABLE SECTION                                             01380021
*   4. WORK AREA                                                        01400021
*   5. BUFFER INITIALIZATION                                            01420021
*   6. SUBROUTINES                                                      01440021
*   7. INTERLUDE PROCESSOR                                              01460021
*   8. LINKAGE PACKAGE                                                  01480021
*   9. PHASE 00 INITIALIZATION AND CONTROLLER                           01500021
*   10. TAMER MANAGEMENT ROUTINES                                       01520021
*   11. DATA -- TAMER ROUTIMES                                          01540021
*   12. CONSTANTS -- TESTING                                            01560021
*                                                                       01580021
*                                                                       01600021
*   REGISTERS USAGE                                                     01620021
*                                                                       01640021
*   0    WORK REGISTER                                                  01660021
*   1    WORK REGISTER                                                  01680021
*   2    WHERE TO PUT FROM ON ANY PUT (WRITE)                           01700021
*   3    LENGTH FOR PUTN (WRITE)                                        01720021
*   4    WORK REGISTER                                                  01740021
*   5    BASE REGISTER                                                  01760021
*   6    POINTS TO BUFFER CONTROL BLOCK FOR LOGICAL I-O                 01780021
*   7    POINTS TO BUFFER CONTROL BLOCK FOR PHYSICAL I-O                01800021
*   8    RETURN ADDRESS LESS 1 (LINKAGE PARAMETERS)                     01820021
*   9    TO FILE POINTERS (POINT) FOR THIS OS                           01840021
*   10    FILE NUMBER X 4                                               01860021
*   11    LINKAGE                                                       01880021
*   12    LINKAGE                                                       01900021
*   13    FOR LINK/RETURN OR FOR I-O REQUEST                            01920021
*   14    LINKAGE, WORK REGISTER                                        01940021
*   15     LINKAGE, WORK REGISTER                                       01960021
*                                                                       01980021
*                                                                       02000021
*   ERROR PROCESSING:                                                   02020021
*   IF AN ERROR THAT STOPS COMPILATION OCCURS, PHASE 00 ISSUES A        02040021
*   RETURN MACRO TO RETURN TO THE OPERATING SUSTEM.  WHEN PHASE 6 H     02060021
*   FINISHED ITS PROCESSING, PHASE 00 PUTS A CODE INTO REGISTER 15      02080021
*   INDICATING THE HIGHEST SOURCE PROGRAM ERROR SEVERITY LEVEL AND      02100021
*   RETURNS TO THE OPERATING SYSTEM.                                    02120021
*                                                                       02140021
*                                                                       02160021
IKFCBL00 START                                                          02180021
       ENTRY START                                                      02200021
*                                                                       02220021
R0     EQU   0                                                          02240021
R1     EQU   1                                                          02260021
R2     EQU   2                                                          02280021
R3     EQU   3                                                          02300021
R4     EQU   4                                                          02320021
R5     EQU   5                                                          02340021
R6     EQU   6                                                          02360021
R7     EQU   7                                                          02380021
R8     EQU   8                                                          02400021
R9     EQU   9                                                          02420021
R10    EQU   10                                                         02440021
R11    EQU   11                                                         02460021
R12    EQU   12                                                         02480021
R13    EQU   13                                                         02500021
R14    EQU   14                                                         02520021
R15    EQU   15                                                         02540021
PXOSTB   EQU   *                                                        02560021
COS      STM   R14,R12,DX12(R13)                                        02580021
COSAA    BALR  R5,R0               ESTABLISH ADDRESSABILITY             02600021
         USING *,R5            POINT TO SAVE AREA IN COS                02620021
         USING TRMNATE,R4                                               02640021
CASAB    B     GO                  BRANCH AROUND CONSTANTS              02660021
*    ACCESS- TAMER CONSTANTS AND WORK AREA                              02680021
*                                                                       02700021
*      FOLLOWING IS THE TAMER CONSTANT AREA.  TIBS AND TAMMS ASSEMB     02720021
*      HERE ARE ACCESSIBLE TO ACCESS, AND TO THE PHASE PROGRAMMER.      02740021
*                                                                       02760021
*                            AND CONSTANTS AREA                         02780021
*    TIB20 RESERVED FOR THE DICOT TABLE                                 02800021
       DS    0F                                                         02820021
TIB0   DC    2F'0'                 TABLE INFORMATION BLOCK NO 0         02840021
TIB1   DC    2F'0'                 TABLE INFORMATION BLOCK NO 1         02860021
TIB2   DC    2F'0'                 TABLE INFORMATION BLOCK NO 2         02880021
TIB3   DC    2F'0'                 TABLE INFORMATION BLOCK NO 3         02900021
TIB4   DC    2F'0'                 TABLE INFORMATION BLOCK NO 4         02920021
TIB5   DC    2F'0'                 TABLE INFORMATION BLOCK NO 5         02940021
TIB6   DC    2F'0'                 TABLE INFORMATION BLOCK NO 6         02960021
TIB7   DC    2F'0'                 TABLE INFORMATION BLOCK NO 7         02980021
TIB8   DC    2F'0'                 TABLE INFORMATION BLOCK NO 8         03000021
TIB9   DC    2F'0'                 TABLE INFORMATION BLOCK NO 9         03020021
TIB10  DC    2F'0'                 TABLE INFORMATION BLOCK NO 10        03040021
TIB11  DC    2F'0'                 TABLE INFORMATION BLOCK NO 11        03060021
TIB12  DC    2F'0'                 TABLE INFORMATION BLOCK NO 12        03080021
TIB13  DC    2F'0'                 TABLE INFORMATION BLOCK NO 13        03100021
TIB14  DC    2F'0'                 TABLE INFORMATION BLOCK NO 14        03120021
TIB15  DC    2F'0'                 TABLE INFORMATION BLOCK NO 15        03140021
TIB16  DC    2F'0'                 TABLE INFORMATION BLOCK NO 16        03160021
TIB17  DC    2F'0'                 TABLE INFORMATION BLOCK NO 17        03180021
TIB18  DC    2F'0'                 TABLE INFORMATION BLOCK NO 18        03200021
TIB19  DC    2F'0'                 TABLE INFORMATION BLOCK NO 19        03220021
TIB20  DC    2F'0'                 TABLE INFORMATION BLOCK NO 20        03240021
*                                                                       03260021
*      TIBS 21 THROUGH 30 HAVE BEEN ADDED AS -------------------        03280021
*      EXTENSIONS TO THE PRESENT TIB AREA %TIBS 1 THROUGH 19, IN-       03300021
*      CLUSIVE<  IN THE BASIC TAMER PACKAGE.                            03320021
*                                                                       03340021
*      AS BEFORE TIB20 IS RESERVED,REPEAT RESERVED, FOR ACCESS.         03360021
*                                                                       03380021
TIB21  DC    2F'0'                 TABLE INFORMATION BLOCK NO 21        03400021
TIB22  DC    2F'0'                 TABLE INFORMATION BLOCK NO 22        03420021
TIB23  DC    2F'0'                 TABLE INFORMATION BLOCK NO 23        03440021
TIB24  DC    2F'0'                 TABLE INFORMATION BLOCK NO 24        03460021
TIB25  DC    2F'0'                 TABLE INFORMATION BLOCK NO 25        03480021
TIB26  DC    2F'0'                 TABLE INFORMATION BLOCK NO 26        03500021
TIB27  DC    2F'0'                 TABLE INFORMATION BLOCK NO 27        03520021
TIB28  DC    2F'0'                 TABLE INFORMATION BLOCK NO 28        03540021
TIB29  DC    2F'0'                 TABLE INFORMATION BLOCK NO 29        03560021
TIB30  DC    2F'0'                 TABLE INFORMATION BLOCK NO 30        03580021
TIB31    DC    2F'0'               TABLE INFORMATION BLOCK NO 31        03600021
TIB32    DC    2F'0'               TABLE INFORMATION BLOCK NO 32        03620021
TIB33    DC    2F'0'               TABLE INFORMATION BLOCK NO 33        03640021
TIB34    DC    2F'0'               TABLE INFORMATION BLOCK NO 34        03660021
TIB35    DC    2F'0'               TABLE INFORMATION BLOCK NO 35        03680021
*                                                                       03700021
*      THE FOLLOWING ARE TAMER ADCONS FOR THE VARIOUS ROUTINE NAMES     03720021
*                                                                       03740021
*                                                                       03760021
APRIME DC    A(PRIME)              TAMER ADDRESS CONSTANT               03780021
AINSRT DC    A(INSERT)             TAMER ADDRESS CONSTANT               03800021
ADSTAT DC    A(STATIC)             TAMER ADDRESS CONSTANT               03820021
RELADD DC    A(TABREL)             TAMER ADDRESS CONSTANT               03840021
TAMNAD DC    A(TAMEIN)             TAMER ADDRESS CONSTANT               03860021
ACCESW DC    X'00'                ACCESS INITIALIZATION SWITCH.         03880021
AMAINF   DC    AL3(0)              TAMER ADDRESS CONSTANT               03900021
ALSTAM DC    A(DICSPC)             TAMER ADDRESS CONSTANT               03920021
*                                                                       03940021
       DS    0F                                                         03960021
LOCCTR   DC    XL4'080'  STARTING LOCATION                              03980021
LOCCTR1  DC    F'0'                *                                    04000021
PROGID DC    CL8'        '         PROGRAM-ID FROM IDENTIFICATION D     04020021
LABELS DC    H'0'                  CONTAINS LABEL INFORMATION           04040021
SEGCNTR  DC    H'0'                *                                    04060021
PNCTR  DC    H'0'                  FOR ASSIGNING PB NO.S TO PR0L NM     04080021
GNCTR  DC    H'0'                  FOR ASSIGNING GN NO.S TO GEN PRO     04100021
DCBCTR DC    H'0'                  ASSIGNS ID NO TO DCB'S               04120021
VIRCTR   DC    H'1'                ASSIGNS ID NO TO VIRTUALS            04140021
LTLCTR DC    H'0'                  ASSIGNS ID NO TO LITERALS            04160021
WCMAX  DC    H'0'                  LARGEST WORK AREA FOR LIBR SUB       04180021
TSMAX  DC    H'0'                  TEMP STORAGE SIZE FOR ARITHM.        04200021
TS2MAX DC    H'0'                  TEMP STORAGE SIZE FOR NON-ARITHM     04220021
ODOCTR DC    H'0'                  NO OF Q-ROUTINES                     04240021
CKPCTR DC    H'0'                  NO OF CHECKPOINT REQUESTS            04260021
INDCTR   DC    H'0'                AVAILABLE                            04280021
SBLOMX DC    H'0'                  AVAILABLE                            04300021
VLCOMX DC    H'0'                  AVAILABLE                            04320021
SBLIMX DC    H'0'                  NO OF 2NDARY BASE LOCATORS           04340021
VLCIMX DC    H'0'                  NO OF VARIABLE LENGTH CELLS          04360021
SBLCTR DC    H'0'                  CNTR FOR ASSIGNING SBL'S             04380021
VLCCTR DC    H'0'                  USED TO DETERMINE VLCOMX & VLCIM     04400021
BLLCTR DC    H'0'                  ASSIGNS ID NO TO LNK SECT BL'S       04420021
SEQERR DC    H'0'                  NO OF OUT-OF-SEQUENCE CARDS          04440021
SWITCH   DC    H'0'                *                                    04460021
SWTRCE   EQU   X'80'                                                    04480021
SPILLQ   EQU   X'10'                                                    04500021
MQVAR    EQU   X'04'                                                    04520021
SWLIST   EQU   X'02'                                                    04540021
MQFILE   EQU   X'01'                                                    04560021
*                                                                       04580021
*                                  SECOND BYTE OF SWITCH                04600021
*                                                                       04620021
SORTRTN  EQU   X'20'                                                    04640021
RERUN    EQU   X'10'                                                    04660021
DSOU     EQU   X'08'                                                    04680021
NOFITSW  EQU   X'04'                                                    04700021
DOPH7    EQU   X'02'                                                    04720021
RDERRFIL EQU   X'01'                                                    04740021
DICND2 DS    F      TO REPLACE DICTPT                                   04760021
DICND1 DS    F      INSERT AFTER DICND2                                 04780021
DATE     DC    CL15'THIS MSG = DATE'    AFTER DICND1                    04800021
WSDEF    DC    XL7'0'              END OF DATA ATEXT EL FOR WK STOR     04820021
ERRSEV   DC    X'00'         SEVERITY CODE                              04840021
RETCDE   EQU   ERRSEV                                                   04860021
PHZSW    DC    X'00'         OPTIONS SWITCH                             04880021
LIST     EQU X'80'       SOURCE(OS)                                     04900021
LISTX    EQU   X'40'     PMAP                                           04920021
DECK     EQU   X'20'                                                    04940021
LINK     EQU   X'10'     LOAD                                           04960021
SEQ      EQU   X'08'                                                    04980021
FLAGW    EQU   X'04'                                                    05000021
LIBR     EQU   X'02'                                                    05020021
ZWB      EQU   X'01'                                                    05040021
PHZSW1   DC    X'00'               VARIOUS COMPILATION OPTIONS          05060021
XREF     EQU   X'80'                                                    05080021
CLIST    EQU   X'40'                                                    05100021
SYM      EQU   X'20'      DMAP                                          05120021
PDT      EQU   X'10'                                                    05140021
APOST    EQU   X'04'                                                    05160021
SUPMAP   EQU   X'02'                                                    05180021
TRUNC    EQU   X'01'                                                    05200021
PHZSW2   DC    X'00'               MORE COMPILATION OPTIONS             05220021
STAT     EQU   X'80'                                                    05240021
NO6A     EQU   X'02'               PH6 SETS FOR PH7 IF PH6A BYPASSED    05260021
DICADR DC    F'0'             MOVED TO COMMON PORTION                   05280021
DLSVAL DC    F'0'                  ACCESS RTN COMMUNICATION CELL        05300021
DICPTR DC    X'0'                  ACCESS RTN COMMUNICATION CELL        05320021
DCPTR  DC    3X'0'                 ACCESS RTN COMMUNICATION CELL        05340021
RPTSAV DC    H'0'                  REPOET SAVE AREA CELL                05360021
DYNAM    DC    X'00'     PH6 EXEC TIME LOADED SUBROUTINE SWITCH         05380021
         DC    X'00'     AVAILABLE                                      05400021
LCSECT DC    F'0'                  USED BY PH6                          05420021
PH7LOD DC    A(0)                  USED BY PH6                          05440021
RGNCTR DC    H'0'                  COUNT OF UNIQUE GN'S                 05460021
ERF4SW DC    X'0'                  USED BY PH6/PH7                      05480021
PTYNO    DC    X'0'                PRIORITY NO OF CURRENT SEGMENT       05500021
COMMAD DC    C',.'                 USED BY PH1                          05520021
PHZSW3   DC    X'00'               OPTION SWITCH                        05540021
VERBR    EQU   X'01'               LISTING A-TEXT                       05560021
PHZSW4   DC    X'00'               RESERVED FOR ADDITIONAL OPTIONS      05580021
AMOVDC DC    A(MOVDIC)             TAMER ADDRESS CONSTANT               05600021
SDSIZ    DC    F'0'     BIGGEST FD IN PGM                               05620021
SEGLMT   DC    X'32'               *                                    05640021
DTFNUM   DC    X'0'                NO OF DTF                            05660021
CURSGN   DC    C'$'                USED BY PH1                          05680021
PH1BYTE  DC    X'00'               PH1/PH2 COMMUNICATION CELL           05700021
BASINSQ  EQU   X'08'                                                    05720021
INIBIT   EQU   X'04'                                                    05740021
UPSIBT   EQU   X'01'                                                    05760021
EOPPH1   EQU   X'02'                                                    05780021
BASIS    EQU   X'20'                                                    05800021
DECBCT   DC    H'0'                *                                    05820021
INDEXS   DC    H'0'     # INDEX NAMES DEFNED IN S.A.'S                  05840021
INDEX1   DC    H'0'     # INDEX NAMES DEFNED IN IN-LINE FILES           05860021
CYCTOTAL DC    H'0'     TOTAL # CYCLES FOR THIS PROGRAM                 05880021
IOPTRCTR DC    H'0'     # I/O POINTERS FOR APPLY-WRITE-ONLY             05900021
TS3MAX   DC    1H'0'               USED BY PH6                          05920021
TS4MAX   DC    1H'0'               USED BY PH6                          05940021
BUFSIZE  DC    F'0'                USED FOR STATISTICS                  05960021
CORESIZE DC    F'0'                USED FOR STATISTICS                  05980021
CNTLINE  DC    H'0'                USED FOR STATISTICS                  06000021
CURCRD   DC    H'0'                CURRENT CARD NO SET BY PH4           06020021
SPACING  DC    X'00'               USED FOR STATISTICS                  06040021
PDTCHR   DC    X'0'                *                                    06060021
         DS    H                   *                                    06080021
BASINS   DS    F                   *                                    06100021
         DS    F                   *                                    06120021
*                                                                       06140021
         DS    0F                                                       06160021
AGETALL  DC    A(GETALL)           TAMER ADDRESS CONSTANT               06180021
         DC    F'0'                *                                    06200021
RPDNUM DC    H'0'                  AVAILABLE                            06220021
CYCNUM DC    H'1'                  AVAILABLE                            06240021
IDENTL DS    F                     REL. LOC 1ST INSTR IN OBJ MODULE     06260021
BLCTR  DC    H'0'                  ID NO ASSIGNED TO BL'S               06280021
VNCTR  DC    H'0'                  ASSIGNING VN NUMBERS                 06300021
ONCTR  DC    H'0'                  ASSIGNING ID NO'S TO ON CTL CELL     06320021
PFMCTR DC    H'0'                  ASSIGNING ID NO'S TO PERFORM CEL     06340021
PSVCTR DC    H'0'                  ASSIGNING ID NO'S TO PERF SV CEL     06360021
XSACTR DC    H'1'                  LOC WITHIN EXHIBIT OR SOLT SAVE      06380021
XSWCTR DC    H'0'   TO REPLACE XSALOC                                   06400021
RELLOC DS    F                     DISP OF TGT/SGT FROM BEG OF OBJM     06420021
GTLNG  DS    H                     LNGT OF TGT SPECIFIED IN RELLOC      06440021
RPILOC DS    H                     AVAILABLE                            06460021
VNILOC DS    H                     DISP OF VNI FIELDS IN PGT            06480021
VNLOC  DS    H                             VN FIELDS IN TGT OR SGT      06500021
SUBCTR DC    H'0'                  ASSIGNING ID'S TO SOBSCR. REFS       06520021
PARMAX DC    H'0'        MOVED TO COMTBL SINCE NEED IN RPD NE 0         06540021
BLSVAL DC    H'0'                  AVAILABLE                            06560021
BLSLOC DC    H'0'                  AVAILABLE                            06580021
CMTBSW   DC    H'0'                AVAILABLE                            06600021
*                        BIT 0 1#HOLD IN THIS SECTION                   06620021
SA2CTR   DC    H'0'                SET IF OPT 2 OF USE SPECIFIED        06640021
SA3CTR   DC    H'0'                SET IF OPT 5 OF USE SPECIFIED        06660021
BLSEND DC    H'0'                  AVAILABLE                            06680021
INDEX    DC    F'0'                NO OF INDEX NAMES                    06700021
INDEX0   DC    H'0'     # INDEX NAMAVAILABLE                            06720021
       DS    6F                    AVAILABLE                            06740021
*******************************************************************     06760021
DX0      EQU   0                                                        06780021
DX1      EQU   1                                                        06800021
NX1      EQU   1                                                        06820021
DX2      EQU   2                                                        06840021
NX2      EQU   2                                                        06860021
NX3      EQU   3                                                        06880021
DX4      EQU   4                                                        06900021
NX4      EQU   4                                                        06920021
DX5      EQU   5                                                        06940021
NX5      EQU   5                                                        06960021
DX6      EQU   6                                                        06980021
NX6      EQU   6                                                        07000021
DX8      EQU   8                                                        07020021
NX8      EQU   8                                                        07040021
DX9      EQU   9                                                        07060021
NX9      EQU   9                                                        07080021
DX12     EQU   12                                                       07100021
NX12     EQU   12                                                       07120021
DX13     EQU   13                                                       07140021
DX14     EQU   14                                                       07160021
DX16     EQU   16                                                       07180021
NX18     EQU   18                                                       07200021
NX19     EQU   19                                                       07220021
DX24     EQU   24                                                       07240021
NX24     EQU   24                                                       07260021
DX25     EQU   25                                                       07280021
DX27     EQU   27                                                       07300021
DX28     EQU   28                                                       07320021
NX28     EQU   28                                                       07340021
DX33     EQU   33                                                       07360021
DX48     EQU   48                                                       07380021
DX50     EQU   50                                                       07400021
DX56     EQU   56                                                       07420021
DX62     EQU   62                                                       07440021
DX65     EQU   65                                                       07460021
NX70     EQU   70                                                       07480021
DX82     EQU   82                                                       07500021
NX86     EQU   86                                                       07520021
DX89     EQU   89                                                       07540021
DX121    EQU   121                                                      07560021
DX256    EQU   256                                                      07580021
DX512    EQU   512                                                      07600021
DX1568   EQU   1568                                                     07620021
XX0      EQU   X'00'                                                    07640021
XX06     EQU   X'06'                                                    07660021
XXF0     EQU   X'F0'                                                    07680021
XXFF     EQU   X'FF'                                                    07700021
XX00     EQU   X'00'                                                    07720021
XX80     EQU   X'80'                                                    07740021
XX20     EQU   X'20'                                                    07760021
XXF1     EQU   X'F1'                                                    07780021
XX0F     EQU   X'0F'                                                    07800021
XX40     EQU   X'40'                                                    07820021
XX60     EQU   X'60'                                                    07840021
XXF2     EQU   X'F2'                                                    07860021
XX01     EQU   X'01'                                                    07880021
XX10     EQU   X'10'                                                    07900021
XX7F     EQU   X'7F'                                                    07920021
XX03     EQU   X'03'                                                    07940021
XX02     EQU   X'02'                                                    07960021
XXBF     EQU   X'BF'                                                    07980021
XX0D     EQU   X'0D'                                                    08000021
XX0E     EQU   X'0E'                                                    08020021
XXFB     EQU   X'FB'                                                    08040021
XC0      EQU   C'0'                                                     08060021
XCB      EQU   C'B'                                                     08080021
LX0      EQU   0                                                        08100021
LX1      EQU   1                                                        08120021
LX2      EQU   2                                                        08140021
LX3      EQU   3                                                        08160021
LX4      EQU   4                                                        08180021
LX6      EQU   6                                                        08200021
LX8      EQU   8                                                        08220021
LX10     EQU   10                                                       08240021
LX12     EQU   12                                                       08260021
LX16     EQU   16                                                       08280021
LX24     EQU   24                                                       08300021
LX64     EQU   64                                                       08320021
LX77     EQU   77                                                       08340021
LX119    EQU   119                                                      08360021
LX256    EQU   256                                                      08380021
       EJECT                                                            08400021
SAVER13  DS    F                   ADDR OF CALLING PHASE'S REG SAVE     08420021
ZEROES   DC    F'0'                FULLWORD CONSTANT OF ZEROES          08440021
         DC    F'511'              MASK FOR TURNING OFF 23 HI BITS      08460021
ADD      DC    A(READ)                  X=0                             08480021
         DC    A(WRITE)    PUTN         X=1                             08500021
         DC    A(WRITEA)   PUT          X=2                             08520021
         DC    A(EXITR)    OPEN         X=3                             08540021
         DC    A(EXITR)    OPEN         X=4                             08560021
         DC    A(EXITR)    CLOSE        X=5                             08580021
         DC    A(CLOSET)     TEMP CLOSE    X=6                          08600021
         DC    A(READ)     SYSIN        X=7                             08620021
         DC    A(WOUT)     SYSOUT       X=8                             08640021
         DC    A(SEGPNT)           X=9                                  08660021
         DC    A(LINKB)         X=A  LOAD NEXT PHASE                    08680021
         DC    A(EOJ)    END JOB     X=B                                08700021
         DC    A(SEGNOTE)          X=C                                  08720021
         DC    A(EJECT)              X=D                                08740021
         DC    A(WGO1)               X=E, F ILLEGAL   EXTERNAL          08760021
         DC    A(CLOSER)             X=F                                08780021
SINGBUF  DC    X'00'               SINGLE  BUFFER  SWITCH               08800021
SPECIAL  DC    X'00'               SPECIAL USE SWITCH  (PRIME INPUT     08820021
         DC    C'IKFCBL00'         USED FOR IDENTIFICATION              08840021
         DC    C'B'                *                                    08860021
         DC    X'1C'               *                                    08880021
         DS    0H                                                       08900021
*                                                                       08920021
*                                                                       08940021
*                                                                       08960021
*                                                                       08980021
*                                                                       09000021
POINT    DC    H'0'              FILE  USING     NO. BUFF               09020021
         DC    X'00'             UT1     1  FIRST   0       LEFT        09040021
         DC    X'00'                     1  ALT.    0       HAND        09060021
         DC    X'02'             UT2     2          2       NIBBLE      09080021
         DC    X'03'                     2          3       USED TO     09100021
         DC    X'F4'             UT3     3          4       PRIME       09120021
         DC    X'05'                     3          5       BUFFER      09140021
         DC    X'F1'             UT4     4          1       ON          09160021
         DC    X'01'                     4          0       READ        09180021
         DC    X'F9'           SYSIN     5    PRIME      6A1     OR     09200021
         DC    X'0A'                     5               6A2     WR     09220021
         DC    X'F7'            SYSOUT   6                              09240021
         DC    X'08'                     6               6A4     ON     09260021
         DC    X'0D'           SYSPNCH   7               0       CL     09280021
         DC    X'0E'                     7               0              09300021
         DC    X'0F'       SYSLIN(GO) 8                                 09320021
         DC    X'00'                     8               0              09340021
         DC    X'FB'           USLIB  9  6A 5  PRIME                    09360021
         DC    X'0C'                      9                             09380021
* AT INIT0 TIME WE BRING IN PHASE 1. THE  BUFFER                        09400021
* POINTERS ARE INITIALIZED AND THE LRECL'S ARE ALREADY INITIALIZED      09420021
*        AS WELL AS THE  BLKSIZES,THEREFORE WE ARE READY TO OPEN  T     09440021
*        FILES. BETWEEN THE OTHER PHASES  WE  CHANGE THE POINTERS F     09460021
*        BUFFER SWAPPING  AND NECESSARILY OPEN AND CLOSE FILES.         09480021
*                                                                       09500021
POINTM2  DC    X'0101'             BUFFER ALLOCATION CONSTANT           09520021
POINTM3  DC    X'0106'             BUFFER ALLOCATION CONSTANT           09540021
POINTM4  DC    X'010602030505'     BUFFER ALLOCATION CONSTANT           09560021
POINTM50 DC    X'0406020305050101' BUFFER ALLOCATION CONSTANT           09580021
POINTM5  DC    X'04030202'         BUFFER ALLOCATION CONSTANT           09600021
POINTMX  DC    X'0505'             ALTERNATE POINT VALUES               09620021
POINTSEG DC    X'0404020205050103' *                                    09640021
*                                                                       09660021
*                                                                       09680021
*                                                                       09700021
*                                                                       09720021
*                                                                       09740021
*                                                                       09760021
*                                                                       09780021
*                                                                       09800021
*                                                                       09820021
*                                                                       09840021
*                                                                       09860021
*                                                                       09880021
*                                                                       09900021
EJECTSW  DC    X'00'               'FF' MEANS TAKE A NEW PAGE           09920021
MASKPG DC      X'402020202021'     EDITS PAGE NUMBER                    09940021
         DS    0D                                                       09960021
OVERFLOD  DC   A(OVERFLO)          ADDRESS OF HEADER LINE               09980021
OVERFLO  DC    H'4'                HEADER CONSTANT                      10000021
       DC      CL4' '              HEADER CONSTANT                      10020021
PAGE   DC      X'00001C'           PAGE CONSTANT                        10040021
SIXTY    DC    X'060C'             LINE COUNT LIMIT                     10060021
BLANK    DC     C' '               CARRIAGE CONTROL                     10080021
*                                                                       10100021
*                                                                       10120021
*FORMAT  BCB                                                            10140021
*        BYTE  1  X'00'                                                 10160021
*                                                                       10180021
*                                                                       10200021
*                                                                       10220021
*                                                                       10240021
*                                                                       10260021
*        BYTES 2-4     ADDRESS  OF  BUFFER                              10280021
*                                                                       10300021
*        BYTES 5-6     BYTES  USED    FOR  PUT  & GET SO FAR            10320021
*                                                                       10340021
*        BYTES 7-8     LENGTH OF  BUFFER                                10360021
*                                                                       10380021
*        CORE MAP                                                       10400021
* BCTLS   18D                                                           10420021
* BUF      1F       AMOUNT OF   CORE LEFT  FOR GET MAINS                10440021
*          2F       START OF  TAMER  -  SIZE  USED                      10460021
       DS    0D                                                         10480021
BUFX   DC    A(OVERFLOD)           ADDRESS OF ADDRESS OF HEADER LIN     10500021
         DC    A(DATE)             ADDRESS OF DATE                      10520021
BUFCNLS  DC    15D'0'       BCB                                   1044  10540021
CORELEFT DS    1F                  BUFFER CONTROL BLOCKS                10560021
TAMAREA  DS    1F        START TAMER AREA                               10580021
TAMLL    DS    1F             END OF TAMER SET BY PHASE02               10600021
NOLIB  DS    CL1                   SWITCH FOR OK LIBRARY OPEN           10620021
LIBSIZE  DC    H'400'              BLKSIZE FOR LIB - SET IN PH01        10640021
INBUF    DS    H                   SYSIN BUFFER SIZE - SET IN PH01      10660021
*                                                                       10680021
LIBNAME  DC    CL8' '              SAVE AREA FOR COPY/BASIS RTN         10700021
CURNAME  DC    CL8'0'              SAVE AREA FOR COPY/BASIS RTN         10720021
LIBRAR   DC    H'36'               FILE NUMBER VALUE                    10740021
PUNCHER  DC    H'28'               FILE NUMBER VALUE                    10760021
PRINTER  DC    H'24'               FILE NUMBER VALUE                    10780021
OFF    DC      X'0F0F'             MASK FOR POINT TABLE                 10800021
EIGHTY   DC    H'80'               USED IN READB ROUTINE                10820021
PRINTBUF DC    C'1'                CONTROL CH FOR PRINTER               10840021
LINECNT  DC    X'0000000C'         PROGRAM LISTING LINE COUNT           10860021
ONE      DC    X'1C'               USED TO ADJUST PAGE AND LINECNT      10880021
SWITCHD  EQU   X'182'                                                   10900021
SKIP     DC    C'1'                EJECT VALUE FOR CARRIAGE CTL         10920021
PZERO    DC    X'0C'               PACKED ZERO CONSTANT                 10940021
BASSW    DC    X'00'               SET IF BASIS REQUEST                 10960021
*                                                                       10980021
*                                                                       11000021
*                                                                       11020021
*                                                                       11040021
MYSAVE   DC    1F'0'               PH00 SAVE AREA                       11060021
         DS    F              SAVE AREA IN OS                           11080021
         DC     A(SAVEPHSE)        ADDR OF PHASE SAVE AREA              11100021
         DS    15F                 REG SAVE AREA                        11120021
SAVEPHSE DS    18F            FOR PHASE USE                             11140021
*                                                                       11160021
*                                                                       11180021
*                                                                       11200021
*                                                                       11220021
*                                                                       11240021
LINKNAME DC    CL8'IKFCBL01'       USED BY LINK MACRO                   11260021
         DC    CL2'01'             VARIABLE PORTION OF LINK CONSTAN     11280021
         DC    CL2'10'             VARIABLE PORTION OF LINK CONSTAN     11300021
         DC    CL2'1B'             VARIABLE PORTION OF LINK CONSTAN     11320021
         DC    CL2'20'             VARIABLE PORTION OF LINK CONSTAN     11340021
         DC    CL2'30'             VARIABLE PORTION OF LINK CONSTAN     11360021
         DC    CL2'40'             VARIABLE PORTION OF LINK CONSTAN     11380021
         DC    CL2'50'             VARIABLE PORTION OF LINK CONSTAN     11400021
         DC    CL2'51'             VARIABLE PORTION OF LINK CONSTAN     11420021
         DC    CL2'60'             VARIABLE PORTION OF LINK CONSTAN     11440021
         DC    CL2'6A'             VARIABLE PORTION OF LINK CONSTAN     11460021
         DC    CL2'70'             VARIABLE PORTION OF LINK CONSTAN     11480021
         DC    X'FF'       INDICATE END OF LINKNAMES              9330  11500021
LINKCNT  DC    H'0'                VALUE CORRESPONDS TO CURRENT PMS     11520021
PHASW  DC    X'00'                 PHASW FOR USE BY TAMER               11540021
RETOK    DC    X'00'               'FF' MEANS END COMPILATION           11560021
LIBADD   DC    A(LIB)              @ LIB DCB                            11580021
GO       ST    R13,SAVER13                                              11600021
         LA    R13,MYSAVE                                               11620021
         N     R3,ZEROES+NX4                                            11640021
GOSYSGO  LM    R6,R7,ZEROES                                             11660021
         LR    R8,R0                                                    11680021
         CLI   DX0(R8),XX06                                             11700021
         BE    EXIT1               OSDUMPS DUMMY CALL                   11720021
         IC    R6,DX0(R8)                    PICK UP LINKAGE PARAM      11740021
         SRDL  R6,DX4                       6 HAS ACTION CODEX4         11760021
         SLL   R6,DX2                          AT THIS TIME             11780021
         SRL   R7,DX27                      FILE TIMES 2  (HALF WORD    11800021
         L     R11,ADD(R6)                                              11820021
         TM    DX0(R8),LNKRQST1     STEP 1 OF CHECK FOR X = 'A'         11840021
         BNZ   GSYSG1              NOT LOAD NEXT PHASE                  11860021
         TM    DX0(R8),LNKRQST2     FINAL STEP OF CHECK FOR X = 'A'     11880021
         BNO   GSYSG1              X DOES NOT = 'A'                     11900021
         BR    R11                 IT DOES, GO RIGHT TO LINK ROUTIN     11920021
*                                                                       11940021
*                                                                       11960021
*  AT THE END OF THIS ROUTINE SINGLE BUFFER WILL BE SET,SPECIAL         11980021
*        WILL BE SET, REG6 POINTS TO BCB 1 , 7 TO BCB2 ,   8  TO PA     12000021
*        LIST  9  TO  POINTER (FOR BUFFER SWITCH) 10 HAS FILE NOX4      12020021
GSYSG1   LA    R9,POINT(R7)                                             12040021
         MVC   SINGBUF(LX2),ZEROES                                      12060021
         LR    R10,R7                                                   12080021
         SLL   R10,DX1                                                  12100021
         TM    DX0(R9),XXF0                                             12120021
         BZ    GOA1                NOT FIRST I/O                        12140021
         OI    SPECIAL,XXFF                                             12160021
GOA1     IC    R6,DX0(R9)                                               12180021
         IC    R7,DX1(R9)                                               12200021
         SLDL  R6,DX28                                                  12220021
         SRL   R6,DX25                                                  12240021
         SRL   R7,DX25                                                  12260021
         CR    R6,R7                                                    12280021
         BNE   GOA2                DOUBLE BUFFERED                      12300021
         OI    SINGBUF,XXFF     SINGLE BUFFER                           12320021
GOA2     LA    R6,BUFCNLS-NX8(R6)                                       12340021
         LA    R7,BUFCNLS-NX8(R7)                                       12360021
         BR    R11                 GO TO X PARAMETER ROUTINE            12380021
GETDECBA LR    R1,R10                                                   12400021
         SH    R1,FOUR                                                  12420021
         MH    R1,FIVE                                                  12440021
         A     R1,ADECB                                                 12460021
         BR    R15                 RETURN TO NEXT SEQUENTIAL INSTR      12480021
FOUR     DC    H'4'                USED IN GETDECBA ROUTINE             12500021
FIVE     DC    H'5'                USED IN GETDECBA ROUTINE             12520021
ADECB    DC    A(DECBDS1)          @ FIRST DECB                         12540021
*  REG    POINTS TO                                                     12560021
*  6      FIRST BUFFER AREA               10= FILE NOX4                 12580021
*  7      SECOND                                                        12600021
*  8      PARAM LINK FROM PHASE  (RETURN AD-2)                          12620021
*  9      POINTERS  FOR FILE   POINTERS TO BCB'S  FOR  SWITCHING        12640021
*  5      BASE REGISTER                                                 12660021
READ     CH    R10,LIBRAR                                               12680021
         BE    READLIB             MUST READ FROM LIBRARY               12700021
READD    TM    SPECIAL,XXFF                                             12720021
         BZ    READB          NOT  FIRST READ                           12740021
* PRIMING NECESSARY                                                     12760021
READSING BAL   R11,READER          READ FIRST                           12780021
         BAL   R11,CHECKER         THEN CHECK                           12800021
         TM    SINGBUF,XXFF                                             12820021
         BO    EXIT                SINGLE BUFFERED-SO EXIT              12840021
*                                                                       12860021
         LA    R11,EXIT                                                 12880021
         B     READER              DOUBLE BUFFERED-MUST READ AGAIN      12900021
*                                                                       12920021
*                                                                       12940021
*        COPY BASIS ROUTINE                                             12960021
*                                                                       12980021
*        SAVE  AREAS FOR ROTOTIONAL RETURN TO BASIS LIBRARY             13000021
PREREG6  DS    F                   R6 SAVEAREA                          13020021
PREREG7  DS    F                   R7 SAVEAREA                          13040021
PREPOINT DS    CL2                 ALTERNATE POINT FIELD                13060021
PRELEN   DS    CL2                 LENGTH FIELD                         13080021
PREHLD   DS    CL16     PREVIOUS DCB STATUS FOR NOTE                    13100021
BASISN   DC    CL8' '              VALUE PASSED BY CALLING PHASE        13120021
PRENAME  DC    CL8' '    OUS MEMBER NAME                                13140021
LIBHLD   DS    CL16                STORAGE FIELD FOR LIB DCB INFO       13160021
EODADD   DC    A(ENDIN1)           @ EOD ROUTINE                        13180021
ADRLIBF  DC    A(RLIBF)            @ READ FROM LIBRARY ROUTINE          13200021
CTRMNT   DC    A(TRMNATE)          @ ABNORMAL END COMPILATION RTNE      13220021
* NOTICE THAT WE FOURCE A NOTE AND POINT AS REQUIRED                    13240021
READLIB  TM    NOLIB,XXFF                                               13260021
         BO    RLIBD               LIBRARY NOT OPENED SUCCESSFULLY      13280021
         CLC   CURNAME,DX1(R8)                                          13300021
         BE    READDA     CONTINUE SAME MEMBER                          13320021
         TM    SPECIAL,XXFF                                             13340021
         BO    RLIBA    FIRST READ FROM LIBRARY                         13360021
         CLC   PRENAME,DX1(R8)                                          13380021
         BNE   RLIBB          NEW MEMBER -COPY OPTION                   13400021
         OI    BASSW,XXFF          SET SWITCH FOR RETURN TO BASIS LI    13420021
         B     RLIBA              GO FIND MEMBER                        13440021
* NOTICE THAT NO CHECK IS NECESSARY BECAUSEE ARE REVERTING TO A         13460021
* PREVIOUS MEMBER    THEN A COPY IS COMPLETE AND WE RETURN TO THE B     13480021
READNOTE L     R1,LIBADD                                                13500021
         MVC   DX4(LX16,R1),PREHLD                                      13520021
         NOTE  (1)                                                      13540021
         ST    R1,READSAV                                               13560021
         LA    R0,READSAV                                               13580021
         L     R1,LIBADD                                                13600021
         POINT (1),(0)                                                  13620021
         L     R7,PREREG6                                               13640021
         L     R6,PREREG7                                               13660021
         MVC   DX6(LX2,R7),LIBSIZE                                      13680021
         MVC   DX6(LX2,R6),LIBSIZE                                      13700021
         BAL   R11,READER          MUST READ                            13720021
         BAL   R11,CHECKER  REPRIME                                     13740021
         BAL   R11,READER          MUST READ                            13760021
         MVC   POINT+NX18(LX2),PREPOINT                                 13780021
         MVC   DX4(LX2,R6),PRELEN                                       13800021
         NI    BASSW,XX00          TURN OFF SWITCH                      13820021
READDA   LA    R8,DX8(R8)                                               13840021
         B     READB   GO DEBLOCK                                       13860021
*                                                                       13880021
RLIBB    CLC   CURNAME,BASISN                                           13900021
         BNE   RLIBA      NOT READING FROM BASIS DONT SAVE              13920021
         MVC   PRELEN,DX4(R6) LOGICAL LENGTH USED                       13940021
         MVC   PRENAME,CURNAME                                          13960021
         STM   R6,R7,PREREG6                                            13980021
         MVC   PREPOINT,POINT+NX18                                      14000021
         MVC   PREHLD,LIBHLD   LAST CHECK STATUS                        14020021
         L     R11,LIBADD                                               14040021
         MVC   DX33(LX3,R11),ADRLIBF+NX1                                14060021
         BAL   R11,CHECKER  ISSUE OUTSTANDING CHECK CHANGE EODAD        14080021
         MVI   COPYCHK,XXFF                                             14100021
RLIBF    L     R1,LIBADD                                                14120021
         MVC   DX33(LX3,R1),EODADD+NX1                                  14140021
RLIBA    MVC   LIBNAME,DX1(R8)                                          14160021
         LR    R4,R8                                                    14180021
         LA    R0,DX1(R8)                                               14200021
         L     R1,LIBADD                                                14220021
         FIND  (1),(0),D                                                14240021
         B     *+4(R15)            BRANCH WRT FIND RETURN CODE          14260021
         B     RLIBGO              SUCCESSFUL FIND                      14280021
         LA    R8,DX4(R8)                                               14300021
         LA    R8,DX4(R8)  I O ERROR                                    14320021
RLIBC    LA    R8,DX12(R8)                                              14340021
         CLI   DX9(R4),XCB                                              14360021
         BNE   EXITR                   RETURN TO PH1 ONLY ON COPY       14380021
NOREADL  L     PR4,CTRMNT                                               14400021
         B     NOLIBRY             UNSUCCESSFUL FIND                    14420021
RLIBD    LR    R4,R8                                                    14440021
         BC    UNCOND,RLIBC        CHECK IF COPY                        14460021
RLIBGO   MVC   CURNAME,LIBNAME                                          14480021
         MVI   COPYCHK,XX00                                             14500021
         TM    BASSW,XXFF           IS THIS A RETURN TO BASIS LIBRAR    14520021
         BO    READNOTE           BRANCH IF                             14540021
         TM    PH1BYTE,BASIS                                            14560021
         BZ    RLIBGOA             BASIS BIT ALREADY OFF                14580021
         MVC   BASISN,DX1(R8)                                           14600021
         NI    PH1BYTE,XXFF-BASIS                                       14620021
* NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB NB        14640021
*  PHASE ONE MUST TURN OFF BASIS SWITCH IF FIRST CARD IS NOT            14660021
* A BASIS STATEMENT                                                     14680021
RLIBGOA  OI    SPECIAL,XXFF                                             14700021
         MVC   DX6(LX2,R7),LIBSIZE                                      14720021
         MVC   DX6(LX2,R6),LIBSIZE                                      14740021
         LA    R8,DX8(R8)                                               14760021
         B     READD               PREPARE TO DO A READ                 14780021
*                                                                       14800021
*                                                                       14820021
READSAV  DS    F                   SAVE AREA FOR R1 - MACRO USAGE       14840021
WCOMM    TM    SPECIAL,XXFF       FIRST I-O THIS PHASE                  14860021
         BO    WRTAAA              NOT NEED TO ISSUE CHECK              14880021
         BAL   R11,CHECKER         MUST CHECK FIRST                     14900021
WRTAA    BAL   R11,WRITER          THEN WRITE                           14920021
         BR    R12                 GO TO NEXT I/O PROCESSING RTNE       14940021
WRTAAA   BAL   R11,CHECKERB        FIRST I/O-SKIP CHECK MACRO           14960021
         B     WRTAA               NOW WRITE                            14980021
CHECKER  BAL   R15,GETDECBA        GET @ DECB                           15000021
         ST    R1,READSAV                                               15020021
         CHECK (1)                                                      15040021
         L     R1,READSAV                                               15060021
         TM    DX5(R1),XX80   WAS IT A REA                              15080021
         BZ    CHECKERB            NOT A READ                           15100021
         CH    R10,UTILITY                                              15120021
         BL    CHECKERB            UTILITY FILE SO BRANCH               15140021
         CH    R10,LIBRAR                                               15160021
         BNE   CHECKERD            NOT LIBRARY FILE SO BRANCH           15180021
         CLI   COPYCHK,XXFF                                             15200021
         BNE   CHECKERA            CHECK MUST BE ISSUED SO BRANCH       15220021
         MVI   COPYCHK,XX00                                             15240021
         BR    R11                 RETURN TO NEXT SEQUENTIAL INSTR      15260021
CHECKERA L     R15,LIBADD                                               15280021
         MVC   LIBHLD,DX4(R15)                                          15300021
CHECKERD L     R1,DX16(R1)    ADDRESS OF IOB                            15320021
         LH    R15,DX6(R7)    LENGTH OF BUFFER                          15340021
         SH    R15,DX14(R1)   RESIDUAL BYTE COUNT FROM CSW              15360021
         STH   R15,DX6(R7)    DATA READ IN                              15380021
CHECKERB LH    R15,DX0(R9)                                              15400021
         STC   R15,DX0(R9)                                              15420021
         SRL   R15,DX8                                                  15440021
         STC   R15,DX1(R9)                                              15460021
         XR    R6,R7                                                    15480021
         XR    R7,R6                                                    15500021
         XR    R6,R7                                                    15520021
CHECKERC MVC   DX4(LX2,R6),ZEROES                                       15540021
         MVC   DX4(LX2,R7),ZEROES                                       15560021
         CH    R10,SUT1                                                 15580021
         BCR   R7,R11              NOT SYSUT1 SO BRANCH                 15600021
         TM    SEGNTSW,XXFF                                             15620021
         BM    SEGNOTE1  CHK LAST WRITE PREVIOUS SEG ISSUED             15640021
         BO    SEGNOTE2  CHK FIRST WRITE PREVIOUS SEG ISSUED            15660021
         BR    R11                 RETURN TO NEXT SEQUENTIAL INSTR      15680021
MOVE     MVC   DX0(LX0,R1),DX0(R2)                                      15700021
IOCOM    BAL   R15,GETDECBA  ON RETURN R1 = DECB ADDRESS                15720021
         MVC   DX12(LX4,R1),DX0(R7) ADDRESS OF AREA                     15740021
         L     R15,DX8(R1)    DCB ADDRESS                               15760021
         CH    R10,SUT1                                                 15780021
         BNE   SNOTUT1             NOT SYSUT1 SO BRANCH                 15800021
         TM    STRUNCSW,XXFF       TRUNCATED WRITE OF SYSUT1?           15820021
         BO    NSYSN               SKIP NEXT INSTRUCTIONS               15840021
         MVC   DX6(LX2,R1),DX6(R7)                                      15860021
         MVC   DX82(LX2,R15),DX6(R7)                                    15880021
         B     NSYSN               SKIP SNOTUT1 ROUTINE                 15900021
SNOTUT1  DS    0H                                                       15920021
         CH    R10,SYSN      IF SYSIN, RESET BLKSIZE (CONCAT DS)        15940021
         BNE   NSYSN         NOT SYSIN                                  15960021
         MVC   DX6(LX2,R7),INBUF SIZE SET BY PH00 RESTORED IN DCB       15980021
NSYSN    MVC   DX62(LX2,R15),DX6(R7) BLOCK SIZE                         16000021
         TM    CLOSE,XXFF                                               16020021
         BZ    IOCOMA              LEAVE DCB ALONE                      16040021
         MVC   DX62(LX2,R15),CLOSEH                                     16060021
         NI    CLOSE,XX00                                               16080021
IOCOMA   L     R15,DX48(R0,R15) ADDRESS OF READ/WRITE MODULE            16100021
         NC    DX0(LX2,R9),OFF                                          16120021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      16140021
READER   BAL   R14,IOCOM           GET @ DECB,ETC                       16160021
         MVI   DX5(R1),XX80                                             16180021
BALR     BALR  R14,R15             BRANCH TO READ/WRITE MODULE          16200021
         BR    R11                 RETURN TO NEXT SEQUENTIAL INSTR      16220021
WRITER   BAL   R14,IOCOM           GET @ DECB,ETC                       16240021
         MVI   DX5(R1),XX20                                             16260021
         B     BALR                BRANCH TO READ/WRITE MODULE          16280021
*                                                                       16300021
*                                                                       16320021
*                                                                       16340021
READB    CH    R10,UTILITY                                              16360021
       BL      READC               UTILITY FILE                         16380021
*                                            SYSIN BLOCKED              16400021
*                                            NO                         16420021
         LH    R1,DX4(R6)                                               16440021
         AH    R1,EIGHTY                                                16460021
         CH    R1,DX6(R6)                                               16480021
       BE      READC               BRANCH AROUND EXIT                   16500021
*                                                                       16520021
         STH   R1,DX4(R6)                                               16540021
*                                                                       16560021
         B     EXIT                          SINGLE  BUFFER             16580021
*                                                                       16600021
READC    TM    SINGBUF,XXFF                                             16620021
         BO    READSING            SINGLE BUFFER READ                   16640021
*                                                                       16660021
READC1   BAL   R11,CHECKER         MUST CHECK                           16680021
READC2   BAL   R11,READER          THEN READ                            16700021
EXIT     L     R0,DX0(R6)                                               16720021
         AH    R0,DX4(R6)                  CC DOES NOT EQUAL 0          16740021
*                                                                       16760021
EXIT1    LR    R1,R8                                                    16780021
         LA    R1,DX0(R1)                                               16800021
*                                                                       16820021
*                                                                       16840021
EXIT2    L     R13,SAVER13              CC  EQUALS 0                    16860021
         LM    R14,R15,DX12(R13)                                        16880021
         MVC   DX12(LX4,R13),SAVEPHSE+NX12                              16900021
         LM    R2,R12,DX28(R13)                                         16920021
         BC    R15,DX2(R1)         RETURN TO CALLING PHASE              16940021
ENDIN1   XC    CURNAME(LX8),CURNAME ZERO CURNAME                        16960021
ENDIN    CR    R1,R1                                                    16980021
         B     EXIT1               PREPARE TO RETURN TO CALLING PH      17000021
*                                                                       17020021
*                                                                       17040021
*                                                                       17060021
*                                                                       17080021
WRITEA   SR    R3,R3            IC TEXT  WRITER                         17100021
         IC    R3,DX0(R2)                                               17120021
         SRA   R3,DX6                                                   17140021
         LA    R3,DX1(R3)                                               17160021
         BC    R7,WRITE        SHORT FORM                               17180021
         IC    R3,DX1(R2)        LONG  FORM                             17200021
         LA    R3,DX2(R3)                                               17220021
*                                                                       17240021
WRITE    CH    R10,PRINTER          IS IT PRINTER                       17260021
         BE    WRITPRNH            YES                                  17280021
         CH    R10,PUNCHER          IS IT  PUNCH                        17300021
         BE    WRITPCH             YES                                  17320021
WRITE1   LH    R4,DX4(R6)   USED BYTES      UTILITY                     17340021
         AR    R4,R3       THIS WRITE                                   17360021
         CH    R4,DX6(R6)                                               17380021
         BNL   WRITE1A   WILL NOT  FIT                                  17400021
         L     R1,DX0(R6)                                               17420021
         AH    R1,DX4(R6)                                               17440021
         STH   R4,DX4(R6)   STORE  UPDATED LENGTH                       17460021
         BCTR  R3,R0       GET  INTERNAL  LENGTH                        17480021
         EX    R3,MOVE    MOVE  DATA                                    17500021
         BC    UNCOND,EXIT1        PREPARE TO RETURN TO CALLING PH      17520021
*                                                                       17540021
*                                                                       17560021
*                                                                       17580021
*                                                                       17600021
*                                                                       17620021
*                                                                       17640021
*                                                                       17660021
*                                                                       17680021
WRITE1A  L     R1,DX0(R6)                                               17700021
         AH    R1,DX4(R6)                                               17720021
         MVI   DX0(R1),XXFF                                             17740021
         TM    SINGBUF,XXFF                                             17760021
         BO    WSINGLE             SINGLE BUFFERED                      17780021
         LA    R12,WRITE1                                               17800021
         B     WCOMM               DOUBLE BUFFERED                      17820021
WSINGLE  BAL   R11,WRITER          MUST WRITE                           17840021
         LA    R11,WRITE1                                               17860021
         B     CHECKER             THEN CHECK                           17880021
WRITPRIN TM    PHZSW,LIST                                               17900021
         BZ    EXITR               SOURCE LISTING NOT REQUESTED         17920021
         TM    PRINTBUF,XXF1                                            17940021
         BO    EJECTC              GO EJECT PAGE                        17960021
         TM    PRINTSW,XXFF                                             17980021
         BO    WPRINA              *                                    18000021
WPRINB   LA    R14,EXITR   WILL FIT EXIT                                18020021
         LA    R12,WPRINB   RETRY ADDRESS                               18040021
         B     UNITCOM             BR TO PUT REC IN BUF IF POSSIBL      18060021
WRITPRNH TM    HDRSW,XXFF           WAS IDENT PRINTED                   18080021
         BNO   WRITPRIN            YES BRANCH                           18100021
         NI    HDRSW,XXF0           SET MIXED SWITCH                    18120021
WPRINA   NI    PRINTSW,XX00                                             18140021
         LA    R3,DX1(R3)                                               18160021
         BCTR  R2,R0               POINT TO CARR CONTROL POSITION       18180021
         MVC   WPRINHLD,DX0(R2)                                         18200021
         MVC   DX0(LX1,R2),PRINTBUF                                     18220021
WPRINC   LA    R14,WPRIND                                               18240021
         LA    R12,WPRINC                                               18260021
         B     UNITCOM             BR TO PUT REC IN BUF IF POSSIBL      18280021
WPRIND   MVC    PRINTBUF,BLANK                                          18300021
         MVC   DX0(LX1,R2),WPRINHLD                                     18320021
EXITEJ   TM    EJECTSW,XXFF                                             18340021
       BZ      EXITR               NO NEED TO GO TO WOUT                18360021
         NI    EJECTSW,XX0F                                             18380021
       B       WOUT                MUST PAD RECORD WITH BLANKS          18400021
*                                                                       18420021
WRITPCH  TM    PHZSW,DECK                                               18440021
         BO    WPNCH               *                                    18460021
*   DECK IS REQUESTED                                                   18480021
WRITPCHA TM    PHZSW,LINK                                               18500021
         BO    WGO                 LOAD MODULE REQUESTED                18520021
         B     EXITR               RETURN NOW TO CALLING PHASE          18540021
WPNCH    LA    R14,WRITPCHA        WILL FIT EXIT                        18560021
         LA    R12,WPNCH    RESTART ADDRESS AFTER WRITING BUFFER        18580021
         B     UNITCOM  ANALYSIS ROUTINE                                18600021
WGO      ST    R8,READSAV        PICK UP PIINTERS FOR SYSLIN FILE       18620021
         BAL   R0,GOSYSGO          *                                    18640021
         DC   X'E8'                INTERNAL CALL TO COS                 18660021
HDRSW    DC    X'FF'               USED IN PRINT ROUTINE                18680021
WGO1     L     R8,READSAV                                               18700021
         TM    PHZSW,DECK                                               18720021
         BZ    WGO1A    NO DECK DO NOT RESTORE LENGTH                   18740021
         LA    R3,DX1(R3)                                               18760021
WGO1A    LA    R12,WGO1A                                                18780021
         LA    R14,EXITR   MOVE DONE                                    18800021
         B     UNITCOM             BR TO PUT REC IN BUF IF POSSIBL      18820021
WPRINHLD DC    X'00'               SAVE AREA FOR 1ST CH OF PRINT LI     18840021
PRINTSW  DC    X'FF'               'FF' MEANS PRINTLINE                 18860021
WOUT     OI    PRINTSW,XXFF                                             18880021
         TM    PHZSW,LIST                                               18900021
         BZ    EXITR               RETURN NOW TO CALLING PHASE          18920021
         LH    R2,DX4(R6)                                               18940021
         SR    R3,R3                                                    18960021
WOUTA    LA    R3,DX121(R3)                                             18980021
         CR    R2,R3                                                    19000021
         BH    WOUTA               MUST INCREMENT R3                    19020021
         STH   R3,DX4(R6)                                               19040021
         SR    R3,R2                                                    19060021
         BZ    WOUT6               NO NEED TO PAD WITH BLANKS           19080021
         A     R2,DX0(R6)                                               19100021
         MVI   DX0(R2),XX40                                             19120021
         BCTR  R3,R0               ADJUST LENGTH FOR WOUTB              19140021
         BCTR  R3,R0               *                                    19160021
         LTR   R3,R3                                                    19180021
         BC    R12,WOUT6           NO NEED TO PAD                       19200021
         STC   R3,WOUTB+NX1                                             19220021
WOUTB    MVC   DX1(LX0,R2),DX0(R2)                                      19240021
WOUT6    TM    EJECTSW,XXFF                                             19260021
       BM      EJECTA              DON'T EJECT YET                      19280021
       AP      LINECNT,ONE                                              19300021
         CLI   PRINTBUF,XC0                                             19320021
         BE    WOUT6A       SPACE=2                                     19340021
         CLI   PRINTBUF,XX60                                            19360021
         BNE   WOUT6B       NOT  SPACE=3                                19380021
         AP    LINECNT,ONE                                              19400021
WOUT6A   AP    LINECNT,ONE                                              19420021
WOUT6B   CP    LINECNT,SIXTY                                            19440021
         BNL   EJECTR1             PREPARE TO EJECT               44678 19460021
         NI    MAXLINES,XX00       LINECNT < MAXIMUM              44678 19480021
         B     EXITR               RETURN TO CALLING PHASE              19500021
*                                                                       19520021
*                                                                       19540021
*                                                                       19560021
EJECTA   NI    EJECTSW,XX00                                             19580021
         LM    R2,R3,SAVEPHSE                                           19600021
         MVI   PRINTBUF,XX60                                            19620021
         TM    EJRETURN,XXFF       WPRINA CALLED FROM EJECT?            19640021
         BO    EJECTD              YES-THEN RETURN THERE                19660021
       B       WRITPRIN            CONTINUE WRITE PROCESSING            19680021
EJECTC   TM    HDRSW,XXFF           TEST IF IDENT                       19700021
         BZ    EJECTB              BRANCH IF NO                         19720021
         NI    HDRSW,XX00           ZERO SWITCH                         19740021
         MVI   PRINTBUF,XC0         SET DOUBLE SPACE                    19760021
         AP    LINECNT,ONE                                              19780021
         B     EJECTCC             DON'T CLEAR LINECNT                  19800021
EJECTB  SP     LINECNT,LINECNT                                          19820021
EJECTCC  STM   R2,R3,SAVEPHSE        STORE REG 2 + 3                    19840021
         L     R2,OVERFLOD                                              19860021
         LH    R3,DX0(R2)                                               19880021
         MVC   DX0(LX6,R2),MASKPG                                       19900021
         ED    DX0(LX6,R2),PAGE                                         19920021
       AP      PAGE,ONE                                                 19940021
         STH   R3,DX0(R2)                                               19960021
         LA    R2,DX2(R2)                                               19980021
         OI    EJECTSW,XXFF                                             20000021
       B       WPRINA              CONTINUE WRITE PROCESSING            20020021
*                                                                       20040021
*                                                                       20060021
*                                                                       20080021
EJECT    CLI   LINKCNT+NX1,LSWPH2  ARE WE PAST PHASE1B                  20100021
         BH    EJECTE      YES NO NEED TO GO THRU THIS CODE             20120021
         CLI   PRINTBUF,XXF1       EJECT IMPENDING?                     20140021
         BNE   EJECTE              NO-THEN CONTINUE                     20160021
         B     EJECTG              TEST FOR EJECT AT END-OF-PAGE  44678 20180021
EJECTF   OI    EJRETURN,XXFF       SIGNAL-RETURN CONTR-L-EJECTD   44678 20200021
         B     EJECTCC             BRANCH TO WRITE HEADING(CC=F1)       20220021
EJECTD   NI    EJRETURN,XX00                                            20240021
EJECTE   CLI   DX1(R8),EJCTQ       EJECT REQUEST FROM X'86'?            20260021
         BE    EJECTR              YES                                  20280021
         CLI   DX1(R8),SKIP1Q       WANT TO SKIP ONE LINE               20300021
         BE    SKP1                YES                                  20320021
         CLI   DX1(R8),SKIP2Q       NO, WANT TO SKIP TWO LINES          20340021
         BE    SKP2                YES                                  20360021
         CLI   DX1(R8),SKIP3Q       NO, WANT TO SKIP THREE LINES        20380021
         BE    SKP3                YES                                  20400021
         B     EJECTR              INVALID REQUEST BUT AT LEAST EJE     20420021
SKP1     MVI   SKIPCC,SKPCC1Q      PUT A BLANK IN CARRIAGE CONTROL      20440021
         B     SKP5                CONTINUE                             20460021
SKP2     MVI   SKIPCC,SKPCC2Q      PUT A ZERO  IN CARRIAGE CONTROL      20480021
SKP4     AP    LINECNT,ONE         RECONCILE LINECOUNT                  20500021
         B     SKP5                CONTINE                              20520021
SKP3     MVI   SKIPCC,SKPCC3Q      PUT A DASH  IN CARRIAGE CONTROL      20540021
         AP    LINECNT,ONE         RECONCILE LINECNT                    20560021
         B     SKP4                GO TO ADD ONE MORE TO LINECNT        20580021
SKP5     AP    LINECNT,ONE                                              20600021
SKP51    LH    R2,DX4(R6)          GET BYTE COUNT FROM BCB         3817 20620021
         LA    R2,DX121(R2)                                             20640021
         LH    R3,DX6(R6)           R3 = LENGTH OF BUFFER               20660021
         CR    R2,R3                                                    20680021
         BH    SKP6                NOT ENOUGH ROOM IN BUFF WRITE FI     20700021
         L     R3,DX0(R6)           R3 = ADDRESS OF BUFFER              20720021
         AH    R3,DX4(R6)           ADD BYTES USED SO FAR               20740021
         MVC   DX0(LX1,R3),SKIPCC    NEW CARRIAGE CONTROL IN IST POSI   20760021
         MVI   DX1(R3),XX40         PROPAGATE A BLANK                   20780021
         MVC   DX2(LX119,R3),DX1(R3)                                    20800021
         STH   R2,DX4(R6)                                               20820021
         TM    EJECTSW,XXFF         WERE WE ALREADY SUPPOSED TO EJEC    20840021
         BM    EJECTA              YES GO THERE                         20860021
         CP    LINECNT,SIXTY       WILL WE HAVE TO EJECT NOW            20880021
         BNL   EJECTR              YES GO THERE                         20900021
         B     EXITR               ELSE RETURN TO CALLING PHASE         20920021
SKP6     LA    R12,SKP51           SAVE RETURN ADDRESS             3817 20940021
         B     WCOMM               CHECK / WRITE / RETURN               20960021
EJECTR   SP    LINECNT,LINECNT     CLEAR LINECNT                        20980021
         MVC   PRINTBUF(LX1),SKIP   SET UP EJECT CHARACTER              21000021
         B     EXITR               RETURN TO CALLING PHASE              21020021
EJECTR1  OI    MAXLINES,XXFF       INDICATE FORCED EJECT (EOP)    44678 21040021
         B     EJECTR              PREPARE TO EJECT               44678 21060021
EJECTG   TM    MAXLINES,XXFF       END-OF-PAGE EJECT?             44678 21080021
         BNO   EJECTF              NO                             44678 21100021
         NI    MAXLINES,XX00       TURN OFF SWITCH                44678 21120021
         CLI   DX1(R8),EJCTQ       'EJECT' AT END-OF-PAGE?        44678 21140021
         BNE   EJECTF              NO-CONTINUE                    44678 21160021
         B     EJECTR              BYPASS FORCED EJECT            44678 21180021
COPYCHK  DC    X'00'               X'00' MEANS CHK ISSUED FOR COPY      21200021
SKPCC1Q  EQU   C' '                                                     21220021
SKPCC2Q  EQU   C'0'                                                     21240021
SKPCC3Q  EQU   C'-'                                                     21260021
EJCTQ    EQU   X'00'                                                    21280021
SKIP1Q   EQU   X'01'                                                    21300021
SKIP2Q   EQU   X'02'                                                    21320021
SKIP3Q   EQU   X'03'                                                    21340021
MAXLINES DC    X'00'               MAX LINES/PAGE CONDITION SW    44678 21360021
SKIPCC   DS    C                   CARRIAGE CONTROL FOR SKIP            21380021
EJRETURN DC    X'00'               RETURN CONTROL TO EJECTD IF ON       21400021
*                                                                       21420021
*                                                                       21440021
*                                                                       21460021
*                                                                       21480021
*                                                                       21500021
*                                                                       21520021
*                                                                       21540021
*                                                                       21560021
*                                                                       21580021
*                                                                       21600021
*                                                                       21620021
*                                                                       21640021
*                                                                       21660021
*                                                                       21680021
*                                                                       21700021
*                                                                       21720021
*                                                                       21740021
*                                                                       21760021
*                                                                       21780021
SYSN     DC    H'20'         SYSIN FILE NUMBER                          21800021
*                                                                       21820021
UNITCOM  LH    R4,DX4(R6)                                               21840021
         AR    R4,R3                 TESTS TO SEE IF A FIELD            21860021
         CH    R4,DX6(R6)             WILL  FIT AND IF IT  DOES         21880021
         BC    R2,WCOMM  WILL NOT FIT    IT MOVES AND UPDATES           21900021
         BCTR  R3,R0                 BUFFER CONTROL BLOCK               21920021
         L     R1,DX0(R6) WHERE TO    IF NOT  IT EXITS  TO  REG 15      21940021
         AH    R1,DX4(R6)             IF YES  IT EXITS  TO  REG 14      21960021
         STH   R4,DX4(R6) UPDATE LENGTH                                 21980021
         EX    R3,MOVE                                                  22000021
         BR    R14                 CONTINUE WRITE PROCESSING            22020021
*                                                                       22040021
*                                                                       22060021
*                                                                       22080021
*                                                                       22100021
*                                                                       22120021
*                                                                       22140021
*                                                                       22160021
*                                                                       22180021
*                                                                       22200021
*                                                                       22220021
*                                                                       22240021
*                                                                       22260021
*                                                                       22280021
*                                                                       22300021
EXITR    TM    PHZSW,LIST                                               22320021
         BZ    EXIT                RETURN TO CALLING PHASE              22340021
         CP    LINECNT,PZERO                                            22360021
         B     EXIT1                         PAGE                       22380021
*                                                                       22400021
*                                                                       22420021
*                                                                       22440021
*                                                                       22460021
*                                                                       22480021
*                                                                       22500021
*                                                                       22520021
         DS    0F                                                       22540021
SEGSAVE  DC    F'1'                REL. LOC OF SEG. RECORD              22560021
ADS1     DC    A(DS1)              @ SYSUT1 DCB                         22580021
APCBSPT  DC    A(PCBSPT)           @ COBOL SPACE PARAMETERS             22600021
ADECB1   DC    A(DECBDS1)          @ SYSUT1 DECB                        22620021
SEGRECL  DC    H'0'                RECORD LENGTH OF PUT FOR SEG         22640021
SUT1     DC    H'4'                Y PARAMETER VALUE FOR SYSUT1         22660021
SEGNTSW  DC    X'00'               3 WAY SEGMENTATION SWITCH            22680021
STRUNCSW DC    X'00'               INDICATES TRUNCATED WRITE IN SEG     22700021
PTYSAVE  DC    X'0'                SAVE PLACE FOR PRIORITY NUMBER OF    22720021
*                                  THE SEGMENT JUST NOTED               22740021
NOTSEG   EQU   X'FF'                                                    22760021
CHECKSW  DC    X'0'                 TELLS SEGNOTE2 IF A SWRITE WAS DONE 22780021
ONSWITCH EQU   X'FF'                                                    22800021
OFFSWTCH EQU   X'00'                                                    22820021
* ENTER SEGNOTE.PH5 HAS ENCOUNTERED A SEGMENT CONTROL BREAK.LAST        22840021
* RECORD OF PREVIOUS SEGMENT HAS BEEN PUT.                              22860021
SEGNOTE DS     0H                                                       22880021
         L     R1,DX0(R6)      A(BUFFER)                                22900021
         AH    R1,DX4(R6)      LENGTH                                   22920021
         MVI   DX0(R1),XXFF    DELIMITER                                22940021
         LH    R4,DX4(R6)                                               22960021
         LA    R4,DX1(R4)      NEW LENGTH                               22980021
         STH   R4,SEGRECL     SAVE FOR TRUNCATED WRITE                  23000021
         TM    SPECIAL,XXFF                                             23020021
         BO    SFIRSTW             FIRST I/O THIS PHASE                 23040021
         BAL   R11,CHECKER    CHECK PREVIOUS PHYSICAL WRITE             23060021
         B     SEGNOTE0            BRANCH AROUND NEXT INSTRUCTION       23080021
SFIRSTW  DS    0H                                                       23100021
         BAL   R11,CHECKERB        SWITCH BCB POINTERS                  23120021
SEGNOTE0 DS    0H                                                       23140021
         OI    STRUNCSW,XXFF       INDICATES TRUNCATED WRITE TO IOCO    23160021
         L     R1,ADECB1                                                23180021
         MVC   DX6(LX2,R1),SEGRECL                                      23200021
         L     R1,ADS1                                                  23220021
         MVC   DX82(LX2,R1),SEGRECL                                     23240021
         BAL   R11,WRITER     WRITE LAST BLOCK OF PREVIOUS SEGMENT      23260021
         NI    STRUNCSW,XX00       DCBRECL WILL BE RESTORED             23280021
         MVI   CHECKSW,ONSWITCH     SET IT ON                           23300021
         BAL   R11,CHECKERC        UPDATE BCB'S                         23320021
         MVI   SEGNTSW,XXF0    SEGNOTE1 WILL BE ENTERED FROM CHECKER    23340021
         MVI   CHECKSW,OFFSWTCH     SET IT OFF                          23360021
         TM    DX1(R8),ONSWITCH      LAST C1 CALL FROM PHASE5?          23380021
         BNO   EXIT1                NO - RETURN TO PHASE5               23400021
         CLC   PTYNO,PTYSAVE                                            23420021
         BE    SEGNOT00            LEAVE SEGNTSW ALONE                  23440021
         MVI   SEGNTSW,ONSWITCH                                         23460021
SEGNOT00 BAL   R11,CHECKER         OWE A CHECK OR A CHECK/NOTE          23480021
         MVI   SEGNTSW,OFFSWTCH    ALL THRU WITH THIS SWITCH            23500021
         MVC   PURGER,PURGER+NX1    DONT PURGE UT1                      23520021
         B     EXIT1               LAST RETURN TO PHASE5                23540021
* SEGNOTE1 ENTERED AFTER CHECK  OF LAST WRITE PREVIOUS SEGMENT          23560021
SEGNOTE1 DS    0H                                                       23580021
         OI    SEGNTSW,XXFF                                             23600021
         BR    R11                 RETURN TO NEXT SEQUENTIAL INSTR      23620021
* SEGNOTE2 ENTERED AFTER CHECK  OF FIRST WRITE OF SEGMENT               23640021
SEGNOTE2 DS    0H                                                       23660021
         CLI   CHECKSW,ONSWITCH     DO WE HAVE TO CHECK PRIOR TO NOTE?  23680021
         BNE   SEGNT2A              NO - M THAT IT JUST NOTE            23700021
         BAL   R15,GETDECBA         START SETUP FOR CHECK MACRO         23720021
         ST    R1,READSAV                                               23740021
         CHECK (1)                                                      23760021
         L     R1,READSAV           END SETUP FOR CHECK MACRO           23780021
SEGNT2A  ST    R1,READSAV           START SETUP FOR NOTE MACRO          23800021
*                                   KEEP IT NEAT ETC                    23820021
         L     R1,ADS1                                                  23840021
         NOTE  (1)                                                      23860021
         ST    R1,SEGSAVE    TO BE RETURNED TO PH5                      23880021
         L     R1,READSAV                                               23900021
         MVC   PTYSAVE,PTYNO       SAVE PRIORITY NO                     23920021
         NI    SEGNTSW,XX00                                             23940021
         BR    R11       RETURN TO WRITE NEXT BLOCK                     23960021
* ENTER SEGPNT . THERE HAS BEEN A PREVIOUS READ ON SYSUT1               23980021
SEGPNT   DS    0H                                                       24000021
         ST    R1,SEGSAVE                                               24020021
         L     R1,ADS1             SET UP FOR SYSUT1 POINT              24040021
         POINT (1),SEGSAVE         POINT TO FIRST SEGMENT               24060021
         BAL   R11,READER          READ                                 24080021
         BAL   R11,CHECKER         CHECK SEGMENT AND TURN OFF SPECI     24100021
         B     EXIT                RETURN TO CALLING PHASE              24120021
*                                                                       24140021
UTILITY  DC    H'17'               HILIMIT Y VALUE FOR UTILITY FILE     24160021
*                                  S                                    24180021
*                                                                       24200021
*THIS ROUTINE  CLOSES OUT PUT FILES  AND CHECKS PUTS                    24220021
*TRUNCATION WILL OCCUR FOR  UNIT RECORD TYPE OUTPUT FILES  TO THE       24240021
*CURRENT LENGTH (SEE WRITER)                                            24260021
CLOSER   EQU   *                                                        24280021
         TM    DX0(R8),XXFF    TEST IF COMMON ROUTINE                   24300021
         BO    COMRTN        BRANCH IF YES                              24320021
         MVC   CLOSEH,DX4(R6)                                           24340021
         CH    R10,UTILITY                                              24360021
         BH    CLOSERB        NOT A UTILITY                             24380021
         L     R14,DX0(R6)                                              24400021
         AH    R14,DX4(R6)                                              24420021
         MVI   DX0(R14),XXFF                                            24440021
CLOSERB  TM    SPECIAL,XXFF                                             24460021
         BO    CLOSERAA            FIRST I/O THIS PHASE                 24480021
         TM    SINGBUF,XXFF                                             24500021
         BO    CLOSERA             SINGLE BUFFER                        24520021
         BAL   R11,CHECKER         MUST ISSUE CHECK                     24540021
CLOSERA  CLC   CLOSEH,ZEROES                                            24560021
*    IF FILE IS F2, BETWEEN PHASES 5 + 6, WRITE FF                      24580021
*       IF EMPTY BUFFER.                                                24600021
       BNE CLOSEZ                  LENGTH TRUNCATED WRITE NOT ZERO      24620021
         CLI   LINKCNT+NX1,LSWPH01 PHASE 01                             24640021
         BE    CLOSEZ              YES - LAST WRITE UTILITY             24660021
         CLI   LINKCNT+NX1,LSWPH7                                       24680021
       BNE   CLOSERX               NOT LAST PHASE                       24700021
         CLI   PURGEB,XXF2                                              24720021
       BNE   CLOSERX               NOT FIRST I/O BUF2 THIS PHASE        24740021
CLOSEZ EQU   *                                                          24760021
         CH    R10,UTILITY                                              24780021
         BL    CLOSERD             UTILITY FILE                         24800021
         OI    CLOSE,XXFF                                               24820021
CLOSERD  BAL   R11,WRITER          WRITE                                24840021
         BAL   R11,CHECKER         THEN CHECK                           24860021
         L     PR4,CTRMNT                                               24880021
CLOSERX  CLI   DX1(R8),EXTCALL                                          24900021
         BE    EXIT1               CALLED FROM ANOTHER PHASE            24920021
         BC    UNCOND,DX2(R8)       INTERNAL CALL DON'T RESTORE REG     24940021
CLOSERAA BAL   R11,CHECKERB        SWITCH BCB POINTERS                  24960021
         B     CLOSERA             CONTINUE CLOSE PROCESSING            24980021
*                                                                       25000021
CLOSEH   DS    H                   LENGTH OF TRUNCATED WRITE            25020021
CLOSE    DC    X'00'               'FF' MEANS LAST WRITE ON UTILITY     25040021
*                                                                       25060021
CLOSET   DS    0H                                                       25080021
         L     PR4,CTRMNT                                               25100021
         B     CLOSOK              CONTINUE TCLOSE PROCESSING           25120021
*                                                                       25140021
COMRTN   DS    0H                                                       25160021
*              THIS ROUTINE IS TO BE USED FOR ASYNCHRONOUS PROCESSING   25180021
*              ONLY    CODING HAS BEEN REMOVED 29 JULY 1968             25200021
         B     EXIT1               RETURN TO CALLING PHASE              25220021
SYAA     SYNADAF ACSMETH=BPAM      I/O ERROR EXIT FOR SYSLIB            25240021
         BC    UNCOND,SYAC         *                                    25260021
SYAB     SYNADAF ACSMETH=BSAM      I/O ERROR EXIT FOR ALL OTHER FILES   25280021
SYAC     LA    R2,SYNMSG                                                25300021
         MVC   DX14(LX77,R2),DX50(R1) MOVE MESSAGE TO WORK AREA         25320021
         SYNADRLS                                                       25340021
         WTO   MF=(E,(2))                                               25360021
         L     PR4,CTRMNT                                               25380021
         OI    SKPRSW,XXFF          SET SWITHC TO SKIP PRINTER          25400021
         XC    FLSHBUF,FLSHBUF                                          25420021
         BC    UNCOND,TRMNATE      ABNORMAL TERMINATION OF JOB          25440021
SYNMSG   DC    H'91'               MESSAGE LENGTH                       25460021
         DC    X'8000'             *                                    25480021
         DC    CL87'IKF0003I-D'                                         25500021
         DC    X'04004020'         *                                    25520021
*                                                                       25540021
LINKBAZ  L     R8,SPIEAD                                                25560021
         L     R2,DX0(R8)                                               25580021
         SPM   R2                                                       25600021
         SPIE  MF=(E,(8))                                               25620021
         MVC   LAST+NX3(LX1),RETCDE                                     25640021
         TM    RETOK,XXFF                                               25660021
          BZ    LASTB              PREPARE TO RETURN TO CALLING PH      25680021
         L     R13,MYSAVE+NX4                                           25700021
          B     LASTC              PREPARE TO RETURN TO SUPERVISOR      25720021
LASTB    LA    R13,SAVEPHSE                                             25740021
         OI    RETOK,XX0F                                               25760021
LASTC    LM    R14,R12,DX12(R13)                                        25780021
LAST     LA    R15,DX0                                                  25800021
         BR    R14                 BRANCH TO SUPVR OR CALLING PH        25820021
EOJ      CLI   LINKCNT+NX1,LSWPH01                                      25840021
         BNE   PH6OR7             NO, IT MUST BE 6 OR 7                 25860021
         MVI   PH01SW,XX01                                              25880021
         MVI   RETCDE,XX10         SET RETURN CODE TO TERMINATE         25900021
         TM    PHZSW,LIST    WAS ERROR ON PRINTER                       25920021
         BO    PROK               NO, BRANCH                            25940021
         XC    ENDBUF,ENDBUF      DO NOT FLUSH PRINT BUFFER             25960021
PROK     MVC   PURGER(LX3),ENDBUF  MOVE CODE TO FLUSH OUT PRINT BUFF    25980021
PH6OR7   CLI   LINKCNT+NX1,LSWPH6A                                      26000021
         BNE   SETPH7SW            NOT XREF                             26020021
         MVC   PURGER,PURGER+NX1                                        26040021
SETPH7SW MVI   LINKCNT+NX1,LSWPH7                                       26060021
         B     LINKB               PREPARE TO END COMPILATION           26080021
RELSPACA DC    A(RELSPACE)         TAMER ADDRESS CONSTANT               26100021
ENDBUF   DC    X'00F600'           CONSTANT TO FORCE FLUSH PRINT BU     26120021
PH01SW   DC    X'00'               '01' MEANS ABANDONED IN PH01         26140021
*                                                                       26160021
*                                                                       26180021
*                                                                       26200021
*LINKAGE PACKAGE TO BRING IN PHASES                                     26220021
*                                                                       26240021
*                                                                       26260021
*                                                                       26280021
*                                                                       26300021
LINKA    LH    R2,LINKCNT                                               26320021
         LA    R2,LINKNAME(R2)                                          26340021
         MVC   LINKNAME+NX6(LX2),DX8(R2)                                26360021
         NI    RETOK,XX00                                               26380021
         LH    R2,LINKCNT                                               26400021
         LA    R2,DX2(R2)                                               26420021
         STH   R2,LINKCNT                                               26440021
         SRL   R2,DX1                  CALCULATE PHASW FOR TAMER.       26460021
         STC   R2,PHASW                                                 26480021
         CLI   LINKCNT+NX1,LSWPH1B  ABOUT TO LINK PHASE1B?              26500021
         BE    LINKPH1             YES, LEAVE BUFFERS ALONE             26520021
         LA    R15,POINT+NX2                                            26540021
         LA    R14,DX9                                                  26560021
LINKAZ   IC    R6,DX0(R15)                                              26580021
         SLL   R6,DX28                                                  26600021
         SRL   R6,DX25                                                  26620021
         LA    R6,BUFCNLS-NX8(R6)                                       26640021
         CLC   DX4(LX2,R6),ZEROES                                       26660021
         BNE    LINKAZB            SKIP NEXT INSTRUCTION                26680021
         OI    DX0(R15),XXF0                                            26700021
LINKAZB  LA    R15,DX2(R15)                                             26720021
         BCT   R14,LINKAZ          CONTINUE ALTERING POINT FIELD        26740021
         CLI   LINKCNT+NX1,LSWPH2                                       26760021
         BE    LINKTM         BRANCH IF YES                             26780021
         CLI   LINKCNT+NX1,LSWPH3                                       26800021
         BNE   LINKPH          BRANCH IF NO                             26820021
LINKTM   L     R15,ATAMIN      YES                                      26840021
         BALR  R14,R15          GO TO TAMIN                             26860021
LINKPH   TM    HDRSW,XXFF                                               26880021
         BNZ   LINKPH1             LEAVE PRINTBUF,LINECNT ALONE         26900021
         MVI   PRINTBUF,XXF1        SET SKIP                            26920021
         SP    LINECNT,LINECNT   CLEAR LINE COUNT                       26940021
LINKPH1  LA    R13,SAVEPHSE                                             26960021
         LINK  EPLOC=LINKNAME,PARAM=(COS,BUFCNLS,INTO,DS1,BUFX,PHZSW,  X26980021
               ERRSEV,SEGSAVE,APCBSPT,LINKNAME+10,DECBLIB)        40329 27000021
LINKBA   DS    0H                                                       27020021
         TM    RETOK,XXFF                                               27040021
         BC    R12,LINKBAZ         MUST ISSUE SPIE                      27060021
PURGE    MVC   PURGER,PURGER+NX1                                        27080021
         TM    PURGER,XXFF                                              27100021
         L     PR4,CTRMNT                                               27120021
         BZ    INTERLUD            PURGE COMPLETE                       27140021
         MVC   PURGEB,PURGER                                            27160021
         BAL   R0,GOSYSGO          FLUSH BUFFERS                        27180021
PURGEB   DC    X'00'               SLACK BYTE FOR PURGE CALL            27200021
         B     PURGE               BRANCH TO SHIFT PURGE FIELD          27220021
PGR      DS    0XL29               PURGE STRING                         27240021
         DC    X'00'               FIRST BYTE                           27260021
         DC    X'00'               AFTER PH01                           27280021
         DC    X'00'               AFTER PH1A                           27300021
         DC    X'F3F600'           AFTER PH1B                           27320021
         DC    X'F2F400'           AFTER PH2                            27340021
         DC    X'F1F3F4F600'       AFTER PH3                            27360021
         DC    X'F100'             AFTER PH4                            27380021
         DC    X'F200'             AFTER PH50                           27400021
         DC    X'F1F3F400'         AFTER PH51                           27420021
         DC    X'F3F6F7F800'       AFTER PH6 NO XREF                    27440021
         DC    X'F600'             AFTER PH7                            27460021
PURGER   EQU   PGR                 PURGE STRING                         27480021
LINKB    CLC   LINKCNT,ZEROES                                           27500021
         BE    LINKA               MUST LINK TO PHASE01                 27520021
         OI    RETOK,XXFF                                               27540021
         L     R3,TBASWGNE                                              27560021
         NI    DX0(R3),SPACASK                                          27580021
         CLI   LINKCNT+NX1,LSWPH1A                                      27600021
         BE    LINKR               RETURNING FROM PHASE1A               27620021
         CLI   LINKCNT+NX1,LSWPH2                                       27640021
         BE    LINKR               RETURNING FROM PHASE2                27660021
         CLI   LINKCNT+NX1,LSWPH4                                       27680021
         BE    LINKR               RETURNING FROM PHASE4                27700021
         CLI   LINKCNT+NX1,LSWPH50                                      27720021
         BE    LINKR               RETURNING FROM PHASE5                27740021
         CLI   LINKCNT+NX1,LSWPH51                                      27760021
         BE    LINKR               RETURNING FROM PHASE51               27780021
         CLI   LINKCNT+NX1,LSWPH6                                       27800021
         BE    LNKB                RETURNING FROM PHASE6                27820021
         CLI   LINKCNT+NX1,LSWPH7                                       27840021
         BE    LINKR               RETURNING FROM PHASE7                27860021
LINKT    L     R15,ATAMOP                                               27880021
         BALR  R14,R15          GO TO TAMEOP.                           27900021
LINKR    LA    R13,SAVEPHSE    LOAD R13 REG SAV AREA                    27920021
         ST    R13,SAVER13         SET CURRENT SAVE AREA                27940021
         RETURN  (14,12)                                                27960021
LNKB     TM    PHZSW1,XREF                                              27980021
         BNO   LINKT               NO PH6A- GO THROUGH TAMEOP           28000021
         BC    UNCOND,LINKR        ELSE GO TO LINKR                     28020021
ATAMIN   DC    A(TAMEIN)           TAMER ADDRESS CONSTANT               28040021
ATAMOP   DC    A(TAMEOP)           TAMER ADDRESS CONSTANT               28060021
TBASWGNE DC    A(TBSWGENE)         TAMER ADDRESS CONSTANT               28080021
ARLDIC   EQU   ATAMOP                                                   28100021
*                                                                       28120021
SPIEAD   DC    A(0)                USED WITH SPIE MACRO                 28140021
*                                                                       28160021
IKFPATCH DS    0F                  PATCH AREA                           28180021
         B     IKFPATCH            EASES BRANCH ADDRESS CODING          28200021
         DC    6F'0'                                                    28220021
*                                                                       28240021
PH0SECT2 CSECT                                                          28260021
         DS    2F                  X                                    28280021
         DC    A(PRINTBUF)         X                                    28300021
         DS    F                   X                                    28320021
DS1      DCB   DSORG=PS,MACRF=(RP,WP),DDNAME=SYSUT1,DEVD=DA,RECFM=U,   X28340021
               LRECL=001,BLKSIZE=0,NCP=1,EODAD=ENDIN,SYNAD=SYAB,       X28360021
               KEYLEN=0                                                 28380021
DS2      DCB   DSORG=PS,MACRF=(R,W),DDNAME=SYSUT2,DEVD=DA,RECFM=FS,    X28400021
               LRECL=001,BLKSIZE=0,NCP=1,EODAD=ENDIN,SYNAD=SYAB         28420021
DS3      DCB   DSORG=PS,MACRF=(R,W),DDNAME=SYSUT3,DEVD=DA,RECFM=FS,    X28440021
               LRECL=001,BLKSIZE=0,NCP=1,EODAD=ENDIN,SYNAD=SYAB         28460021
DS4      DCB   DSORG=PS,MACRF=(R,W),DDNAME=SYSUT4,DEVD=DA,RECFM=FS,    X28480021
               LRECL=001,BLKSIZE=0,NCP=1,EODAD=ENDIN,SYNAD=SYAB         28500021
SPILL    DCB   DSORG=PS,MACRF=(R,W),DDNAME=SYSUT1,DEVD=DA,RECFM=F,     X28520021
               LRECL=512,BLKSIZE=512,NCP=1,SYNAD=SYAB                   28540021
IN       DCB   DSORG=PS,MACRF=(R),DDNAME=SYSIN,DEVD=DA,RECFM=FB,       X28560021
               LRECL=80,BLKSIZE=0,NCP=1,EODAD=ENDIN,SYNAD=SYAB          28580021
OUT      DCB   DSORG=PS,MACRF=(W),DDNAME=SYSPRINT,DEVD=DA,RECFM=FBA,   X28600021
               LRECL=121,BLKSIZE=0,NCP=1,SYNAD=SYAB                     28620021
LIB      DCB   DSORG=PO,MACRF=(R),DDNAME=SYSLIB,DEVD=DA,               X28640021
               LRECL=80,BLKSIZE=0,NCP=1,EODAD=ENDIN1,SYNAD=SYAA         28660021
PCH      DCB   DSORG=PS,MACRF=(W),DDNAME=SYSPUNCH,DEVD=DA,RECFM=FB,    X28680021
               LRECL=80,BLKSIZE=0,NCP=1,SYNAD=SYAB                      28700021
GOF      DCB   DSORG=PS,MACRF=(W),DDNAME=SYSLIN,DEVD=DA,RECFM=FB,      X28720021
               LRECL=80,BLKSIZE=0,NCP=1,SYNAD=SYAB                      28740021
*                                                                       28760021
SYATBL   DS    80C         TABLE OF DD NAMES CREATED BY PHASE 01        28780021
*                                                                       28800021
*  FORMAT OF DECB'S                                                     28820021
*        DC    F'0'   ECB                                               28840021
*        DC    X'00'   TYPE                                             28860021
*        DC    X'80'    TYPE                                            28880021
*        DC    AL2(0)                                                   28900021
*        DC    A(DCB)    DCB ADDRESS                                    28920021
*        DC    A(AREO)    I-O AREA                                      28940021
*        DC    A(0)  POINTRRS TO I-O STATUS BLOCK                       28960021
DECBDS1  DC    2F'0'               X                                    28980021
         DC    A(DS1)              X                                    29000021
         DC    2A(0)               X                                    29020021
DECBDS2  DC    2F'0'               X                                    29040021
         DC    A(DS2)              X                                    29060021
         DC    2A(0)               X                                    29080021
DECBDS3  DC    2F'0'               X                                    29100021
         DC    A(DS3)              X                                    29120021
         DC    2A(0)               X                                    29140021
DECBDS4  DC    2F'0'               X                                    29160021
         DC    A(DS4)              X                                    29180021
         DC    2A(0)               X                                    29200021
DECBSIN  DC    2F'0'               X                                    29220021
         DC    A(IN)               X                                    29240021
         DC    2A(0)               X                                    29260021
DECBSOU  DC    2F'0'               X                                    29280021
         DC    A(OUT)              X                                    29300021
         DC    2A(0)               X                                    29320021
DECBSPH  DC    2F'0'               X                                    29340021
         DC    A(PCH)              X                                    29360021
         DC    2A(0)               X                                    29380021
DECBSGO  DC    2F'0'               X                                    29400021
         DC    A(GOF)              X                                    29420021
         DC    2A(0)               X                                    29440021
DECBLIB  DC    2F'0'               X                                    29460021
         DC    A(LIB)              X                                    29480021
         DC    2A(0)               X                                    29500021
*                                                                       29520021
*                                                                       29540021
       DS    0F         AREA ALIGNMENT FOR RECORDING GET MAINS          29560021
         EJECT                                                          29580021
START    SAVE  (14,12)                                                  29600021
         BALR  R4,R0               ESTABLISH ADDRESSABILITY             29620021
         USING *,R4                                                     29640021
         L     R6,SVRTER                                                29660021
         ST    R13,DX0(R6)                                              29680021
         L     R6,BXAD                                                  29700021
         ST    R1,DX0(R6)                                               29720021
         L     R6,DX0(R1)                                               29740021
         L     R7,BFAD           PICK UP EXECUTE  PARAMS                29760021
         LA    R3,DX1                                                   29780021
         AH    R3,DX0(R6)                                               29800021
         EX  R3,MPARM                                                   29820021
         L     R5,ADCOS                                                 29840021
         LA    R5,DX6(R5)                                               29860021
         SPIE                                                           29880021
         ST    R1,SPIEAD                                                29900021
         L     R1,COSAD                                                 29920021
         BALR  R0,R1               PREPARE TO LINK TO PHASE01           29940021
         DC    X'A1'               LINK TO NEXT PHASE                   29960021
BXAD   DC    A(CORELEFT)           X                                    29980021
BFAD     DC    A(BUFCNLS)          X                                    30000021
COSAD    DC    A(COSAA)            X                                    30020021
MPARM    MVC   DX0(LX0,R7),DX0(R6)                                      30040021
SVRTER   DC    A(MYSAVE+4)         SYSTEM'S R13 SAVE AREA               30060021
*                                                                       30080021
         DS    0F                                                       30100021
         USING *,R4                                                     30120021
TRMNATE  L     PR12,ADCOS          LOAD ADDRESS OF COS                  30140021
         LA    PR5,DX6(PR12)        LOAD BASE REGISTER                  30160021
         L     R13,SAVER13                                              30180021
         TM    SKPRSW,XXFF          DID IO ERROR OCCURR                 30200021
         BO    SKPRNT              YES SKIP PRINTING                    30220021
         OI    PHZSW,LIST         SET PRINT SWITCH                      30240021
         MVI   PRINTBUF,XXF1        SET CHARACTER TO EJECT PAGE         30260021
         OI    LIST2,XX80           SET BIT TO OPEN PRINTER             30280021
         LA    R1,LIST2            OPEN PRINTER ONLY                    30300021
         SVC   19                  OPEN PRINTER                         30320021
         NI    LIST2,XX7F           TURN OFF DELIMITER BIT              30340021
         BALR  R0,R12                GO TO PUT                          30360021
         DC    X'16'               PUT RECORD                           30380021
         BALR  R0,R12                GO TO PRINT                        30400021
         DC    X'86'               WRITE RECORD                         30420021
         L     R15,TBAPR           ADDRESSIBILITY                       30440021
         USING PH0TBST2,15                                              30460021
         TM    TBERCD,XXFF                                              30480021
         BO    SKPRNT              NO ABEND DESIRED                     30500021
         LA    R3,LX1                                                   30520021
         LA    R2,BLANK                                                 30540021
         BALR  R0,R12              DUMMY PRINT TO UNBUFFER              30560021
         DC    X'16'                                                    30580021
         ABEND DX16,DUMP           QUIT FOR THIS TASK                   30600021
TBAPR    DC    A(TBPRIMEB)                                              30620021
         DROP  15                                                       30640021
SKPRNT   MVC   PURGER(LX3),FLSHBUF  MOVE CODE TO FLUSH OUT PRINT BUF    30660021
         MVI   LINKCNT+NX1,LSWPH7                                       30680021
         MVI   RETCDE,XX10          SET RETURN CODE TO 16               30700021
         B     LINKB               TERMINATE RUN                        30720021
INTERLUD DS    0H                                                       30740021
         L     PR4,CTRMNT                                               30760021
         LH    R2,LINKCNT                                               30780021
         SLL   R2,DX1                                                   30800021
         L     R2,PHASAD(R2)                                            30820021
         BR    R2                  GO TO CORRECT INT ROUTINE            30840021
INT1A    DS    0H                                                       30860021
         B     LINKA               GO IMMEDIATELY TO LINKA              30880021
INT1B    OI    LIST1,XX80                                               30900021
         LA    R1,LIST1                                                 30920021
         SVC   23                  TEMPORARY CLOSE                      30940021
         OI    LIST5,XX80                                               30960021
         LA    R1,LIST5                                                 30980021
         SVC   23                  TEMPORARY CLOSE                      31000021
         NI    LIST5,XX7F                                               31020021
         MVI   POINT+NX9,XX06  UT4                                      31040021
         MVI   BLANK,XX40                                               31060021
         B     LINKA               NOW GO TO LINKA                      31080021
INT2     TM    PHZSW,LIST                                               31100021
         BZ    INTMAP                                                   31120021
         OI    SWITCH+DX1,DSOU     SOURCE BIT FOR PH6 STATISTICS        31140021
INTMAP   OI    PHZSW,LIST                                               31160021
         LA    R1,LIST3                                                 31180021
         SVC   23                                                       31200021
         MVC   POINT+NX8(LX2),POINTM2                                   31220021
         B     LINKA               NOW GO TO LINKA                      31240021
INT3     LA    R1,LIST3                                                 31260021
         SVC   23                                                       31280021
         OI    INTO,XX80                                                31300021
         LA    R1,INTO                                                  31320021
         SVC   19                  OPEN SYSUT1 OUTPUT                   31340021
         MVC   POINT+NX2(LX2),POINTM3   ALLOCATE BUFFERS                31360021
         LA    R1,LIST2+NX4                                             31380021
         SVC   20                  PERMANENT CLOSE                      31400021
         B     LINKA               NOW GO TO LINKA                      31420021
INT4     DS    0H                                                       31440021
         OI    INTO,XX80           TCLOSE SYSUT1,SYSUT3                 31460021
         LA    R1,LIST6                                                 31480021
         SVC   23             TCLOSE                                    31500021
         MVC   POINT+NX2(LX6),POINTM4                                   31520021
         B     LINKA               NOW GO TO LINKA                      31540021
INT50    DS    0H                                                       31560021
         OI    LIST22,XX80                                              31580021
         LA    R1,LIST11                                                31600021
         SVC   23                  TCLOSE SYSUT1,SYSUT2                 31620021
         MVC   POINT+NX2(LX8),POINTM50  ALLOCATE BUFFERS FOR PH51       31640021
         B     LINKA               GO LINK PHASE51                      31660021
INT51    DS    0H             SAME AS OLD INT5 (BEFORE SPLIT PH51)      31680021
INT5     DS    0H                                                       31700021
         NI    INTO,XX7F       TURN OFF LIST DELIMITER                  31720021
         LA    R1,INTO                                                  31740021
         SVC   23             TCLOSE SYSUT1-4                           31760021
         OI    LIST4+NX4,XX80                                           31780021
         LA    R1,LIST4                                                 31800021
         SVC   19                                                       31820021
         NI    LIST4+NX4,XX7F                                           31840021
         MVC   POINT+NX2(LX4),POINTM5                                   31860021
         TM    PHZSW1,XREF                                              31880021
        BZ    NOX                  NO XREF- LEAVE PURGER ALONE          31900021
         MVC   PURGER+NX1(LX10),ALTPURGE                                31920021
NOX      DS    0H                                                       31940021
         CLI   SEGLMT,NOTSEG       IS PROGRAM SEGMENTED                 31960021
         BE    LINKA         NO    GET NEXT PHASE                       31980021
         MVC   POINT+NX2(LX8),POINTSEG                                  32000021
         B     LINKA               GET PHASE 6                          32020021
INT6     DS    0H                                                       32040021
         TM    PHZSW1,XREF         IS XREF ON                           32060021
         BO    PREINT6X           USER HAS REQUESTED 6A                 32080021
BYPASS6A LH    R2,LINKCNT         BYPASS 6A - INCREMENT LINKCNT BY 2    32100021
         LA    R2,DX2(R2)                                               32120021
         STH   R2,LINKCNT                                               32140021
         OI    PHZSW,LIST    SET PRINT SWITCH TO PRINT ERRORS           32160021
         OI    LIST6,XX80                                               32180021
         LA    R1,LIST6                                                 32200021
         SVC   23                                                       32220021
         NI    LIST6,XX7F                                               32240021
         MVI   POINT+NX5,XX03                                           32260021
         B     LINKA               NOW GO TO LINKA                      32280021
PREINT6X TM    PHZSW2,NO6A                                              32300021
         BO    BYPASS6A  DISASTER CONDITION - MUST BYPASS 6A            32320021
*ALTERNATE PH6 INTERLUDE, TCLOSE SYSUT1-3, BUFFERS - UT1,2,2,1,3,PR     32340021
INT6X    OI    LIST5,XX80                                               32360021
         LA    R1,LIST6                                                 32380021
         SVC   23                                                       32400021
         NI    LIST5,XX7F                                               32420021
         MVC   POINT+NX6(LX2),POINTMX                                   32440021
         OI    LIST7,XX80          CLOSE SYSUT2 IF XREF           54404 32460021
         LA    R1,LIST7            IN EFFECT TO FREE              54404 32480021
         SVC   14                  CONTROL BLOCK AREA (IOB)       54404 32500021
         B     LINKA               NOW GO TO LINKA                      32520021
INT6A    OI    PHZSW,LIST                                               32540021
         MVI   POINT+NX5,XX03                                           32560021
*DEL                                                                    32580021
*DEL                                                                    32600021
*DEL                                                                    32620021
         B     LINKA               NOW GO TO LINKA                      32640021
INT7     DS    0H                                                       32660021
         NI    LIST1,XX7F                                               32680021
         NI    LIST3,XX7F                                               32700021
         NI    LIST5,XX7F      TURN OFF DELIMITER                 43123 32720021
         NI    INTO,XX7F            TURN OFF DELIMITER BIT              32740021
         NI    LIST2,XX7F          TURN OFF DELIMITER             43123 32760021
         NI    LIST2+DX4,XX7F      TURN OFF DELIMITER             43123 32780021
         NI    LIST2+DX8,XX7F      TURN OFF DELIMITER             43123 32800021
         OI    LIST2+DX12,XX80  END OF LIST                       43123 32820021
         LA    R1,INTO             SETUP FOR PERMANENT CLOSE            32840021
         SVC   20                                                       32860021
         CLI   PH01SW,XX01                                              32880021
         BE    SKIPFRMN            SKIP RELSPACE                        32900021
         L     R15,RELSPACA                                             32920021
         BALR  R14,R15             GO TO RELSPACE ROUTINE               32940021
SKIPFRMN EQU   *                                                        32960021
         L     R0,CORELEFT                                              32980021
         L     R1,TAMAREA                                               33000021
         SR    R0,R1                                                    33020021
         FREEMAIN  R,LV=(0),A=(1)                                       33040021
         B     LINKBAZ             MUST ISSUE SPIE                      33060021
ALTPURGE DC    X'F1F2F3F6F7F80000F600'  ALTERNATE PURGER CT             33080021
CLOSOK   DS    0H                                                       33100021
         SRL   R10,DX2        GET ACTUAL VALUE OF FILE NUMBER           33120021
         STC   R10,YVALUE                                               33140021
         SLL   R10,DX2                                                  33160021
         CLI   YVALUE,XX01                                              33180021
         BNE   CLOSET1             NOT SYSUT1                           33200021
         MVC   TLIST+NX1(LX3),INTO+NX1 T CLOSING UT1                    33220021
         B     CLOSET4             SYSUT1 SO SKIP TO CLOSET4            33240021
CLOSET1  CLI   YVALUE,XX02                                              33260021
         BNE   CLOSET2             NOT SYSUT2                           33280021
         MVC   TLIST+NX1(LX3),LIST3+NX1 T CLOSING UT2                   33300021
         B     CLOSET4             SYSUT2 SO SKIP TO CLOSET4            33320021
CLOSET2  CLI   YVALUE,XX03                                              33340021
         BNE   CLOSET3             NOT SYSUT3                           33360021
         MVC   TLIST+NX1(LX3),LIST1+NX1 T CLOSING UT3                   33380021
         B     CLOSET4             SYSUT3 SO SKIP TO CLOSET4            33400021
CLOSET3  MVC   TLIST+NX1(LX3),LIST5+NX1 T CLOSING UT4                   33420021
CLOSET4  DS    0H                                                       33440021
         TM    DX1(R8),XX01                                             33460021
         BZ    XREAD               BIT OFF SO SKIP NEXT INSTRS          33480021
         OI    YVALUE,XXF0                                              33500021
         ST    R8,X8SAV                                                 33520021
         BAL   R0,GOSYSGO          PURGE FILES                          33540021
YVALUE   DC    X'00'               FILE NUMBER                          33560021
         L     R8,X8SAV                                                 33580021
XREAD    DS    0H                                                       33600021
         LA    R1,TLIST                                                 33620021
         SVC   23                                                       33640021
         BAL   R11,CHECKERC        SWITCH BCB POINTERS                  33660021
         SRL   R10,DX1                                                  33680021
         LA    R10,POINT(R10)                                           33700021
         OI    DX0(R10),XXF0                                            33720021
         B     EXIT1               RETURN TO CALLING PHASE              33740021
X8SAV    DS    F                   SAVE AREA FOR R8                     33760021
PHASAD   DC    A(LINKA)            TABLE OF INTERLUDE ADDRESSES         33780021
         DC    A(LINKA)            X                                    33800021
         DC    A(INT1A)            X                                    33820021
         DC    A(INT1B)            X                                    33840021
         DC    A(INT2)             X                                    33860021
         DC    A(INT3)             X                                    33880021
         DC    A(INT4)             X                                    33900021
         DC    A(INT50)            X                                    33920021
         DC    A(INT51)            X                                    33940021
         DC    A(INT6)             LIST OF DCB'S FOR OPEN/CLOSE         33960021
         DC    A(INT6A)            X                                    33980021
         DC    A(INT7)             X                                    34000021
         CNOP 0,4                                                       34020021
LIST11   DC    X'17'               X                                    34040021
         DC    AL3(DS1)            X                                    34060021
LIST22   DC    X'17'               X                                    34080021
         DC    AL3(DS2)            X                                    34100021
TLIST    DC    X'97'               X                                    34120021
         DC    AL3(0)              X                                    34140021
LIST7    DC    X'17'               X                                    34160021
         DC    AL3(DS2)            X                                    34180021
LIST6    DC    X'17'               X                                    34200021
         DC    AL3(DS3)            X                                    34220021
INTO     DC    X'17'               X                                    34240021
         DC    AL3(DS1)            X                                    34260021
LIST5    DC    X'17'               X                                    34280021
         DC    AL3(DS4)            X                                    34300021
LIST3    DC    X'17'               X                                    34320021
         DC    AL3(DS2)            X                                    34340021
LIST1    DC    X'17'               X                                    34360021
         DC    AL3(DS3)            X                                    34380021
LIST4    DC    X'3F'               X                                    34400021
         DC    AL3(GOF)            X                                    34420021
         DC    X'3F'               X                                    34440021
         DC    AL3(PCH)            X                                    34460021
LIST2    DC    X'3F'               X                                    34480021
         DC    AL3(OUT)            X                                    34500021
         DC    X'00'               X                                    34520021
         DC    AL3(IN)             X                                    34540021
         DC    X'30'               X                                    34560021
         DC    AL3(LIB)            X                                    34580021
         DC    X'9F'               X                                    34600021
         DC    AL3(SPILL)          X                                    34620021
NOLIBRY  LA    R2,MESSLIB           LOAD ADDRESS OF MESSAGE             34640021
         LA    R3,DX89                                                  34660021
         L     R13,SAVER13                                              34680021
         B     TRMNATE             GO TO TERMINATE RUN                  34700021
*                                                                       34720021
MESSLIB  DC    C'IKF0002I-D INVALID BASIS LIBRARY NAME OR LIB '         34740021
         DC    C'OPTION NOT SPECIFIED. COMPILATION ABANDONED.'          34760021
ADCOS    DC    A(COS)              X                                    34780021
ADSYAT DC    A(SYATBL)             X                                    34800021
FLSHBUF  DC    X'00F600'           CONSTANT TO FLUSH PRINT BUFFER       34820021
SKPRSW   DC    X'00'               X                                    34840021
LSWPH01  EQU   X'2'                                                     34860021
LSWPH1A  EQU   X'4'                                                     34880021
LSWPH1B  EQU   X'6'                                                     34900021
LSWPH2   EQU   X'8'                                                     34920021
LSWPH3   EQU   X'A'                                                     34940021
LSWPH4   EQU   X'C'                                                     34960021
LSWPH50  EQU   X'E'                                                     34980021
LSWPH51  EQU   X'10'                                                    35000021
LSWPH6   EQU   X'12'                                                    35020021
LSWPH6A  EQU   X'14'                                                    35040021
LSWPH7   EQU   X'16'                                                    35060021
LNKRQST1 EQU   X'50'                                                    35080021
LNKRQST2 EQU   X'A0'                                                    35100021
EXTCALL  EQU   X'CC'                                                    35120021
         DROP  R4                                                       35140021
         DROP  R5                                                       35160021
       EJECT                                                            35180021
       SPACE 5                                                          35200021
PH0TBST1 CSECT                                                          35220021
*                                                                       35240021
******                                                           **     35260021
*                                                                       35280021
*                                                                       35300021
*                       TABLE - HANDLING ROUTINES                       35320021
*                           BASE REGISTERS                              35340021
*                        R15   INSTRUCTION AREAS                        35360021
*                        R11   INSTRUCTION AREAS                        35380021
*                        R12   DATA AREAS                               35400021
*                                                                       35420021
*                                                                       35440021
******                                                           **     35460021
*        EXTERNAL CALL TO TABLE HANDLER.                                35480021
*                                                                       35500021
*                                                                       35520021
         USING TBDATA,R12                                               35540021
         USING TBCOMMN,R11                                              35560021
         USING *,R15                                                    35580021
         SPACE 2                                                        35600021
PRIME    STM   R0,R15,TBSAV1                                            35620021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            35640021
         BR    R15                 GO TO TBPRIMEB                       35660021
         SPACE 2                                                        35680021
         USING *,R15                                                    35700021
INSERT   STM   R0,R15,TBSAV1                                            35720021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            35740021
         L     R14,TBAINSTA                                             35760021
         BR    R14                 GO TO TBINSERT                       35780021
         SPACE 2                                                        35800021
         USING *,R15                                                    35820021
TABREL   STM   R0,R15,TBSAV1                                            35840021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            35860021
         L     R14,TBATABRL                                             35880021
         BR    R14                 GO TO TBTABREL                       35900021
         SPACE 2                                                        35920021
         USING *,R15                                                    35940021
TAMEIN   STM   R0,R15,TBSAV1                                            35960021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            35980021
         L     R14,TBATAMEN                                             36000021
         BR    R14                 GO TO TBTAMEIN                       36020021
         SPACE 2                                                        36040021
         USING *,R15                                                    36060021
STATIC   STM   R0,R15,TBSAV1                                            36080021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36100021
         L     R14,TBASTATC                                             36120021
         BR    R14                 GO TO TBSTATIC                       36140021
         SPACE 2                                                        36160021
         USING *,R15                                                    36180021
DICSPC   STM   R0,R15,TBSAV1                                            36200021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36220021
         L     R14,TBADICSP                                             36240021
         BR    R14                 GO TO TBDICSPC                       36260021
         SPACE 2                                                        36280021
         USING *,R15                                                    36300021
MOVDIC   STM   R0,R15,TBSAV1                                            36320021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36340021
         L     R14,TBAMOVDI                                             36360021
         BR    R14                 GO TO TBMOVDIC                       36380021
         SPACE 2                                                        36400021
         USING *,R15                                                    36420021
RELDIC   EQU   *                                                        36440021
TAMEOP   STM   R0,R15,TBSAV1                                            36460021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36480021
         L     R14,TBATAMEP                                             36500021
         BR    R14                 GO TO TBTAMEOP                       36520021
         SPACE 3                                                        36540021
         USING *,R15                                                    36560021
RELSPACE STM   R0,R15,TBSAV1                                            36580021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36600021
         L     R14,TBRELSPA                                             36620021
         BR    R14                 GO TO TBRELSPC                       36640021
*                                                                       36660021
         USING *,R15                                                    36680021
GETALL   STM   R0,R15,TBSAV1       PHASE 6 & 6A CALL FOR ALL AVAIL SPAC 36700021
*                                                                       36720021
         BAL   R14,TBINITRG        INITIALIZE BASE REGISTERS            36740021
         L     R14,TBAGTALL                                             36760021
         BR    R14                 GO TO TBGETALL                       36780021
         SPACE 5                                                        36800021
******              THIS ROUTINE INITIALIZES BASE REGISTERS      **     36820021
         SPACE                                                          36840021
TBINITRG BALR  R15,R0              ESTABLISH ADDRESSABILITY             36860021
         USING *,R15                                                    36880021
         L     R12,TBADATA                                              36900021
         L     R11,TBACOMMN                                             36920021
         L     R15,TBAPRIME                                             36940021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      36960021
TBSAV1   DS    16F                 REGISTER SAVEAREA                    36980021
TBADATA  DC    A(TBDATA)           X                                    37000021
TBACOMMN DC    A(TBCOMMN)          X                                    37020021
         SPACE 3                                                        37040021
         USING TBPRIMEB,R15                                             37060021
         EJECT                                                          37080021
*        COMMON SUBROUTINE AREA.                                        37100021
*                                                                       37120021
TBCOMMN EQU    *                                                        37140021
         SPACE  5                                                       37160021
******                                                           **     37180021
*           THIS ROUTINE WILL WRITE OUT A SECTION OF THE DICTIONARY     37200021
*           IT IS CALLED BY TBSPILL.                                    37220021
*           INPUT -   R9  POINTS TO START ADDRESS OF SECTION TO BE      37240021
*                     SPILLED.                                          37260021
*           OUTPUT -  ENTRY IN DICOT TABLE IS MODIFIED                  37280021
******                                                           **     37300021
TBWRITE  STM   R14,R7,TYWSAVR                                           37320021
         L     R5,TYSPLAD          PUT DCB ADD IN R5                    37340021
         LR    R6,R9                                                    37360021
         BAL   R14,TBGETDIC        GET ENTRY IN DICOT TABLE             37380021
         TM    DX0(R7),TBUPDATE     IS U FLAG ON IN DICOT TABLE         37400021
         BO    TYXD                YES GO TO ISSUE XDAP                 37420021
         WRITE TYDECB,SF,(R5),(R9) ISSUE WRITE MACRO                    37440021
         CHECK TYDECB                                                   37460021
         L     R15,TBAPRIME                                             37480021
         MVC   DX4(LX8,R7),DX5(R5)                                      37500021
         B     TYSETF              X                                    37520021
TYXDAP1  LA    R4,DX4(R7)                                               37540021
         NI    TYXECB,XXBF                                              37560021
TYXDAP   XDAP  TYXECB,WI,(R5),(R9),512,,(R4)                            37580021
         WAIT  1,ECB=TYXECB                                             37600021
         SPACE                                                          37620021
*                                  RESTORE BASE REGISTER AFTER SVC      37640021
         L     R15,TBAPRIME                                             37660021
         BCR   R15,R2              X                                    37680021
TYXD     L     R2,TBAPHASW                                              37700021
*                                  IS IT PHASE 3, IF NOT BRANCH         37720021
         CLI   DX0(R2),TAM3Q                                            37740021
         BNE   TYXD1               NOT EQUAL TO X'05'                   37760021
*                                  IF SECT UNCHANGED SINCE LAS WRIT     37780021
*                                  OUT, DON'T WRITE AGAIN               37800021
         TM    DX0(R7),TBFLWRTR                                         37820021
         BZ    TYSETF              SKIP NEXT 2 INSTRUCTIONS             37840021
TYXD1    MVI   TYXDAP+NX19,XX0D                                         37860021
         BAL   R2,TYXDAP1          MUST ISSUE XDAP                      37880021
TYSETF   MVI   DX0(R7),TBSPILD+TBUPDATE                                 37900021
*                                                                       37920021
         LM    R14,R7,TYWSAVR                                           37940021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      37960021
         SPACE                                                          37980021
******                                                           **     38000021
*           THIS ROUTINE WILL READ BACK A SECTION OF THE DICTIONARY     38020021
*           IT IS CALLED BY TBMDVDIC AND TBTAMEIN                       38040021
*           INPUT -  R9 HAS ADDRESS IN CORE INTO WHICH SECTION          38060021
*                    SHOULD BE READ.  R7 HAS POINTER TO DICOT TABLE     38080021
*           OUTPUT - ENTRY IN DICOT TABLE IS MODIFIED                   38100021
******                                                           **     38120021
         SPACE                                                          38140021
TBREADIC STM   R14,R7,TYWSAVR                                           38160021
         L     R5,TYSPLAD          GET DCB ADDRESS                      38180021
*                                                                       38200021
         MVI   TYXDAP+NX19,XX0E                                         38220021
         BAL   R2,TYXDAP1          MUST ISSUE XDAP                      38240021
         ST    R9,DX0(R7)           STORE CORE ADD IN DICOT TABLE       38260021
         MVI   DX0(R7),TBIN+TBUPDATE                                    38280021
         L     R2,TBAPHASW             GET  NXT PHASE NO IN R2          38300021
         CLI   DX0(R2),XX03             IS THIS PHASE 2                 38320021
         BNE   TBRNP2              RESTORE REGISTERS AND RETURN         38340021
         OI    DX0(R7),XX10             TURN  ON  BIT 3 OF DICT SIG     38360021
TBRNP2   EQU    *                                                       38380021
         LM    R14,R7,TYWSAVR                                           38400021
         BR    R14                 RETURN TO CALLING ROUTINE            38420021
         SPACE 5                                                        38440021
*                                                                       38460021
*      TBTAMEOP    - INTERPHASE INITIALIZATION ROUTINE.                 38480021
*                                                                       38500021
*                                                                       38520021
         SPACE 5                                                        38540021
TBRELSPC EQU   *                                                  46147 38560021
         L     R7,TBSPACGT   ANY COBOL SPACE                      46147 38580021
         LTR   R7,R7         GOTTEN                               46147 38600021
         BZ    TBTAMENX      NO, FREE MFA ONLY                    46147 38620021
         LA    R8,GETTABLE   POINT TO GET TABLE                   46147 38640021
TBREL1   C     R8,AGETEND    LOOKED AT WHOLE TABLE                46147 38660021
         BE    TBRELEND      EXIT                                 46147 38680021
         LM    R0,R1,DX0(R8) SET UP TO FREE                       46147 38700021
         LTR   R0,R0         HAS ANY BEEN GOTTEN                  46147 38720021
         BZ    TBREL2        FOR THIS ENTRY, NO                   46147 38740021
         FREEMAIN R,LV=(0),A=(1)   GIVE IT BACK                   46147 38760021
TBREL2   LA    R8,DX8(R8)    LOOK AT NEXT ENTRY                   46147 38780021
         BC    UNCOND,TBREL1 UNTIL FINISHED                       46147 38800021
TBRELEND L     R15,TBTAMNXA  A(TBTAMENX)                          46147 38820021
         BR    R15           X                                    46147 38840021
TBTAMNXA DC    A(TBTAMENX)   ENSURE R15 AFTER FREEMAIN            46147 38860021
*DEL                                                                    38880021
*DEL                                                                    38900021
*DEL                                                                    38920021
*DEL                                                                    38940021
*DEL                                                                    38960021
*DEL                                                                    38980021
*DEL                                                                    39000021
*DEL                                                                    39020021
*DEL                                                                    39040021
*DEL                                                                    39060021
*DEL                                                                    39080021
TBTAMEOP EQU   *                                                        39100021
*                                                                       39120021
*                                                                       39140021
         L     R10,TBAPHASW                                             39160021
*                                                                       39180021
*                                                                       39200021
*                                                                       39220021
*                                                                       39240021
*                                                                       39260021
*                                                                       39280021
TBINTP01 CLI   DX0(R10),TAM3Q                                           39300021
         BNE   TBINTP04            NOT EQUAL TO X'05'                   39320021
         OI    TBSWGENE,TBFLNODC                                        39340021
         LA    R4,TBMASTAM         RELEASE DICTIONARY SPACE             39360021
TBINTP0X L     R5,TBDBEGAR(R4)                                          39380021
         L     R6,TBDSTADD(R4)                                          39400021
         L     R7,TBDLENG(R4)                                           39420021
         SR    R6,R5                                                    39440021
         SR    R7,R6                                                    39460021
         ST    R7,TBDCLENG(R4)                                          39480021
         C     R4,TBLASMTM                                              39500021
         BE    TBINTP04            R4=@LAST MASTAM USED SO FAR          39520021
         LA    R4,TBMSTMLG(R4)                                          39540021
         BC    UNCOND,TBINTP0X     LOOP THROUGH UNTIL EQUAL             39560021
TBINTP04 SR    R5,R5                                                    39580021
         IC    R5,DX0(R10)                                              39600021
         STC   R5,TBPHZNO                                               39620021
         CLI   TBPHZNO,TAM6Q                                            39640021
         BE    TBINTP03            TBPHZNO = X'08'                      39660021
         AH    R5,TBCOM001                                              39680021
         SLL   R5,DX2                                                   39700021
         L     R6,PCBSPT(R5)                                            39720021
TBINTP05 L     R7,TBSPACGT                                              39740021
         SR    R6,R7                                                    39760021
         LTR   R6,R6                                                    39780021
         BNM   TBTAMENX            RESTORE REGISTERS AND BRANCH         39800021
         LPR   R7,R6                                                    39820021
         ST    R7,FREEMANE                                              39840021
         OI    TBSWGENE,TBSPASKD                                        39860021
*                                                                       39880021
*                                  HAVE TO GIVE SOME BACK               39900021
TBINTP02 BAL   R14,TBPACKGN        PACK ALL TABLES IN ALL MASTAMS       39920021
         LA    R4,TBMASTAM         POINT R4 TO 1ST MASTAM               39940021
         LA    R5,DX56(R4)          POINT R5 TO 3RD MASTAM              39960021
         L     R5,DX0(R5)                                               39980021
         LTR   R5,R5               IS IT BEING USED                     40000021
         BNZ   TBERR4              YES - WE CAN'T HANDLE THIS           40020021
*                                  ABANDON COMPILATION                  40040021
         BC    UNCOND,TBINTP20     MUST ALTER TBLSUM,ETC                40060021
TBINTP03 L     R6,CBSPH7                                                40080021
         BC    UNCOND,TBINTP05     GO IMMEDIATELY TO TBINTP05           40100021
TBINTP09 L     R6,TBSPACGT                                              40120021
         SR    R6,R0                                                    40140021
         LTR   R6,R6                                                    40160021
         BNZ   TBINTP10            LEAVE TBSWGENE ALONE                 40180021
         NI    TBSWGENE,SPACASK                                         40200021
TBINTP10 ST    R6,TBSPACGT                                              40220021
         LA    R8,GETTABLE                                              40240021
FREELOOK C     R1,DX4(R8)                                               40260021
         BE    FREEHIT             R8 = @ GETEND                        40280021
         C     R8,AGETEND                                               40300021
         BE    TBERR1              R8 = AGETEND                         40320021
         LA    R8,DX8(R8)                                               40340021
         BC    UNCOND,FREELOOK     LOOP THROUGH UNTIL EQUAL             40360021
*                                                                 58329 40380021
FREESV   DC    4F'0'               SAVE REGS. DESTROYED BY FREEMN 58329 40400021
*                                                                 58329 40420021
FREEHIT  LR    R5,R0                                                    40440021
         C     R5,DX0(R8)                                               40460021
         BE    FREEHIT1            R5 = GETTABLE ENTRY                  40480021
         BL    TBINTP13            R5 < GETTABLE ENTRY                  40500021
         L     R0,DX0(R8)     ENTRY LENGTH INTO R0                      40520021
         LA    R14,FREEHIT2                                             40540021
         BC    UNCOND,TBINTP11     MUST ISSUE FREEMAIN                  40560021
FREEHIT2 SR    R5,R0                                                    40580021
         AR    R1,R0                                                    40600021
         LR    R0,R5                                                    40620021
         LA    R8,GETTABLE                                              40640021
         BC    UNCOND,FREELOOK     LOOP THROUGH FREELOOK--->EQUAL       40660021
TBINTP11 STM   R14,R1,FREESV       R14-R1 FREEMAIN SAVE           58329 40680021
         FREEMAIN R,LV=(0),A=(1)                                  58329 40700021
         LM    R14,R1,FREESV       RESTORE AFTER FREEMAIN         58329 40720021
         CLI   GETSW,XXFF                                               40740021
         BE    TBINTP15            DON'T ZERO OUT                       40760021
         XC    DX0(LX8,R8),DX0(R8)                                      40780021
TBINTP15 L     R15,TBAPRIME                                             40800021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      40820021
FREEHIT1 LA    R14,TBINTP12                                             40840021
         BC    UNCOND,TBINTP11     MUST ISSUE FREEMAIN                  40860021
TBINTP13 LA    R14,TBINTP12                                             40880021
         L     R6,DX0(R8)                                               40900021
         SR    R6,R5                                                    40920021
         ST    R6,DX0(R8)                                               40940021
         L     R6,DX4(R8)                                               40960021
         AR    R6,R5                                                    40980021
         ST    R6,DX4(R8)                                               41000021
         MVI   GETSW,XXFF                                               41020021
         BC    UNCOND,TBINTP11     MUST ISSUE FREEMAIN                  41040021
TBINTP12 XC    TBWCHWAY,TBWCHWAY                                        41060021
         XC    GETSW,GETSW                                              41080021
         XC    TBLSUM,TBLSUM                                            41100021
         XC    FREEMANE,FREEMANE                                        41120021
         XC    DCTLNGTH,DCTLNGTH                                        41140021
         CLI   TBPHZNO,TAM3Q                                            41160021
         BH    TBTAMEOP            TBPHZNO > X'05'                 5084 41180021
         L     R10,TBATIB30                                             41200021
         L     R10,DX0(R10)                                             41220021
         L     R9,TBACCSW                                               41240021
         MVC   DX1(LX3,R9),DX1(R10)                                     41260021
         BC    UNCOND,TBTAMEOP     X                               5084 41280021
*                                  TOTAL TABLES TOO LARGE FOR MFA       41300021
*                                                                       41320021
TBINTP20 LA    R4,TBMASTAM                                              41340021
TBINTP21 BAL   R14,TBTBLSUM        ALTER TBLSUM                         41360021
         CLI   TBPHZNO,TAM2Q                                            41380021
         BH    TBINTP22            TBPHZNO > X'04'                      41400021
         BAL   R14,TBDICTSP        GET COBOL SPACE                      41420021
TBINTP22 L     R9,FREEMANE                                              41440021
         LR    R7,R9                                                    41460021
         L     R8,TBLSUM                                                41480021
         AR    R9,R8                                                    41500021
         A     R9,DCTLNGTH                                              41520021
         C     R9,FREEMANE                                              41540021
         BE    TBINTP30            X                                    41560021
*                                  WILL IT ALL FIT IN                   41580021
         L     R6,TBDLENG(R4)      THIS MASTAM AREA?                    41600021
         CR    R6,R9                                                    41620021
         BL    TBINTP24            NO - IS THERE ANOTHER MASTAM         41640021
         L     R10,TBDBEGAR(R4)    THEY WILL FIT                        41660021
         L     R5,TBATAMAR                                              41680021
         L     R5,DX0(R5)                                               41700021
         CR    R10,R5                                                   41720021
         BE    TBINTP26            R10 = TAMAREA                        41740021
         BNH   TBINTPA                                            50784 41760021
         AR    R10,R6              CURRENT AREA ABOVE MAIN TAMAREA50784 41780021
         B     TBINTPB             R6 = ENTIRE LENGTH             50784 41800021
TBINTPA  EQU   *                                                  50784 41820021
         LR    R9,R10              SAVE ORIGIN                    50784 41840021
         AR    R10,R6              R6  = ENTIRE LENGTH                  41860021
         CR    R10,R5                                             50784 41880021
         BNH   TBINTPB             CURRENT AREA BELOW MAIN TAMAREA50784 41900021
         AR    R9,R7               MASTAM BEGIN + NEEDED SPACE    50784 41920021
         CR    R9,R5               CHECK OVERLAP OF MAIN TAMAREA  50784 41940021
         BH    TBINTP26            PROTECT MAIN TAMAREA           50784 41960021
TBINTPB  EQU   *                                                  50784 41980021
         ST    R10,TBENDADR        THIS IS THE HI ADDR IN AREA          42000021
         S     R10,DCTLNGTH                                             42020021
         L     R9,TBDSTADD(R4)                                          42040021
         BAL   R14,TBMOVDON        MOVE TABLES TO HICORE                42060021
         SR    R10,R8                                                   42080021
         LR    R9,R10              FIRST BYTE OF TABLES                 42100021
         L     R10,TBDBEGAR(R4)                                         42120021
         AR    R10,R7              R10 = NEW START ADDRESS              42140021
         LR    R5,R10                                                   42160021
         CR    R10,R9                                                   42180021
         BE    TBINTP23            SKIP TBMOVUP                         42200021
         BAL   R14,TBMOVUP         MOVE TABLE TO LOW ADDRESSES          42220021
TBINTP23 L     R6,TBDBEGAR(R4)                                          42240021
         LR    R1,R6               SET UP FOR FREEMAIN                  42260021
         SR    R5,R6                                                    42280021
         ST    R5,SHIFTVAL                                              42300021
         ST    R10,TBDBEGAR(R4)                                         42320021
         L     R0,FREEMANE         SET UP FOR FREEMAIN                  42340021
         L     R6,TBENDADR                                              42360021
         SR    R6,R10                                                   42380021
         ST    R6,TBDLENG(R4)                                           42400021
         SR    R6,R8               R8  = LENGTH OF TABLES               42420021
         S     R6,DCTLNGTH                                              42440021
         ST    R6,TBDCLENG(R4)                                          42460021
         AR    R10,R8                                                   42480021
         ST    R10,TBDSTADD(R4)                                         42500021
         L     R9,SHIFTVAL                                              42520021
         L     R5,TBDFSTAM(R4)                                          42540021
         BAL   R14,TBTAMSH         UPDATE TAM TABLE @'S-->HIGHCORE      42560021
         BC    UNCOND,TBINTP09     FREEMAIN AND EXIT                    42580021
*                                  NO FIT - CAN WE SPILL DICTIONARY     42600021
TBINTP24 CLI   TBPHZNO,TAM3Q                                            42620021
         BL    TBINTP50            TRY TO SPILL                         42640021
*                                  MAYBE THERE'S ANOTHER MASTAM         42660021
TBINTP26 LR    R5,R4                                                    42680021
         LA    R4,TBMSTMLG(R4)                                          42700021
         L     R6,TBDBEGAR(R4)                                          42720021
         LTR   R6,R6                                                    42740021
         BNZ   TBINTP21            LOOKING AT 2ND MASTAM TRY AGAIN      42760021
         LA    R6,TBMASTAM     ADDR OF 1ST MASTAM                 43972 42780021
         CR    R5,R6   IS IT THE 1ST MASTAM                       43972 42800021
         BE    TBERR4              THERE WAS ONLY 1 - NO HOPE           42820021
         BC    UNCOND,TBINTP40     X                                    42840021
*                                  NO TABLES AND NO DICTIONARY HERE     42860021
TBINTP30 L     R1,TBDBEGAR(R4)                                          42880021
         L     R0,FREEMANE         SET UP FOR FREEMANE                  42900021
         LA    R7,TBMASTAM                                              42920021
         CR    R7,R4                                                    42940021
         BE    TBINTP32            @TBMASTAM = R4                       42960021
         ST    R7,TBLASMTM                                              42980021
         L     R0,TBDLENG(R4)                                           43000021
         XC    DX0(TBMSTMLG,R4),DX0(R4)   CLEAR 2ND MASTAM              43020021
         BC    UNCOND,TBINTP09     NOW GO TO TBINTP09                   43040021
TBINTP32 L     R5,TBATAMAR                                              43060021
         L     R5,DX0(R5)                                               43080021
         CR    R5,R1                                                    43100021
         BE    TBINTP26            TAMAREA = R1                         43120021
         BL    TBINTPC             MAIN TAMAREA OVERLAP IMPOSSIBLE50784 43140021
         LR    R7,R1               CURRENT TAMER AREA             50784 43160021
         AR    R7,R0               +LENGTH TO BE FREED            50784 43180021
         CR    R7,R5               CHECK FOR MAIN TAMAREA OVERLAP 50784 43200021
         BH    TBINTP26            EXISTS, TRY NEXT MASTAM        50784 43220021
TBINTPC  EQU   *                                                  50784 43240021
         L     R7,FREEMANE                                              43260021
         C     R7,TBDLENG(R4)                                           43280021
         BL    TBINTP33            FREEMANE LESS                        43300021
         LA    R4,TBMSTMLG(R4)                                          43320021
         BC    UNCOND,TBINTP21     PREPARE TO ALTER TBLSUM,ETC          43340021
TBINTP33 L     R6,TBDBEGAR(R4)                                          43360021
         AR    R6,R7                                                    43380021
         ST    R6,TBDBEGAR(R4)                                          43400021
         ST    R6,TBDSTADD(R4)                                          43420021
         L     R6,TBDLENG(R4)                                           43440021
         SR    R6,R7                                                    43460021
         ST    R6,TBDLENG(R4)                                           43480021
         ST    R6,TBDCLENG(R4)                                          43500021
         BC    UNCOND,TBINTP09     PREPARE TO LOOP THRU FREELOOK        43520021
TBINTP50 L     R6,TBDNSECT(R4)                                          43540021
         CH    R6,TBCON003                                              43560021
         BL    TBINTP26            R6 < DECIMAL '03'                    43580021
         BAL   R14,TBSPILL         PREPARE TO SPILL LAST DICT SECT      43600021
         BC    UNCOND,TBINTP21     MUST ALTER TBLSUM,ETC                43620021
TBINTP40 LA    R4,TBMASTAM                                              43640021
         LA    R6,TBMSTMLG(R4)                                          43660021
         L     R5,TBDCLENG(R4)                                          43680021
         L     R8,DCTLNGTH  ARE THERE ANY DICT SECTS.             45083 43700021
         LTR   R8,R8          IN THE SECOND MASTAM                45083 43720021
         BNZ   TBERR4  YES  WE CANT COMPILE                       45083 43740021
         L     R8,TBLSUM                                                43760021
         CR    R5,R8                                                    43780021
         BL    TBERR4              R5 < TBLSUM                          43800021
         L     R10,TBDSTADD(R4)                                         43820021
         L     R9,TBDBEGAR(R6)                                          43840021
         BAL   R14,TBMOVDON        MOVE TABLE TOWARDS HIGH CORE         43860021
         L     R7,TBDBEGAR(R4)                                          43880021
         SR    R7,R9                                                    43900021
         ST    R7,SHIFTVAL                                              43920021
         LR    R9,R7                                                    43940021
         L     R5,TBDFSTAM(R6)                                          43960021
         LR    R4,R6                                                    43980021
         BAL   R14,TBTAMSH         UPDATE TAM TABLE ADDRESSES           44000021
         LA    R4,TBMASTAM                                              44020021
         AR    R10,R8              R10 STILL HAS OLD STADDR IN 1ST MSTM 44040021
         ST    R10,TBDSTADD(R4)                                         44060021
         L     R10,TBDSTADD(R6)                                         44080021
         SR    R10,R8                                                   44100021
         ST    R10,TBDSTADD(R6)                                         44120021
         L     R10,TBDCLENG(R4)                                         44140021
         SR    R10,R8                                                   44160021
         ST    R10,TBDCLENG(R4)                                         44180021
         L     R10,TBDCLENG(R6)                                         44200021
         AR    R10,R8                                                   44220021
         ST    R10,TBDCLENG(R6)                                         44240021
         LR    R4,R6                                                    44260021
         BC    UNCOND,TBINTP21     MUST ALTER TBLSUM,ETC                44280021
TBCHKDIC BC    UNCOND,TBERR4       SHOULDN'T BE HERE ANY MORE           44300021
TBTBLSUM L     R6,TBDBEGAR(R4)                                          44320021
         L     R7,TBDSTADD(R4)                                          44340021
         SR    R7,R6                                                    44360021
         ST    R7,TBLSUM                                                44380021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      44400021
TBDICTSP L     R6,TBLSUM                                                44420021
         L     R7,TBDCLENG(R4)                                          44440021
         AR    R6,R7                                                    44460021
         L     R7,TBDLENG(R4)                                           44480021
         SR    R7,R6                                                    44500021
         ST    R7,DCTLNGTH                                              44520021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      44540021
         SPACE 5                                                        44560021
         SPACE  5                                                       44580021
*        TBGETSPC  - ASK FOR COBOL SPACE = SPACE NOT OCCUPIED BY A      44600021
*                    PHASE SMALLER THAN PH5.                            44620021
*                    R1 IS DESTROYED BY THIS ROUTINE.                   44640021
*                                                                       44660021
         SPACE 5                                                        44680021
TBGETSPC STM   R5,R10,TBSAV3                                            44700021
         ST    R14,TBSAV314                                             44720021
         TM    TBSWGENE,TBSPASKD                                        44740021
         BO    TBGETXIT            X                                    44760021
         L     R10,TBAPHASW                                             44780021
         SR    R5,R5                                                    44800021
         IC    R5,DX0(R10)                                              44820021
         CLI   DX0(R10),LONGPHS                                         44840021
         BE    TBGETXIT            THIS IS LONGEST PHASE                44860021
         SH    R5,TBCON002                                              44880021
         SLL   R5,DX2                                                   44900021
         L     R6,PCBSPT(R5)                                            44920021
         L     R7,TBSPACGT                                              44940021
         ST    R6,TBSPACGT                                              44960021
         SR    R6,R7                                                    44980021
         LTR   R6,R6                                                    45000021
         BZ    TBGET01                                                  45020021
         MVC   GETTABLE(LX24),GETTABLE+NX8                              45040021
         ST    R6,GETTABLE+NX24                                         45060021
         LR    R0,R6                                                    45080021
         GETMAIN R,LV=(0)                                               45100021
         L     R15,TBAPRIME                                             45120021
         ST    R1,GETTABLE+NX28                                         45140021
         LR    R0,R6                                                    45160021
*                                                                       45180021
* TEST IF NEW AREA IS CONTIGUOUS TO AN OLD ONE.                         45200021
*                                                                       45220021
         LA    R6,TBMASTAM              GET FIRST MASTAM.               45240021
         LR    R9,R1                                                    45260021
         AR    R9,R0                                                    45280021
TBGET06  C     R9,TBDBEGAR(R6)                                          45300021
         BE    TBGET05                  LOW CORE CONTIGUITY.            45320021
         L     R10,TBDBEGAR(R6)                                         45340021
         A     R10,TBDLENG(R6)                                          45360021
         CR    R1,R10                                                   45380021
         BE    TBGET55                  HIGH CORE CONTIGUITY.           45400021
         C     R6,TBLASMTM                                              45420021
         BE    TBGET07                  NO CONTIGUITY AT ALL.           45440021
         LA    R6,TBMSTMLG(R6)                                          45460021
         B     TBGET06                  TRY NEXT AREA.                  45480021
         SPACE 2                                                        45500021
*        NO CONTIGUITY - SET A NEW MASTAM.                              45520021
*                                                                       45540021
*                                                                       45560021
TBGET07  LA    R6,TBMSTMLG(R6)                                          45580021
         ST    R6,TBLASMTM                                              45600021
         BAL   R14,TBGET77         UPDATE MASTAM                        45620021
         ST    R1,TBDSTADD(R6)                                          45640021
         MVC   TBDFSTAM(LX4,R6),TBNEXTAM                                45660021
         MVC   TBDLSTAM(LX4,R6),TBNEXTAM                                45680021
*                                                                       45700021
*                                                                       45720021
TBGET01  OI    TBSWGENE,TBSPASKD                                        45740021
TBGETXIT LM    R5,R10,TBSAV3            RETURN                          45760021
         L     R14,TBSAV314                                             45780021
         OI    TBSWGENE,TBSPASKD                                        45800021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      45820021
         SPACE 2                                                        45840021
TBGET05  LR    R10,R1                   MOVE TABLE TOWARDS LOW CORE     45860021
         L     R9,TBDBEGAR(R6)                                          45880021
         L     R8,TBDSTADD(R6)                                          45900021
         SR    R8,R9                                                    45920021
         BAL   R14,TBMOVUP         MOVE TABLE TOWARDS LOW @'S           45940021
         LR    R10,R4                                                   45960021
         LR    R4,R6                                                    45980021
         L     R5,TBDFSTAM(R4)                                          46000021
         LR    R9,R0                                                    46020021
         BAL   R14,TBTAMSL              UPDATE TAM'S                    46040021
         LR    R4,R10                                                   46060021
         L     R9,TBDSTADD(R6)          UPDATE MASTAM'S.                46080021
         SR    R9,R0                                                    46100021
         ST    R9,TBDSTADD(R6)                                          46120021
         BAL   R14,TBGET77         UPDATE MASTAM                        46140021
* UPDATE  HASH TABLE ADDRESS IF NEEDED                                  46160021
*                                                                       46180021
         L     R10,TBAPHASW                                             46200021
         CLI   DX0(R10),TAM3Q                                           46220021
         BH    TBGETXIT            > X'05'                              46240021
         L     R10,TBATIB30                                             46260021
         L     R10,DX0(R10)              R10 HAS HASH TAM ADDR.         46280021
         L     R9,TBACCSW                                               46300021
         MVC   DX1(LX3,R9),DX1(R10)                                     46320021
         B     TBGETXIT            RETURN                               46340021
         SPACE 5                                                        46360021
         SPACE 2                                                        46380021
TBGET55  TM    TBSWGENE,TBFLNODC                                        46400021
         BZ    TBGET07                  DICT. DONT MOVE IT .CREATE      46420021
*                                       NEW TAM.                        46440021
         BAL   R14,TBGET78         UPDATE MASTAM                        46460021
         B     TBGETXIT            RETURN                               46480021
         EJECT                                                          46500021
* UPDATE  MASTAM                                                        46520021
TBGET77  ST    R1,TBDBEGAR(R6)                                          46540021
TBGET78  L     R9,TBDLENG(R6)                                           46560021
         AR    R9,R0                                                    46580021
         ST    R9,TBDLENG(R6)                                           46600021
         L     R9,TBDCLENG(R6)                                          46620021
         AR    R9,R0                                                    46640021
         ST    R9,TBDCLENG(R6)                                          46660021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      46680021
*                                                                       46700021
*              PHASE 6 & 6A CALL FOR ALL AVAILABLE SPACE                46720021
*                                                                       46740021
TBGETALL DS    0H                                                       46760021
         TM    TBSWGENE,TBSPASKD                                        46780021
         BO    TBGTAL10            YES - BYPASS GETMAIN                 46800021
         BAL   R14,TBGETSPC        ASK FOR COBOL SPACE                  46820021
TBGTAL10 BAL   R14,TBPACKGN        PACK ALL MASTAMS                     46840021
         LA    R4,TBMASTAM                                              46860021
         C     R4,TBLASMTM                                              46880021
         BE    TBGTAL21            ONLY 1 MASTAM                        46900021
         LA    R5,TBMSTMLG(R4)                                          46920021
         C     R5,TBLASMTM                                              46940021
         BNE   TBERR4              R5 NOT EQUAL TO TBLASMTM             46960021
         L     R0,TBDCLENG(R5)     THERE ARE TWO MASTAMS                46980021
         BC    UNCOND,TBGTAL00     X                                    47000021
TBGTAL21 BAL   R14,TBTIBUP         UPDATE TIBS ONCE MORE ANYWAY         47020021
TBGTAL20 L     R5,TBDSTADD(R4)                                          47040021
         L     R6,TBASAV1                                               47060021
         ST    R5,DX0(R6)           START ADDR IN R0                    47080021
         L     R5,TBDCLENG(R4)                                          47100021
         ST    R5,DX4(R6)           LENGTH OF AREA INTO R1              47120021
         BC    UNCOND,TBTAMENX     RETURN TO CALLING PHASE              47140021
         SPACE 5                                                        47160021
*                                                                       47180021
*        TBGETDIC   -GET ENTRY IN DICOT TABLE OF A SECTION WHOSE AD     47200021
*                    IN CORE IS IN R6. R7 WILL HAVE DICOT ENTRY ADD     47220021
*                    IN RETURN                                          47240021
*                                                                       47260021
*                                                                       47280021
TBGETDIC STM   R5,R10,TBSAV8                                            47300021
         L     R5,TBATIB20              GET TIB ADDR.                   47320021
         L     R5,DX0(R5)                GET TAM ADDR.                  47340021
         L     R8,DX0(R5)                GET TABLE ADDR.                47360021
         LA    R8,DX0(R8)                X                              47380021
         LH    R7,DX4(R5)                GET TABLE END                  47400021
         AR    R7,R8                    X                               47420021
TBGETD01 L     R9,DX0(R8)                GET ADDRESS OF SECTION AT T    47440021
         LA    R9,DX0(R9)                ENTRY                          47460021
*                                  IS SECT IN CORE                      47480021
         TM    DX0(R8),TBIN                                             47500021
         BZ    TBGETD00                 NOT A VALID ADDRESS.            47520021
*                                  IS THIS THE SECT WE ARE LOOKING      47540021
*                                  IF YES,RETURN. IF NO,GET NEXT EN     47560021
         CR    R9,R6                                                    47580021
         BE    TBGETEX             R9 = @ DICOT TABLE ENTRY             47600021
TBGETD00 LA    R8,DX12(R8)                                              47620021
         CR    R8,R7                                                    47640021
         BE    TBERR1              PREPARE TO SEND OUT WARNING          47660021
         B     TBGETD01            LOOP THROUGH AGAIN                   47680021
TBGETEX  LR    R0,R8                                                    47700021
         LM    R5,R10,TBSAV8                                            47720021
         LR    R7,R0                    R7 HAS DICOT ENTRY ADDR.        47740021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      47760021
TBGTAL00 C     R0,TBDCLENG(R4)     R0 = AVAILABLE SPACE IN 2ND MASTAM   47780021
         BL    TBGTAL20            AVAIL SPACE IN 2ND MASTAM LESS       47800021
         LR    R4,R5                                                    47820021
         BC    UNCOND,TBGTAL20     GO TO TBGTAL20 WITH NEW R4           47840021
         SPACE 5                                                        47860021
*                                                                       47880021
*        TBMOVUP  -MOVE TABLE TOWARDS LOW ADDRESSES                     47900021
*                     R10  =  NEW START ADDRESS.                        47920021
*                     R9   =  OLD START ADDRESS.                        47940021
*                     R8   =  LENGTH OF BLOCK TO BE MOVED.              47960021
*        TBMOVDON - MOVE TABLE TOWARDS HIGTH CORE.                      47980021
*                     R10  = NEW  ENDING                                48000021
*                     R9   = OLD  ENDING                                48020021
*                     R8   = LENGTH                                     48040021
*                                                                       48060021
*                                                                       48080021
TBMOVUP  STM   R5,R10,TBSAV5                                            48100021
         CR    R9,R10                                                   48120021
         BE    TBMOVOUT            OLD START = NEW START                48140021
TBMOV00  CH    R8,TBCON256                                              48160021
         BL    TBMOV01             LENGTH BLOCK <256                    48180021
         MVC   DX0(LX256,R10),DX0(R9)                                   48200021
         SH    R8,TBCON256                                              48220021
         AH    R10,TBCON256                                             48240021
         AH    R9,TBCON256                                              48260021
         B     TBMOV00             LOOP THROUGH AGAIN                   48280021
TBMOV01  LTR   R8,R8                                                    48300021
         BE    TBMOVOUT            ALL MOVING DONE                      48320021
         BCTR  R8,R0               MODIFY LENGTH FOR EXEC               48340021
         EX    R8,TBMOVEX                                               48360021
TBMOVOUT LM    R5,R10,TBSAV5                                            48380021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      48400021
         SPACE 3                                                        48420021
TBMOVDON STM   R5,R10,TBSAV5                                            48440021
         CR    R9,R10                                                   48460021
         BE    TBMOVOUT            OLD ENDING = NEW ENDING              48480021
         LR    R6,R10                                                   48500021
         SR    R6,R9                                                    48520021
         CH    R6,TBCON256                                              48540021
         BNL   TBMOV03             R6 > OR = 256                        48560021
TBMOV07  LR    R5,R6                                                    48580021
         BCTR  R5,R0               SET UP R5 FOR EXEC                   48600021
TBMOV05  CR    R8,R6                                                    48620021
         BNH   TBMOV04             LENGTH < OR = R6                     48640021
TBMOV06  SR    R10,R6                                                   48660021
         SR    R9,R6                                                    48680021
         EX    R5,TBMOVEX                                               48700021
         SR    R8,R6                                                    48720021
         B     TBMOV05             LOOP THROUG AGAIN                    48740021
TBMOV04  SR    R10,R8                                                   48760021
         SR    R9,R8                                                    48780021
         B     TBMOV01             PREPARE TO DO A MOVE IF NECESSA      48800021
TBMOV03  LA    R6,DX256                                                 48820021
         B     TBMOV07             GO TO TBMOV07 WITH NEW R6            48840021
TBMOVEX  MVC   DX0(LX0,R10),DX0(R9)                                     48860021
         SPACE 5                                                        48880021
*                                                                       48900021
*        TBSPILL  -  SPILL A SECTION FROM DICTIONARY.                   48920021
*                                                                       48940021
*                                                                       48960021
TBSPILL  STM   R5,R10,TBSAV7                                            48980021
         ST    R14,TBSAV714                                             49000021
         LR    R10,R2                                                   49020021
*                                  SAVE R2, WHICH HAS AMT CORE NEED     49040021
         OI    TBSW1,TBSPILLF                                           49060021
         L     R9,TBDBEGAR(R4)                                          49080021
         A     R9,TBDLENG(R4)           END OF DICT.                    49100021
         L     R6,TBDSTADD(R4)                                          49120021
         A     R6,TBDCLENG(R4)          BEG. OF DICT.                   49140021
         L     R7,TBDNSECT(R4)                                          49160021
         SH    R9,TBCON512              TRY TO DUMP LAST SECTION.       49180021
         C     R9,TBCURSTN              IS IT THE SECTION BEING BUI     49200021
         BNE   TBSP41              R9 NOT @ CURRENT DICT SECTION        49220021
         CH    R7,TBCON002                                              49240021
*                                  IS THIS THE ONLY SECTION,YES BRA     49260021
*                                  IF NOT SPILL NEXT-TO-LAST SECTIO     49280021
         BL    TBSP40              X                                    49300021
         SH    R9,TBCON512                                              49320021
TBSP41   BAL   R14,TBWRITE         BR TO WRITE OUT DICT SECTION         49340021
         ST    R9,TBTEMP                                                49360021
         CH    R7,TBCON002                                              49380021
         BL    TBSP42              R7 < 2                               49400021
         C     R6,TBCURSTN                                              49420021
         BNE   TBSP443             R6 NOT = @ CURRENT DICT SECTION      49440021
TBSP44   ST    R9,TBCURSTN      UPDATE CURENT SECTION IF NEEDED.        49460021
TBSP443  EQU   *                                                        49480021
         CR    R6,R9                                                    49500021
         BE    TBSP42              EQUAL SKIP NEXT INSTRUCTIONS         49520021
         MVC   DX0(LX256,R9),DX0(R6)                                    49540021
         MVC   DX256(LX256,R9),DX256(R6)                                49560021
         BAL   R14,TBGETDIC        GET DICOT TABLE ENTRY                49580021
         MVC   DX1(LX3,R7),TBTEMP+NX1                                   49600021
*                                  BRANCH TO UPDATE MASTAMS             49620021
TBSP42   LH    R2,TBCOM512                                              49640021
         BAL   R14,TBINS78         UPDATE MASTAM                        49660021
*                                                                       49680021
         LH    R8,TBCOM001                                              49700021
         BAL   R14,TBDIC100        UPDATE NB OF DICT SECTION            49720021
         TM    TBSWGENE,TBFLDICT                                        49740021
         BO    TBSP46              DON'T GO TO TBACCINT                 49760021
         BAL   R14,TBACCINT        X                                    49780021
TBSP46   EQU   *                                                        49800021
         LR    R2,R10                                                   49820021
         LM    R5,R10,TBSAV7                                            49840021
         L     R14,TBSAV714                                             49860021
         BR    R14                 RESTORE R14 AND BRANCH               49880021
         SPACE 2                                                        49900021
*                   TRY OTHER MASTAMS FOR SECTION TO SPILL              49920021
TBSP40   LA    R5,TBMASTAM                                              49940021
TBSP45   CR    R5,R4                                                    49960021
         BE    TBSP43              R4 =@TBMASTAM                        49980021
         L     R14,TBDNSECT(R4)                                         50000021
         LTR   R14,R14                                                  50020021
         BE    TBSP43              R14 = 0                              50040021
         L     R9,TBDBEGAR(R5)                                          50060021
         A     R9,TBDLENG(R5)                                           50080021
         SH    R9,TBCON512                                              50100021
         BAL   R14,TBWRITE         WRITE OUT DICT SECTION               50120021
         ST    R9,TBTEMP                                                50140021
         B     TBSP44              BR TO UPDATE CURR SECT IF NECES      50160021
TBSP43   LA    R5,TBMSTMLG(R5)                                          50180021
         C     R5,TBLASMTM                                              50200021
         BH    TBERR1              MUST SEND OUT MESSAGE                50220021
         B     TBSP45              TRY OTHER MASTAMS-SECT TO SPILL      50240021
         SPACE 5                                                        50260021
*                                                                       50280021
*                                                                       50300021
TBACCINT STM   R5,R10,TBSAV5                                            50320021
         L     R9,TBAPHASW                                              50340021
         CLI   DX0(R9),TAM3Q                                            50360021
         BE    TBACCINX            PHZSW = X'05'                        50380021
         L     R10,TBADICAD                                             50400021
         L     R8,DX0(R10)          DICADR                              50420021
         L     R6,DX4(R10)          DLSVAL                              50440021
         SR    R6,R8                                                    50460021
         L     R7,TBCURSTN                                              50480021
         AH    R7,TBCON512                                              50500021
         ST    R7,DX4(R10)                                              50520021
         SR    R7,R6                                                    50540021
         ST    R7,DX0(R10)                                              50560021
TBACCINX EQU   *                                                        50580021
         LM    R5,R10,TBSAV5                                            50600021
         BR    14                  RETURN TO NEXT SEQUENTIAL INSTR      50620021
         SPACE 5                                                        50640021
*        TBPACKTB  - ROUTINE WHICH PACKS TABLE  (NO FREE SPACE BETW     50660021
*                    TABLES) WHITHIN A MASTAM WHOSE ADDRESS IS IN R     50680021
*                   -IF TBFULLPK SWITCH IS ON  ONLY SPACE FOR ONE M     50700021
*                   ENTRY WILL BE LEFT IN EACH TABLE.                   50720021
         SPACE 5                                                        50740021
TBPACKTB STM   R5,R10,TBSAV3                                            50760021
         ST    R14,TBSAV314                                             50780021
         L     R5,TBDFSTAM(R4)          LOAD FIRST TAM ADDR.            50800021
TBPK005  C     R5,TBDLSTAM(R4)                                          50820021
         BE    TBPACKEN                 END OF PACKING.                 50840021
         LA    R6,TBTAMLG(R5)           GET NEXT TAM ADDR.              50860021
         L     R10,DX0(R5)                                              50880021
         LA    R10,DX0(R10)              START OF TABLE.                50900021
         TM    DX0(R5),TBFLFREE                                         50920021
         BO    TBPK000                  FREE AREA.                      50940021
         TM    DX0(R5),TBFLPRIM                                         50960021
         BO    TBPK001                  PRIMED TABLE.                   50980021
         AH    R10,DX4(R5)               STATIC TABLE                   51000021
         LR    R9,R10                                                   51020021
         AH    R10,TBCONS03             GET END OF TABLE AND            51040021
         N     R10,TBMASK00             UPDATE FREE BYTES LEFT.         51060021
         SR    R9,R10                                                   51080021
         LCR   R9,R9                                                    51100021
         STH   R9,DX6(R5)                                               51120021
         B     TBPK002             BRANCH AROUND NEXT ROUTINE           51140021
TBPK001  AH    R10,DX6(R5)               GET END OF TABLE               51160021
         TM    TBSWGENE,TBFULLPK        FULL PACK.                      51180021
         BZ    TBPK002                  NO                              51200021
         L     R7,DX8(R5)                                               51220021
         BAL   R14,TBENTLG              SPACE ONLY FOR ONE MORE ENT     51240021
         L     R9,DX0(R5)                                               51260021
         LA    R9,DX0(R9)                                               51280021
         LR    R14,R9                                                   51300021
         AR    R9,R7                                                    51320021
         AH    R9,DX4(R5)                                               51340021
         AH    R9,TBCONS03                                              51360021
         N     R9,TBMASK00                                              51380021
         CR    R9,R10                                                   51400021
         BH    TBPK002             R9 > R10                             51420021
         LR    R10,R9                                                   51440021
         SR    R9,R14                                                   51460021
         STH   R9,DX6(R5)                                               51480021
TBPK002  LA    R5,TBTAMLG(R5)                                           51500021
         SPACE 2                                                        51520021
*        NOW  TEST IF NEXT TAM IS A FREE AREA.                          51540021
*                                                                       51560021
TBPK000  EQU   *                                                        51580021
         C     R6,TBDLSTAM(R4)                                          51600021
         BE    TBPK003                  MASTAM- YES                     51620021
         TM    DX0(R6),TBFLFREE                                         51640021
         BZ    TBPK004                  NOT A FREE AREA.                51660021
         LA    R6,TBTAMLG(R6)           TRY NEXT TAM.                   51680021
         B     TBPK000             LOOP BACK                            51700021
TBPK004  L     R9,DX0(R6)                                               51720021
         LA    R9,DX0(R9)                                               51740021
         BAL   R14,TBLASTBY             GET LAST BYTE OF LAST TABLE     51760021
         SR    R8,R9                                                    51780021
         BAL   R14,TBMOVEUP             GET RID OF INTERSPACE IF AN     51800021
TBPK006  BAL   R14,TBTAMUP         PACKING-->MUST MOVE TAM              51820021
         SR    R9,R10                                                   51840021
         BAL   R14,TBTAMSL              UPDATE TAM'S DUE TO SHIFT O     51860021
         B     TBPK005                  TABLES.                         51880021
         SPACE 2                                                        51900021
*        ONLY  FREE AREAS LEFT AT THE END OF MFA. UPDATE MASTAM AND     51920021
*        TAM'S                                                          51940021
*                                                                       51960021
TBPK003  L     R9,TBDSTADD(R4)                                          51980021
         SR    R9,R10                                                   52000021
         ST    R10,TBDSTADD(R4)                                         52020021
         A     R9,TBDCLENG(R4)                                          52040021
         ST    R9,TBDCLENG(R4)                                          52060021
         B     TBPK006             PACKING-->MUST MOVE,UPDATE TAM       52080021
TBPACKEN BAL   R14,TBTIBUP         TAM MOVED-->MUST UPDATE TIB          52100021
         NI    TBSWGENE,XXFB      RESET FULLPACK                        52120021
         L     R14,TBSAV314                                             52140021
         LM    R5,R10,TBSAV3                                            52160021
         BR    14                  RETURN TO NEXT SEQUENTIAL INSTR      52180021
         SPACE 5                                                        52200021
*                                                                       52220021
*        TBENTLG   -GET ENTRY LENGTH FOR A TABLE WHOSE TIB ADDR.IS      52240021
*                   GIVEN IN R7 . ENTRY LENGTH IS SENT BACK IN R7.      52260021
*                                                                       52280021
         SPACE 2                                                        52300021
TBENTLG  L     R7,DX0(R7)                                               52320021
         SRL   R7,DX24                   IF LENGTH =0  SET IT EQUAL     52340021
         LTR   R7,R7                    TO 256.                         52360021
         BCR   R7,R14              R7 NOT ZERO                          52380021
         LA    R7,DX256                                                 52400021
         BR    14                  RETURN TO NEXT SEQUENTIAL INSTR      52420021
         SPACE 5                                                        52440021
*                                                                       52460021
*        TBTIBUP   -UPDATE TIB DUE TO A MOVING OF THE TAM'S.            52480021
*                                                                       52500021
         SPACE 2                                                        52520021
TBTIBUP  LA    R9,TBTAM                                                 52540021
TBTIBU1  C     R9,TBNEXTAM              LAST TAM.                       52560021
         BCR   R8,R14                    YES- EXIT                      52580021
         TM    DX0(R9),TBFLPRIM+TBFLSTAT                                52600021
         BZ    TBTIBU0             SKIP NEXT INSTRUCTIONS               52620021
         L     R10,DX8(R9)               GET TIB ADDR.                  52640021
         ST    R9,TBTEMP                                                52660021
         MVC   DX1(LX3,R10),TBTEMP+NX1    MOVE TAM ADDR TO TIB.         52680021
TBTIBU0  LA    R9,TBTAMLG(R9)                                           52700021
         B     TBTIBU1             LOOP BACK                            52720021
         SPACE 5                                                        52740021
*                                                                       52760021
*        TBLASTBY   GET ADDRESS OF LAST BYTE OF LAST TABLE IN A MAS     52780021
*                   WHOSE ADDRESS IS GIVEN IN R4                        52800021
*                                                                       52820021
         SPACE 2                                                        52840021
TBLASTBY L     R7,TBDLSTAM(R4)                                          52860021
TBLAST00 SH    R7,TBCON012                                              52880021
         TM    DX0(R7),TBFLFREE                                         52900021
         BO    TBLAST00            IF ON THEN REPEAT                    52920021
         L     R8,DX0(R7)                                               52940021
         LA    R8,DX0(R8)                START OF LAST TABLE            52960021
         AH    R8,DX6(R7)                FOR PRIME  ADD NUMBER OF BY    52980021
         TM    DX0(R7),TBFLPRIM          ASSIGNED                       53000021
         BCR   R1,R14              RETURN IF ONES                       53020021
         AH    R8,DX4(R7)                                               53040021
         BR    R14                 NOW RETURN WITH MODIFIED R8          53060021
         SPACE 5                                                        53080021
*                                                                       53100021
*        TBTAMUP -  MOVE TAM DUE TO PACKING.R5 POINTS TO WHERE SHIF     53120021
*        END-R6 POINTS TO WHERE IT STARTS . R4 HAS SHIFTED MASTAM.      53140021
         SPACE 2                                                        53160021
TBTAMUP  STM   R5,R10,TBSAV4                                            53180021
         ST    R14,TBSAV414                                             53200021
         CR    R5,R6                    NO SHIFT NECESSARY.             53220021
         BCR   R8,R14              R5 = R6                              53240021
         LR    R10,R5                                                   53260021
         LR    R9,R6                                                    53280021
         L     R8,TBNEXTAM                                              53300021
         SR    R8,R6                                                    53320021
         BAL   R14,TBMOVUP         MOVE TABLE TOWARDS LOW @'S           53340021
         SR    R9,R10                                                   53360021
         LR    R5,R4                                                    53380021
         BAL   R14,TBMASUPL             UPDATE  MASTAM.                 53400021
TBTAMEX  L     R14,TBSAV414                                             53420021
TBTAMSX  LM    R5,R10,TBSAV4                                            53440021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      53460021
         SPACE 5                                                        53480021
*                                                                       53500021
*        TBTAMSL   UPDATE  TABLE ADDRESSES IN  TAM'S  DUE  TO A SHI     53520021
*                  OF  TABLES TOWARDS LOW CORE.                         53540021
*                  R5 POINTS TO FIRST  TAM TO BE UPDATED                53560021
*                  R4 POINTS TO  MASTAM.                                53580021
*                  R9 HAS VALUE OF  SHIFT                               53600021
*        TBTAMSH   SAME  THING FOR A SHIFT TOWARDS HIGH CORE.           53620021
*                                                                       53640021
         SPACE 2                                                        53660021
TBTAMSL  STM   R5,R10,TBSAV4                                            53680021
         LA    R6,DX0                                                   53700021
         B     TBTAMS00            SKIP NEXT INSTRUCTIONS               53720021
TBTAMSH  STM   R5,R10,TBSAV4                                            53740021
         LA    R6,DX2                                                   53760021
TBTAMS00 C     R5,TBDLSTAM(R4)                                          53780021
         BE    TBTAMSX             PREPARE TO RETURN TO NXT SEQ IN      53800021
         L     R7,DX0(R5)                                               53820021
         LA    R7,DX0(R7)                GET OLD ADDRESS.               53840021
         EX    R0,TBTAMSAS(R6)          UPDATE IT.                      53860021
         ST    R7,TBTEMP                                                53880021
         MVC   DX1(LX3,R5),TBTEMP+NX1                                   53900021
         LA    R5,TBTAMLG(R5)                                           53920021
         B     TBTAMS00            LOOP BACK                            53940021
         SPACE 2                                                        53960021
TBTAMSAS SR    R7,R9                                                    53980021
         AR    R7,R9                                                    54000021
         SPACE 5                                                        54020021
*                                                                       54040021
*        TBINSTAM  -ADD A TAM  AT THE END OF THE TAM AREA ASSIGNED      54060021
*                   A MASTAM. R4 HAS ADDR. OF MASTAM                    54080021
*                             R5  -   -   WHERE TAM SHOULD BE INSER     54100021
*                                                                       54120021
*                                                                       54140021
         SPACE 2                                                        54160021
TBINSTAM STM   R5,R10,TBSAV2                                            54180021
         ST    R14,TBSAV214                                             54200021
TBINS01  L     R10,TBNEXTAM                                             54220021
         LR    R9,R10                                                   54240021
         C     R10,TBAENTM                                              54260021
         BL    TBINS00             R10 < @TBENDTAM                      54280021
         BAL   R14,TBPACKGN             NO TAM'S LEFT -PACK ALL MAS     54300021
         B     TBINS01             LOOP BACK                            54320021
TBINS00  L     R5,TBDLSTAM(R4)                                          54340021
         LR    R8,R9                                                    54360021
         SR    R8,R5                                                    54380021
         LA    R10,TBTAMLG(R10)                                         54400021
         BAL   R14,TBMOVDON             MOVE TAM'S DOWN 1 .             54420021
         LA    R9,TBTAMLG                                               54440021
         LR    R10,R5                                                   54460021
         LR    R5,R4                                                    54480021
         BAL   R14,TBMASUPH             UPDATE TAM.                     54500021
         LR    R5,R10                                                   54520021
         LM    R6,R10,TBSAV2+NX4                                        54540021
         L     R14,TBSAV214                                             54560021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      54580021
         SPACE 5                                                        54600021
*                                                                       54620021
*        TBMASUPH   UPDATE TAM'S AND MASTAM'S DUE TO A SHIFT OF TAM     54640021
*                   HIGH CORE.                                          54660021
*        TBMASUPL   SAME THING FOR SHIFT TO LOW CORE.                   54680021
*                                                                       54700021
         SPACE 2                                                        54720021
TBMASUPH LA    R6,DX2                                                   54740021
         B     TBMASU00            LEAVE R6 AS IS                       54760021
TBMASUPL LA    R6,DX0                                                   54780021
TBMASU00 L     R7,TBNEXTAM              UPDATE TBNEXTAM.                54800021
         EX    R0,TBTAMSAS(R6)                                          54820021
         ST    R7,TBNEXTAM                                              54840021
TBMAS01  L     R7,TBDLSTAM(R5)          UPDATE FIRST MASTAM (THE ON     54860021
         EX    R0,TBTAMSAS(R6)          WHERE SHIFT OCCURED)            54880021
         ST    R7,TBDLSTAM(R5)                                          54900021
         C     R5,TBLASMTM                                              54920021
         BCR   R8,R14              BRANCH IF EQUAL                      54940021
         LA    R5,TBMSTMLG(R5)          UPDATE  OTHER  MASTAMS.         54960021
         L     R7,TBDFSTAM(R5)                                          54980021
         EX    R0,TBTAMSAS(R6)                                          55000021
         ST    R7,TBDFSTAM(R5)                                          55020021
         B     TBMAS01             LOOP BACK                            55040021
         SPACE 5                                                        55060021
*                                                                       55080021
*        TBPACKGN  -PACK ALL MASTAM'S.                                  55100021
*                                                                       55120021
         SPACE 2                                                        55140021
TBPACKGN ST    R4,TBSAV64                                               55160021
         ST    R14,TBSAV614                                             55180021
         LA    R4,TBMASTAM                                              55200021
TBPK11   BAL   R14,TBPACKTB        BRANCH TO PACK TABLE                 55220021
         C     R4,TBLASMTM                                              55240021
         BE    TBPK10              PREPARE TO RETURN                    55260021
         LA    R4,TBMSTMLG(R4)                                          55280021
         B     TBPK11              LOOP BACK                            55300021
TBPK10   L     R14,TBSAV614                                             55320021
         L     R4,TBSAV64                                               55340021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      55360021
         SPACE 5                                                        55380021
*                   ENTRY POINT FOR INTERNAL CALL TO PRIME              55400021
TBPRIMEC STM   R6,R10,TBSAV2                                            55420021
         ST    R14,TBSAV214                                             55440021
         B     TBPRIM00            X                                    55460021
PH0TBST2 CSECT                                                          55480021
         EJECT                                                          55500021
         USING *,15                                                     55520021
TBPRIMEB EQU   *                                                        55540021
         L     R3,DX0(R1)                GET TIB  ADDRESS.              55560021
         LA    R3,DX0(R3)                RELOCATE IT IF NOT DONE YET    55580021
         C     R3,TBACOS                X                               55600021
         BNL   TBPRIM01                 X                               55620021
         A     R3,TBACOS                X                               55640021
         ST    R3,TBTEMP                X                               55660021
         MVC   DX1(LX3,R1),TBTEMP+NX1     X                             55680021
TBPRIM01 MVC   DX0(LX1,R3),DX0(R1)        MOVE ENTRY LENGTH.            55700021
         MVC   DX4(LX4,R3),DX4(R1)        MOVE E AND G  PARAMETERS.     55720021
         LH    R2,DX4(R1)                                               55740021
         AH    R2,TBCON003                                              55760021
         N     R2,TBMASK00              R2 HAS AMOUNT OF CORE WANTE     55780021
         LA    R4,TBMASTAM                                              55800021
TBPRIM00 ST    R4,TBCCMSTM              SAVE ADDR. OF STARTING MAST     55820021
         LA    R10,TBPRIM05             LOAD TRANSFER REGISTERS FOR     55840021
         LA    R9,TBPRIM06              TEST ROUTINE.                   55860021
TBPRIM05 C     R2,TBDCLENG(R4)          R2 HAS AMOUNT OF CORE WANTE     55880021
         BH    TBPRIM02            AM'T WANTED IS GREATER               55900021
         TM    TBSWGENE,TBFLINST+TBFLDICT                               55920021
         BZ    TBPRIM03            BR TO GET NEW TAM,ETC                55940021
*        EXIT FOR INSERT OR DISCP WHEN ENOUGH SPACE IN MFA.             55960021
*                                                                       55980021
TBPRIM13 LM    R6,R10,TBSAV2                                            56000021
         L     R14,TBSAV214                                             56020021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      56040021
         SPACE 2                                                        56060021
*                                                                       56080021
*  TEST IF EVERY MASTAM HAS BEEN SCANNED  STARTING WHITH THE ONE WH     56100021
*  ADDRESS IS IN TBCCMSTM.    R10 AND R9 ARE SET BY CALLER.             56120021
*                                                                       56140021
*                                                                       56160021
TBPRIM02 C     R4,TBLASMTM                                              56180021
         BE    TBPRIM04                 LAST MASTAM                     56200021
         LA    R4,TBMSTMLG(R4)                                          56220021
TBPRIM07 C     R4,TBCCMSTM              ARE WE BACK WITH FIRST ONE.     56240021
         BCR   R7,R10                    NO- TEST NEXT MASTAM.          56260021
         BR    R9                       YES-GO TO NEXT STEP.            56280021
TBPRIM04 LA    R4,TBMASTAM                                              56300021
         B     TBPRIM07            X                                    56320021
         SPACE 2                                                        56340021
*  NOW TRY  TO FIND A BIG ENOUGH FREE AREA (TFA)                        56360021
*                                                                       56380021
*                                                                       56400021
TBPRIM06 L     R10,TBAPHASW                                             56420021
         LR    R7,R2                                                    56440021
         CLI   DX0(R10),TAM2Q                                           56460021
         BNE   TBPRIM66            PHZSW NOT EQUAL X'04'                56480021
         TM    TBSWGENE,TBFLDICT                                        56500021
         BZ    TBPRIM66            SKIP NEXT INSTRUCTIONS               56520021
         CLI   TBDISW,XX01                                              56540021
         BE    TBPRIM22            BR TO TRY TO SPILL DICT SECTION      56560021
TBPRIM66 LA    R10,TBPRIM09                                             56580021
         LA    R9,TBPRIM14              NEXT STEP ADDRESS.              56600021
TBPRIM09 L     R5,TBDFSTAM(R4)                                          56620021
TBPRIM99 C     R5,TBDLSTAM(R4)                                          56640021
         BE    TBPRIM02                 NO MORE TAM - TRY NEXT MAST     56660021
         TM    DX0(R5),TBFLFREE                                         56680021
         BO    TBPRIM08            DON'T GO TO TBPRIM99                 56700021
TBPRIM10 LA    R5,TBTAMLG(R5)                                           56720021
         B     TBPRIM99            LOOP BACK                            56740021
TBPRIM08 L     R6,DX4(R5)                                               56760021
         CR    R6,R2                                                    56780021
         BL    TBPRIM10                 NOT BIG ENOUGH                  56800021
         TM    TBSWGENE,TBFLDICT                                        56820021
         BO    TBPRIM11                 FOR DICT CALL- PACK TABLE.      56840021
         TM    TBSWGENE,TBFLINST                                        56860021
         BZ    TBPRIM12            DON'T RETURN YET                     56880021
TBPRIM35 LM    R6,R10,TBSAV2            RETURN FOR INSERT WHEN SPAC     56900021
         L     R14,TBSAV214             IS FOUND IN TFA.                56920021
         B     4(R14)              X                                    56940021
         SPACE 2                                                        56960021
TBPRIM12 MVI   DX0(R5),TBFLPRIM                                         56980021
*                                                                       57000021
         ST    R5,TBTEMP                                                57020021
         MVC   DX1(LX3,R3),TBTEMP+NX1                                   57040021
         ST    R2,DX4(R5)                UPDATE TIB AND TAM FOR NEW     57060021
         ST    R3,DX8(R5)                TABLE.                         57080021
         B     TBTAMENX            NOW PREPARE TO RETURN                57100021
         SPACE 2                                                        57120021
TBPRIM03 EQU   *                                                        57140021
         BAL   R14,TBINSTAM             GET A NEW TAM                   57160021
         MVC   DX0(LX4,R5),TBDSTADD(R4)                                 57180021
         BAL   R14,TBTIBUP         UPDATE TIB                           57200021
         BAL   R14,TBINS88         UPDATE MASTAM                        57220021
         B     TBPRIM12            UPDATE TIB,TAM AND RETURN            57240021
         SPACE 2                                                        57260021
TBPRIM11 BAL   R14,TBPACKTB        BRANCH TO PACK TABLE                 57280021
         B     TBPRIM13            PREPARE TO RETURN                    57300021
         SPACE 2                                                        57320021
*   THE NEXT STEP IS TO PACK THE TABLES AND TRY STEP1 AGAIN.            57340021
*                                                                       57360021
*                                                                       57380021
TBPRIM14 LA    R10,TBPRIM15                                             57400021
         LA    R9,TBPRIM16                                              57420021
TBPRIM15 BAL   R14,TBPACKTB        BRANCH TO PACK TABLE                 57440021
         B     TBPRIM05            X                                    57460021
         SPACE 2                                                        57480021
*   THE NEXT STEP IS TO ASK FOR COBOL SPACE IF ANY IS LEFT.             57500021
*                                                                       57520021
*                                                                       57540021
TBPRIM16 DS    0H                                                       57560021
         TM    TBSWGENE,TBSPASKD                                        57580021
         BO    TBPRIM17            X                                    57600021
         BAL   R14,TBGETSPC        BR TO ASK FOR COBOL SPACE            57620021
         LA    R10,TBPRIM05                                             57640021
         LA    R9,TBPRIM17                                              57660021
         BR    R10                 GO TO TBPRIM05                       57680021
         SPACE 2                                                        57700021
*   THE  NEXT  STEP IS TO LEAVE SPACE FOR ONLY ONE MORE ENTRY IN EA     57720021
*   PRIMED TABLE AND TO PACK THOSE TRUNCATED TABLE. FROM NOW ON FOR     57740021
*   PRIME AND INSERT SPACE WILL BE GIVEN ON AN ENTRY BASIS.             57760021
*                                                                       57780021
*                                                                       57800021
TBPRIM17 LR    R7,R2                                                    57820021
         LA    R9,TBPRIM20                                              57840021
         LA    R10,TBPRIM18                                             57860021
         TM    TBSWGENE,TBFLDICT                                        57880021
         BO    TBPRIM18            SKIP OVER NEXT INSTRUCTIONS          57900021
         LR    R7,R3                    GET ENTRY LENGTH.               57920021
         BAL   R14,TBENTLG         BRANCH TO GET ENTRY LENGTH           57940021
         AH    R7,TBCON003                                              57960021
         N     R7,TBMASK00                                              57980021
         TM    TBSWGENE,TBFLINST                                        58000021
         BZ    TBPRIM18            SKIP NEXT INSTRUCITONS               58020021
         LA    R10,TBPRIM05                                             58040021
         L     R5,DX0(R3)                                               58060021
         LH    R2,DX6(R5)                                               58080021
         AR    R2,R7                                                    58100021
TBPRIM18 C     R7,TBDCLENG(R4)                                          58120021
         BH    TBPRIM02            BR TO TEST EVERY MASTAM SCANNED      58140021
TBPRIM31 LR    R2,R7                                                    58160021
TBPRIM36 TM    TBSWGENE,TBFLINST+TBFLDICT                               58180021
         BZ    TBPRIM03            GET NEW TAM,UPDATE TIB,MASTAM        58200021
         TM    TBSWGENE,TBFLDICT                                        58220021
         BO    TBPRIM13            BRANCH TO RETURN                     58240021
         LM    R6,R10,TBSAV2                                            58260021
         L     R14,TBSAV214                                             58280021
         B     8(R14)              RETURN                               58300021
         SPACE 2                                                        58320021
*  FULLPACK                                                             58340021
*                                                                       58360021
*                                                                       58380021
TBPRIM20 LA    R9,TBPRIM22                                              58400021
         LA    R10,TBPRIM21                                             58420021
         TM    TBSWGENE,TBFLINST                                        58440021
         BZ    TBPRIM21            LEAVE R10 ALONE                      58460021
         LA    R10,TBPRIM23                                             58480021
TBPRIM21 OI    TBSWGENE,TBFULLPK                                        58500021
         BAL   R14,TBPACKTB        BRANCH TO PACK TABLE                 58520021
         B     TBPRIM18            X                                    58540021
TBPRIM23 OI    TBSWGENE,TBFULLPK                                        58560021
         BAL   R14,TBPACKTB        BRANCH TO PACK TABLE                 58580021
         B     TBPRIM05            X                                    58600021
         SPACE 2                                                        58620021
*        NO LUCK  - TRY  TO SPILL DICTIONARY SECTION                    58640021
*                                                                       58660021
*                                                                       58680021
TBPRIM22 TM    TBSWGENE,TBFLNODC                                        58700021
         BO    TBABEND             SEND WARNING AND END COMP.           58720021
         L     R6,TBSECTN                                               58740021
         CH    R6,TBCON003                                              58760021
         BL    TBABEND             SEND WARNING AND END COMP.           58780021
*                                                                       58800021
*  TRY  TO  SPILL  ONE SECTION FROM  CURRENT MASTAM.                    58820021
*                                                                       58840021
         L     R6,TBDNSECT(R4)                                          58860021
         LTR   R6,R6                                                    58880021
         BZ    TBPRIM30            X                                    58900021
         BAL   R14,TBSPILL         BR TO SPILL DICT SECTION             58920021
         B     TBPRIM31            X                                    58940021
TBPRIM30 LA    R10,TBPRIM32                                             58960021
         LA    R9,TBABEND                                               58980021
         B     TBPRIM02            BR TO TEST EVERY MASTAM SCANNED      59000021
TBPRIM32 TM    TBSWGENE,TBFLINST                                        59020021
         BO    TBPRIM33            X                                    59040021
         LR    R2,R7                                                    59060021
TBPRIM33 SR    R1,R1                                                    59080021
         L     R0,TBDCLENG(R4)                                          59100021
TBPRIM37 EQU *                                                          59120021
         LA    R1,DX1(R1)                                               59140021
         AH    R0,TBCON512                                              59160021
         CR    R0,R2                                                    59180021
         BL    TBPRIM37            X                                    59200021
         C     R1,TBDNSECT(R4)                                          59220021
         BH    TBPRIM02            BR TO TEST EVERY MASTAM SCANNED      59240021
         L     R6,TBSECTN                                               59260021
         SR    R6,R1                                                    59280021
         CH    R6,TBCON003                                              59300021
         BL    TBABEND             SEND WARNING AND END COMP            59320021
TBPRIM34 BAL   R14,TBSPILL         BR TO SPILL DICT SECTION             59340021
         BCT   R1,TBPRIM34         X                                    59360021
         TM    TBSWGENE,TBFLINST                                        59380021
         BO    TBPRIM13            RETURN TO NEXT SEQUENTIAL INSTR      59400021
         B     TBPRIM36            X                                    59420021
TBABEND  LA    R2,TBMESS1                                               59440021
         LA    R3,TBMESS1L                                              59460021
TBERRLG  L     R4,TBATRMNT                                              59480021
         BR    R4                  BRANCH TO TRMNATE                    59500021
         SPACE 2                                                        59520021
         SPACE  5                                                       59540021
*        TBSTATIC - INDICATES THAT A PRIMED TABLE  WILL NOT GROW AN     59560021
*                 - MORE                                                59580021
*        STATIC CALCULATES THE AMOUNT OF UNUSED TABLE AREA AND STOR     59600021
*        IT IN THE TAMM IN PLACE OF THE SIZE OF THE ENTIRE TABLE        59620021
*        THESTATIC CODE IS X'02' IN THE TOP BYTE OF THE TAMM            59640021
TBSTATIC L     R2,DX0(R1)      LOAD TAMM ADD INTO R2                    59660021
         TM    DX0(R2),TBFLPRIM                                         59680021
         BZ    TBERR1              PREPARE TO TERMINATE                 59700021
         LH    R3,DX6(R2)      LOAD TAMM ADDR INTO R2                   59720021
         SH    R3,DX4(R2)      SUBTRACT BYTES USED                      59740021
         STH   R3,DX6(R2)      STORE NO OF FREE BYTES AVAILABLE         59760021
*                                  FLAG TABLE AS STATIC                 59780021
         MVI   DX0(R2),TBFLSTAT                                         59800021
         B     TBTAMENX            BRANCH TO RETURN                     59820021
         SPACE  5                                                       59840021
******                                                           **     59860021
*                             TBTABREL                                  59880021
*        TABREL IS CALLED WHEN A PHASE IS FINISHED WITH A TABLE         59900021
*        THE SPACE IS THEN RELEASED FOR USE BY OTHER TABLES             59920021
*        THE TIB CAN NOW BE REUSED FOR ANOTHER TABLE. THE TAMM IS S     59940021
*        TO X'02' TO INDICATE THAT THE TABLE IT POINTS TO IS FREE.      59960021
*        THE LENGTH OF THE TABLE IS STORED IN THE SECOND FULL WORD      59980021
*        THE TAMM                                                       60000021
******                                                           **     60020021
TBTABREL L     R2,DX0(R1)           GET TAMM ADDRESS                    60040021
         LH    R3,DX6(R2)                                               60060021
         TM    DX0(R2),TBFLPRIM                                         60080021
         BO    TYCONT              X                                    60100021
         AH    R3,DX4(R2)           GET LENGTH OF TABLE IF STATIC       60120021
TYCONT   EQU   *                                                        60140021
         ST    R3,DX4(R2)           STORE FREE LENGTH IN TAMM           60160021
         MVI   DX0(R2),TBFLFREE                                         60180021
         XC    DX0(LX4,R1),DX0(R1) SET TAMM ADDRESS IN TIB TO ZERO      60200021
         B     TBTAMENX            BRANCH TO RETURN                     60220021
         SPACE  5                                                       60240021
******                                                           **     60260021
*                             TBINSERT                                  60280021
*        INSERT IS CALLED WHEN ONE OF THE PHASES NEEDS TO MAKE AN       60300021
*        ENTRY INTO THE TABLE                                           60320021
*                                                                       60340021
*        IF THERE IS ROOM LEFT IN THE TABLE INSERT WILL RETURN          60360021
*        NORMALLY. OTHERWISE IT WILL CALL PRIME TO FIND A LARGER        60380021
*        AREA FOR THE TABLE.                                            60400021
*                                                                       60420021
*        INSERT CALLING PARAMETERS                                      60440021
*              R15  ADDRESS OF INSERT                                   60460021
*              R14  RETURN LINKAGE                                      60480021
*              R1   ADDRESS OF TIB                                      60500021
*              R0   CAN CONTAIN ENTRY LENGTH IF NOT ALREADY IN TIB      60520021
*                                                                       60540021
*        INSERT RETURN PARAMETERS                                       60560021
*              R2   ADDRESS WHERE NEW ENTRY CAN BE MADE                 60580021
*              R3   DISPLACEMENT FROM BEGINNING OF TABLE OF NEW ENT     60600021
******                                                           **     60620021
TBINSERT LR    R3,R1                                                    60640021
         OI    TBSWGENE,TBFLINST                                        60660021
         L     R2,DX0(R3)                                               60680021
         LR    R6,R2                                                    60700021
         SRL   R2,DX24                                                  60720021
*                                  IS ENTRY LENGTH IN TIB               60740021
         LTR   R2,R2                                                    60760021
         BNE   TBINSE00            X                                    60780021
*                                  IF NOT, IS ENTRY LENGTH IN R0        60800021
         LTR   R0,R0                                                    60820021
         BE    TBINSEXT            NO ENTRY LENGTH GIVEN.               60840021
         LR    R2,R0                                                    60860021
TBINSE00 EQU   *                                                        60880021
         TM    DX0(R6),TBFLPRIM                                         60900021
         BZ    TBERR1              SEND OUT WARNING AND END COMP.       60920021
         LH    R7,DX4(R6)                                               60940021
         AR    R7,R2                                                    60960021
         CH    R7,DX6(R6)                                               60980021
         BNH   TBINSEXT            ENOUGH ROOM :OK                      61000021
         LR    R7,R2               SAVE ENTRY LENGTH                    61020021
*  TABLE NEED TO GROW - GROW IS ALWAYS SET TO 256 BYTES.                61040021
*                                                                       61060021
         LH    R2,DX6(R6)                                               61080021
         AH    R2,TBCON256                                              61100021
         CH    R2,TB32767                                               61120021
         BH    TBERR3              SEND OUT WARNING AND END COMP.       61140021
         LA    R4,TBMASTAM                                              61160021
         LA    R6,DX0(R6)                                               61180021
TBINSE02 L     R5,TBDLSTAM(R4)                                          61200021
         CR    R6,R5                                                    61220021
         BL    TBINSE01                 R4 HAS MASTAM TO WHICH TABL     61240021
         C     R4,TBLASMTM              BELONG.                         61260021
         BE    TBERR1              SEND OUT WARNING AND END COMP.       61280021
         LA    R4,TBMSTMLG(R4)                                          61300021
         B     TBINSE02            LOOP THROUGH AGAIN                   61320021
         SPACE 2                                                        61340021
TBINSE01 BAL   R14,TBPRIMEC        INTERNAL CALL TO PRIME               61360021
*                                  RETURN FROM PRIME IF MFA WAS FOU     61380021
         B     TBINS04             X                                    61400021
         B     TBINS05             INSERT NEW TAMM --> MOVE TO MFA      61420021
*                                  RETURN FROM PRIME IF TFA WAS FOU     61440021
         SPACE 2                                                        61460021
*  ENOUGH SPACE IN MFA FOR ONE ENTRY.                                   61480021
*                                  GET ADD OF TAMM  IN R6               61500021
         BAL   R14,TBINS90         X                                    61520021
         L     R8,DX0(R6)                                               61540021
         LA    R8,DX0(R8)                                               61560021
*                                  R8 HAS ADD OF END OF TABLE           61580021
         AH    R8,DX6(R6)                                               61600021
         L     R9,TBDSTADD(R4)                                          61620021
         LR    R10,R9                                                   61640021
         AR    R10,R2                                                   61660021
         SR    R8,R9                                                    61680021
         LCR   R8,R8                                                    61700021
*                                  R8 NOW HAS LENGTH TABLE MUST MOV     61720021
         BAL   R14,TBMOVDON        BR TO MOVE TABLE TOWARDS HICORE      61740021
         LA    R5,TBTAMLG(R6)                                           61760021
         SR    R9,R10                                                   61780021
         LCR   R9,R9                                                    61800021
*                                  GO TO UPDATE TAMMS AFFCTED BY SH     61820021
         BAL   R14,TBTAMSH         HICORE SHIFT-->UPDTE TAM TBL @S      61840021
*                                  GO TO UPDATE MASTAMS                 61860021
         BAL   R14,TBINS88         UPDATE MASTAM                        61880021
         LH    R1,DX6(R6)                                               61900021
         AR    R2,R1                                                    61920021
         BAL   R14,TBINS89         SET UP RETURN REGS FROM INSERT       61940021
*                                  UPDATE TAMM AND SET UP R2 AND R3     61960021
*                                  RETURN TO PHASE                      61980021
*                                                                       62000021
TBINXIT  L     R15,TBASAV1              EXIT                            62020021
         XI    TBSWGENE,TBFLINST                                        62040021
         LM    R0,R1,DX0(R15)                                           62060021
         LM    R4,R15,DX16(R15)                                         62080021
         BR    R14                 RETURN                               62100021
         SPACE 2                                                        62120021
*                                  PRIME RETURNS ADD OF NEW TAMM IN     62140021
TBINS05  L     R10,DX0(R5)                                              62160021
         LA    R10,DX0(R10)                                             62180021
         BAL   R14,TBINS90         X                                    62200021
*                                  R6 HAS ADD OF OLD TAMM               62220021
         L     R9,DX0(R6)                                               62240021
         LA    R9,DX0(R9)                                               62260021
         LH    R8,DX4(R6)                                               62280021
         BAL   R14,TBMOVUP         BR TO MOVE TBL TOWARDS LOW CORE      62300021
*                                  MOVE TABLE TO TFA                    62320021
         MVC   DX4(LX8,R5),DX4(R6)                                      62340021
*                                  UPDATE NEW TAMM                      62360021
         XR    R6,R5                                                    62380021
         XR    R5,R6                                                    62400021
         XR    R6,R5                                                    62420021
         BAL   R14,TBINS89         SET UP RETURN REGS FROM INSERT       62440021
         MVI   DX0(R6),TBFLPRIM                                         62460021
         MVI   DX0(R5),TBFLFREE                                         62480021
         XC    DX4(LX2,R5),DX4(R5)                                      62500021
         BAL   R14,TBTIBUP         TAM MOVED-->UPDATE TIB               62520021
         B     TBINXIT             PREPARE TO RETURN TO CALLING PH      62540021
         SPACE 2                                                        62560021
*                                  INSERT NEW TAMM BEFORE MOVING TA     62580021
*                                  TO MFA                               62600021
TBINS04  EQU   *                                                        62620021
         BAL   R14,TBINS90         X                                    62640021
         LH    R9,DX6(R6)           TABLE LENGTH                        62660021
         L     R8,DX0(R6)           TABLE ADDRESS                       62680021
         LA    R8,DX0(R8)           CLEAR H.O. BYTE                     62700021
         AR    R9,R8               TABLE END                            62720021
         C     R9,TBDSTADD(R4)                                          62740021
         BNE   TBINS03             X                                    62760021
**            LAST TABLE - DO NOT MOVE IT                               62780021
         LA    R2,DX256             ADD GROWTH FACTOR TO MASTAM,        62800021
         BAL   R14,TBINS88         UPDATE TABLE END                     62820021
         LH    R2,DX6(R6)                                               62840021
         AH    R2,TBCON256         NEW TABLE SIZE                       62860021
         BAL   R14,TBINS89         SET UP RETURN REGS FORM INSERT       62880021
         BC    UNCOND,TBINXIT      PREPARE TO RETURN TO CALLING PH      62900021
TBINS03  DS    0H                                                       62920021
         BAL   R14,TBINSTAM        BRANCH TO ADD A TAM                  62940021
         MVC   DX0(LX4,R5),TBDSTADD(R4)                                 62960021
         BAL   R14,TBINS88         BRANCH TO UPDATE MASTAM              62980021
         BAL   R14,TBTIBUP         BRANCH TO UPDATE TIB                 63000021
         LA    R14,TBINS05                                              63020021
TBINS90  EQU   *                                                        63040021
         L     R6,DX0(R3)                                               63060021
         LA    R6,DX0(R6)                                               63080021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      63100021
*                                  GIVEN ADDR OF TIB IN R3, PUT ADD     63120021
*                                  TAMM IN R6                           63140021
         SPACE 2                                                        63160021
TBINSEXT LR    R7,R2                                                    63180021
         BAL   R14,TBINS89A        X                                    63200021
         B     TBINXIT             PREPARE TO RETURN TO CALLING PH      63220021
         SPACE 5                                                        63240021
*                                  UPDATES MASTAM                       63260021
TBINS88  L     R9,TBDSTADD(R4)                                          63280021
         AR    R9,R2                                                    63300021
         ST    R9,TBDSTADD(R4)                                          63320021
TBINS78  L     R9,TBDCLENG(R4)                                          63340021
         SR    R9,R2                                                    63360021
         ST    R9,TBDCLENG(R4)                                          63380021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      63400021
         SPACE 2                                                        63420021
*                                  SETS UP RETURN REGS FROM INSERT      63440021
TBINS89  STH   R2,DX6(R6)                                               63460021
TBINS89A LH    R2,DX4(R6)                                               63480021
         LR    R3,R2                                                    63500021
         LR    R0,R2                                                    63520021
         AR    R0,R7                                                    63540021
         STH   R0,DX4(R6)                                               63560021
         L     R1,DX0(R6)                                               63580021
         LA    R1,DX0(R1)                                               63600021
         AR    R2,R1                                                    63620021
         BR    R14                 RETURN TO NEXT SEQUENTIAL INSTR      63640021
         EJECT                                                          63660021
******                                                           **     63680021
*                                                                       63700021
*        TAMEIN  - INITIALIZE TABLE HANDLER.                            63720021
*        PHASE1 - SET UP FIRST MASTAM AND HASH TABLE TAMM               63740021
*                 PHASE1 CALLS TAMEIN                                   63760021
*                                                                       63780021
*        PHASE2 - NO PROCESSING                                         63800021
*                 PHASE0 CALLS TAMEIN                                   63820021
*                                                                       63840021
*        PHASE3 - IF NO SECTIONS HAVE BEEN SPILLED, RETURN              63860021
*                 OTHERWISE, TRY TO GET SPACE TO READ IN AS MANY OF     63880021
*                 SPILLED SECTIONS AS POSSIBLE.                         63900021
*                 PHASE0 CALLS TAMEIN                                   63920021
*                                                                       63940021
*        PHASE4 - DOES NOT CALL TAMEIN                                  63960021
*                                                                       63980021
*        PHASE5 - DOES NOT CALL TAMEIN                                  64000021
*                                                                       64020021
*        PHASE6 - NO PROCESSING - RETURN                                64040021
*                 PHASE6 CALLS TAMEIN                                   64060021
******                                                           **     64080021
*                                                                       64100021
TBTAMEIN L     R2,TBAPHASW                                              64120021
*                                  GREATER THAN PHASE3, RETURN          64140021
         CLI   DX0(R2),TAM3Q                                            64160021
         BH    TBTAMENX            BR TO RESTORE REGS AND RETURN        64180021
         CLI   DX0(R2),TAM1Q                                            64200021
         BH    TBAMEN00            X                                    64220021
         LA    R4,TBMASTAM         PH1 INIT. OF TABLE HANDLER.          64240021
*                                  R6 HAS BEGINNING OF TABLE AREA       64260021
         L     R9,TBATAMAR                                              64280021
*                                  R7 HAS END OF TABLE AREA             64300021
         LM    R6,R7,DX0(R9)                                            64320021
         SR    R7,R6                                                    64340021
         STM   R6,R7,DX0(R4)                                            64360021
*                                  SET UP FIRST MASTAM                  64380021
******                                                           **     64400021
         STM   R6,R7,TBDSTADD(R4)                                       64420021
         MVC   TBTAM(LX12),TBHASH        PRIME HASH.TABLE               64440021
         BAL   R14,TBTIBUP         BRANCH TO UPDATE TIB                 64460021
         MVC   TBTAM+NX1(LX3),TBMASTAM+NX1                              64480021
         L     R9,TBACCSW                                               64500021
         MVC   DX1(LX3,R9),TBMASTAM+NX1                                 64520021
         LA    R2,DX1568                                                64540021
         BAL   R14,TBINS88         BRANCH TO UPDATE MASTAM              64560021
         B     TBTAMENX            BR TO RESTORE REGS AND RETURN        64580021
         SPACE 2                                                        64600021
TBAMEN00 CLI   DX0(R2),TAM2Q                                            64620021
         BE    TBTAMENX            BR TO RESTORE REGS AND RETURN        64640021
         SPACE 2                                                        64660021
TBAMEN01 TM    TBSW1,TBSPILLF                                           64680021
         BZ    TBTAMENX            BR TO RESTORE REGS AND RETURN        64700021
         XC    TBCURSTN(LX4),TBCURSTN                                   64720021
         BAL   R14,TBGETSPC             GET ADDITIONAL SPACE AND        64740021
*                                       READ  BACK IN CORE AS MANY      64760021
*                                       SECTION OF THE DICTION. AS      64780021
*                                       POSSIBLE                        64800021
         L     R3,TBATIB20                                              64820021
         L     R3,DX0(R3)                                               64840021
         L     R5,DX0(R3)                                               64860021
         LA    R5,DX0(R5)                                               64880021
         LR    R6,R5                                                    64900021
         AH    R5,DX4(R3)                                               64920021
         LA    R4,TBMASTAM                                              64940021
TBAMEN03 SH    R5,TBCON012                                              64960021
TBAMEN04 CR    R5,R6                                                    64980021
         BL    TBTAMENX            BR TO RESTORE REGS AND RETURN        65000021
         TM    DX0(R5),TBIN                                             65020021
         BO    TBAMEN03            X                                    65040021
         LA    R2,DX512                                                 65060021
TBAMEN05 C     R2,TBDCLENG(R4)                                          65080021
         BNH   TBAMEN06            X                                    65100021
         C     R4,TBLASMTM                                              65120021
         BE    TBTAMENW            SPILL HAS OCCURRED                   65140021
         LA    R4,TBMSTMLG(R4)                                          65160021
         B     TBAMEN05            X                                    65180021
*                                                                       65200021
*                                                                       65220021
         SPACE 2                                                        65240021
TBAMEN06 LR    R7,R5                                                    65260021
         L     R9,TBDSTADD(R4)                                          65280021
         A     R9,TBDCLENG(R4)                                          65300021
         SH    R9,TBCON512                                              65320021
         BAL   R14,TBREADIC        BR TO READ BACK DICT SECTION         65340021
         BAL   R14,TBINS78         UPDATE MASTAM                        65360021
         BAL   R14,TBDIC300        UPDATE NB. OF DICT SECTION           65380021
         B     TBAMEN03            X                                    65400021
*        TURN ON SPILL BIT FOR STATISTICS                               65420021
TBTAMENW ST    R8,TBSAVER          SAVE CONTENTS OF R8                  65440021
         L     R8,TBACOS           LOAD ADDRESS OF COS                  65460021
         OI    SWITCHD(R8),SPILLQ  TURN ON SPILL BIT                    65480021
TBTAMEN1 L     R8,TBSAVER          RESTORE R8                           65500021
         SPACE 2                                                        65520021
TBTAMENX L     R15,TBASAV1                                              65540021
         LM    R0,R15,DX0(R15)                                          65560021
         BR    R14                 RETURN                               65580021
*                                                                       65600021
         SPACE 5                                                        65620021
*        TBDICSP  -ASK A NEW DICTIONARY SECTION.                        65640021
*        RETURNS IN R1 ADDR OF BEGINNING OF NEW DICTIONARY SECT         65660021
*              AND IN R2 ADDR OF END OF NEW DICT SECTION.               65680021
******                                                           **     65700021
*                                                                       65720021
*                                                                       65740021
TBDICSPC MVI   TBDISW,XX00                                              65760021
         L     R9,TBATIB20                                              65780021
         L     R10,DX0(R9)                                              65800021
         LH    R2,DX6(R10)                                              65820021
         SH    R2,DX4(R10)                                              65840021
         CH    R2,TBCON012                                              65860021
         BNL   TBDICSP0            ASK-A-NEW-DICT-SECT PROCESSING       65880021
         L     R6,TBASAV1                                               65900021
         MVC   TBSAVD(LX64),DX0(R6)                                     65920021
         LR    R1,R9                                                    65940021
         L     R15,TBINNST                                              65960021
         BALR  R14,R15             BRANCH AND LINK TO INSERT            65980021
         MVC   DX0(LX64,R6),TBSAVD                                      66000021
         L     R15,TBAPRIME                                             66020021
         L     R10,DX0(R9)                                              66040021
         LH    R2,DX4(R10)                                              66060021
         SH    R2,TBCON012                                              66080021
         STH   R2,DX4(R10)                                              66100021
*                                 IF DICOT TABLE MUST GROW INSERT W     66120021
*                                  BE CALLED BEFORE DICT SECTION IS     66140021
*                                  UP, IN CASE A SECT WILL HAVE TO      66160021
*                                  SPILLED WHEN DICOT TABLE GROWS.      66180021
TBDICSP0 OI    TBSWGENE,TBFLDICT                                        66200021
         LA    R2,DX512                                                 66220021
         LA    R4,TBMASTAM                                              66240021
         BAL   R14,TBPRIMEC        ENTRY PT FOR INT CALL TO PRIME       66260021
         BAL   R14,TBINS78         UPDATE MASTAM                        66280021
         L     R1,TBDSTADD(R4)                                          66300021
         A     R1,TBDCLENG(R4)                                          66320021
         LR    R2,R1                                                    66340021
         AH    R2,TBCON512                                              66360021
         XI    TBSWGENE,TBFLDICT                                        66380021
         LA    R14,TBDIC200                                             66400021
TBDIC300 LA    R8,DX1                                                   66420021
TBDIC100 EQU   *                   UPDATES NO. OF DICT SECT.            66440021
         L     R9,TBDNSECT(R4)                                          66460021
         AR    R9,R8                                                    66480021
         ST    R9,TBDNSECT(R4)                                          66500021
         L     R9,TBSECTN                                               66520021
         AR    R9,R8                                                    66540021
         ST    R9,TBSECTN                                               66560021
         BR    R14                 RETURN                               66580021
TBDIC200 CLI   TBDISW,XX00                                              66600021
         BNE   TBMOVDI0            X                                    66620021
         ST    R1,TBCURSTN                                              66640021
         L     R15,TBASAV1                                              66660021
         L     R0,DX0(R15)                                              66680021
         LM    R3,R15,DX12(R15)                                         66700021
         BR    R14                 RETURN                               66720021
         SPACE 5                                                        66740021
*                                                                       66760021
*        TBMOVDIC   READ BACK A SECTION WHOSE ENTRY ADDRESS IN DICO     66780021
*                   IS IN  R3.                                          66800021
*                                                                       66820021
*                                                                       66840021
TBDICOTX L     R5,TBATIB20         GET STARTING ADDRESS OF DICOT        66860021
         L     R5,DX0(R5)                                               66880021
         L     R5,DX0(R5)                                               66900021
         LA    R5,DX0(R5)                                               66920021
         BR    R14                 RETURN                               66940021
TBMOVDIC BAL   R14,TBDICOTX        GET STARTING @ OF DICOT              66960021
         SR    R3,R5                                                    66980021
         MVI   TBDISW,XX01                                              67000021
         B     TBDICSP0            GET THE  SPACE TO READ IN (IN R1     67020021
         SPACE 2                                                        67040021
TBMOVDI0 BAL   R14,TBACCINT        INITIALIZE ACCESS CELLS IN COMMO     67060021
         BAL   R14,TBDICOTX        GET STARTING @ OF DICOT              67080021
         AR    R3,R5               GET POINTER IN DICOT                 67100021
         LR    R9,R1                                                    67120021
         LR    R7,R3                                                    67140021
         BAL   R14,TBREADIC        BR TO READ BACK DICT SECTION         67160021
*                                                                       67180021
*                                                                       67200021
         L     R15,TBASAV1                                              67220021
         LM    R0,R2,DX0(R15)                                           67240021
         LM    R4,R15,DX16(R15)                                         67260021
         BR    R14                 RETURN                               67280021
TBERR1   MVI   TBERCD,DX0          ABEND EVENTUALLY                     67300021
         B     TBERR                                                    67320021
TBERR3   MVI   TBERCD,DX4          ABEND EVENTUALLY                     67340021
         B     TBERR                                                    67360021
TBERR4   MVI   TBERCD,DX8          ABEND EVENTUALLY                     67380021
TBERR    STM   R0,R15,TBERRG       SAVE ALL REGISTERS FOR DUMP          67400021
         SR    R2,R2                                                    67420021
         IC    R2,TBERCD                                                67440021
         L     R3,TBERL(R2)        PICK UP MESSAGE LENGTH               67460021
         L     R2,TBERMSG(R2)      POINT TO MESSAGE                     67480021
         B     TBERRLG                                                  67500021
TBERMSG  DC    A(TBMESS2)                                               67520021
         DC    A(TBMESS3)                                               67540021
         DC    A(TBMESS4)                                               67560021
TBERL    DC    A(TBMESS2L)                                              67580021
         DC    A(TBMESS3L)                                              67600021
         DC    A(TBMESS4L)                                              67620021
TBERCD   DC    X'FF'                                                    67640021
         ORG   TBDICOTX            16 WORDS ON WORD                     67660021
TBERRG   DS    16F                 BOUNDARY FOR ABEND REGISTERS         67680021
         EJECT                                                          67700021
*                                                                       67720021
TBDATA   CSECT                                                          67740021
         DS    0F                                                       67760021
* THE FOLLOWING EIGHT CARDS MUST BE KEPT TOGETHER.  DO NOT INSERT       67780021
*  ANYTHING HERE.                                                       67800021
TBMASTAM DC    1F'0'     BEG.OF AREA.                                   67820021
         DC    1F'0'     LENGTH OF AREA                                 67840021
         DC    1F'0'     CURRENT FIRST FREE BYTE FOR TABLE.             67860021
         DC    1F'0'     REMAINING LENGTH.                              67880021
         DC    A(TBTAM)       FIRST TAM FOR THIS MASTAM.                67900021
         DC    A(TBTAM+TBTAMLG)  NEXT TAM TO BE FOR THIS MASTAM.        67920021
         DC    1F'0'     NUMBER OF DICT. SECTION IN THIS MASTAM.        67940021
         DC    14F'0'   2 OTHER MASTAMS                           9330  67960021
TBENMSTM EQU   *                                                        67980021
         SPACE 2                                                        68000021
TBTAM    DC    864X'0'         D                                        68020021
TBENDTAM EQU   *                                                        68040021
         SPACE 2                                                        68060021
TBNEXTAM DC    A(TBTAM+TBTAMLG)  NEXT AVAL. TAM .(INIT. FOR PH10).      68080021
TYSPLAD  DC    A(SPILL)            X                                    68100021
TBLASMTM DC    A(TBMASTAM)    LAST MASTAM USED SO FAR.                  68120021
TBCURSTN DC    A(0)           CURENT  DICT. SECTION.                    68140021
TBSECTN  DC    1F'0'          DICT. SECT. LEFT IN CORE.                 68160021
TBTEMP   DC    1F'0'                                                    68180021
TBSAV2   DS    6F                  TAMER RTN REG SAVE AREAS             68200021
TBSAV214 DS    1F                  X                                    68220021
TBSAV3   DS    6F                  X                                    68240021
TBSAV314 DS    F                   X                                    68260021
TBSAV4   DS    6F                  X                                    68280021
TBSAV414 DS    1F                  X                                    68300021
TBSAV5   DS    6F                  X                                    68320021
TBSAV6   DS    6F                  X                                    68340021
TBSAV614 DS    1F                  X                                    68360021
TBSAV7   DS    6F                  X                                    68380021
TBSAV714 DS    1F                  X                                    68400021
TBSAV8   DS    6F                  X                                    68420021
TYWSAVR  DS    10F                 X                                    68440021
TBACCSW  DC    A(ACCESW)           X                                    68460021
TBAPHASW DC    A(PHASW)            X                                    68480021
TBATABRL DC    A(TBTABREL)         X                                    68500021
TBATAMEN DC    A(TBTAMEIN)         X                                    68520021
TBAINSTA DC    A(TBINSERT)         X                                    68540021
TBASTATC DC    A(TBSTATIC)         X                                    68560021
TBADICSP DC    A(TBDICSPC)         X                                    68580021
TBAPRIME DC    A(TBPRIMEB)         X                                    68600021
TBRELSPA DC    A(TBRELSPC)         X                                    68620021
TBAENTM  DC    A(TBENDTAM)         X                                    68640021
TBAMOVDI DC    A(TBMOVDIC)         X                                    68660021
TBATAMEP DC    A(TBTAMEOP)         X                                    68680021
TBATAMAR DC    A(TAMAREA)          X                                    68700021
TBATIB20 DC    A(TIB20)       DICOT TABLE TIB.                          68720021
TBASAV1  DC    A(TBSAV1)           X                                    68740021
TBAGTALL DC    A(TBGETALL)         TAMER ADDRESS FOR PHASES 6 & 6A      68760021
TBADICAD DC    A(DICADR)           X                                    68780021
*                                                                       68800021
TBACOS   DC    A(COS)              X                                    68820021
TBSAVER  DS    1F                  SAVE AREA FOR A REGISTER             68840021
* * * * * * * * * * *                                                   68860021
*              COBOL SPACE TABLE                                        68880021
*                  KEEP THE FOLLOWING 10 CARDS TOGETHER                 68900021
*                                                                       68920021
* * * * * * * * * * *                                                   68940021
         DS    0F                                                       68960021
PCBSPT   DC    10F'0'              COBOL CONSTANTS                      68980021
CBSPH7   DC    XL4'3D78'           COBOL SPACE PH70 CONSTANT            69000021
TBCCMSTM DS    1F                  CURRENT MASTAM                       69020021
TBSPACGT DC    F'0'                                                     69040021
GETTABLE DC    8F'0'                                                    69060021
GETEND   EQU   *                                                        69080021
FREEMANE DC    F'0'                                                     69100021
SHIFTVAL DC    F'0'                                                     69120021
TBENDADR DC    F'0'                                                     69140021
TBLSUM   DC    F'0'                                                     69160021
DCTLNGTH DC    F'0'                                                     69180021
         DS    0F                                                       69200021
TBMASK00 DC    X'FFFFFFFC'                                              69220021
TBHASH   DC    X'02'               PRIMES HASH TABLE                    69240021
         DC    AL3(0)              PRIMES HASH TABLE                    69260021
         DC    H'1568'             PRIMES HASH TABLE                    69280021
         DC    H'0'                PRIMES HASH TABLE                    69300021
TBATIB30 DC    A(TIB30)            X                                    69320021
AGETEND  DC    A(GETEND)                                                69340021
         SPACE 5                                                        69360021
TBCON012 DC    H'12'               X                                    69380021
TBCOM001 DC    H'-1'               X                                    69400021
TBCON002 DC    H'2'                X                                    69420021
TBCON003 DC    H'03'               X                                    69440021
TBCOM512 DC    H'-512'             X                                    69460021
TBCON256 DC    H'256'              X                                    69480021
         DS    0F                                                       69500021
         DS    0F                                                       69520021
TBNEWLG1 DC    H'0'                                                     69540021
TAM1Q    EQU   X'02'                                                    69560021
TAM2Q    EQU   X'04'                                                    69580021
LONGPHS EQU   TAM2Q                                                     69600021
TAM3Q    EQU   X'05'                                                    69620021
TAM4Q    EQU   X'06'                                                    69640021
TAM5Q    EQU   X'07'                                                    69660021
TAM6Q    EQU   X'09'                                                    69680021
*                                                                       69700021
TBCON512 DC    H'512'              X                                    69720021
TBPHZNO  DC    X'00'                                                    69740021
         SPACE 2                                                        69760021
TBSWGENE DC    X'00'               X                                    69780021
TBDISW   DC    X'00'               X                                    69800021
TBSW1    DC    X'00'               X                                    69820021
GETSW    DC    X'00'                                                    69840021
TBMESS1  DC  C'IKF0001I-D SIZE PARAMETER TOO SMALL FOR THIS PROGRAM'    69860021
TBMESS1L EQU   *-TBMESS1                                                69880021
TBMESS2  DC  C'IKF0020I-D COMPILER ERROR - COMPILATION WILL NOT BE COMPX69900021
               LETE'                                                    69920021
TBMESS2L EQU   *-TBMESS2                                                69940021
TBATRMNT DC    A(TRMNATE)          X                                    69960021
TBMESS3  DC   C'IKF0010I-D A TABLE HAS EXCEEDED THE MAXIMUM PERMISSIBLEX69980021
                SIZE.COMPILATION ABANDONED.'                            70000021
TBMESS3L EQU   *-TBMESS3                                                70020021
TBMESS4  DC   C'IKF0030I-D FRAGMENTED CORE. RUN IN LARGER SIZE REGION. X70040021
                COMPILATION ABANDONED.'                                 70060021
TBMESS4L EQU   *-TBMESS4                                                70080021
TBNODIC  EQU   X'06'                                                    70100021
         EJECT                                                          70120021
TBFLFREE EQU   X'01'                                                    70140021
TBFLPRIM EQU   X'04'                                                    70160021
TBFLSTAT EQU   X'02'                                                    70180021
         SPACE 5                                                        70200021
TBSPILLF EQU   X'01'                                                    70220021
TBFLINST EQU   X'08'     CALL FROM INSERT                               70240021
TBFLDICT EQU   X'10'     CALL FROM DICT.                                70260021
TBFLSPH1 EQU   X'20'     PH1 SPACE ASSIGNED.                            70280021
TBFLSPH2 EQU   X'40'     PH2 SPACE ASSIGNED.                            70300021
TBFLSPH3 EQU   X'80'     PH3 SPACE ASSIGNED.                            70320021
TBFLNODC EQU   X'01'     NO DICT.                                       70340021
TBFULLPK EQU   X'04'     FULL PACK.                                     70360021
TBSPASKD EQU   X'02'     SPACE ALREADY  ASKED.                          70380021
UNCOND   EQU   15                                                       70400021
         SPACE 5                                                        70420021
SPACASK  EQU   X'FD'                                                    70440021
         SPACE 3                                                        70460021
TBDBEGAR EQU   0         DISPLACT. IN  MASTAM                           70480021
TBDLENG  EQU   4                                                        70500021
TBDSTADD EQU   8                                                        70520021
TBDCLENG EQU   12                                                       70540021
TBDFSTAM EQU   16                                                       70560021
TBDLSTAM EQU   20                                                       70580021
TBDNSECT EQU   24                                                       70600021
         SPACE 5                                                        70620021
TBTAMLG  EQU   12                                                       70640021
TBMSTMLG EQU   28                                                       70660021
         SPACE 5                                                        70680021
TBSPILD  EQU   X'80'                                                    70700021
TBFLWRTR EQU   X'10'                                                    70720021
TBIN     EQU   64                                                       70740021
TBUPDATE EQU   32                                                       70760021
TYINOFF  EQU   191                                                      70780021
TYSPLOFF EQU   127                                                      70800021
TYSUOFF  EQU   X'A0'                                                    70820021
         SPACE 10                                                       70840021
TBSAV64  EQU   TBSAV6                                                   70860021
TBOUST   EQU   TBTAMENX                                                 70880021
TBMOVEUP EQU   TBMOVUP                                                  70900021
PR12     EQU   12                                                       70920021
PR5      EQU   5                                                        70940021
PR4      EQU   4                                                        70960021
TAMARA   EQU   TBATAMAR                                                 70980021
TBCONS03 EQU   TBCON003                                                 71000021
TBSAVD   DS    16F                 DICT RTN SAVE REGISTER AREA          71020021
TBINNST  DC    A(INSERT)           X                                    71040021
TB32767  DC    H'32767'            X                                    71060021
TBTAGSW  DC    X'00'                                                    71080021
TBWCHWAY DC    X'00'                                                    71100021
       EJECT                                                            71120021
       SPACE 5                                                          71140021
****** HASH TABLE---USED BY ACCESS---STORED NOW AT END OF TAMER  **     71160021
       DS    0F                                                         71180021
       END   START                                                      71200021
