*//    ILBOTRN0                                                         02000018
TRN0     TITLE     'ILBOTRN0'                                           04000018
*        ILBOTRN0   CALLING SEQ... L    15,V(ILBOTRN0)                  06000018
*                                                                       08000018
*        LEVEL  180     09/14/66                                        10000018
*                                                                       12000018
*FUNCTION 0 THIS IS A 256-BYTE TRANSFORM TABLE USED FOR PROCESSING      14000018
*   TRANSFORM STATEMENTS WITH FIXED LENGTH TRANSFORMED FIELDS.          16000018
*INPUT 0 N/A                                                            18000018
*OUTPUT 0 N/A                                                           20000018
*EXTERNAL ROUTINES 0 N/A                                                22000018
*EXITS 0 N/A                                                            24000018
*ATTRIBUTES 0 N/A                                                       26000018
*                                                                       28000018
ILBOTRN0 START 0                                                        30000018
       DC    X'000102030405060708090A0B0C0D0E0F'                        32000018
       DC    X'101112131415161718191A1B1C1D1E1F'                        34000018
       DC    X'202122232425262728292A2B2C2D2E2F'                        36000018
       DC    X'303132333435363738393A3B3C3D3E3F'                        38000018
       DC    X'404142434445464748494A4B4C4D4E4F'                        40000018
       DC    X'505152535455565758595A5B5C5D5E5F'                        42000018
       DC    X'606162636465666768696A6B6C6D6E6F'                        44000018
       DC    X'707172737475767778797A7B7C7D7E7F'                        46000018
       DC    X'808182838485868788898A8B8C8D8E8F'                        48000018
       DC    X'909192939495969798999A9B9C9D9E9F'                        50000018
       DC    X'A0A1A2A3A4A5A6A7A8A9AAABACADAEAF'                        52000018
       DC    X'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'                        54000018
       DC    X'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'                        56000018
       DC    X'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'                        58000018
       DC    X'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'                        60000018
       DC    X'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF'                        62000018
       END                                                              64000018
         EJECT                                                          66000018
